[
    {
        "content": "A third Bush? Heaven help us. quote: GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition. Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels.", 
        "intTime": 20090502, 
        "postID": 1, 
        "quote": "GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition.", 
        "reply": "A third Bush? Heaven help us.  Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 18:32:00", 
        "title": "Bush is listening", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: A third Bush? Heaven help us. quote: GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition. Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels. I don't think you'll see another bush enter national politics for a long long time! Memories of the last eight years will not go quitely into the night. I actually heard Ann Coulter say last night on Larry King Live (which I was astonished), that she hopes Sarah Palin stays in Alaska for another 4-6 years. All of this tells me the GOP \"may be\" starting to use a \"new\" strategy that is outside its past history of \"same old GOP.\" We shall see....... This message has been edited. Last edited by: ProgMod, Sat 02 May 2009 09:40 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090502, 
        "postID": 2, 
        "quote": "Originally posted by FrJohn1123: A third Bush? Heaven help us. quote: GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition. Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels.", 
        "reply": " I don't think you'll see another bush enter national politics for a long long time! Memories of the last eight years will not go quitely into the night. I actually heard Ann Coulter say last night on Larry King Live (which I was astonished), that she hopes Sarah Palin stays in Alaska for another 4-6 years. All of this tells me the GOP \"may be\" starting to use a \"new\" strategy that is outside its past history of \"same old GOP.\" We shall see....... This message has been edited. Last edited by: ProgMod, Sat 02 May 2009 09:40 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 19:03:00", 
        "title": "Bush is listening", 
        "userID": "ProgMod"
    }, 
    {
        "content": "They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "intTime": 20090502, 
        "postID": 3, 
        "quote": "", 
        "reply": "They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 19:32:00", 
        "title": "Bush is listening", 
        "userID": "Boots_"
    }, 
    {
        "content": "They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "", 
        "reply": "They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 19:49:00", 
        "title": "Bush is listening", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Now I was never a AU H20 fan...a bit to atomic for me...But he did say politicians had no business in peoples bedrooms and churches...Now a almost fatal flaw of conservatism...Plus He was nominated in 1964 in San Francisco,California at the GOP convention(Cow Palace). I know... I was there.... and thats your trivia for the day", 
        "intTime": 20090502, 
        "postID": 5, 
        "quote": "Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "reply": " Now I was never a AU H20 fan...a bit to atomic for me...But he did say politicians had no business in peoples bedrooms and churches...Now a almost fatal flaw of conservatism...Plus He was nominated in 1964 in San Francisco,California at the GOP convention(Cow Palace). I know... I was there.... and thats your trivia for the day", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 20:14:00", 
        "title": "Bush is listening", 
        "userID": "scottrj50"
    }, 
    {
        "content": "By 2012 the people will be fed up with the Obama taxes and fees it will be easier for the Republicans to win seats and maybe the whitehouse. It is already projected that when filing 2009 income taxes people will owe money because of the Obama supposed tax cut. Energy bill will be going up and everything is going to be costing more because of hidden taxes and fees.", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "", 
        "reply": "By 2012 the people will be fed up with the Obama taxes and fees it will be easier for the Republicans to win seats and maybe the whitehouse. It is already projected that when filing 2009 income taxes people will owe money because of the Obama supposed tax cut. Energy bill will be going up and everything is going to be costing more because of hidden taxes and fees.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 20:15:00", 
        "title": "Bush is listening", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "mmmmm......A wager?", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "", 
        "reply": "mmmmm......A wager?", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 20:42:00", 
        "title": "Bush is listening", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character. Very True and Excellent Point...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090502, 
        "postID": 8, 
        "quote": "Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "reply": " Very True and Excellent Point...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 21:43:00", 
        "title": "Bush is listening", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090502, 
        "postID": 9, 
        "quote": "Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "reply": " Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 21:57:00", 
        "title": "Bush is listening", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090503, 
        "postID": 10, 
        "quote": "Now I was never a Au H20 fan...a bit too atomic for me.", 
        "reply": " OK! Now that's funny! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 06:25:00", 
        "title": "Bush is listening", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character. Nice try, but still lame. The same could be said about liberal spokesw a n k e r s Jeanine Garafolo and Keith Olbermann as well as Obama spokeswhiner Rachel Maddow.", 
        "intTime": 20090503, 
        "postID": 11, 
        "quote": "Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "reply": " Nice try, but still lame. The same could be said about liberal spokesw a n k e r s Jeanine Garafolo and Keith Olbermann as well as Obama spokeswhiner Rachel Maddow.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:06:00", 
        "title": "Bush is listening", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! LOL I never liked him either....he still reminds me of to this day.", 
        "intTime": 20090503, 
        "postID": 12, 
        "quote": "Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny!", 
        "reply": " LOL I never liked him either....he still reminds me of to this day.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:26:00", 
        "title": "Bush is listening", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Scott Now tell me that was not ironical, Goldwater at the Cow Palace. And what exactly were you doing there???", 
        "intTime": 20090503, 
        "postID": 13, 
        "quote": "", 
        "reply": "Scott Now tell me that was not ironical, Goldwater at the Cow Palace. And what exactly were you doing there???", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:28:00", 
        "title": "Bush is listening", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! LOL I never liked him either....he still reminds me of to this day. I wouldn't say that I didn't like him; he was very Libertarian for his day and you always knew where he stood on a subject! He could be strident without behaving like a complete lunatic, but after his last failed run for President, I think that he saw what was coming and got out before he might get caught on camera puking over what his party and indeed, our nation, was trending toward! He didn't greatly approve of Reagan or his people, and I strongly suspect he would have taken a shotgun after W for masquerading as a Conservative! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090503, 
        "postID": 14, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! LOL I never liked him either....he still reminds me of to this day.", 
        "reply": " I wouldn't say that I didn't like him; he was very Libertarian for his day and you always knew where he stood on a subject! He could be strident without behaving like a complete lunatic, but after his last failed run for President, I think that he saw what was coming and got out before he might get caught on camera puking over what his party and indeed, our nation, was trending toward! He didn't greatly approve of Reagan or his people, and I strongly suspect he would have taken a shotgun after W for masquerading as a Conservative! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:46:00", 
        "title": "Bush is listening", 
        "userID": "KJ1110"
    }, 
    {
        "content": "My $0.02 ***Below taken from \"http://madwriter.livejournal.com/401278.html\" AU H20, memories...... Barry Goldwater, though maligned by many, was almost prescient, as shown in his book, \"The Conscience of a Conservative\" The following passages below are excerpts from Barry Goldwater's 1960 book The Conscience of a Conservative--specifically his chapter \"The Perils of Power\". He wrote these words, of course, when the Soviet Union was still the world's only other superpower and owned thousands of nuclear missiles pointed at the United States. quote: ... Such, then, is history's lesson, which Messrs. Acheson and Larson evidently did not read: release the holders of state power from any restraints other than those they wish to impose upon themselves, and you are swinging down the well-travelled road to absolutism. The framers of the Constitution had learned the lesson. They were not only students of history, but victims of it: they knew from vivid, personal experience that freedom depends on effective restraints against the accumulation of power in a single authority. And that is what the Constitution is: a system of restraints against the natural tendency of government to expand in the direction of absolutism. ... ... But the framers were not visionaries. They knew that rules of government, however brilliantly calculated to cope with the imperfect nature of man, however carefully designed to avoid the pitfalls of power, would be no match for men who were determined to disregard them. In the last analysis their system of government would prosper only if the governed were sufficiently determined that it should. \"What have you given us?\" a woman asked Ben Franklin toward the close of the Constitutional Convention. \"A Republic,\" he said, \"if you can keep it!\" ... ... The Frenchman, Alexis de Tocqueville, probably the most clairvoyant political observer of modern times, saw the danger when he visited this country in the 1830's. Even then he foresaw decay for a society that tended to put more emphasis on its democracy than its republicanism. He predicted that America would produce, not tyrants but \"guardians\". And that the American people would \"console themselves for being in tutelage by the reflection that they have chosen their own guardians. Every man allows himself to be put in lead-strings, because he sees that it is not a person nor a class of persons, but the people at large that hold the end of his chain.\" Our tendency to concentrate power in the hands of a few men deeply concerns me. We can be conquered by bombs or by subversion; but we can also be conquered by neglect--by ignoring the Constitution and disregarding the principles of limited government. Our defenses against the accumulation of unlimited power in Washington are in poorer shape, I fear, than our defenses against the aggressive designs of Moscow. Like so many other nations before us, we may succumb through internal weakness rather than fall before a foreign foe. I am convinced that most Americans now want to reverse the trend. I think that concern for our vanishing freedoms is genuine. I think that the people's uneasiness in the stifling omnipresence of government has turned into something approaching alarm. But bemoaning the evil will not drive it back, and accusing fingers will not shrink government. The turn will come when we entrust the conduct of our affairs to men who understand that their first duty as public officials is to divest themselves of the power they have been given. It will come when Americans, in the hundreds of communities throughout the nation, decide to put the man in office who is pledged to enforce the Constitution and restore the Republic. Who will proclaim in a campaign speech: \"I have little interest in streamlining government or in making it more efficient, for I mean to reduce its size. I do not undertake to promote welfare, for I propose to extend freedom. My aim is not to pass laws, but to repeal them. It is not to inaugurate new programs, but to cancel old ones that do violence to the Constitution, or that have failed in their purpose, or that impose on the people an unwarranted financial burden. I will not attempt to discover whether legislation is 'needed' before I have first determined whether it is constitutionally permissible. And if I should later be attacked for neglecting my constituents' 'interests,' I shall reply that I was informed their main interest is liberty and that in that cause I am doing the very best I can.\" \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "intTime": 20090503, 
        "postID": 15, 
        "quote": "... Such, then, is history's lesson, which Messrs. Acheson and Larson evidently did not read: release the holders of state power from any restraints other than those they wish to impose upon themselves, and you are swinging down the well-travelled road to absolutism. The framers of the Constitution had learned the lesson. They were not only students of history, but victims of it: they knew from vivid, personal experience that freedom depends on effective restraints against the accumulation of power in a single authority. And that is what the Constitution is: a system of restraints against the natural tendency of government to expand in the direction of absolutism. ... ... But the framers were not visionaries. They knew that rules of government, however brilliantly calculated to cope with the imperfect nature of man, however carefully designed to avoid the pitfalls of power, would be no match for men who were determined to disregard them. In the last analysis their system of government would prosper only if the governed were sufficiently determined that it should. \"What have you given us?\" a woman asked Ben Franklin toward the close of the Constitutional Convention. \"A Republic,\" he said, \"if you can keep it!\" ... ... The Frenchman, Alexis de Tocqueville, probably the most clairvoyant political observer of modern times, saw the danger when he visited this country in the 1830's. Even then he foresaw decay for a society that tended to put more emphasis on its democracy than its republicanism. He predicted that America would produce, not tyrants but \"guardians\". And that the American people would \"console themselves for being in tutelage by the reflection that they have chosen their own guardians. Every man allows himself to be put in lead-strings, because he sees that it is not a person nor a class of persons, but the people at large that hold the end of his chain.\" Our tendency to concentrate power in the hands of a few men deeply concerns me. We can be conquered by bombs or by subversion; but we can also be conquered by neglect--by ignoring the Constitution and disregarding the principles of limited government. Our defenses against the accumulation of unlimited power in Washington are in poorer shape, I fear, than our defenses against the aggressive designs of Moscow. Like so many other nations before us, we may succumb through internal weakness rather than fall before a foreign foe. I am convinced that most Americans now want to reverse the trend. I think that concern for our vanishing freedoms is genuine. I think that the people's uneasiness in the stifling omnipresence of government has turned into something approaching alarm. But bemoaning the evil will not drive it back, and accusing fingers will not shrink government. The turn will come when we entrust the conduct of our affairs to men who understand that their first duty as public officials is to divest themselves of the power they have been given. It will come when Americans, in the hundreds of communities throughout the nation, decide to put the man in office who is pledged to enforce the Constitution and restore the Republic. Who will proclaim in a campaign speech: \"I have little interest in streamlining government or in making it more efficient, for I mean to reduce its size. I do not undertake to promote welfare, for I propose to extend freedom. My aim is not to pass laws, but to repeal them. It is not to inaugurate new programs, but to cancel old ones that do violence to the Constitution, or that have failed in their purpose, or that impose on the people an unwarranted financial burden. I will not attempt to discover whether legislation is 'needed' before I have first determined whether it is constitutionally permissible. And if I should later be attacked for neglecting my constituents' 'interests,' I shall reply that I was informed their main interest is liberty and that in that cause I am doing the very best I can.\"", 
        "reply": "My $0.02 ***Below taken from \"http://madwriter.livejournal.com/401278.html\" AU H20, memories...... Barry Goldwater, though maligned by many, was almost prescient, as shown in his book, \"The Conscience of a Conservative\" The following passages below are excerpts from Barry Goldwater's 1960 book The Conscience of a Conservative--specifically his chapter \"The Perils of Power\". He wrote these words, of course, when the Soviet Union was still the world's only other superpower and owned thousands of nuclear missiles pointed at the United States.  \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 08:36:00", 
        "title": "Bush is listening", 
        "userID": "Silent_Surface"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: mmmmm......A wager? Yeesssss. Perhaps one of the farsiders would care to put an avatar on the table?", 
        "intTime": 20090503, 
        "postID": 16, 
        "quote": "Originally posted by scottrj50: mmmmm......A wager?", 
        "reply": " Yeesssss. Perhaps one of the farsiders would care to put an avatar on the table?", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 09:49:00", 
        "title": "Bush is listening", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Now this is a small world. I was looking up Barry Goldwater and here he is!! Thanks for the post SS. KL, in a few of your latest posts, you are starting to make sense and there are even traces of humor. It appears you may be morphing into a liberal.", 
        "intTime": 20090503, 
        "postID": 17, 
        "quote": "Originally posted by klassylady25: Now this is a small world. I was looking up Barry Goldwater and here he is!! Thanks for the post SS.", 
        "reply": " KL, in a few of your latest posts, you are starting to make sense and there are even traces of humor. It appears you may be morphing into a liberal.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 09:51:00", 
        "title": "Bush is listening", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. We do need that balance of conservative and liberal. Extreme politics is getting in the way of making this a great nation again.", 
        "intTime": 20090503, 
        "postID": 18, 
        "quote": "Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "reply": " We do need that balance of conservative and liberal. Extreme politics is getting in the way of making this a great nation again.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 10:11:00", 
        "title": "Bush is listening", 
        "userID": "billbright"
    }, 
    {
        "content": "Hey, Isn't Obama STILL doing all the Bush ear Patriot act stuff? lets hear about that!", 
        "intTime": 20090503, 
        "postID": 19, 
        "quote": "", 
        "reply": "Hey, Isn't Obama STILL doing all the Bush ear Patriot act stuff? lets hear about that!", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 13:48:00", 
        "title": "Bush is listening", 
        "userID": "threerings"
    }, 
    {
        "content": "Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "intTime": 20090503, 
        "postID": 20, 
        "quote": "", 
        "reply": "Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 14:15:00", 
        "title": "Bush is listening", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Where are the Obama supporters when they are needed?", 
        "intTime": 20090503, 
        "postID": 21, 
        "quote": "Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " Where are the Obama supporters when they are needed?", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 18:08:00", 
        "title": "Bush is listening", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. It is definitely NOT create new jobs. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090503, 
        "postID": 22, 
        "quote": "Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " It is definitely NOT create new jobs. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 18:22:00", 
        "title": "Bush is listening", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances.", 
        "intTime": 20090503, 
        "postID": 23, 
        "quote": "Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 19:02:00", 
        "title": "Bush is listening", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances. Unsubstantiated claims and yet another repetition of administration talking points is not an answer.", 
        "intTime": 20090504, 
        "postID": 24, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances.", 
        "reply": " Unsubstantiated claims and yet another repetition of administration talking points is not an answer.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 02:28:00", 
        "title": "Bush is listening", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\".", 
        "intTime": 20090504, 
        "postID": 25, 
        "quote": "Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\".", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 02:57:00", 
        "title": "Bush is listening", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff! Of course a real conservative could be elected with an R before his name. Contrary to popular opinion, the Republican Party isn't dead yet. It will be back. It only remains to be seen what ideology will be driving it when it returns. Right now, there appears to be two schools of thought on how to resurrect the GOP. 1. Hold fast to the \"new\" Conservatism and wait for the Obama administration to fail. In fact, HELP it fail, thereby opening an opportunity to say, \"We told you so,\" and ride back into power. 2. Move the party to the center. In other words, become more like the Democrats. Nobody in the party is suggesting a return to true Conservatism: smaller government which is less intrusive on our lives, fiscal responsibility, an America First foreign policy and the military power to defend it. That just seems to be off the table. Of the two schools of thought above, the first one has the best chance to succeed in returning the party to power, but the least likely to be good for America. My opinion is that they had their chance and wrecked the country because their first priority seems to have been serving their corporate masters rather than The People. The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end. Those who suggest the Republican Party should become more like the Democrats are buying into the same misunderstanding and, if they have their way with the party, future elections will revolve around nothing more than buying votes by promising the moon. Ultimately, a few cycles of the GOP and Demos both trying to outspend each other will lead to catastrophe. At some point, a true Conservative WILL arise in one party or another and he'll win the election hands down. Either that, or America is doomed.", 
        "intTime": 20090504, 
        "postID": 26, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff!", 
        "reply": " Of course a real conservative could be elected with an R before his name. Contrary to popular opinion, the Republican Party isn't dead yet. It will be back. It only remains to be seen what ideology will be driving it when it returns. Right now, there appears to be two schools of thought on how to resurrect the GOP. 1. Hold fast to the \"new\" Conservatism and wait for the Obama administration to fail. In fact, HELP it fail, thereby opening an opportunity to say, \"We told you so,\" and ride back into power. 2. Move the party to the center. In other words, become more like the Democrats. Nobody in the party is suggesting a return to true Conservatism: smaller government which is less intrusive on our lives, fiscal responsibility, an America First foreign policy and the military power to defend it. That just seems to be off the table. Of the two schools of thought above, the first one has the best chance to succeed in returning the party to power, but the least likely to be good for America. My opinion is that they had their chance and wrecked the country because their first priority seems to have been serving their corporate masters rather than The People. The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end. Those who suggest the Republican Party should become more like the Democrats are buying into the same misunderstanding and, if they have their way with the party, future elections will revolve around nothing more than buying votes by promising the moon. Ultimately, a few cycles of the GOP and Demos both trying to outspend each other will lead to catastrophe. At some point, a true Conservative WILL arise in one party or another and he'll win the election hands down. Either that, or America is doomed.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 03:31:00", 
        "title": "Bush is listening", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\". You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer.", 
        "intTime": 20090504, 
        "postID": 27, 
        "quote": "Originally posted by karlhungusjr: quote: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\".", 
        "reply": " You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 03:48:00", 
        "title": "Bush is listening", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end. I see exactly what you're saying here but I disagree slightly. I don't think most people seen it as a vote FOR liberalism and I don't think it was a vote Against George Bush necessarily. What I can see it as is a vote AGAINST the Republican party. And(IMO) that was because they had 6 years of a majority and then when they lost the majority it was only a very small number. and during that time they did nothing to make any headway into what the claim is their core beliefs. No smaller government, no fiscal conservatism, no action on their wedge issues(god guns and gays). so I believe the voters decided to swing the pendulum the other way and see how that works. if the dems don't deliver they'll be out in 4-8 years too. I think one way the republicans SHOULD try to become \"more like the democrats\" is socially. We are a conservative nation at our heart. fiscally. But you can' claim to be for small government and at the same time push your social agenda that limits personal freedom. and pushing their bran of social conservatism is what is going to hurt them in the long run unless they become more \"liberal\" in that area. and I don't necessarily mean spending on social programs. You're right that the republican party is far from dead. But I don't see them being a strong contender until they find a Goldwater type conservative and they ditch the fundamentalist/social conservatives. I guess what I'm saying is that they need to become more like libertarians.", 
        "intTime": 20090504, 
        "postID": 28, 
        "quote": "The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end.", 
        "reply": " I see exactly what you're saying here but I disagree slightly. I don't think most people seen it as a vote FOR liberalism and I don't think it was a vote Against George Bush necessarily. What I can see it as is a vote AGAINST the Republican party. And(IMO) that was because they had 6 years of a majority and then when they lost the majority it was only a very small number. and during that time they did nothing to make any headway into what the claim is their core beliefs. No smaller government, no fiscal conservatism, no action on their wedge issues(god guns and gays). so I believe the voters decided to swing the pendulum the other way and see how that works. if the dems don't deliver they'll be out in 4-8 years too. I think one way the republicans SHOULD try to become \"more like the democrats\" is socially. We are a conservative nation at our heart. fiscally. But you can' claim to be for small government and at the same time push your social agenda that limits personal freedom. and pushing their bran of social conservatism is what is going to hurt them in the long run unless they become more \"liberal\" in that area. and I don't necessarily mean spending on social programs. You're right that the republican party is far from dead. But I don't see them being a strong contender until they find a Goldwater type conservative and they ditch the fundamentalist/social conservatives. I guess what I'm saying is that they need to become more like libertarians.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 03:55:00", 
        "title": "Bush is listening", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer. wow...I nailed your response perfectly. \"But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\". \" and as a bonus...you even said \"teleprompter\"!", 
        "intTime": 20090504, 
        "postID": 29, 
        "quote": "You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer.", 
        "reply": " wow...I nailed your response perfectly. \"But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\". \" and as a bonus...you even said \"teleprompter\"!", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 04:00:00", 
        "title": "Bush is listening", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "A third Bush? Heaven help us. quote: GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition. Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels.", 
        "intTime": 20090502, 
        "postID": 30, 
        "quote": "GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition.", 
        "reply": "A third Bush? Heaven help us.  Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 18:32:00", 
        "title": "Bush is listening", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: A third Bush? Heaven help us. quote: GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition. Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels. I don't think you'll see another bush enter national politics for a long long time! Memories of the last eight years will not go quitely into the night. I actually heard Ann Coulter say last night on Larry King Live (which I was astonished), that she hopes Sarah Palin stays in Alaska for another 4-6 years. All of this tells me the GOP \"may be\" starting to use a \"new\" strategy that is outside its past history of \"same old GOP.\" We shall see....... This message has been edited. Last edited by: ProgMod, Sat 02 May 2009 09:40 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090502, 
        "postID": 31, 
        "quote": "Originally posted by FrJohn1123: A third Bush? Heaven help us. quote: GOP group launches listening tour to rebrand image Former presidential candidate Mitt Romney, former Florida Gov. Jeb Bush and House Minority Whip Eric Cantor, R-Va., held a town-hall style meeting at a pizza restaurant in the Democratic suburb of Arlington, Va., to hear about people's concerns on issues from the economy and health care to the rising costs of college tuition. Still, listening is a good start, but if they only listen to those in the republican party, they will be spinning their wheels.", 
        "reply": " I don't think you'll see another bush enter national politics for a long long time! Memories of the last eight years will not go quitely into the night. I actually heard Ann Coulter say last night on Larry King Live (which I was astonished), that she hopes Sarah Palin stays in Alaska for another 4-6 years. All of this tells me the GOP \"may be\" starting to use a \"new\" strategy that is outside its past history of \"same old GOP.\" We shall see....... This message has been edited. Last edited by: ProgMod, Sat 02 May 2009 09:40 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 19:03:00", 
        "title": "Bush is listening", 
        "userID": "ProgMod"
    }, 
    {
        "content": "They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "intTime": 20090502, 
        "postID": 32, 
        "quote": "", 
        "reply": "They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 19:32:00", 
        "title": "Bush is listening", 
        "userID": "Boots_"
    }, 
    {
        "content": "They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "intTime": 20090502, 
        "postID": 33, 
        "quote": "", 
        "reply": "They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 19:49:00", 
        "title": "Bush is listening", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Now I was never a AU H20 fan...a bit to atomic for me...But he did say politicians had no business in peoples bedrooms and churches...Now a almost fatal flaw of conservatism...Plus He was nominated in 1964 in San Francisco,California at the GOP convention(Cow Palace). I know... I was there.... and thats your trivia for the day", 
        "intTime": 20090502, 
        "postID": 34, 
        "quote": "Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "reply": " Now I was never a AU H20 fan...a bit to atomic for me...But he did say politicians had no business in peoples bedrooms and churches...Now a almost fatal flaw of conservatism...Plus He was nominated in 1964 in San Francisco,California at the GOP convention(Cow Palace). I know... I was there.... and thats your trivia for the day", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 20:14:00", 
        "title": "Bush is listening", 
        "userID": "scottrj50"
    }, 
    {
        "content": "By 2012 the people will be fed up with the Obama taxes and fees it will be easier for the Republicans to win seats and maybe the whitehouse. It is already projected that when filing 2009 income taxes people will owe money because of the Obama supposed tax cut. Energy bill will be going up and everything is going to be costing more because of hidden taxes and fees.", 
        "intTime": 20090502, 
        "postID": 35, 
        "quote": "", 
        "reply": "By 2012 the people will be fed up with the Obama taxes and fees it will be easier for the Republicans to win seats and maybe the whitehouse. It is already projected that when filing 2009 income taxes people will owe money because of the Obama supposed tax cut. Energy bill will be going up and everything is going to be costing more because of hidden taxes and fees.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 20:15:00", 
        "title": "Bush is listening", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "mmmmm......A wager?", 
        "intTime": 20090502, 
        "postID": 36, 
        "quote": "", 
        "reply": "mmmmm......A wager?", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 20:42:00", 
        "title": "Bush is listening", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character. Very True and Excellent Point...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090502, 
        "postID": 37, 
        "quote": "Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "reply": " Very True and Excellent Point...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 21:43:00", 
        "title": "Bush is listening", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090502, 
        "postID": 38, 
        "quote": "Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "reply": " Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-02 21:57:00", 
        "title": "Bush is listening", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090503, 
        "postID": 39, 
        "quote": "Now I was never a Au H20 fan...a bit too atomic for me.", 
        "reply": " OK! Now that's funny! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 06:25:00", 
        "title": "Bush is listening", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character. Nice try, but still lame. The same could be said about liberal spokesw a n k e r s Jeanine Garafolo and Keith Olbermann as well as Obama spokeswhiner Rachel Maddow.", 
        "intTime": 20090503, 
        "postID": 40, 
        "quote": "Originally posted by Boots_: They can try to \"rebrand\" all they want, as long as they have the likes of Rush Limbaugh, Glenn Beck, and Sean Hannity speaking for them we'll all know their true character.", 
        "reply": " Nice try, but still lame. The same could be said about liberal spokesw a n k e r s Jeanine Garafolo and Keith Olbermann as well as Obama spokeswhiner Rachel Maddow.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:06:00", 
        "title": "Bush is listening", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! LOL I never liked him either....he still reminds me of to this day.", 
        "intTime": 20090503, 
        "postID": 41, 
        "quote": "Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny!", 
        "reply": " LOL I never liked him either....he still reminds me of to this day.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:26:00", 
        "title": "Bush is listening", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Scott Now tell me that was not ironical, Goldwater at the Cow Palace. And what exactly were you doing there???", 
        "intTime": 20090503, 
        "postID": 42, 
        "quote": "", 
        "reply": "Scott Now tell me that was not ironical, Goldwater at the Cow Palace. And what exactly were you doing there???", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:28:00", 
        "title": "Bush is listening", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! LOL I never liked him either....he still reminds me of to this day. I wouldn't say that I didn't like him; he was very Libertarian for his day and you always knew where he stood on a subject! He could be strident without behaving like a complete lunatic, but after his last failed run for President, I think that he saw what was coming and got out before he might get caught on camera puking over what his party and indeed, our nation, was trending toward! He didn't greatly approve of Reagan or his people, and I strongly suspect he would have taken a shotgun after W for masquerading as a Conservative! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090503, 
        "postID": 43, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by KJ1110: quote: Now I was never a Au H20 fan...a bit too atomic for me. OK! Now that's funny! LOL I never liked him either....he still reminds me of to this day.", 
        "reply": " I wouldn't say that I didn't like him; he was very Libertarian for his day and you always knew where he stood on a subject! He could be strident without behaving like a complete lunatic, but after his last failed run for President, I think that he saw what was coming and got out before he might get caught on camera puking over what his party and indeed, our nation, was trending toward! He didn't greatly approve of Reagan or his people, and I strongly suspect he would have taken a shotgun after W for masquerading as a Conservative! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 07:46:00", 
        "title": "Bush is listening", 
        "userID": "KJ1110"
    }, 
    {
        "content": "My $0.02 ***Below taken from \"http://madwriter.livejournal.com/401278.html\" AU H20, memories...... Barry Goldwater, though maligned by many, was almost prescient, as shown in his book, \"The Conscience of a Conservative\" The following passages below are excerpts from Barry Goldwater's 1960 book The Conscience of a Conservative--specifically his chapter \"The Perils of Power\". He wrote these words, of course, when the Soviet Union was still the world's only other superpower and owned thousands of nuclear missiles pointed at the United States. quote: ... Such, then, is history's lesson, which Messrs. Acheson and Larson evidently did not read: release the holders of state power from any restraints other than those they wish to impose upon themselves, and you are swinging down the well-travelled road to absolutism. The framers of the Constitution had learned the lesson. They were not only students of history, but victims of it: they knew from vivid, personal experience that freedom depends on effective restraints against the accumulation of power in a single authority. And that is what the Constitution is: a system of restraints against the natural tendency of government to expand in the direction of absolutism. ... ... But the framers were not visionaries. They knew that rules of government, however brilliantly calculated to cope with the imperfect nature of man, however carefully designed to avoid the pitfalls of power, would be no match for men who were determined to disregard them. In the last analysis their system of government would prosper only if the governed were sufficiently determined that it should. \"What have you given us?\" a woman asked Ben Franklin toward the close of the Constitutional Convention. \"A Republic,\" he said, \"if you can keep it!\" ... ... The Frenchman, Alexis de Tocqueville, probably the most clairvoyant political observer of modern times, saw the danger when he visited this country in the 1830's. Even then he foresaw decay for a society that tended to put more emphasis on its democracy than its republicanism. He predicted that America would produce, not tyrants but \"guardians\". And that the American people would \"console themselves for being in tutelage by the reflection that they have chosen their own guardians. Every man allows himself to be put in lead-strings, because he sees that it is not a person nor a class of persons, but the people at large that hold the end of his chain.\" Our tendency to concentrate power in the hands of a few men deeply concerns me. We can be conquered by bombs or by subversion; but we can also be conquered by neglect--by ignoring the Constitution and disregarding the principles of limited government. Our defenses against the accumulation of unlimited power in Washington are in poorer shape, I fear, than our defenses against the aggressive designs of Moscow. Like so many other nations before us, we may succumb through internal weakness rather than fall before a foreign foe. I am convinced that most Americans now want to reverse the trend. I think that concern for our vanishing freedoms is genuine. I think that the people's uneasiness in the stifling omnipresence of government has turned into something approaching alarm. But bemoaning the evil will not drive it back, and accusing fingers will not shrink government. The turn will come when we entrust the conduct of our affairs to men who understand that their first duty as public officials is to divest themselves of the power they have been given. It will come when Americans, in the hundreds of communities throughout the nation, decide to put the man in office who is pledged to enforce the Constitution and restore the Republic. Who will proclaim in a campaign speech: \"I have little interest in streamlining government or in making it more efficient, for I mean to reduce its size. I do not undertake to promote welfare, for I propose to extend freedom. My aim is not to pass laws, but to repeal them. It is not to inaugurate new programs, but to cancel old ones that do violence to the Constitution, or that have failed in their purpose, or that impose on the people an unwarranted financial burden. I will not attempt to discover whether legislation is 'needed' before I have first determined whether it is constitutionally permissible. And if I should later be attacked for neglecting my constituents' 'interests,' I shall reply that I was informed their main interest is liberty and that in that cause I am doing the very best I can.\" \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "intTime": 20090503, 
        "postID": 44, 
        "quote": "... Such, then, is history's lesson, which Messrs. Acheson and Larson evidently did not read: release the holders of state power from any restraints other than those they wish to impose upon themselves, and you are swinging down the well-travelled road to absolutism. The framers of the Constitution had learned the lesson. They were not only students of history, but victims of it: they knew from vivid, personal experience that freedom depends on effective restraints against the accumulation of power in a single authority. And that is what the Constitution is: a system of restraints against the natural tendency of government to expand in the direction of absolutism. ... ... But the framers were not visionaries. They knew that rules of government, however brilliantly calculated to cope with the imperfect nature of man, however carefully designed to avoid the pitfalls of power, would be no match for men who were determined to disregard them. In the last analysis their system of government would prosper only if the governed were sufficiently determined that it should. \"What have you given us?\" a woman asked Ben Franklin toward the close of the Constitutional Convention. \"A Republic,\" he said, \"if you can keep it!\" ... ... The Frenchman, Alexis de Tocqueville, probably the most clairvoyant political observer of modern times, saw the danger when he visited this country in the 1830's. Even then he foresaw decay for a society that tended to put more emphasis on its democracy than its republicanism. He predicted that America would produce, not tyrants but \"guardians\". And that the American people would \"console themselves for being in tutelage by the reflection that they have chosen their own guardians. Every man allows himself to be put in lead-strings, because he sees that it is not a person nor a class of persons, but the people at large that hold the end of his chain.\" Our tendency to concentrate power in the hands of a few men deeply concerns me. We can be conquered by bombs or by subversion; but we can also be conquered by neglect--by ignoring the Constitution and disregarding the principles of limited government. Our defenses against the accumulation of unlimited power in Washington are in poorer shape, I fear, than our defenses against the aggressive designs of Moscow. Like so many other nations before us, we may succumb through internal weakness rather than fall before a foreign foe. I am convinced that most Americans now want to reverse the trend. I think that concern for our vanishing freedoms is genuine. I think that the people's uneasiness in the stifling omnipresence of government has turned into something approaching alarm. But bemoaning the evil will not drive it back, and accusing fingers will not shrink government. The turn will come when we entrust the conduct of our affairs to men who understand that their first duty as public officials is to divest themselves of the power they have been given. It will come when Americans, in the hundreds of communities throughout the nation, decide to put the man in office who is pledged to enforce the Constitution and restore the Republic. Who will proclaim in a campaign speech: \"I have little interest in streamlining government or in making it more efficient, for I mean to reduce its size. I do not undertake to promote welfare, for I propose to extend freedom. My aim is not to pass laws, but to repeal them. It is not to inaugurate new programs, but to cancel old ones that do violence to the Constitution, or that have failed in their purpose, or that impose on the people an unwarranted financial burden. I will not attempt to discover whether legislation is 'needed' before I have first determined whether it is constitutionally permissible. And if I should later be attacked for neglecting my constituents' 'interests,' I shall reply that I was informed their main interest is liberty and that in that cause I am doing the very best I can.\"", 
        "reply": "My $0.02 ***Below taken from \"http://madwriter.livejournal.com/401278.html\" AU H20, memories...... Barry Goldwater, though maligned by many, was almost prescient, as shown in his book, \"The Conscience of a Conservative\" The following passages below are excerpts from Barry Goldwater's 1960 book The Conscience of a Conservative--specifically his chapter \"The Perils of Power\". He wrote these words, of course, when the Soviet Union was still the world's only other superpower and owned thousands of nuclear missiles pointed at the United States.  \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 08:36:00", 
        "title": "Bush is listening", 
        "userID": "Silent_Surface"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: mmmmm......A wager? Yeesssss. Perhaps one of the farsiders would care to put an avatar on the table?", 
        "intTime": 20090503, 
        "postID": 45, 
        "quote": "Originally posted by scottrj50: mmmmm......A wager?", 
        "reply": " Yeesssss. Perhaps one of the farsiders would care to put an avatar on the table?", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 09:49:00", 
        "title": "Bush is listening", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Now this is a small world. I was looking up Barry Goldwater and here he is!! Thanks for the post SS. KL, in a few of your latest posts, you are starting to make sense and there are even traces of humor. It appears you may be morphing into a liberal.", 
        "intTime": 20090503, 
        "postID": 46, 
        "quote": "Originally posted by klassylady25: Now this is a small world. I was looking up Barry Goldwater and here he is!! Thanks for the post SS.", 
        "reply": " KL, in a few of your latest posts, you are starting to make sense and there are even traces of humor. It appears you may be morphing into a liberal.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 09:51:00", 
        "title": "Bush is listening", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. We do need that balance of conservative and liberal. Extreme politics is getting in the way of making this a great nation again.", 
        "intTime": 20090503, 
        "postID": 47, 
        "quote": "Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat.", 
        "reply": " We do need that balance of conservative and liberal. Extreme politics is getting in the way of making this a great nation again.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 10:11:00", 
        "title": "Bush is listening", 
        "userID": "billbright"
    }, 
    {
        "content": "Hey, Isn't Obama STILL doing all the Bush ear Patriot act stuff? lets hear about that!", 
        "intTime": 20090503, 
        "postID": 48, 
        "quote": "", 
        "reply": "Hey, Isn't Obama STILL doing all the Bush ear Patriot act stuff? lets hear about that!", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 13:48:00", 
        "title": "Bush is listening", 
        "userID": "threerings"
    }, 
    {
        "content": "Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "intTime": 20090503, 
        "postID": 49, 
        "quote": "", 
        "reply": "Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 14:15:00", 
        "title": "Bush is listening", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Where are the Obama supporters when they are needed?", 
        "intTime": 20090503, 
        "postID": 50, 
        "quote": "Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " Where are the Obama supporters when they are needed?", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 18:08:00", 
        "title": "Bush is listening", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. It is definitely NOT create new jobs. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090503, 
        "postID": 51, 
        "quote": "Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " It is definitely NOT create new jobs. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 18:22:00", 
        "title": "Bush is listening", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances.", 
        "intTime": 20090503, 
        "postID": 52, 
        "quote": "Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-03 19:02:00", 
        "title": "Bush is listening", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances. Unsubstantiated claims and yet another repetition of administration talking points is not an answer.", 
        "intTime": 20090504, 
        "postID": 53, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Duster6: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. As a result of the stimulus, I have 3 major state and municipal clients in PA and DE that have more work than my firm can handle. This includes water treatment plants, bridges, and other infrastructure projects. Many private firms, agencies, and contractors will benefit as a result of the stimulus. There's been a huge gain in the science and engineering sectors of this country since Obama has become President. Take a look at the stimulus breakdown below and ask again what has Obama done to benefit YOU and this country. I don't think you'll see these details on Foxnews. quote: Highlights of the investments included in the Act: Infrastructure Improvements $7.2 billion for Broadband to increase broadband access and usage in unserved and underserved areas of the Nation, which will better position the U.S. for economic growth, innovation, and job creation. $2.75 billion for the Department of Homeland Security to secure the homeland and promote economic activity, including $1 billion for airport baggage and checkpoint security, $430 million for construction of border points of entry, $210 million for construction of fire stations, $300 million for port, transit, and rail security, $280 million for border security technology and communication, and $240 million for the Coast Guard. $4.6 billion in funding for the Corps of Engineers. $1.2 billion for VA hospital and medical facility construction and improvements, longterm care facilities for veterans, and improvements at VA national cemeteries. $3.1 billion for repair, restoration and improvement of public facilities at on public and tribal lands. $4.2 billion for Facilities Sustainment, Restoration and Modernization to be used to invest in energy efficiency projects and to improve the repair and modernization o Department of Defense facilities to include Defense Health facilities. $2.33 billion for Department of Defense Facilities including quality of life and familyfriendly military improvement projects such as family housing, hospitals, and child care centers. $2.25 billion through HOME and the Low Income Housing Tax Credit program to fill financing gaps caused by the credit freeze and et stalled housing development projects moving. $1 billion for the Community Development Block Grant program for community and economic development projects including housing ad services for those hit hard by tough economic times. $1 billion for the Bureau of Reclamation to provide clean, reliable drinking water to rural areas and to ensure adequate water supply to western localities impacted by drought. Transportation $27.5 billion is included for highway investments $8.4 billion for investments in public transportation $1.5 billion for competitive grants to state and local governments for transportation investments $1.3 billion for investments in our air transportation system $9.3 billion for investments in rail transportation, including Amtrak, High Speed and Intercity Rail. Environmental CleanUp/Clean Water $6 billion is directed towards environmental cleanup of former weapon production and energy research sites. $6 billion for local clean and drinking water infrastructure improvements. $1.2 billion for EPA’s nationwide environmental cleanup programs, including Superfund. $1.28 billion to support $3.8 billion in loans and grants for needed water and waste disposal facilities in rural areas. Science $1 billion total for NASA. $3 billion total for National Science Foundation (NSF). $2 billion total for Science at the Department of Energy including $400 million for the Advanced Research Projects Agency—Energy (ARPAE). $830 million total for the National Oceanic and Atmospheric Association (NOAA). Energy $4.5 billion for repair of federal buildings to increase energy efficiency using green technology. $3.4 billion for Fossil Energy research and development. $11 billion for smartgrid related activities, including work to modernize the electric grid. $6.3 billion for Energy Efficiency and Conservation Grants. $5 billion for the Weatherization Assistance Program. $2.5 billion for energy efficiency and renewable energy research. $2 billion in grant funding for the manufacturing of advanced batteries systems and components and vehicle batteries that are prduced in the United States. $6 billion for new loan guarantees aimed at standard renewable projects such as wind or solar projects and for electricity transission projects. $1 billion for other energy efficiency programs including alternative fuel trucks and buses, transportation charging infrastructure, and smart and energy efficient appliances.", 
        "reply": " Unsubstantiated claims and yet another repetition of administration talking points is not an answer.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 02:28:00", 
        "title": "Bush is listening", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\".", 
        "intTime": 20090504, 
        "postID": 54, 
        "quote": "Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please.", 
        "reply": " Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\".", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 02:57:00", 
        "title": "Bush is listening", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff! Of course a real conservative could be elected with an R before his name. Contrary to popular opinion, the Republican Party isn't dead yet. It will be back. It only remains to be seen what ideology will be driving it when it returns. Right now, there appears to be two schools of thought on how to resurrect the GOP. 1. Hold fast to the \"new\" Conservatism and wait for the Obama administration to fail. In fact, HELP it fail, thereby opening an opportunity to say, \"We told you so,\" and ride back into power. 2. Move the party to the center. In other words, become more like the Democrats. Nobody in the party is suggesting a return to true Conservatism: smaller government which is less intrusive on our lives, fiscal responsibility, an America First foreign policy and the military power to defend it. That just seems to be off the table. Of the two schools of thought above, the first one has the best chance to succeed in returning the party to power, but the least likely to be good for America. My opinion is that they had their chance and wrecked the country because their first priority seems to have been serving their corporate masters rather than The People. The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end. Those who suggest the Republican Party should become more like the Democrats are buying into the same misunderstanding and, if they have their way with the party, future elections will revolve around nothing more than buying votes by promising the moon. Ultimately, a few cycles of the GOP and Demos both trying to outspend each other will lead to catastrophe. At some point, a true Conservative WILL arise in one party or another and he'll win the election hands down. Either that, or America is doomed.", 
        "intTime": 20090504, 
        "postID": 55, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by stillkit: They don't need a new strategy, or a new package or even a new face...they need a new message based upon REAL, Goldwater conservatism, not more of the same, tired, failed \"new\" conservatism of Ronald Reagan, Newt Gingrich, PNAC and the evangelical theonomists. In spite of the last election, I'm still convinced that a TRUE Conservative could stroll right into the White House without breaking a sweat. Point taken CPT. But what if that conservative still had an (R) after their name? Could they still waltz right into the WH? Maybe it's 3rd Party Time? I heard radio jocks Michael Savage and Rusty Humphries just recently say they don't want to be aligned with the GOP anymore. Interesting comment from those two to say the least! Savage of course is the most vocal against the party. They will of course continue with their conservative mantra, just minus the Grand Old Party. Interesting stuff!", 
        "reply": " Of course a real conservative could be elected with an R before his name. Contrary to popular opinion, the Republican Party isn't dead yet. It will be back. It only remains to be seen what ideology will be driving it when it returns. Right now, there appears to be two schools of thought on how to resurrect the GOP. 1. Hold fast to the \"new\" Conservatism and wait for the Obama administration to fail. In fact, HELP it fail, thereby opening an opportunity to say, \"We told you so,\" and ride back into power. 2. Move the party to the center. In other words, become more like the Democrats. Nobody in the party is suggesting a return to true Conservatism: smaller government which is less intrusive on our lives, fiscal responsibility, an America First foreign policy and the military power to defend it. That just seems to be off the table. Of the two schools of thought above, the first one has the best chance to succeed in returning the party to power, but the least likely to be good for America. My opinion is that they had their chance and wrecked the country because their first priority seems to have been serving their corporate masters rather than The People. The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end. Those who suggest the Republican Party should become more like the Democrats are buying into the same misunderstanding and, if they have their way with the party, future elections will revolve around nothing more than buying votes by promising the moon. Ultimately, a few cycles of the GOP and Demos both trying to outspend each other will lead to catastrophe. At some point, a true Conservative WILL arise in one party or another and he'll win the election hands down. Either that, or America is doomed.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 03:31:00", 
        "title": "Bush is listening", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\". You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer.", 
        "intTime": 20090504, 
        "postID": 56, 
        "quote": "Originally posted by karlhungusjr: quote: Can anyone out their name three things that Obama has done in the last 100 days that will benefit me or this country? No minor crap please. Established a credit card bill of rights Created a foreclosure prevention fund for homeowners Reverse restrictions on stem cell research Expand \"the Small Business Administration's loan and micro-loan programs \" Direct military leaders to end war in Iraq Send two additional brigades to Afghanistan there's plenty more at \"http://www.politifact.com\". But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\".", 
        "reply": " You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 03:48:00", 
        "title": "Bush is listening", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end. I see exactly what you're saying here but I disagree slightly. I don't think most people seen it as a vote FOR liberalism and I don't think it was a vote Against George Bush necessarily. What I can see it as is a vote AGAINST the Republican party. And(IMO) that was because they had 6 years of a majority and then when they lost the majority it was only a very small number. and during that time they did nothing to make any headway into what the claim is their core beliefs. No smaller government, no fiscal conservatism, no action on their wedge issues(god guns and gays). so I believe the voters decided to swing the pendulum the other way and see how that works. if the dems don't deliver they'll be out in 4-8 years too. I think one way the republicans SHOULD try to become \"more like the democrats\" is socially. We are a conservative nation at our heart. fiscally. But you can' claim to be for small government and at the same time push your social agenda that limits personal freedom. and pushing their bran of social conservatism is what is going to hurt them in the long run unless they become more \"liberal\" in that area. and I don't necessarily mean spending on social programs. You're right that the republican party is far from dead. But I don't see them being a strong contender until they find a Goldwater type conservative and they ditch the fundamentalist/social conservatives. I guess what I'm saying is that they need to become more like libertarians.", 
        "intTime": 20090504, 
        "postID": 57, 
        "quote": "The second school of thought is based upon the same mis-reading of the last election which the Democrats have fallen into: That the election of Obama was a vote for liberalism. It was not. It was a vote AGAINST George Bush, which isn't the same thing. I'm more and more convinced that radical liberalism still does not enjoy wide public support, that the majority of our citizens are still truly conservative at heart, but the Democrats don't see that. In their zeal and enthusiasm at winning power, they're going off the deep end with extreme liberalism and thereby ensuring their own defeat down the road. Americans will reject it in the end.", 
        "reply": " I see exactly what you're saying here but I disagree slightly. I don't think most people seen it as a vote FOR liberalism and I don't think it was a vote Against George Bush necessarily. What I can see it as is a vote AGAINST the Republican party. And(IMO) that was because they had 6 years of a majority and then when they lost the majority it was only a very small number. and during that time they did nothing to make any headway into what the claim is their core beliefs. No smaller government, no fiscal conservatism, no action on their wedge issues(god guns and gays). so I believe the voters decided to swing the pendulum the other way and see how that works. if the dems don't deliver they'll be out in 4-8 years too. I think one way the republicans SHOULD try to become \"more like the democrats\" is socially. We are a conservative nation at our heart. fiscally. But you can' claim to be for small government and at the same time push your social agenda that limits personal freedom. and pushing their bran of social conservatism is what is going to hurt them in the long run unless they become more \"liberal\" in that area. and I don't necessarily mean spending on social programs. You're right that the republican party is far from dead. But I don't see them being a strong contender until they find a Goldwater type conservative and they ditch the fundamentalist/social conservatives. I guess what I'm saying is that they need to become more like libertarians.", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 03:55:00", 
        "title": "Bush is listening", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer. wow...I nailed your response perfectly. \"But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\". \" and as a bonus...you even said \"teleprompter\"!", 
        "intTime": 20090504, 
        "postID": 58, 
        "quote": "You've got to be kidding right? I'm sure two more brigades to Afghanistan is going to help our country. I'm sure a credit card bill of rights is going to jump start our economy. And as far as telling our Military leaders to find a way to pull out of Iraq why didn't he just tell them to find a way to win the war in Iraq and in Afghanistan? Why not go on national TV and tell the American people that paying more than 15% interest on a credit care is stupid and they should pay it off with a nice last payment note that reads \"F#ck You\"? I never could understand why a President would want to serve more than 4 years in office anyway. Most Americans that I know would rather see a man or woman in the Oval Office that is not afraid to stand in front of a camera and speak his mind instead of reading it off of some TelePrompTer.", 
        "reply": " wow...I nailed your response perfectly. \"But somehow I have the feeling you're going to claim none of it will benefit you or the country, or is \"minor\". \" and as a bonus...you even said \"teleprompter\"!", 
        "threadID": "409192893_1060053222001", 
        "time": "2009-05-04 04:00:00", 
        "title": "Bush is listening", 
        "userID": "karlhungusjr"
    }
]