[
    {
        "content": "leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people", 
        "intTime": 20090321, 
        "postID": 1, 
        "quote": "", 
        "reply": "leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 15:34:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "The American people were clear in 2006 and 2008: Republicans.", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "", 
        "reply": "The American people were clear in 2006 and 2008: Republicans.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 16:31:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "intTime": 20090321, 
        "postID": 3, 
        "quote": "Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans.", 
        "reply": " And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 19:35:00", 
        "title": "least trusted Politician and why??", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. Agreed! We the People need a third party! The two party system are killing us! JMHO, I could be wrong...", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "reply": " Agreed! We the People need a third party! The two party system are killing us! JMHO, I could be wrong...", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 21:49:00", 
        "title": "least trusted Politician and why??", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. It certainly seems to be going in that direction, whereas no party seems to make any \"real change.\" We'll see how things go until the congressional elections in 2010. Until then, the democrats are the party in charge, and Mr. Obama has until 2012 for his first term. If the dems make the catastrophic mistakes that cost the repubs the 2006, and 2008 elections; then and only then would I be willing to support a Third Party. IMO, our political system is broke, but not yet completely broken. 2010/12, \"may\" well turn out to be a decisive turning point in US political history. It would however be unrealistic to think that Mr. Obama and his party are not unaware of futuristic events, even though such predictions on future events are speculative. Every President (and his party) wants what every First Term Administration wants, a Second Term! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "reply": " It certainly seems to be going in that direction, whereas no party seems to make any \"real change.\" We'll see how things go until the congressional elections in 2010. Until then, the democrats are the party in charge, and Mr. Obama has until 2012 for his first term. If the dems make the catastrophic mistakes that cost the repubs the 2006, and 2008 elections; then and only then would I be willing to support a Third Party. IMO, our political system is broke, but not yet completely broken. 2010/12, \"may\" well turn out to be a decisive turning point in US political history. It would however be unrealistic to think that Mr. Obama and his party are not unaware of futuristic events, even though such predictions on future events are speculative. Every President (and his party) wants what every First Term Administration wants, a Second Term! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 22:31:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Thats easy...Repubs, Dimocraps, and Independents. Not necessarily in that order.", 
        "intTime": 20090321, 
        "postID": 6, 
        "quote": "", 
        "reply": "Thats easy...Repubs, Dimocraps, and Independents. Not necessarily in that order.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 22:33:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "we need a third or forth party system.... sooooo people come this next election cycle we need to break from the old.. lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 7, 
        "quote": "", 
        "reply": "we need a third or forth party system.... sooooo people come this next election cycle we need to break from the old.. lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 22:36:00", 
        "title": "least trusted Politician and why??", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "LOL...after two months President Obama = President Decider... You people are a trip...", 
        "intTime": 20090321, 
        "postID": 8, 
        "quote": "", 
        "reply": "LOL...after two months President Obama = President Decider... You people are a trip...", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 23:59:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: ...lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting. But wasn't that the reason that a whole lotta peeps wanted Obama... Something about \"Hope & Change;\" the way things are turning out - I don't believe that this was the \"change\" that they were \"hoping\" for.", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by m551sheridan: ...lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting.", 
        "reply": " But wasn't that the reason that a whole lotta peeps wanted Obama... Something about \"Hope & Change;\" the way things are turning out - I don't believe that this was the \"change\" that they were \"hoping\" for.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 00:09:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Spot379th"
    }, 
    {
        "content": "Rangel, Reid, Dodd and oh my god Pelosi, the woman is just plain incompetant and dumber than a box of rocks.", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "", 
        "reply": "Rangel, Reid, Dodd and oh my god Pelosi, the woman is just plain incompetant and dumber than a box of rocks.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 01:52:00", 
        "title": "least trusted Politician and why??", 
        "userID": "dhd123"
    }, 
    {
        "content": "quote: We the People need a third party do not agree, there are some good decent people on both sides of the aisle. the real culprit is \"TOTAL LACK OF ACCOUNTABILITY WHEN ELECTED\" just today it was announced that a democratic congressman has lied about principal residence for tax purposes. \"http://beltwayblips.dailyradar.com/story/california_congressman_calls_maryland_home_to_gain_tax/\" now someone tell me that this guy is totally innocent!! he knew damn well what he was doing and why DODD and FRANKS ARE TOTALLY OUTRAGEOUS. I DO NOT AGREE ABOUT PELOSI BEING DUMB SHE IS PRETTY SHREWD AND A REAL PLAYER. but they all get away with too much crap, we need more convictions like that nitwit Duke Cunningham, that man had the world on a string and got greedy, and he got put into jail. politicians just dont seem to police themselves at all but how is this fixed, politicos just plain lie to get elected, and the most important item is to get re elected, maybe term limits?? dunno sumpin needs to be done", 
        "intTime": 20090322, 
        "postID": 11, 
        "quote": "We the People need a third party", 
        "reply": " do not agree, there are some good decent people on both sides of the aisle. the real culprit is \"TOTAL LACK OF ACCOUNTABILITY WHEN ELECTED\" just today it was announced that a democratic congressman has lied about principal residence for tax purposes. \"http://beltwayblips.dailyradar.com/story/california_congressman_calls_maryland_home_to_gain_tax/\" now someone tell me that this guy is totally innocent!! he knew damn well what he was doing and why DODD and FRANKS ARE TOTALLY OUTRAGEOUS. I DO NOT AGREE ABOUT PELOSI BEING DUMB SHE IS PRETTY SHREWD AND A REAL PLAYER. but they all get away with too much crap, we need more convictions like that nitwit Duke Cunningham, that man had the world on a string and got greedy, and he got put into jail. politicians just dont seem to police themselves at all but how is this fixed, politicos just plain lie to get elected, and the most important item is to get re elected, maybe term limits?? dunno sumpin needs to be done", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 08:30:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: ....dunno sumpin needs to be done Why!? By the time the current crop of clowns/criminals in office are eligible to be replaced there probably wont be enough left to do anything with. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "Originally posted by Ira1945: ....dunno sumpin needs to be done", 
        "reply": " Why!? By the time the current crop of clowns/criminals in office are eligible to be replaced there probably wont be enough left to do anything with. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 09:30:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by MilitaryFanSupporter: quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. Agreed! We the People need a third party! The two party system are killing us! Thanks you guys for saving me the time. It's pretty annoying to get on hear every day and read people acting like there is some huge moral and intellectual difference between the parties.", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "Originally posted by MilitaryFanSupporter: quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. Agreed! We the People need a third party! The two party system are killing us!", 
        "reply": " Thanks you guys for saving me the time. It's pretty annoying to get on hear every day and read people acting like there is some huge moral and intellectual difference between the parties.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 09:42:00", 
        "title": "least trusted Politician and why??", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates.", 
        "intTime": 20090322, 
        "postID": 14, 
        "quote": "Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people", 
        "reply": " Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 10:36:00", 
        "title": "least trusted Politician and why??", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates. Absolutely correct!!", 
        "intTime": 20090322, 
        "postID": 15, 
        "quote": "Originally posted by shuman14: quote: Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates.", 
        "reply": " Absolutely correct!!", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 10:43:00", 
        "title": "least trusted Politician and why??", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Frank Dodd Rangel Reid Pelosi Waters Conyers", 
        "intTime": 20090323, 
        "postID": 16, 
        "quote": "", 
        "reply": "Frank Dodd Rangel Reid Pelosi Waters Conyers", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 07:42:00", 
        "title": "least trusted Politician and why??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "You could not find a single tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution.... This message has been edited. Last edited by: ipw533, Mon 23 March 2009 11:14 AM", 
        "intTime": 20090323, 
        "postID": 17, 
        "quote": "", 
        "reply": "You could not find a single tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution.... This message has been edited. Last edited by: ipw533, Mon 23 March 2009 11:14 AM", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 08:33:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ipw533"
    }, 
    {
        "content": "Sen. Schumer Announces Support for Marriage Equality Reported by: WROC-TV Monday, Mar 23, 2009 @01:16pm EST On Monday, Senator Charles Schumer announced his support for marriage equality for same sex couples and for the repeal of the Defense of Marriage Act. Schumer has pledged to work to provide federal recognition and portability of benefits to legally married gay couples.", 
        "intTime": 20090323, 
        "postID": 18, 
        "quote": "", 
        "reply": "Sen. Schumer Announces Support for Marriage Equality Reported by: WROC-TV Monday, Mar 23, 2009 @01:16pm EST On Monday, Senator Charles Schumer announced his support for marriage equality for same sex couples and for the repeal of the Defense of Marriage Act. Schumer has pledged to work to provide federal recognition and portability of benefits to legally married gay couples.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:28:00", 
        "title": "least trusted Politician and why??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by ipw533: You could not find a singe tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution.... tell us how you really feel", 
        "intTime": 20090323, 
        "postID": 19, 
        "quote": "Originally posted by ipw533: You could not find a singe tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution....", 
        "reply": " tell us how you really feel", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:32:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Im with gunny.", 
        "intTime": 20090323, 
        "postID": 20, 
        "quote": "", 
        "reply": "Im with gunny.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:32:00", 
        "title": "least trusted Politician and why??", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Poll: Paterson's Approval Rating Hits New Low Reported by: WROC-TV Monday, Mar 23, 2009 @11:25am EST Only 14 percent of voters are prepared to elect him in 2010. 67% say they prefer \"someone else. \" New Yorkers Continue to Move to Other States Reported by: WROC-TV Monday, Mar 23, 2009 @08:36am EST The exodus of New Yorkers to other states continues. That's according to the latest U.S. Census figures, which indicate residents moved out of New York at the third fastest rate in the country. Perhaps the only variable that keeps New York from having the highest out migration rate is the influx of immigrants, who mostly move to New York city.", 
        "intTime": 20090323, 
        "postID": 21, 
        "quote": "", 
        "reply": "Poll: Paterson's Approval Rating Hits New Low Reported by: WROC-TV Monday, Mar 23, 2009 @11:25am EST Only 14 percent of voters are prepared to elect him in 2010. 67% say they prefer \"someone else. \" New Yorkers Continue to Move to Other States Reported by: WROC-TV Monday, Mar 23, 2009 @08:36am EST The exodus of New Yorkers to other states continues. That's according to the latest U.S. Census figures, which indicate residents moved out of New York at the third fastest rate in the country. Perhaps the only variable that keeps New York from having the highest out migration rate is the influx of immigrants, who mostly move to New York city.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:33:00", 
        "title": "least trusted Politician and why??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: Im with gunny. And no need to explain why they are so shiitey.", 
        "intTime": 20090323, 
        "postID": 22, 
        "quote": "Originally posted by MSGCAVALRY: Im with gunny.", 
        "reply": " And no need to explain why they are so shiitey.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:45:00", 
        "title": "least trusted Politician and why??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Frank and Murtha are the worse IMO. Frank because he is Gay, a liar, and a thief. Murtha because he is a traitor, an embezzler, and has no honor.", 
        "intTime": 20090323, 
        "postID": 23, 
        "quote": "", 
        "reply": "Frank and Murtha are the worse IMO. Frank because he is Gay, a liar, and a thief. Murtha because he is a traitor, an embezzler, and has no honor.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:52:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Duster6"
    }, 
    {
        "content": "Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast....", 
        "intTime": 20090323, 
        "postID": 24, 
        "quote": "", 
        "reply": "Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast....", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 11:38:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast.... Murtha, a combat vet?? i know bunches of S3 types that earned 'bronze stars' for editing actual combat reports ans supervising changing of typewriter ribbons.. he like that?", 
        "intTime": 20090323, 
        "postID": 25, 
        "quote": "Originally posted by ipw533: Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast....", 
        "reply": " Murtha, a combat vet?? i know bunches of S3 types that earned 'bronze stars' for editing actual combat reports ans supervising changing of typewriter ribbons.. he like that?", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 11:44:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "While we're on the subject of Mr. Murtha, just exactly when does he intend to apologize to the Marines he convicted without a trial of being \"colblooded murderers\"? Especially since they were found not guilty of those charges. Have you no honor at all, Congressman-have you no shame...?", 
        "intTime": 20090323, 
        "postID": 26, 
        "quote": "", 
        "reply": "While we're on the subject of Mr. Murtha, just exactly when does he intend to apologize to the Marines he convicted without a trial of being \"colblooded murderers\"? Especially since they were found not guilty of those charges. Have you no honor at all, Congressman-have you no shame...?", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 11:47:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ipw533"
    }, 
    {
        "content": "Both parties (and the other third parties as well, to a lesser extent) are populated by people who have gotten good at playing \"the game\" and all they are interested in doing is winning it. Pelosi has pretty much admitted it - she is not interested in good governance, just increasing the power of the party in Congress. The Republicans are just the same (although more subtle). Still, my vote: The American voter. A person that can give a 14% approval rating to Congress as a whole while simultaneously giving their own Congressmen 60% approval ratings.", 
        "intTime": 20090323, 
        "postID": 27, 
        "quote": "", 
        "reply": "Both parties (and the other third parties as well, to a lesser extent) are populated by people who have gotten good at playing \"the game\" and all they are interested in doing is winning it. Pelosi has pretty much admitted it - she is not interested in good governance, just increasing the power of the party in Congress. The Republicans are just the same (although more subtle). Still, my vote: The American voter. A person that can give a 14% approval rating to Congress as a whole while simultaneously giving their own Congressmen 60% approval ratings.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 13:09:00", 
        "title": "least trusted Politician and why??", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "If they are a politician , they can't be trusted.", 
        "intTime": 20090323, 
        "postID": 28, 
        "quote": "", 
        "reply": "If they are a politician , they can't be trusted.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 13:45:00", 
        "title": "least trusted Politician and why??", 
        "userID": "coh75inf"
    }, 
    {
        "content": "ANY Politician that says, \"I promise to....\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 29, 
        "quote": "", 
        "reply": "ANY Politician that says, \"I promise to....\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 15:40:00", 
        "title": "least trusted Politician and why??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Roland Burris-I did not have any contact with Blogo---well I might have talked with somebody from his staff----I tried to raise money for him, but coould not. Chuck Schumer, makes great statements about what he has does for the people, until you read and understand the bills he has passed. The one of his I like is you get up to a $1000 credit for text books to help poor struggling students. Sounds great, until you find out the qualifing factors. first the books must be required as part of addimission to the institution. This means no sharing or using the library copy. Second the books can only be availible from the institution, no ecampus, no E-bay. To the other college students how many of you would qualified for this credit. Not I, every class I took from first year to grad school, the classes had required books, but the instructor could not force me get the book. We also had the college bookstore and the off campus bookstore.", 
        "intTime": 20090323, 
        "postID": 30, 
        "quote": "", 
        "reply": "Roland Burris-I did not have any contact with Blogo---well I might have talked with somebody from his staff----I tried to raise money for him, but coould not. Chuck Schumer, makes great statements about what he has does for the people, until you read and understand the bills he has passed. The one of his I like is you get up to a $1000 credit for text books to help poor struggling students. Sounds great, until you find out the qualifing factors. first the books must be required as part of addimission to the institution. This means no sharing or using the library copy. Second the books can only be availible from the institution, no ecampus, no E-bay. To the other college students how many of you would qualified for this credit. Not I, every class I took from first year to grad school, the classes had required books, but the instructor could not force me get the book. We also had the college bookstore and the off campus bookstore.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 15:59:00", 
        "title": "least trusted Politician and why??", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people", 
        "intTime": 20090321, 
        "postID": 31, 
        "quote": "", 
        "reply": "leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 15:34:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "The American people were clear in 2006 and 2008: Republicans.", 
        "intTime": 20090321, 
        "postID": 32, 
        "quote": "", 
        "reply": "The American people were clear in 2006 and 2008: Republicans.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 16:31:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "intTime": 20090321, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans.", 
        "reply": " And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 19:35:00", 
        "title": "least trusted Politician and why??", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. Agreed! We the People need a third party! The two party system are killing us! JMHO, I could be wrong...", 
        "intTime": 20090321, 
        "postID": 34, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "reply": " Agreed! We the People need a third party! The two party system are killing us! JMHO, I could be wrong...", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 21:49:00", 
        "title": "least trusted Politician and why??", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. It certainly seems to be going in that direction, whereas no party seems to make any \"real change.\" We'll see how things go until the congressional elections in 2010. Until then, the democrats are the party in charge, and Mr. Obama has until 2012 for his first term. If the dems make the catastrophic mistakes that cost the repubs the 2006, and 2008 elections; then and only then would I be willing to support a Third Party. IMO, our political system is broke, but not yet completely broken. 2010/12, \"may\" well turn out to be a decisive turning point in US political history. It would however be unrealistic to think that Mr. Obama and his party are not unaware of futuristic events, even though such predictions on future events are speculative. Every President (and his party) wants what every First Term Administration wants, a Second Term! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090321, 
        "postID": 35, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats.", 
        "reply": " It certainly seems to be going in that direction, whereas no party seems to make any \"real change.\" We'll see how things go until the congressional elections in 2010. Until then, the democrats are the party in charge, and Mr. Obama has until 2012 for his first term. If the dems make the catastrophic mistakes that cost the repubs the 2006, and 2008 elections; then and only then would I be willing to support a Third Party. IMO, our political system is broke, but not yet completely broken. 2010/12, \"may\" well turn out to be a decisive turning point in US political history. It would however be unrealistic to think that Mr. Obama and his party are not unaware of futuristic events, even though such predictions on future events are speculative. Every President (and his party) wants what every First Term Administration wants, a Second Term! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 22:31:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Thats easy...Repubs, Dimocraps, and Independents. Not necessarily in that order.", 
        "intTime": 20090321, 
        "postID": 36, 
        "quote": "", 
        "reply": "Thats easy...Repubs, Dimocraps, and Independents. Not necessarily in that order.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 22:33:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "we need a third or forth party system.... sooooo people come this next election cycle we need to break from the old.. lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 37, 
        "quote": "", 
        "reply": "we need a third or forth party system.... sooooo people come this next election cycle we need to break from the old.. lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 22:36:00", 
        "title": "least trusted Politician and why??", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "LOL...after two months President Obama = President Decider... You people are a trip...", 
        "intTime": 20090321, 
        "postID": 38, 
        "quote": "", 
        "reply": "LOL...after two months President Obama = President Decider... You people are a trip...", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-21 23:59:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: ...lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting. But wasn't that the reason that a whole lotta peeps wanted Obama... Something about \"Hope & Change;\" the way things are turning out - I don't believe that this was the \"change\" that they were \"hoping\" for.", 
        "intTime": 20090322, 
        "postID": 39, 
        "quote": "Originally posted by m551sheridan: ...lesser of two evils thing. A totally unknown cannot be any worse then what we've been getting.", 
        "reply": " But wasn't that the reason that a whole lotta peeps wanted Obama... Something about \"Hope & Change;\" the way things are turning out - I don't believe that this was the \"change\" that they were \"hoping\" for.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 00:09:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Spot379th"
    }, 
    {
        "content": "Rangel, Reid, Dodd and oh my god Pelosi, the woman is just plain incompetant and dumber than a box of rocks.", 
        "intTime": 20090322, 
        "postID": 40, 
        "quote": "", 
        "reply": "Rangel, Reid, Dodd and oh my god Pelosi, the woman is just plain incompetant and dumber than a box of rocks.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 01:52:00", 
        "title": "least trusted Politician and why??", 
        "userID": "dhd123"
    }, 
    {
        "content": "quote: We the People need a third party do not agree, there are some good decent people on both sides of the aisle. the real culprit is \"TOTAL LACK OF ACCOUNTABILITY WHEN ELECTED\" just today it was announced that a democratic congressman has lied about principal residence for tax purposes. \"http://beltwayblips.dailyradar.com/story/california_congressman_calls_maryland_home_to_gain_tax/\" now someone tell me that this guy is totally innocent!! he knew damn well what he was doing and why DODD and FRANKS ARE TOTALLY OUTRAGEOUS. I DO NOT AGREE ABOUT PELOSI BEING DUMB SHE IS PRETTY SHREWD AND A REAL PLAYER. but they all get away with too much crap, we need more convictions like that nitwit Duke Cunningham, that man had the world on a string and got greedy, and he got put into jail. politicians just dont seem to police themselves at all but how is this fixed, politicos just plain lie to get elected, and the most important item is to get re elected, maybe term limits?? dunno sumpin needs to be done", 
        "intTime": 20090322, 
        "postID": 41, 
        "quote": "We the People need a third party", 
        "reply": " do not agree, there are some good decent people on both sides of the aisle. the real culprit is \"TOTAL LACK OF ACCOUNTABILITY WHEN ELECTED\" just today it was announced that a democratic congressman has lied about principal residence for tax purposes. \"http://beltwayblips.dailyradar.com/story/california_congressman_calls_maryland_home_to_gain_tax/\" now someone tell me that this guy is totally innocent!! he knew damn well what he was doing and why DODD and FRANKS ARE TOTALLY OUTRAGEOUS. I DO NOT AGREE ABOUT PELOSI BEING DUMB SHE IS PRETTY SHREWD AND A REAL PLAYER. but they all get away with too much crap, we need more convictions like that nitwit Duke Cunningham, that man had the world on a string and got greedy, and he got put into jail. politicians just dont seem to police themselves at all but how is this fixed, politicos just plain lie to get elected, and the most important item is to get re elected, maybe term limits?? dunno sumpin needs to be done", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 08:30:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: ....dunno sumpin needs to be done Why!? By the time the current crop of clowns/criminals in office are eligible to be replaced there probably wont be enough left to do anything with. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090322, 
        "postID": 42, 
        "quote": "Originally posted by Ira1945: ....dunno sumpin needs to be done", 
        "reply": " Why!? By the time the current crop of clowns/criminals in office are eligible to be replaced there probably wont be enough left to do anything with. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 09:30:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by MilitaryFanSupporter: quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. Agreed! We the People need a third party! The two party system are killing us! Thanks you guys for saving me the time. It's pretty annoying to get on hear every day and read people acting like there is some huge moral and intellectual difference between the parties.", 
        "intTime": 20090322, 
        "postID": 43, 
        "quote": "Originally posted by MilitaryFanSupporter: quote: Originally posted by 10tenths: quote: Originally posted by Irwin_R_Schyster: The American people were clear in 2006 and 2008: Republicans. And, that will change when they see how crappy the Democrats are. Then, when Republicans are in charge again, the people will get sick of them and go back to the Democrats, and so on and so forth. Over and over, etc etc. You would think that people would get the hint after a while. Both parties are azzhats. Agreed! We the People need a third party! The two party system are killing us!", 
        "reply": " Thanks you guys for saving me the time. It's pretty annoying to get on hear every day and read people acting like there is some huge moral and intellectual difference between the parties.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 09:42:00", 
        "title": "least trusted Politician and why??", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates.", 
        "intTime": 20090322, 
        "postID": 44, 
        "quote": "Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people", 
        "reply": " Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 10:36:00", 
        "title": "least trusted Politician and why??", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates. Absolutely correct!!", 
        "intTime": 20090322, 
        "postID": 45, 
        "quote": "Originally posted by shuman14: quote: Originally posted by Ira1945: leaving Executive branch out of it congress and senate my choice would be a three way toss up RANGEL, DODD, FRANKS why, banking, and the mtg loan super screw up, rangel because paying taxes is for the little people Add Princess Pelosi and Prince Harry Reid and you've got my top five \"most likely to be lynched in a revolution\" canidates.", 
        "reply": " Absolutely correct!!", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-22 10:43:00", 
        "title": "least trusted Politician and why??", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Frank Dodd Rangel Reid Pelosi Waters Conyers", 
        "intTime": 20090323, 
        "postID": 46, 
        "quote": "", 
        "reply": "Frank Dodd Rangel Reid Pelosi Waters Conyers", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 07:42:00", 
        "title": "least trusted Politician and why??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "You could not find a single tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution.... This message has been edited. Last edited by: ipw533, Mon 23 March 2009 11:14 AM", 
        "intTime": 20090323, 
        "postID": 47, 
        "quote": "", 
        "reply": "You could not find a single tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution.... This message has been edited. Last edited by: ipw533, Mon 23 March 2009 11:14 AM", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 08:33:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ipw533"
    }, 
    {
        "content": "Sen. Schumer Announces Support for Marriage Equality Reported by: WROC-TV Monday, Mar 23, 2009 @01:16pm EST On Monday, Senator Charles Schumer announced his support for marriage equality for same sex couples and for the repeal of the Defense of Marriage Act. Schumer has pledged to work to provide federal recognition and portability of benefits to legally married gay couples.", 
        "intTime": 20090323, 
        "postID": 48, 
        "quote": "", 
        "reply": "Sen. Schumer Announces Support for Marriage Equality Reported by: WROC-TV Monday, Mar 23, 2009 @01:16pm EST On Monday, Senator Charles Schumer announced his support for marriage equality for same sex couples and for the repeal of the Defense of Marriage Act. Schumer has pledged to work to provide federal recognition and portability of benefits to legally married gay couples.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:28:00", 
        "title": "least trusted Politician and why??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by ipw533: You could not find a singe tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution.... tell us how you really feel", 
        "intTime": 20090323, 
        "postID": 49, 
        "quote": "Originally posted by ipw533: You could not find a singe tree in this vast country vile enough to hang any one of those specimens from. In their case hydrochloric acid really is the logical solution....", 
        "reply": " tell us how you really feel", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:32:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Im with gunny.", 
        "intTime": 20090323, 
        "postID": 50, 
        "quote": "", 
        "reply": "Im with gunny.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:32:00", 
        "title": "least trusted Politician and why??", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Poll: Paterson's Approval Rating Hits New Low Reported by: WROC-TV Monday, Mar 23, 2009 @11:25am EST Only 14 percent of voters are prepared to elect him in 2010. 67% say they prefer \"someone else. \" New Yorkers Continue to Move to Other States Reported by: WROC-TV Monday, Mar 23, 2009 @08:36am EST The exodus of New Yorkers to other states continues. That's according to the latest U.S. Census figures, which indicate residents moved out of New York at the third fastest rate in the country. Perhaps the only variable that keeps New York from having the highest out migration rate is the influx of immigrants, who mostly move to New York city.", 
        "intTime": 20090323, 
        "postID": 51, 
        "quote": "", 
        "reply": "Poll: Paterson's Approval Rating Hits New Low Reported by: WROC-TV Monday, Mar 23, 2009 @11:25am EST Only 14 percent of voters are prepared to elect him in 2010. 67% say they prefer \"someone else. \" New Yorkers Continue to Move to Other States Reported by: WROC-TV Monday, Mar 23, 2009 @08:36am EST The exodus of New Yorkers to other states continues. That's according to the latest U.S. Census figures, which indicate residents moved out of New York at the third fastest rate in the country. Perhaps the only variable that keeps New York from having the highest out migration rate is the influx of immigrants, who mostly move to New York city.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:33:00", 
        "title": "least trusted Politician and why??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: Im with gunny. And no need to explain why they are so shiitey.", 
        "intTime": 20090323, 
        "postID": 52, 
        "quote": "Originally posted by MSGCAVALRY: Im with gunny.", 
        "reply": " And no need to explain why they are so shiitey.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:45:00", 
        "title": "least trusted Politician and why??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Frank and Murtha are the worse IMO. Frank because he is Gay, a liar, and a thief. Murtha because he is a traitor, an embezzler, and has no honor.", 
        "intTime": 20090323, 
        "postID": 53, 
        "quote": "", 
        "reply": "Frank and Murtha are the worse IMO. Frank because he is Gay, a liar, and a thief. Murtha because he is a traitor, an embezzler, and has no honor.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 10:52:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Duster6"
    }, 
    {
        "content": "Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast....", 
        "intTime": 20090323, 
        "postID": 54, 
        "quote": "", 
        "reply": "Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast....", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 11:38:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast.... Murtha, a combat vet?? i know bunches of S3 types that earned 'bronze stars' for editing actual combat reports ans supervising changing of typewriter ribbons.. he like that?", 
        "intTime": 20090323, 
        "postID": 55, 
        "quote": "Originally posted by ipw533: Well, since you mentioned Murtha it's worth noting that this thing is an ex-Marine. Among the Marines I've known there is no such critter unless it's so dishonored that the Corps itself wants nothing to do with it. The consensus is that Murtha is just that kind of vile outcast....", 
        "reply": " Murtha, a combat vet?? i know bunches of S3 types that earned 'bronze stars' for editing actual combat reports ans supervising changing of typewriter ribbons.. he like that?", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 11:44:00", 
        "title": "least trusted Politician and why??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "While we're on the subject of Mr. Murtha, just exactly when does he intend to apologize to the Marines he convicted without a trial of being \"colblooded murderers\"? Especially since they were found not guilty of those charges. Have you no honor at all, Congressman-have you no shame...?", 
        "intTime": 20090323, 
        "postID": 56, 
        "quote": "", 
        "reply": "While we're on the subject of Mr. Murtha, just exactly when does he intend to apologize to the Marines he convicted without a trial of being \"colblooded murderers\"? Especially since they were found not guilty of those charges. Have you no honor at all, Congressman-have you no shame...?", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 11:47:00", 
        "title": "least trusted Politician and why??", 
        "userID": "ipw533"
    }, 
    {
        "content": "Both parties (and the other third parties as well, to a lesser extent) are populated by people who have gotten good at playing \"the game\" and all they are interested in doing is winning it. Pelosi has pretty much admitted it - she is not interested in good governance, just increasing the power of the party in Congress. The Republicans are just the same (although more subtle). Still, my vote: The American voter. A person that can give a 14% approval rating to Congress as a whole while simultaneously giving their own Congressmen 60% approval ratings.", 
        "intTime": 20090323, 
        "postID": 57, 
        "quote": "", 
        "reply": "Both parties (and the other third parties as well, to a lesser extent) are populated by people who have gotten good at playing \"the game\" and all they are interested in doing is winning it. Pelosi has pretty much admitted it - she is not interested in good governance, just increasing the power of the party in Congress. The Republicans are just the same (although more subtle). Still, my vote: The American voter. A person that can give a 14% approval rating to Congress as a whole while simultaneously giving their own Congressmen 60% approval ratings.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 13:09:00", 
        "title": "least trusted Politician and why??", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "If they are a politician , they can't be trusted.", 
        "intTime": 20090323, 
        "postID": 58, 
        "quote": "", 
        "reply": "If they are a politician , they can't be trusted.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 13:45:00", 
        "title": "least trusted Politician and why??", 
        "userID": "coh75inf"
    }, 
    {
        "content": "ANY Politician that says, \"I promise to....\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 59, 
        "quote": "", 
        "reply": "ANY Politician that says, \"I promise to....\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 15:40:00", 
        "title": "least trusted Politician and why??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Roland Burris-I did not have any contact with Blogo---well I might have talked with somebody from his staff----I tried to raise money for him, but coould not. Chuck Schumer, makes great statements about what he has does for the people, until you read and understand the bills he has passed. The one of his I like is you get up to a $1000 credit for text books to help poor struggling students. Sounds great, until you find out the qualifing factors. first the books must be required as part of addimission to the institution. This means no sharing or using the library copy. Second the books can only be availible from the institution, no ecampus, no E-bay. To the other college students how many of you would qualified for this credit. Not I, every class I took from first year to grad school, the classes had required books, but the instructor could not force me get the book. We also had the college bookstore and the off campus bookstore.", 
        "intTime": 20090323, 
        "postID": 60, 
        "quote": "", 
        "reply": "Roland Burris-I did not have any contact with Blogo---well I might have talked with somebody from his staff----I tried to raise money for him, but coould not. Chuck Schumer, makes great statements about what he has does for the people, until you read and understand the bills he has passed. The one of his I like is you get up to a $1000 credit for text books to help poor struggling students. Sounds great, until you find out the qualifing factors. first the books must be required as part of addimission to the institution. This means no sharing or using the library copy. Second the books can only be availible from the institution, no ecampus, no E-bay. To the other college students how many of you would qualified for this credit. Not I, every class I took from first year to grad school, the classes had required books, but the instructor could not force me get the book. We also had the college bookstore and the off campus bookstore.", 
        "threadID": "409192893_1310035812001", 
        "time": "2009-03-23 15:59:00", 
        "title": "least trusted Politician and why??", 
        "userID": "sgt_posty"
    }
]