[
    {
        "content": "This youtube vid will pizz some off and get a Hoo-Ahh from others. Question is, does this help or harm our effort in Iraq...??? >>>http://www.harpers.org/archive/2009/03/hbc-90004477", 
        "intTime": 20090313, 
        "postID": 1, 
        "quote": "", 
        "reply": "This youtube vid will pizz some off and get a Hoo-Ahh from others. Question is, does this help or harm our effort in Iraq...??? >>>http://www.harpers.org/archive/2009/03/hbc-90004477", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-13 15:58:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: This youtube vid will pizz some off and get a Hoo-Ahh from others. Question is, does this help or harm our effort in Iraq...??? >>>http://www.harpers.org/archive/2009/03/hbc-90004477 This is what works in Iraq. It's that simple. Except for the part where he shamed the officers a little that speech could only have helped. I will bet that anyone who has been there, dealt with IPs, been shot at by IPs, been blown up by IPs will post on the hooah side. These are Iraqi Police. They are a grab bag. Not everyone is rotten, but when I was there every time we got blown up or ambushed they were near. They even caught IPs on video planting IEDs. Before the surge they were heavily infiltrated by insurgents. We only trusted Iraqi Army or Iraqi National Guard. We knew the local Iraqi Police were generally worthless and likely to be the ones killing us.(and each other) Here's a video. What you can't see is the Iraqi Police patrol observing us from a nearby bridge. The days that the Iraqi National Guard posted on the bridge, nothing happened. Almost every time Iraqi Police took the post, we got hit, as has just happened in the video. Listen carefully to what my gunner says about IPs. \"http://www.youtube.com/watch?v=HTXrN5hfrdo\"", 
        "intTime": 20090313, 
        "postID": 2, 
        "quote": "Originally posted by jdksfcret: This youtube vid will pizz some off and get a Hoo-Ahh from others. Question is, does this help or harm our effort in Iraq...??? >>>http://www.harpers.org/archive/2009/03/hbc-90004477", 
        "reply": " This is what works in Iraq. It's that simple. Except for the part where he shamed the officers a little that speech could only have helped. I will bet that anyone who has been there, dealt with IPs, been shot at by IPs, been blown up by IPs will post on the hooah side. These are Iraqi Police. They are a grab bag. Not everyone is rotten, but when I was there every time we got blown up or ambushed they were near. They even caught IPs on video planting IEDs. Before the surge they were heavily infiltrated by insurgents. We only trusted Iraqi Army or Iraqi National Guard. We knew the local Iraqi Police were generally worthless and likely to be the ones killing us.(and each other) Here's a video. What you can't see is the Iraqi Police patrol observing us from a nearby bridge. The days that the Iraqi National Guard posted on the bridge, nothing happened. Almost every time Iraqi Police took the post, we got hit, as has just happened in the video. Listen carefully to what my gunner says about IPs. \"http://www.youtube.com/watch?v=HTXrN5hfrdo\"", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-13 16:36:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: This youtube vid will pizz some off and get a Hoo-Ahh from others. Question is, does this help or harm our effort in Iraq...??? >>>http://www.harpers.org/archive/2009/03/hbc-90004477 I have been in that exact same situation and I have taken a similar course of action a few times. If you have a group of soldiers, police in this case, and you need something done the direct approach can be effective. It works best if have a rapport with the unit, and have helped them in the past. The biggest part of his speech was threatening to cut off equipment, that usually works. He obviously has previous history with this IP unit. The profanity is excessive, that is a cultural thing that can backfire so I wouldn't have used that much. This is one moment in time, we can't possibly know how it is normally. I was a LT acting as the advisor to an Iraqi Brigadier General and up to eight Colonels. I had to be direct and forceful at times to let them know they were not going to manipulate me just to get what they wanted without contributing to the mission. If I thought something was corrupt I told them. If I thought they were being cowards I told them. When they would whine about not having equipment to do their job I would point out what they did have. It was a tough love approach, and sometimes it was sink or swim.", 
        "intTime": 20090313, 
        "postID": 3, 
        "quote": "Originally posted by jdksfcret: This youtube vid will pizz some off and get a Hoo-Ahh from others. Question is, does this help or harm our effort in Iraq...??? >>>http://www.harpers.org/archive/2009/03/hbc-90004477", 
        "reply": " I have been in that exact same situation and I have taken a similar course of action a few times. If you have a group of soldiers, police in this case, and you need something done the direct approach can be effective. It works best if have a rapport with the unit, and have helped them in the past. The biggest part of his speech was threatening to cut off equipment, that usually works. He obviously has previous history with this IP unit. The profanity is excessive, that is a cultural thing that can backfire so I wouldn't have used that much. This is one moment in time, we can't possibly know how it is normally. I was a LT acting as the advisor to an Iraqi Brigadier General and up to eight Colonels. I had to be direct and forceful at times to let them know they were not going to manipulate me just to get what they wanted without contributing to the mission. If I thought something was corrupt I told them. If I thought they were being cowards I told them. When they would whine about not having equipment to do their job I would point out what they did have. It was a tough love approach, and sometimes it was sink or swim.", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-13 16:42:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard.", 
        "intTime": 20090313, 
        "postID": 4, 
        "quote": "", 
        "reply": "I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard.", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-13 17:22:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "threerings"
    }, 
    {
        "content": "My guess is he ahd tried all other avenues of approach, and nothing was working. This was probably a last gasp effort. May help, if it doesn't he's obviously no worse off.", 
        "intTime": 20090313, 
        "postID": 5, 
        "quote": "", 
        "reply": "My guess is he ahd tried all other avenues of approach, and nothing was working. This was probably a last gasp effort. May help, if it doesn't he's obviously no worse off.", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-13 17:30:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "billdawg24"
    }, 
    {
        "content": "I had one group of IA soldiers that had been working longer, harder, and better than most that I had trained previously. As a result towards the end of the day I gave them one of the soccer balls that I always kept in my truck. The next day they asked for another one, I asked what happened to the one I gave them the day before. I found out one of the officers had taken it from them for himself. It was a small thing but it was the principle of the matter not the value of a soccer ball. I went ballistic right there on the Iraqi Colonel that was their commanding officer and was over the thief Captain. I am sure I really offended the Colonel and the Captain (who I had already had several incidents with), but the soldiers got the ball back and the Colonel and the Captain were much easier to deal with afterwards. I am sure I sounded a lot like the video. After that incident that same group of IA soldiers just got better, they knew someone was looking out for them and they were the best group I had in my whole tour.", 
        "intTime": 20090313, 
        "postID": 6, 
        "quote": "", 
        "reply": "I had one group of IA soldiers that had been working longer, harder, and better than most that I had trained previously. As a result towards the end of the day I gave them one of the soccer balls that I always kept in my truck. The next day they asked for another one, I asked what happened to the one I gave them the day before. I found out one of the officers had taken it from them for himself. It was a small thing but it was the principle of the matter not the value of a soccer ball. I went ballistic right there on the Iraqi Colonel that was their commanding officer and was over the thief Captain. I am sure I really offended the Colonel and the Captain (who I had already had several incidents with), but the soldiers got the ball back and the Colonel and the Captain were much easier to deal with afterwards. I am sure I sounded a lot like the video. After that incident that same group of IA soldiers just got better, they knew someone was looking out for them and they were the best group I had in my whole tour.", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-13 17:43:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Just a good ole fashioned American motivational discussion.", 
        "intTime": 20090314, 
        "postID": 7, 
        "quote": "", 
        "reply": "Just a good ole fashioned American motivational discussion.", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-14 00:20:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "dhd123"
    }, 
    {
        "content": "quote: Originally posted by threerings: I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard. OH MY GAWD!!! You've Been Drinking! I can't beleieve this, but I half azz agree with you!", 
        "intTime": 20090314, 
        "postID": 8, 
        "quote": "Originally posted by threerings: I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard.", 
        "reply": " OH MY GAWD!!! You've Been Drinking! I can't beleieve this, but I half azz agree with you!", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-14 01:29:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by threerings: I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard. OH MY GAWD!!! You've Been Drinking! I can't beleieve this, but I half azz agree with you! I, like many people here, spent a lot of time dealing with Iraqis. My job meant that I dealth with the on a personal level daily. I dont like them. I dont like the culture. I dont beleive in nation building. We should have invaded Iraq. The moment we stopped looking for WMD and Sadam was in a body bag..we should have packed up and left.", 
        "intTime": 20090314, 
        "postID": 9, 
        "quote": "Originally posted by samh32: quote: Originally posted by threerings: I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard. OH MY GAWD!!! You've Been Drinking! I can't beleieve this, but I half azz agree with you!", 
        "reply": " I, like many people here, spent a lot of time dealing with Iraqis. My job meant that I dealth with the on a personal level daily. I dont like them. I dont like the culture. I dont beleive in nation building. We should have invaded Iraq. The moment we stopped looking for WMD and Sadam was in a body bag..we should have packed up and left.", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-14 04:10:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by threerings: I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard. OH MY GAWD!!! You've Been Drinking! I can't beleieve this, but I half azz agree with you! I, like many people here, spent a lot of time dealing with Iraqis. My job meant that I dealth with the on a personal level daily. I dont like them. I dont like the culture. I dont beleive in nation building. We should have invaded Iraq. The moment we stopped looking for WMD and Sadam was in a body bag..we should have packed up and left. There's a guy, a former intel Colonel turned columnist named Ralph Peters. He puts forward the fact that the one thing we need in our strategy \"toolbox\" that we don't have, is the option and political guts to just go \"F\" some people/countries up and leave without worrying how they will sort it out afterwards. He might be on to something. I think he calls it \"the big raid\".", 
        "intTime": 20090314, 
        "postID": 10, 
        "quote": "Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by threerings: I couldn't make out the rank, but that officer is my new hero. That said: His approach is counter productive. You cannot shame the Iraqis into being effective combat troops. You cannot shame them into having western ideas of honor and courage. You cannot shame them into standing up for their counrty. Its that simple. We can teach and equip them. But in the end the Iraqis will sink or swim because of their culture. Because of the things they as a culture beleive in..because of a collective work ethic, a common fundamental view of right and wrong...they will succeed of fail based on a common framework... Think about that..because the same shift is taking place here. We can embrace the things that made this nation great..or we can keep going down the same path we've been on for 35 years. We can stand up and say: THIS IS RIGHT. THIS IS WRONG. Or we can keep pretending that everything is equal..that whatever Billy wants to do is okay..or god dammit we start judging people and holding them to a standard. OH MY GAWD!!! You've Been Drinking! I can't beleieve this, but I half azz agree with you! I, like many people here, spent a lot of time dealing with Iraqis. My job meant that I dealth with the on a personal level daily. I dont like them. I dont like the culture. I dont beleive in nation building. We should have invaded Iraq. The moment we stopped looking for WMD and Sadam was in a body bag..we should have packed up and left.", 
        "reply": " There's a guy, a former intel Colonel turned columnist named Ralph Peters. He puts forward the fact that the one thing we need in our strategy \"toolbox\" that we don't have, is the option and political guts to just go \"F\" some people/countries up and leave without worrying how they will sort it out afterwards. He might be on to something. I think he calls it \"the big raid\".", 
        "threadID": "409192893_6320097712001", 
        "time": "2009-03-14 04:45:00", 
        "title": "American military officer trash-talking to a group of Iraqi police.", 
        "userID": "M1Lase_n_Blaze"
    }
]