[
    {
        "content": "and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "", 
        "reply": "and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:16:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there Let's turn them over to the Israeli Mosad.", 
        "intTime": 20090521, 
        "postID": 2, 
        "quote": "Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "reply": " Let's turn them over to the Israeli Mosad.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:18:00", 
        "title": "WATERBOARDING", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE????????????", 
        "intTime": 20090521, 
        "postID": 3, 
        "quote": "Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "reply": " Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE????????????", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:24:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get", 
        "intTime": 20090521, 
        "postID": 4, 
        "quote": "them to an actual prison", 
        "reply": " wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:48:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "intTime": 20090521, 
        "postID": 5, 
        "quote": "Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "reply": " I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:09:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE???????????? No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system.", 
        "intTime": 20090521, 
        "postID": 6, 
        "quote": "Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE????????????", 
        "reply": " No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:16:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it.", 
        "intTime": 20090521, 
        "postID": 7, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "reply": " Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:17:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE???????????? No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system. That was said in jest, it was a joke.", 
        "intTime": 20090521, 
        "postID": 8, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE???????????? No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system.", 
        "reply": " That was said in jest, it was a joke.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:18:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials...", 
        "intTime": 20090521, 
        "postID": 9, 
        "quote": "Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get", 
        "reply": " Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials...", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:23:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I went through POW training while in the 25th Inf station in Hawaii...I say one gets a taste of \"Harsh\" treatment. And I also think every Armed personnel should have to go through POW training regardless of their job. And by the way, the POW training is given to you by the way the enemy would have, not GITMO. Where its the Hotel Ritz....", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "", 
        "reply": "I went through POW training while in the 25th Inf station in Hawaii...I say one gets a taste of \"Harsh\" treatment. And I also think every Armed personnel should have to go through POW training regardless of their job. And by the way, the POW training is given to you by the way the enemy would have, not GITMO. Where its the Hotel Ritz....", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:29:00", 
        "title": "WATERBOARDING", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Volunteer for the military, take a high risk of capture job, and go to SERE. Believe it or not, I tried twice - first time I screwed up the paperwork and then got arrogant and ****y, took my ball and went home (I was a teenager, what can I say). By the second time I was disqualified for medical reasons. Hoping to try again in a few years if I can prove the medical is no longer an issue. quote: Originally posted by psychoABN: Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it. I only know of Harrigan, I assume that is to whom you are referring. I was unconvinced of his demonstration. He knew what was coming, by many accounts (from SERE grads) they took it easy on him, and he had everything to gain by showing how he was unharmed and gave up the info. For a real test, do it with several people, some pro-waterboarding (Beck, please!), some adamantly opposed. The opposed want to show its ineffectiveness, so have them secretly agree on (and record) a code word which the interrogators have to get them to reveal. Barring medical reasons, waterboarding stops when the interrogator thinks he has the word - then we see if they resisted. Set a 2-3 day limit. The pro-waterboarders want to show its not really torture, so tell them that to end it they have to do one of two things - outlast the opposed (which time they don't know) or else undergo something voluntary but more torturish. Maybe get branded, get something really uncomfortable pierced, or get \"I'm a little *****\" tattooed across their chest twice (once in reverse so they can read it in the mirror). If it really isn't torture, they should never say \"I prefer torture as the alternative\". Just an idea. This message has been edited. Last edited by: cosmicfish, Thu 21 May 2009 01:28 PM", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "Originally posted by psychoABN: Volunteer for the military, take a high risk of capture job, and go to SERE.", 
        "reply": " Believe it or not, I tried twice - first time I screwed up the paperwork and then got arrogant and ****y, took my ball and went home (I was a teenager, what can I say). By the second time I was disqualified for medical reasons. Hoping to try again in a few years if I can prove the medical is no longer an issue. quote: Originally posted by psychoABN: Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it. I only know of Harrigan, I assume that is to whom you are referring. I was unconvinced of his demonstration. He knew what was coming, by many accounts (from SERE grads) they took it easy on him, and he had everything to gain by showing how he was unharmed and gave up the info. For a real test, do it with several people, some pro-waterboarding (Beck, please!), some adamantly opposed. The opposed want to show its ineffectiveness, so have them secretly agree on (and record) a code word which the interrogators have to get them to reveal. Barring medical reasons, waterboarding stops when the interrogator thinks he has the word - then we see if they resisted. Set a 2-3 day limit. The pro-waterboarders want to show its not really torture, so tell them that to end it they have to do one of two things - outlast the opposed (which time they don't know) or else undergo something voluntary but more torturish. Maybe get branded, get something really uncomfortable pierced, or get \"I'm a little *****\" tattooed across their chest twice (once in reverse so they can read it in the mirror). If it really isn't torture, they should never say \"I prefer torture as the alternative\". Just an idea. This message has been edited. Last edited by: cosmicfish, Thu 21 May 2009 01:28 PM", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 13:08:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "reply": " We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 14:29:00", 
        "title": "WATERBOARDING", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "I wonder what an actual SERE training instructor has to say about waterboarding? Testimony before congress 2007: SR. CPO. MALCOLM NANCE (Ret.), Former Naval Instructor: Waterboarding is a terrifying, painful and humiliating tool that leaves no physical scars and which can be repeatedly used as an intimidation tool. Waterboarding has the ability to make the subject answer any question with a truth, a half-truth, or outright lie in order to stop the procedure. Contrary to popular opinion, it is not a simulation of drowning. It is drowning. - RAY SUAREZ: So your quarrel with calling it \"simulated drowning\" is that it is drowning, but it just isn't used to kill? MALCOLM NANCE: Well, it's controlled drowning. And if done wrong, by an unprofessional team or by an inexperienced team, you can kill that person quite easily. RAY SUAREZ: Does it work, Malcolm Nance? MALCOLM NANCE: No, I don't think it works at all. The problem with using procedures, if we're going to talk about waterboarding as opposed to many other variations of torture, the problem with using these tools is that you are applying duress and coercion to a subject, and that subject is going to want to make that stop, physiologically and mentally. And as they are trying to make it stop, they will come up with whatever you are asking. Maybe they'll agree with you or they will actually try to create some half-truth or a lie, in order to get you to stop the procedure. And waterboardings are relatively effective. We should clearly differentiate between the question of effectiveness and the question of extracting reliable intelligence information which is actionable. Those are two entirely different things. I can make anyone say anything I want, given a proper team and a proper amount of time on a waterboard, approximately a minute or two minutes. \"http://www.pbs.org/newshour/bb/law/july-dec07/waterboarding_11-08.html\" Mr Nance said US troops were trained to withstand waterboarding, watched by a doctor, a psychologist, an interrogator and a backup team. \"When performed with even moderate intensity over an extended time on an unsuspecting prisoner – it is torture, without doubt,\" he added. \"Most people cannot stand to watch a high-intensity, kinetic interrogation. One has to overcome basic human decency to endure watching or causing the effects. The brutality would force you into a personal moral dilemma between humanity and hatred. It would leave you to question the meaning of what it is to be an American.\" \"http://www.independent.co.uk/news/world/americas/waterboarding-is-torture--i-did-it-myself-says-us-advisor-398490.html\"", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "", 
        "reply": "I wonder what an actual SERE training instructor has to say about waterboarding? Testimony before congress 2007: SR. CPO. MALCOLM NANCE (Ret.), Former Naval Instructor: Waterboarding is a terrifying, painful and humiliating tool that leaves no physical scars and which can be repeatedly used as an intimidation tool. Waterboarding has the ability to make the subject answer any question with a truth, a half-truth, or outright lie in order to stop the procedure. Contrary to popular opinion, it is not a simulation of drowning. It is drowning. - RAY SUAREZ: So your quarrel with calling it \"simulated drowning\" is that it is drowning, but it just isn't used to kill? MALCOLM NANCE: Well, it's controlled drowning. And if done wrong, by an unprofessional team or by an inexperienced team, you can kill that person quite easily. RAY SUAREZ: Does it work, Malcolm Nance? MALCOLM NANCE: No, I don't think it works at all. The problem with using procedures, if we're going to talk about waterboarding as opposed to many other variations of torture, the problem with using these tools is that you are applying duress and coercion to a subject, and that subject is going to want to make that stop, physiologically and mentally. And as they are trying to make it stop, they will come up with whatever you are asking. Maybe they'll agree with you or they will actually try to create some half-truth or a lie, in order to get you to stop the procedure. And waterboardings are relatively effective. We should clearly differentiate between the question of effectiveness and the question of extracting reliable intelligence information which is actionable. Those are two entirely different things. I can make anyone say anything I want, given a proper team and a proper amount of time on a waterboard, approximately a minute or two minutes. \"http://www.pbs.org/newshour/bb/law/july-dec07/waterboarding_11-08.html\" Mr Nance said US troops were trained to withstand waterboarding, watched by a doctor, a psychologist, an interrogator and a backup team. \"When performed with even moderate intensity over an extended time on an unsuspecting prisoner – it is torture, without doubt,\" he added. \"Most people cannot stand to watch a high-intensity, kinetic interrogation. One has to overcome basic human decency to endure watching or causing the effects. The brutality would force you into a personal moral dilemma between humanity and hatred. It would leave you to question the meaning of what it is to be an American.\" \"http://www.independent.co.uk/news/world/americas/waterboarding-is-torture--i-did-it-myself-says-us-advisor-398490.html\"", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 14:40:00", 
        "title": "WATERBOARDING", 
        "userID": "Esample1"
    }, 
    {
        "content": "Waterboarding: A Punishable Offense In the war crimes tribunals that followed Japan's defeat in World War II, the issue of waterboarding was sometimes raised. In 1947, the U.S. charged a Japanese officer, Yukio Asano, with war crimes for waterboarding a U.S. civilian. Asano was sentenced to 15 years of hard labor. \"All of these trials elicited compelling descriptions of water torture from its victims, and resulted in severe punishment for its perpetrators,\" writes Evan Wallach in the Columbia Journal of Transnational Law. On Jan. 21, 1968, The Washington Post ran a front-page photo of a U.S. soldier supervising the waterboarding of a captured North Vietnamese soldier. The caption said the technique induced \"a flooding sense of suffocation and drowning, meant to make him talk.\" The picture led to an Army investigation and, two months later, the court martial of the soldier. Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison. \"http://www.npr.org/templates/story/story.php?storyId=15886834\"", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "", 
        "reply": "Waterboarding: A Punishable Offense In the war crimes tribunals that followed Japan's defeat in World War II, the issue of waterboarding was sometimes raised. In 1947, the U.S. charged a Japanese officer, Yukio Asano, with war crimes for waterboarding a U.S. civilian. Asano was sentenced to 15 years of hard labor. \"All of these trials elicited compelling descriptions of water torture from its victims, and resulted in severe punishment for its perpetrators,\" writes Evan Wallach in the Columbia Journal of Transnational Law. On Jan. 21, 1968, The Washington Post ran a front-page photo of a U.S. soldier supervising the waterboarding of a captured North Vietnamese soldier. The caption said the technique induced \"a flooding sense of suffocation and drowning, meant to make him talk.\" The picture led to an Army investigation and, two months later, the court martial of the soldier. Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison. \"http://www.npr.org/templates/story/story.php?storyId=15886834\"", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 14:46:00", 
        "title": "WATERBOARDING", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The Japanese methods were different than ours, and ended in death in about 50% or more of those getting the \"Water Cure\". Asano tortured a CIVILIAN who was not supposed to be touched at all. Further he beat him with hands, feet and cudgels, burned him with cigarettes etc.. Asano also stole Red Cross packages dent to prisoners. Often, in a Japanses prison camp, getting that R C Package or not was the difference between life and death. A version used by the Japanese of the WATER CURE was filling one's gut with as much water as it cound hold, then beating, even jumping on, the distended gut, sometimes killing. The alternate method called for pouring water down the throat and nose while inverted. Water would get in the lungs, and the person would very often drown. I was actuall drowning or near drowning, luck of the draw if you lived or died. This is not what was done to the THREE who subjected at GITMO. NO ONE died or was in danger of dying. As for the RVN incident, here's what happened: \"Waterboarding was designated as illegal by U.S. generals in the Vietnam War.[77] On January 21, 1968, The Washington Post published a controversial front-page photograph of two U.S soldiers and one South Vietnamese soldier participating in the waterboarding of a North Vietnamese POW near Da Nang.[78] The article described the practice as \"fairly common\".[78] The photograph led to the soldier being court-martialled by a U.S. military court within one month of its publication, and he was discharged from the army.[77][79] Another waterboarding photograph of the same scene, referred to as \"water torture\" in the caption, is also exhibited in the War Remnants Museum in Ho Chi Minh City.[80]\" above From Wiki WOW, discharged from the Army! No more RVN, back in \"the World\", out of the military, why, what a TERRABLE punishment that was in 1968-9 for a grunt! Not. As for the Sheriff, if he'd GOTTEN the same confession with a CATTLE PROD, he'd have been jailed too, something about the Fifth Amendment and getting any confessions thru force. Letting another attack on the Nation take place killing our citizens and our guests when the information necessary to save them is available within sixty seconds does not give you the high moral ground. Just in case you forgot: \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk That showes torture.", 
        "intTime": 20090521, 
        "postID": 15, 
        "quote": "", 
        "reply": "The Japanese methods were different than ours, and ended in death in about 50% or more of those getting the \"Water Cure\". Asano tortured a CIVILIAN who was not supposed to be touched at all. Further he beat him with hands, feet and cudgels, burned him with cigarettes etc.. Asano also stole Red Cross packages dent to prisoners. Often, in a Japanses prison camp, getting that R C Package or not was the difference between life and death. A version used by the Japanese of the WATER CURE was filling one's gut with as much water as it cound hold, then beating, even jumping on, the distended gut, sometimes killing. The alternate method called for pouring water down the throat and nose while inverted. Water would get in the lungs, and the person would very often drown. I was actuall drowning or near drowning, luck of the draw if you lived or died. This is not what was done to the THREE who subjected at GITMO. NO ONE died or was in danger of dying. As for the RVN incident, here's what happened: \"Waterboarding was designated as illegal by U.S. generals in the Vietnam War.[77] On January 21, 1968, The Washington Post published a controversial front-page photograph of two U.S soldiers and one South Vietnamese soldier participating in the waterboarding of a North Vietnamese POW near Da Nang.[78] The article described the practice as \"fairly common\".[78] The photograph led to the soldier being court-martialled by a U.S. military court within one month of its publication, and he was discharged from the army.[77][79] Another waterboarding photograph of the same scene, referred to as \"water torture\" in the caption, is also exhibited in the War Remnants Museum in Ho Chi Minh City.[80]\" above From Wiki WOW, discharged from the Army! No more RVN, back in \"the World\", out of the military, why, what a TERRABLE punishment that was in 1968-9 for a grunt! Not. As for the Sheriff, if he'd GOTTEN the same confession with a CATTLE PROD, he'd have been jailed too, something about the Fifth Amendment and getting any confessions thru force. Letting another attack on the Nation take place killing our citizens and our guests when the information necessary to save them is available within sixty seconds does not give you the high moral ground. Just in case you forgot: \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk That showes torture.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 17:39:00", 
        "title": "WATERBOARDING", 
        "userID": "peter3_1"
    }, 
    {
        "content": "The point is that it is illegal, P-E-R-I-O-D.", 
        "intTime": 20090521, 
        "postID": 16, 
        "quote": "", 
        "reply": "The point is that it is illegal, P-E-R-I-O-D.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 19:01:00", 
        "title": "WATERBOARDING", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D. And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "intTime": 20090521, 
        "postID": 17, 
        "quote": "Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D.", 
        "reply": " And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 19:08:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989 Why wouldn't they let you put it on Youtube? There are lots of waterboard videos already on there.", 
        "intTime": 20090521, 
        "postID": 18, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "reply": " Why wouldn't they let you put it on Youtube? There are lots of waterboard videos already on there.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 19:09:00", 
        "title": "WATERBOARDING", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D. And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years. Provide proof. Torture is ineffective as an interrogation technique, but it IS effective in getting people to confess to what you want them to...like denouncing their Judaism, confessing to witchcraft, or providing a link to Al Qaeda and Iraq (although none existed) There simply is no debate if it is effective or not...it is illegal. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology.~ President Barack Obama", 
        "intTime": 20090522, 
        "postID": 19, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D. And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "reply": " Provide proof. Torture is ineffective as an interrogation technique, but it IS effective in getting people to confess to what you want them to...like denouncing their Judaism, confessing to witchcraft, or providing a link to Al Qaeda and Iraq (although none existed) There simply is no debate if it is effective or not...it is illegal. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology.~ President Barack Obama", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 04:47:00", 
        "title": "WATERBOARDING", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years. Our nation stayed safe because of the hard work and dedication from many patriotic young men and women from around our nation, not because of torture. There is zero evidence to prove Cheney's argument. ZERO. He is an bitter old man that need to retire to the bitter old mans home. He should follow his leader and keep his yapper shut.", 
        "intTime": 20090522, 
        "postID": 20, 
        "quote": "And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "reply": " Our nation stayed safe because of the hard work and dedication from many patriotic young men and women from around our nation, not because of torture. There is zero evidence to prove Cheney's argument. ZERO. He is an bitter old man that need to retire to the bitter old mans home. He should follow his leader and keep his yapper shut.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 04:59:00", 
        "title": "WATERBOARDING", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: they do cling to guns and religion. ?? why this crack??", 
        "intTime": 20090522, 
        "postID": 21, 
        "quote": "they do cling to guns and religion.", 
        "reply": " ?? why this crack??", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 05:01:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: they do cling to guns and religion. ?? why this crack?? Because the areas you seemed to be mocking for being rural (in my experience) have higher gun-to-person and churchgoer-to-person ratios than typical in the US. I was also intending it as a jab at El Presidente (and supporters) for oversimplifying a whole class of people. See, as a moderate, I find the crack funny for what it says about both groups.", 
        "intTime": 20090522, 
        "postID": 22, 
        "quote": "Originally posted by Ira1945: quote: they do cling to guns and religion. ?? why this crack??", 
        "reply": " Because the areas you seemed to be mocking for being rural (in my experience) have higher gun-to-person and churchgoer-to-person ratios than typical in the US. I was also intending it as a jab at El Presidente (and supporters) for oversimplifying a whole class of people. See, as a moderate, I find the crack funny for what it says about both groups.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 10:04:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it. Still not even CLOSE to the same since the person under going SERE training KNOWS that 1) it is training, 2) the people doing the training would get in MAJOR truble if anyone is hurt, 3) they know how long it will last, 4) and they have control. They CAN stop it any time they want.", 
        "intTime": 20090522, 
        "postID": 23, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it.", 
        "reply": " Still not even CLOSE to the same since the person under going SERE training KNOWS that 1) it is training, 2) the people doing the training would get in MAJOR truble if anyone is hurt, 3) they know how long it will last, 4) and they have control. They CAN stop it any time they want.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 10:14:00", 
        "title": "WATERBOARDING", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials... Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest.", 
        "intTime": 20090522, 
        "postID": 24, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials...", 
        "reply": " Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 10:24:00", 
        "title": "WATERBOARDING", 
        "userID": "rayld2"
    }, 
    {
        "content": "Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator...", 
        "intTime": 20090522, 
        "postID": 25, 
        "quote": "", 
        "reply": "Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator...", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 11:34:00", 
        "title": "WATERBOARDING", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials... Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest. Yet Donald Trump disregarded the rules and forgave all...because she may be an airhead, but she's hot.", 
        "intTime": 20090522, 
        "postID": 26, 
        "quote": "Originally posted by rayld2: quote: Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials... Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest.", 
        "reply": " Yet Donald Trump disregarded the rules and forgave all...because she may be an airhead, but she's hot.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 15:47:00", 
        "title": "WATERBOARDING", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods", 
        "intTime": 20090523, 
        "postID": 27, 
        "quote": "Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator...", 
        "reply": " Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 04:16:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash.", 
        "intTime": 20090523, 
        "postID": 28, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods", 
        "reply": " Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 05:03:00", 
        "title": "WATERBOARDING", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash. Me, I never took any prisoners, not to say that was intentional, i just did not see many live NVA or VC, nor was i really inclined to do so. we did take one gent early during Khe Sahn, he had one of the surrender leaflets that were dropped by the ton. It seems he carried RPG rockets all the way from some dump near hanoi and when he got to the place he was to deliver the officer in charge told him \"good job, go back and get more\" he said nuts to that. also on a similar note the local Marines that i have talked to have changed the ROE, due to the crap that has happened thru the media about wounded iraqis and unfortunate incidents they just will not take any alive. it is sort of a no quarter given or asked. but it is what it is but like i said, i was just a grunt, carried a rifle, made no decisions other than a sgt pay grade, but did not take prisoners, no, i will not say i killed anyone rather than take them in, but was not inclined to even see if they were alive, just made sure they were dead. dead ones can not hurt you", 
        "intTime": 20090523, 
        "postID": 29, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash.", 
        "reply": " Me, I never took any prisoners, not to say that was intentional, i just did not see many live NVA or VC, nor was i really inclined to do so. we did take one gent early during Khe Sahn, he had one of the surrender leaflets that were dropped by the ton. It seems he carried RPG rockets all the way from some dump near hanoi and when he got to the place he was to deliver the officer in charge told him \"good job, go back and get more\" he said nuts to that. also on a similar note the local Marines that i have talked to have changed the ROE, due to the crap that has happened thru the media about wounded iraqis and unfortunate incidents they just will not take any alive. it is sort of a no quarter given or asked. but it is what it is but like i said, i was just a grunt, carried a rifle, made no decisions other than a sgt pay grade, but did not take prisoners, no, i will not say i killed anyone rather than take them in, but was not inclined to even see if they were alive, just made sure they were dead. dead ones can not hurt you", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 06:06:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I recall that as a freshman in college, I failed to write the dormitory newsletter timely. Some upper classmen grabbed me from behind, threw me into the trunk of a car, drove me a mile or two outside of town, and dumped me into a pond with good layer of ice on it. Banged up a bit, yes. Shivering and shrivelling, yes. The practice was somewhat risky, yes. But by the standards expressed by leftists who contrive righteous indignation, what occurred then was probably \"torture\" in its physical sense (acknowledging that the purposes were somewhat different). Later, in military training we were imprisoned a while and harassed--hosed, compelled to kneel for extended periods during fake interrogation, listen to loud non-music (jackass polyticks would likely call it torture). This crap is overblown for polytickle purposes, plain and simple. Americans with their heads screwed on straight know this whole pile of pelosi is overblown.", 
        "intTime": 20090523, 
        "postID": 30, 
        "quote": "", 
        "reply": "I recall that as a freshman in college, I failed to write the dormitory newsletter timely. Some upper classmen grabbed me from behind, threw me into the trunk of a car, drove me a mile or two outside of town, and dumped me into a pond with good layer of ice on it. Banged up a bit, yes. Shivering and shrivelling, yes. The practice was somewhat risky, yes. But by the standards expressed by leftists who contrive righteous indignation, what occurred then was probably \"torture\" in its physical sense (acknowledging that the purposes were somewhat different). Later, in military training we were imprisoned a while and harassed--hosed, compelled to kneel for extended periods during fake interrogation, listen to loud non-music (jackass polyticks would likely call it torture). This crap is overblown for polytickle purposes, plain and simple. Americans with their heads screwed on straight know this whole pile of pelosi is overblown.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 11:19:00", 
        "title": "WATERBOARDING", 
        "userID": "RRR52"
    }, 
    {
        "content": "and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "", 
        "reply": "and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:16:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there Let's turn them over to the Israeli Mosad.", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "reply": " Let's turn them over to the Israeli Mosad.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:18:00", 
        "title": "WATERBOARDING", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE????????????", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "reply": " Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE????????????", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:24:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "them to an actual prison", 
        "reply": " wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 11:48:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "intTime": 20090521, 
        "postID": 35, 
        "quote": "Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there", 
        "reply": " I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:09:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE???????????? No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system.", 
        "intTime": 20090521, 
        "postID": 36, 
        "quote": "Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE????????????", 
        "reply": " No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:16:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it.", 
        "intTime": 20090521, 
        "postID": 37, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "reply": " Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:17:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE???????????? No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system. That was said in jest, it was a joke.", 
        "intTime": 20090521, 
        "postID": 38, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by psychoABN: Wouldn't taking them from the tropical setting that they're now in, with the recreation activities, religious allowances, and other perks, and moving them to an actual prison be considered.....TORTURE???????????? No. The Supermax has basketball courts. Islam is practiced in most prisons, and religious observances in general are rigorously protected. While some things may be easier in Gitmo, only completely uncontrollable US convicts are subject to consistently worse conditions, and there are sharper limits on what can be done to the uncontrollable. All in all I think most of the inmates would be grateful if they were transfered. Disclosure: I have never worked with prisoners. I am basing this on conversations with my sister, who for 5 years worked with violent offenders (10+ year sentences) in the Texas correctional system.", 
        "reply": " That was said in jest, it was a joke.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:18:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials...", 
        "intTime": 20090521, 
        "postID": 39, 
        "quote": "Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get", 
        "reply": " Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials...", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:23:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I went through POW training while in the 25th Inf station in Hawaii...I say one gets a taste of \"Harsh\" treatment. And I also think every Armed personnel should have to go through POW training regardless of their job. And by the way, the POW training is given to you by the way the enemy would have, not GITMO. Where its the Hotel Ritz....", 
        "intTime": 20090521, 
        "postID": 40, 
        "quote": "", 
        "reply": "I went through POW training while in the 25th Inf station in Hawaii...I say one gets a taste of \"Harsh\" treatment. And I also think every Armed personnel should have to go through POW training regardless of their job. And by the way, the POW training is given to you by the way the enemy would have, not GITMO. Where its the Hotel Ritz....", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 12:29:00", 
        "title": "WATERBOARDING", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Volunteer for the military, take a high risk of capture job, and go to SERE. Believe it or not, I tried twice - first time I screwed up the paperwork and then got arrogant and ****y, took my ball and went home (I was a teenager, what can I say). By the second time I was disqualified for medical reasons. Hoping to try again in a few years if I can prove the medical is no longer an issue. quote: Originally posted by psychoABN: Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it. I only know of Harrigan, I assume that is to whom you are referring. I was unconvinced of his demonstration. He knew what was coming, by many accounts (from SERE grads) they took it easy on him, and he had everything to gain by showing how he was unharmed and gave up the info. For a real test, do it with several people, some pro-waterboarding (Beck, please!), some adamantly opposed. The opposed want to show its ineffectiveness, so have them secretly agree on (and record) a code word which the interrogators have to get them to reveal. Barring medical reasons, waterboarding stops when the interrogator thinks he has the word - then we see if they resisted. Set a 2-3 day limit. The pro-waterboarders want to show its not really torture, so tell them that to end it they have to do one of two things - outlast the opposed (which time they don't know) or else undergo something voluntary but more torturish. Maybe get branded, get something really uncomfortable pierced, or get \"I'm a little *****\" tattooed across their chest twice (once in reverse so they can read it in the mirror). If it really isn't torture, they should never say \"I prefer torture as the alternative\". Just an idea. This message has been edited. Last edited by: cosmicfish, Thu 21 May 2009 01:28 PM", 
        "intTime": 20090521, 
        "postID": 41, 
        "quote": "Originally posted by psychoABN: Volunteer for the military, take a high risk of capture job, and go to SERE.", 
        "reply": " Believe it or not, I tried twice - first time I screwed up the paperwork and then got arrogant and ****y, took my ball and went home (I was a teenager, what can I say). By the second time I was disqualified for medical reasons. Hoping to try again in a few years if I can prove the medical is no longer an issue. quote: Originally posted by psychoABN: Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it. I only know of Harrigan, I assume that is to whom you are referring. I was unconvinced of his demonstration. He knew what was coming, by many accounts (from SERE grads) they took it easy on him, and he had everything to gain by showing how he was unharmed and gave up the info. For a real test, do it with several people, some pro-waterboarding (Beck, please!), some adamantly opposed. The opposed want to show its ineffectiveness, so have them secretly agree on (and record) a code word which the interrogators have to get them to reveal. Barring medical reasons, waterboarding stops when the interrogator thinks he has the word - then we see if they resisted. Set a 2-3 day limit. The pro-waterboarders want to show its not really torture, so tell them that to end it they have to do one of two things - outlast the opposed (which time they don't know) or else undergo something voluntary but more torturish. Maybe get branded, get something really uncomfortable pierced, or get \"I'm a little *****\" tattooed across their chest twice (once in reverse so they can read it in the mirror). If it really isn't torture, they should never say \"I prefer torture as the alternative\". Just an idea. This message has been edited. Last edited by: cosmicfish, Thu 21 May 2009 01:28 PM", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 13:08:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "intTime": 20090521, 
        "postID": 42, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion.", 
        "reply": " We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 14:29:00", 
        "title": "WATERBOARDING", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "I wonder what an actual SERE training instructor has to say about waterboarding? Testimony before congress 2007: SR. CPO. MALCOLM NANCE (Ret.), Former Naval Instructor: Waterboarding is a terrifying, painful and humiliating tool that leaves no physical scars and which can be repeatedly used as an intimidation tool. Waterboarding has the ability to make the subject answer any question with a truth, a half-truth, or outright lie in order to stop the procedure. Contrary to popular opinion, it is not a simulation of drowning. It is drowning. - RAY SUAREZ: So your quarrel with calling it \"simulated drowning\" is that it is drowning, but it just isn't used to kill? MALCOLM NANCE: Well, it's controlled drowning. And if done wrong, by an unprofessional team or by an inexperienced team, you can kill that person quite easily. RAY SUAREZ: Does it work, Malcolm Nance? MALCOLM NANCE: No, I don't think it works at all. The problem with using procedures, if we're going to talk about waterboarding as opposed to many other variations of torture, the problem with using these tools is that you are applying duress and coercion to a subject, and that subject is going to want to make that stop, physiologically and mentally. And as they are trying to make it stop, they will come up with whatever you are asking. Maybe they'll agree with you or they will actually try to create some half-truth or a lie, in order to get you to stop the procedure. And waterboardings are relatively effective. We should clearly differentiate between the question of effectiveness and the question of extracting reliable intelligence information which is actionable. Those are two entirely different things. I can make anyone say anything I want, given a proper team and a proper amount of time on a waterboard, approximately a minute or two minutes. \"http://www.pbs.org/newshour/bb/law/july-dec07/waterboarding_11-08.html\" Mr Nance said US troops were trained to withstand waterboarding, watched by a doctor, a psychologist, an interrogator and a backup team. \"When performed with even moderate intensity over an extended time on an unsuspecting prisoner – it is torture, without doubt,\" he added. \"Most people cannot stand to watch a high-intensity, kinetic interrogation. One has to overcome basic human decency to endure watching or causing the effects. The brutality would force you into a personal moral dilemma between humanity and hatred. It would leave you to question the meaning of what it is to be an American.\" \"http://www.independent.co.uk/news/world/americas/waterboarding-is-torture--i-did-it-myself-says-us-advisor-398490.html\"", 
        "intTime": 20090521, 
        "postID": 43, 
        "quote": "", 
        "reply": "I wonder what an actual SERE training instructor has to say about waterboarding? Testimony before congress 2007: SR. CPO. MALCOLM NANCE (Ret.), Former Naval Instructor: Waterboarding is a terrifying, painful and humiliating tool that leaves no physical scars and which can be repeatedly used as an intimidation tool. Waterboarding has the ability to make the subject answer any question with a truth, a half-truth, or outright lie in order to stop the procedure. Contrary to popular opinion, it is not a simulation of drowning. It is drowning. - RAY SUAREZ: So your quarrel with calling it \"simulated drowning\" is that it is drowning, but it just isn't used to kill? MALCOLM NANCE: Well, it's controlled drowning. And if done wrong, by an unprofessional team or by an inexperienced team, you can kill that person quite easily. RAY SUAREZ: Does it work, Malcolm Nance? MALCOLM NANCE: No, I don't think it works at all. The problem with using procedures, if we're going to talk about waterboarding as opposed to many other variations of torture, the problem with using these tools is that you are applying duress and coercion to a subject, and that subject is going to want to make that stop, physiologically and mentally. And as they are trying to make it stop, they will come up with whatever you are asking. Maybe they'll agree with you or they will actually try to create some half-truth or a lie, in order to get you to stop the procedure. And waterboardings are relatively effective. We should clearly differentiate between the question of effectiveness and the question of extracting reliable intelligence information which is actionable. Those are two entirely different things. I can make anyone say anything I want, given a proper team and a proper amount of time on a waterboard, approximately a minute or two minutes. \"http://www.pbs.org/newshour/bb/law/july-dec07/waterboarding_11-08.html\" Mr Nance said US troops were trained to withstand waterboarding, watched by a doctor, a psychologist, an interrogator and a backup team. \"When performed with even moderate intensity over an extended time on an unsuspecting prisoner – it is torture, without doubt,\" he added. \"Most people cannot stand to watch a high-intensity, kinetic interrogation. One has to overcome basic human decency to endure watching or causing the effects. The brutality would force you into a personal moral dilemma between humanity and hatred. It would leave you to question the meaning of what it is to be an American.\" \"http://www.independent.co.uk/news/world/americas/waterboarding-is-torture--i-did-it-myself-says-us-advisor-398490.html\"", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 14:40:00", 
        "title": "WATERBOARDING", 
        "userID": "Esample1"
    }, 
    {
        "content": "Waterboarding: A Punishable Offense In the war crimes tribunals that followed Japan's defeat in World War II, the issue of waterboarding was sometimes raised. In 1947, the U.S. charged a Japanese officer, Yukio Asano, with war crimes for waterboarding a U.S. civilian. Asano was sentenced to 15 years of hard labor. \"All of these trials elicited compelling descriptions of water torture from its victims, and resulted in severe punishment for its perpetrators,\" writes Evan Wallach in the Columbia Journal of Transnational Law. On Jan. 21, 1968, The Washington Post ran a front-page photo of a U.S. soldier supervising the waterboarding of a captured North Vietnamese soldier. The caption said the technique induced \"a flooding sense of suffocation and drowning, meant to make him talk.\" The picture led to an Army investigation and, two months later, the court martial of the soldier. Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison. \"http://www.npr.org/templates/story/story.php?storyId=15886834\"", 
        "intTime": 20090521, 
        "postID": 44, 
        "quote": "", 
        "reply": "Waterboarding: A Punishable Offense In the war crimes tribunals that followed Japan's defeat in World War II, the issue of waterboarding was sometimes raised. In 1947, the U.S. charged a Japanese officer, Yukio Asano, with war crimes for waterboarding a U.S. civilian. Asano was sentenced to 15 years of hard labor. \"All of these trials elicited compelling descriptions of water torture from its victims, and resulted in severe punishment for its perpetrators,\" writes Evan Wallach in the Columbia Journal of Transnational Law. On Jan. 21, 1968, The Washington Post ran a front-page photo of a U.S. soldier supervising the waterboarding of a captured North Vietnamese soldier. The caption said the technique induced \"a flooding sense of suffocation and drowning, meant to make him talk.\" The picture led to an Army investigation and, two months later, the court martial of the soldier. Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison. \"http://www.npr.org/templates/story/story.php?storyId=15886834\"", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 14:46:00", 
        "title": "WATERBOARDING", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The Japanese methods were different than ours, and ended in death in about 50% or more of those getting the \"Water Cure\". Asano tortured a CIVILIAN who was not supposed to be touched at all. Further he beat him with hands, feet and cudgels, burned him with cigarettes etc.. Asano also stole Red Cross packages dent to prisoners. Often, in a Japanses prison camp, getting that R C Package or not was the difference between life and death. A version used by the Japanese of the WATER CURE was filling one's gut with as much water as it cound hold, then beating, even jumping on, the distended gut, sometimes killing. The alternate method called for pouring water down the throat and nose while inverted. Water would get in the lungs, and the person would very often drown. I was actuall drowning or near drowning, luck of the draw if you lived or died. This is not what was done to the THREE who subjected at GITMO. NO ONE died or was in danger of dying. As for the RVN incident, here's what happened: \"Waterboarding was designated as illegal by U.S. generals in the Vietnam War.[77] On January 21, 1968, The Washington Post published a controversial front-page photograph of two U.S soldiers and one South Vietnamese soldier participating in the waterboarding of a North Vietnamese POW near Da Nang.[78] The article described the practice as \"fairly common\".[78] The photograph led to the soldier being court-martialled by a U.S. military court within one month of its publication, and he was discharged from the army.[77][79] Another waterboarding photograph of the same scene, referred to as \"water torture\" in the caption, is also exhibited in the War Remnants Museum in Ho Chi Minh City.[80]\" above From Wiki WOW, discharged from the Army! No more RVN, back in \"the World\", out of the military, why, what a TERRABLE punishment that was in 1968-9 for a grunt! Not. As for the Sheriff, if he'd GOTTEN the same confession with a CATTLE PROD, he'd have been jailed too, something about the Fifth Amendment and getting any confessions thru force. Letting another attack on the Nation take place killing our citizens and our guests when the information necessary to save them is available within sixty seconds does not give you the high moral ground. Just in case you forgot: \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk That showes torture.", 
        "intTime": 20090521, 
        "postID": 45, 
        "quote": "", 
        "reply": "The Japanese methods were different than ours, and ended in death in about 50% or more of those getting the \"Water Cure\". Asano tortured a CIVILIAN who was not supposed to be touched at all. Further he beat him with hands, feet and cudgels, burned him with cigarettes etc.. Asano also stole Red Cross packages dent to prisoners. Often, in a Japanses prison camp, getting that R C Package or not was the difference between life and death. A version used by the Japanese of the WATER CURE was filling one's gut with as much water as it cound hold, then beating, even jumping on, the distended gut, sometimes killing. The alternate method called for pouring water down the throat and nose while inverted. Water would get in the lungs, and the person would very often drown. I was actuall drowning or near drowning, luck of the draw if you lived or died. This is not what was done to the THREE who subjected at GITMO. NO ONE died or was in danger of dying. As for the RVN incident, here's what happened: \"Waterboarding was designated as illegal by U.S. generals in the Vietnam War.[77] On January 21, 1968, The Washington Post published a controversial front-page photograph of two U.S soldiers and one South Vietnamese soldier participating in the waterboarding of a North Vietnamese POW near Da Nang.[78] The article described the practice as \"fairly common\".[78] The photograph led to the soldier being court-martialled by a U.S. military court within one month of its publication, and he was discharged from the army.[77][79] Another waterboarding photograph of the same scene, referred to as \"water torture\" in the caption, is also exhibited in the War Remnants Museum in Ho Chi Minh City.[80]\" above From Wiki WOW, discharged from the Army! No more RVN, back in \"the World\", out of the military, why, what a TERRABLE punishment that was in 1968-9 for a grunt! Not. As for the Sheriff, if he'd GOTTEN the same confession with a CATTLE PROD, he'd have been jailed too, something about the Fifth Amendment and getting any confessions thru force. Letting another attack on the Nation take place killing our citizens and our guests when the information necessary to save them is available within sixty seconds does not give you the high moral ground. Just in case you forgot: \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk That showes torture.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 17:39:00", 
        "title": "WATERBOARDING", 
        "userID": "peter3_1"
    }, 
    {
        "content": "The point is that it is illegal, P-E-R-I-O-D.", 
        "intTime": 20090521, 
        "postID": 46, 
        "quote": "", 
        "reply": "The point is that it is illegal, P-E-R-I-O-D.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 19:01:00", 
        "title": "WATERBOARDING", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D. And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "intTime": 20090521, 
        "postID": 47, 
        "quote": "Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D.", 
        "reply": " And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 19:08:00", 
        "title": "WATERBOARDING", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989 Why wouldn't they let you put it on Youtube? There are lots of waterboard videos already on there.", 
        "intTime": 20090521, 
        "postID": 48, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. We held free waterboarding at my Derby Day Party at my house on Maui...(I lasted over a minute) Youtube wouldn't let us post the video (we tried) This whole thing about waterboarding being torture is a crock.....Now granted, the people doing the waterboarding at my bash were chicks in bikinis, but aside from that it was done as demonstrated on the news...Unpleasant, but by no means torture.... Those pieces of human garbage at Gitmo (where they'll stay, by the way. Because they BELONG there) just better thank Allah that I'm not in charge, I'd make them a HELL of alot more uncomfortable.... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "reply": " Why wouldn't they let you put it on Youtube? There are lots of waterboard videos already on there.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-21 19:09:00", 
        "title": "WATERBOARDING", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D. And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years. Provide proof. Torture is ineffective as an interrogation technique, but it IS effective in getting people to confess to what you want them to...like denouncing their Judaism, confessing to witchcraft, or providing a link to Al Qaeda and Iraq (although none existed) There simply is no debate if it is effective or not...it is illegal. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology.~ President Barack Obama", 
        "intTime": 20090522, 
        "postID": 49, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by SeaWitch1220: The point is that it is illegal, P-E-R-I-O-D. And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "reply": " Provide proof. Torture is ineffective as an interrogation technique, but it IS effective in getting people to confess to what you want them to...like denouncing their Judaism, confessing to witchcraft, or providing a link to Al Qaeda and Iraq (although none existed) There simply is no debate if it is effective or not...it is illegal. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology.~ President Barack Obama", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 04:47:00", 
        "title": "WATERBOARDING", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years. Our nation stayed safe because of the hard work and dedication from many patriotic young men and women from around our nation, not because of torture. There is zero evidence to prove Cheney's argument. ZERO. He is an bitter old man that need to retire to the bitter old mans home. He should follow his leader and keep his yapper shut.", 
        "intTime": 20090522, 
        "postID": 50, 
        "quote": "And.....it didn't do a thing to prevent all of those terrorist attacks on US soil that took place over the last eight years.", 
        "reply": " Our nation stayed safe because of the hard work and dedication from many patriotic young men and women from around our nation, not because of torture. There is zero evidence to prove Cheney's argument. ZERO. He is an bitter old man that need to retire to the bitter old mans home. He should follow his leader and keep his yapper shut.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 04:59:00", 
        "title": "WATERBOARDING", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: they do cling to guns and religion. ?? why this crack??", 
        "intTime": 20090522, 
        "postID": 51, 
        "quote": "they do cling to guns and religion.", 
        "reply": " ?? why this crack??", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 05:01:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: they do cling to guns and religion. ?? why this crack?? Because the areas you seemed to be mocking for being rural (in my experience) have higher gun-to-person and churchgoer-to-person ratios than typical in the US. I was also intending it as a jab at El Presidente (and supporters) for oversimplifying a whole class of people. See, as a moderate, I find the crack funny for what it says about both groups.", 
        "intTime": 20090522, 
        "postID": 52, 
        "quote": "Originally posted by Ira1945: quote: they do cling to guns and religion. ?? why this crack??", 
        "reply": " Because the areas you seemed to be mocking for being rural (in my experience) have higher gun-to-person and churchgoer-to-person ratios than typical in the US. I was also intending it as a jab at El Presidente (and supporters) for oversimplifying a whole class of people. See, as a moderate, I find the crack funny for what it says about both groups.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 10:04:00", 
        "title": "WATERBOARDING", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it. Still not even CLOSE to the same since the person under going SERE training KNOWS that 1) it is training, 2) the people doing the training would get in MAJOR truble if anyone is hurt, 3) they know how long it will last, 4) and they have control. They CAN stop it any time they want.", 
        "intTime": 20090522, 
        "postID": 53, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by cosmicfish: quote: Originally posted by Ira1945: and other enhanced interrogation techniques. Just how many have been waterboarded, or had to listen to music they did not like, lost sleep, got hot because air conditioning not working or turned off. wonder how these folks at gitmo would like prison food, such as served in arizona by the good sherriff feeds his quests?? can you imagine the culture shock if they go from gitmo to a prison lockup where they are shut down for 23 hours a day. maybe they should all go to congressman murthas state, that way his airport can actaully have more than three flights a day land there I have never been waterboarded, nor subjected to the other techniques as punishment. But I also do not see many people volunteering to undergo this course to demonstrate that it is not torture. Have you? Has anybody stepped up and said \"to show what ******* they are, and to prove that this is torture, I will be subjected this course of interrogation!\" As long as their food is nutritionally sound (as required by law) and religiously appropriate (i.e. no pork), I have no objection to finding them cheapest food prepared by the worst cook. The 23-hour a day lockdown you refer to is very rare in prisons, because it breeds restlessness and foments rebellion. Even at max-security most inmates get time to exercise and get out of their cell. They also get access to books and some degree of entertainment facilities. Even the death-row guys get that, and not just to be nice - it helps to maintain order and sanity among the prisoners, and provides a simple method of discipline when those activities are curtailed. As an recent Pennsylvanian and current Marylander, I would have no objections to either state taking the prisoners. And while Murtha does mostly represent rural communities, I think that yours was an unfair statement - there are some good people in his district, even if they do cling to guns and religion. Volunteer for the military, take a high risk of capture job, and go to SERE. You'll get waterboarded. Thousands and thousands of our troops have been waterboarded, and guess what, they live happy, successful lives. Even a few FOX NEWS reporters have been waterboarded, they volunteered to do it.", 
        "reply": " Still not even CLOSE to the same since the person under going SERE training KNOWS that 1) it is training, 2) the people doing the training would get in MAJOR truble if anyone is hurt, 3) they know how long it will last, 4) and they have control. They CAN stop it any time they want.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 10:14:00", 
        "title": "WATERBOARDING", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials... Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest.", 
        "intTime": 20090522, 
        "postID": 54, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials...", 
        "reply": " Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 10:24:00", 
        "title": "WATERBOARDING", 
        "userID": "rayld2"
    }, 
    {
        "content": "Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator...", 
        "intTime": 20090522, 
        "postID": 55, 
        "quote": "", 
        "reply": "Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator...", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 11:34:00", 
        "title": "WATERBOARDING", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials... Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest. Yet Donald Trump disregarded the rules and forgave all...because she may be an airhead, but she's hot.", 
        "intTime": 20090522, 
        "postID": 56, 
        "quote": "Originally posted by rayld2: quote: Originally posted by psychoABN: quote: Originally posted by Ira1945: quote: them to an actual prison wait til they meet 6'8\"DuWayne in \"D\" block, he can really show them the ropes in the shower and it is being reported quite common that the food that the detainees receive is better chow than the grunts on the wall get Miss Universe said that she had a WONDERFUL time when she visited GITMO. She also mentioned how nice it was there....then her blog was scrubbed by the organization officials... Her CONTRACT states she is NOT allowed to use her position for ANY activity not approved IN ADVANCE by the organization officials. This type of thing is what actually got Miss California in trouble NOT as the media and the blogosphere claimed being antigay. Miss California vilotated her LEGAL contract in at least two ways that I've heard about: 1) She attended several policital rallies as Miss California without getting permission. 2) It became known that she had posed for partially nude (lingerie) photos and had not told the officials, ie. she lied to get into the contest.", 
        "reply": " Yet Donald Trump disregarded the rules and forgave all...because she may be an airhead, but she's hot.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-22 15:47:00", 
        "title": "WATERBOARDING", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods", 
        "intTime": 20090523, 
        "postID": 57, 
        "quote": "Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator...", 
        "reply": " Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 04:16:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash.", 
        "intTime": 20090523, 
        "postID": 58, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods", 
        "reply": " Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 05:03:00", 
        "title": "WATERBOARDING", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash. Me, I never took any prisoners, not to say that was intentional, i just did not see many live NVA or VC, nor was i really inclined to do so. we did take one gent early during Khe Sahn, he had one of the surrender leaflets that were dropped by the ton. It seems he carried RPG rockets all the way from some dump near hanoi and when he got to the place he was to deliver the officer in charge told him \"good job, go back and get more\" he said nuts to that. also on a similar note the local Marines that i have talked to have changed the ROE, due to the crap that has happened thru the media about wounded iraqis and unfortunate incidents they just will not take any alive. it is sort of a no quarter given or asked. but it is what it is but like i said, i was just a grunt, carried a rifle, made no decisions other than a sgt pay grade, but did not take prisoners, no, i will not say i killed anyone rather than take them in, but was not inclined to even see if they were alive, just made sure they were dead. dead ones can not hurt you", 
        "intTime": 20090523, 
        "postID": 59, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by Ira1945: quote: Originally posted by Fightdirector: Where did I go wrong? I managed to interrogate many North Vietnamese soldiers, Viet Cong and Vietnamese civilians during my time in Viet-Nam. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). During my time in Germany working in counter-intelligence, I interrogated Russian agents, East German agents, Bulgarian agents, Polish agents, etc. I got good, quality intelligence out of the majority of them - and never had to use torture (pardon me, \"enhanced interrogation techniques\"). Some of that intelligence was tactical, some was strategic and it was all solid intel - and I never had to use torture (pardon me, \"enhanced interrogation techniques\"). What did I do wrong? Years of interrogations - and never once did I use torture (pardon me, \"enhanced interrogation techniques\") on anyone. I guess that means I wasn't a good interrogator... Ever witness the Koreans in their techniques?? they also got valuable information but slightly different methods Yes, I did. And guess what? I also remember seeing one of those Korean interrogators one morning, dead and draped over some barb-wire. No one was ever indicted or convicted for his death - but it was strongly suspected that some American MI people were responsible. His \"enhanced interrogation techniques\" were getting people killed, because the information he would get would be crap. Firm, fast and un-disputable rule of all interrogations: Information given under torture is automatically worthless. There was one American interrogator in the 1st Brigade, 5th ID who, assisted by an American helicopter pilot, tried the \"drop the first prisoner out of the helicopter at 800 feet, and then question the second prisoner\" technique. Somehow the helicopter's engine stopped in mid flight and the chopper crashed, killing the interrogator and the pilot - they were never able to prove that the helicopter mechanics sabotaged the chopper once they found out what the pilot was doing, but it was an open secret that was what really caused the crash.", 
        "reply": " Me, I never took any prisoners, not to say that was intentional, i just did not see many live NVA or VC, nor was i really inclined to do so. we did take one gent early during Khe Sahn, he had one of the surrender leaflets that were dropped by the ton. It seems he carried RPG rockets all the way from some dump near hanoi and when he got to the place he was to deliver the officer in charge told him \"good job, go back and get more\" he said nuts to that. also on a similar note the local Marines that i have talked to have changed the ROE, due to the crap that has happened thru the media about wounded iraqis and unfortunate incidents they just will not take any alive. it is sort of a no quarter given or asked. but it is what it is but like i said, i was just a grunt, carried a rifle, made no decisions other than a sgt pay grade, but did not take prisoners, no, i will not say i killed anyone rather than take them in, but was not inclined to even see if they were alive, just made sure they were dead. dead ones can not hurt you", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 06:06:00", 
        "title": "WATERBOARDING", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I recall that as a freshman in college, I failed to write the dormitory newsletter timely. Some upper classmen grabbed me from behind, threw me into the trunk of a car, drove me a mile or two outside of town, and dumped me into a pond with good layer of ice on it. Banged up a bit, yes. Shivering and shrivelling, yes. The practice was somewhat risky, yes. But by the standards expressed by leftists who contrive righteous indignation, what occurred then was probably \"torture\" in its physical sense (acknowledging that the purposes were somewhat different). Later, in military training we were imprisoned a while and harassed--hosed, compelled to kneel for extended periods during fake interrogation, listen to loud non-music (jackass polyticks would likely call it torture). This crap is overblown for polytickle purposes, plain and simple. Americans with their heads screwed on straight know this whole pile of pelosi is overblown.", 
        "intTime": 20090523, 
        "postID": 60, 
        "quote": "", 
        "reply": "I recall that as a freshman in college, I failed to write the dormitory newsletter timely. Some upper classmen grabbed me from behind, threw me into the trunk of a car, drove me a mile or two outside of town, and dumped me into a pond with good layer of ice on it. Banged up a bit, yes. Shivering and shrivelling, yes. The practice was somewhat risky, yes. But by the standards expressed by leftists who contrive righteous indignation, what occurred then was probably \"torture\" in its physical sense (acknowledging that the purposes were somewhat different). Later, in military training we were imprisoned a while and harassed--hosed, compelled to kneel for extended periods during fake interrogation, listen to loud non-music (jackass polyticks would likely call it torture). This crap is overblown for polytickle purposes, plain and simple. Americans with their heads screwed on straight know this whole pile of pelosi is overblown.", 
        "threadID": "409192893_4360088322001", 
        "time": "2009-05-23 11:19:00", 
        "title": "WATERBOARDING", 
        "userID": "RRR52"
    }
]