[
    {
        "content": "Yeah, the party of doom. . . . jackasses subscribing to Obama's sucker crap about the overwhelming crisis that demanded all sorts of stupid spending excesses. Can't be lettin' a good crisis go to waste, now, can we? Jes lahk Frankie Roosevelt, but less credibility. Jackasses that brayed about defense of the nation by forward action in Iraq and Afghanistan, costing $600+ billion for 6 years, since it was \"fiscally irresponsible\" and \"unaffordable;\" but then the jackasses dreamed up and their dupes sucked the swill about trillions more being AOK to foist onto the nation's debt for many decades ahead. Brilliant financial acumen, baby. Talk about a credibility gap.", 
        "intTime": 20090322, 
        "postID": 1, 
        "quote": "", 
        "reply": "Yeah, the party of doom. . . . jackasses subscribing to Obama's sucker crap about the overwhelming crisis that demanded all sorts of stupid spending excesses. Can't be lettin' a good crisis go to waste, now, can we? Jes lahk Frankie Roosevelt, but less credibility. Jackasses that brayed about defense of the nation by forward action in Iraq and Afghanistan, costing $600+ billion for 6 years, since it was \"fiscally irresponsible\" and \"unaffordable;\" but then the jackasses dreamed up and their dupes sucked the swill about trillions more being AOK to foist onto the nation's debt for many decades ahead. Brilliant financial acumen, baby. Talk about a credibility gap.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-22 19:28:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "RRR52"
    }, 
    {
        "content": "Look on the bright side! Every cloud has a silver lining - even if it's a funnel cloud. So then, the good news is - should we actually approach bankruptcy, it is almost guaranteed that marijuana will become a cash crop...", 
        "intTime": 20090322, 
        "postID": 2, 
        "quote": "", 
        "reply": "Look on the bright side! Every cloud has a silver lining - even if it's a funnel cloud. So then, the good news is - should we actually approach bankruptcy, it is almost guaranteed that marijuana will become a cash crop...", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-22 20:10:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "boazjones"
    }, 
    {
        "content": "I for one second the legalization of Marijuana. There are untold billions of tax revenue going uncollected by supressing this lucratic product from open markets... Israel is the leading researcher of Marijuana and they soundly endorse its uses.....As a christian nation, we are obliged to follow their lead...", 
        "intTime": 20090322, 
        "postID": 3, 
        "quote": "", 
        "reply": "I for one second the legalization of Marijuana. There are untold billions of tax revenue going uncollected by supressing this lucratic product from open markets... Israel is the leading researcher of Marijuana and they soundly endorse its uses.....As a christian nation, we are obliged to follow their lead...", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-22 20:31:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Israel is the leading researcher of Marijuana and they soundly endorse its uses.....As a christian nation, we are obliged to follow their lead... what the hell is this", 
        "intTime": 20090322, 
        "postID": 4, 
        "quote": "Originally posted by Irwin_R_Schyster: Israel is the leading researcher of Marijuana and they soundly endorse its uses.....As a christian nation, we are obliged to follow their lead...", 
        "reply": " what the hell is this", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-22 20:33:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: lucratic What the hell? You're making up words, now?", 
        "intTime": 20090322, 
        "postID": 5, 
        "quote": "Originally posted by Irwin_R_Schyster: lucratic", 
        "reply": " What the hell? You're making up words, now?", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-22 20:40:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Yeah lucratic, you know where you can sit at home on your duff and collect Gubmint handouts. Kinda what Obama preaches, it is the lucrative arm of the Dem party. The welfare recieving gettin your gas tank fillin gettin your mortgage paid for ya people who elected him.", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "", 
        "reply": "Yeah lucratic, you know where you can sit at home on your duff and collect Gubmint handouts. Kinda what Obama preaches, it is the lucrative arm of the Dem party. The welfare recieving gettin your gas tank fillin gettin your mortgage paid for ya people who elected him.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 02:13:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "dhd123"
    }, 
    {
        "content": "dhd123, Are you from low income; and in need of a formal education? It's not \"gubmint\" - it's government.", 
        "intTime": 20090323, 
        "postID": 7, 
        "quote": "", 
        "reply": "dhd123, Are you from low income; and in need of a formal education? It's not \"gubmint\" - it's government.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 04:26:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: should we actually approach bankruptcy That is a very big should. Fact is the republicans are becoming practicing demagogues. In actuality...the democrappies have been well-versed as practicing hypocrites for years, thanks to the likes of the Senator-gods Ted Kennedy and Robert Byrd, and their most illustrious and infamous careers... Excellent role models!", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "Originally posted by dmuhler: quote: should we actually approach bankruptcy That is a very big should. Fact is the republicans are becoming practicing demagogues.", 
        "reply": " In actuality...the democrappies have been well-versed as practicing hypocrites for years, thanks to the likes of the Senator-gods Ted Kennedy and Robert Byrd, and their most illustrious and infamous careers... Excellent role models!", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 05:13:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "It was the party of \"yes we can\" that put language in the bailout bill that allowed AIG to pay bonuses to executives. How did that work out for you? The party of reality is saying there is danger in the continued piling up of debt and the continued printing of money. Bankruptcy is when your liquid assets are not enough to cover your liabilities. The country is just one Chinese call for payment away from insolvency.", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "", 
        "reply": "It was the party of \"yes we can\" that put language in the bailout bill that allowed AIG to pay bonuses to executives. How did that work out for you? The party of reality is saying there is danger in the continued piling up of debt and the continued printing of money. Bankruptcy is when your liquid assets are not enough to cover your liabilities. The country is just one Chinese call for payment away from insolvency.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 07:08:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: The country is just one Chinese call for payment away from insolvency. DID YOU KNOW: Bonds don't work like this, there is no \"call for payment\".", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "Originally posted by bill_kananen: The country is just one Chinese call for payment away from insolvency.", 
        "reply": " DID YOU KNOW: Bonds don't work like this, there is no \"call for payment\".", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 07:37:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by boazjones: dhd123, Are you from low income; and in need of a formal education? It's not \"gubmint\" - it's government. LMFAO!!!!!! Let me speak really slow here, boaz h u m o u r.", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "Originally posted by boazjones: dhd123, Are you from low income; and in need of a formal education? It's not \"gubmint\" - it's government.", 
        "reply": " LMFAO!!!!!! Let me speak really slow here, boaz h u m o u r.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 08:18:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: It was the party of \"yes we can\" that put language in the bailout bill that allowed AIG to pay bonuses to executives. How did that work out for you? The party of reality is saying there is danger in the continued piling up of debt and the continued printing of money. Bankruptcy is when your liquid assets are not enough to cover your liabilities. The country is just one Chinese call for payment away from insolvency. As it was the \"responsible\" Party that included it prior to that... and that \"responsible\" party also allowed for the purchase of Corporate Biz-jets with that bailout money as well... as well as other extreme excesses So Bill, do you really have a point in there somewhere?", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "Originally posted by bill_kananen: It was the party of \"yes we can\" that put language in the bailout bill that allowed AIG to pay bonuses to executives. How did that work out for you? The party of reality is saying there is danger in the continued piling up of debt and the continued printing of money. Bankruptcy is when your liquid assets are not enough to cover your liabilities. The country is just one Chinese call for payment away from insolvency.", 
        "reply": " As it was the \"responsible\" Party that included it prior to that... and that \"responsible\" party also allowed for the purchase of Corporate Biz-jets with that bailout money as well... as well as other extreme excesses So Bill, do you really have a point in there somewhere?", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 11:11:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "ArtMarsh you are referring to the Bush administration and the lib/socialist controlled congress. Far from the responsible party. A few of the retiring members of the responsible party voted for it because of loyalty to President Bush. The \"for it before being against it\" members of the responsible party voted for it because of the upcomming elections. Didn't make a bit of difference though. The \"yes we can\" party convinced the sheeple to vote for hope and change. I just hope the crap we are chin deep in isn't the change promised. Being chin deep in crap we can only hope the lib/socialists don't make waves.", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "", 
        "reply": "ArtMarsh you are referring to the Bush administration and the lib/socialist controlled congress. Far from the responsible party. A few of the retiring members of the responsible party voted for it because of loyalty to President Bush. The \"for it before being against it\" members of the responsible party voted for it because of the upcomming elections. Didn't make a bit of difference though. The \"yes we can\" party convinced the sheeple to vote for hope and change. I just hope the crap we are chin deep in isn't the change promised. Being chin deep in crap we can only hope the lib/socialists don't make waves.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 11:41:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: With treasuries, that is not how it works. As long as we make the payments as they come due, we are not in a state of bankruptcy. And that is not going to happen anytime soon and the republican demagogues know it. Yup, it's like paying off one credit card with another. Works well untill the next credit card offer doesn't come or is refused due to your credit score.", 
        "intTime": 20090323, 
        "postID": 14, 
        "quote": "dmuhler: With treasuries, that is not how it works. As long as we make the payments as they come due, we are not in a state of bankruptcy. And that is not going to happen anytime soon and the republican demagogues know it.", 
        "reply": " Yup, it's like paying off one credit card with another. Works well untill the next credit card offer doesn't come or is refused due to your credit score.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 11:44:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: Got plenty of tax revenues to keep up with it. So there is no deficit? I didn't know that. Paying the minimum balance on credit cards each month is sound economic policy then.", 
        "intTime": 20090323, 
        "postID": 15, 
        "quote": "dmuhler: Got plenty of tax revenues to keep up with it.", 
        "reply": " So there is no deficit? I didn't know that. Paying the minimum balance on credit cards each month is sound economic policy then.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 12:32:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Right about now it's mine, Dave, and I really hate admitting that. But let's look at the box score so far. Every time Obama opens his mouth the stock market drops. I'd like to think this is happening because he's incompetent and is following the lead of Reid and Pelosi, who are equally incompetent. But somewhere in the back of my mind is the idea that Obama knows exactly what he's doing and that we ain't seen nothing yet. I don't scare easily, Dave. But this guy really scares me....", 
        "intTime": 20090323, 
        "postID": 16, 
        "quote": "", 
        "reply": "Right about now it's mine, Dave, and I really hate admitting that. But let's look at the box score so far. Every time Obama opens his mouth the stock market drops. I'd like to think this is happening because he's incompetent and is following the lead of Reid and Pelosi, who are equally incompetent. But somewhere in the back of my mind is the idea that Obama knows exactly what he's doing and that we ain't seen nothing yet. I don't scare easily, Dave. But this guy really scares me....", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 12:37:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: dmuhler: Got plenty of tax revenues to keep up with it. So there is no deficit? I didn't know that. Paying the minimum balance on credit cards each month is sound economic policy then. It is if you have an essentially infinite line of credit (like the United States does)", 
        "intTime": 20090323, 
        "postID": 17, 
        "quote": "Originally posted by bill_kananen: quote: dmuhler: Got plenty of tax revenues to keep up with it. So there is no deficit? I didn't know that. Paying the minimum balance on credit cards each month is sound economic policy then.", 
        "reply": " It is if you have an essentially infinite line of credit (like the United States does)", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 13:09:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "liberal90"
    }, 
    {
        "content": "No, the US doesn't. But, the Fed does.", 
        "intTime": 20090323, 
        "postID": 18, 
        "quote": "", 
        "reply": "No, the US doesn't. But, the Fed does.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 14:35:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP.", 
        "intTime": 20090323, 
        "postID": 19, 
        "quote": "", 
        "reply": "dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 15:46:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP. I don't think it's a rebirth of the GOP--I think it died as a conservative party right about the same time the Democratic party died as an American one. At some point in the near future Americans not interested in committing politically correct suicide will reject the Democrats and the Republicans in favor of a party which represent them. The latter are aging beauty queens on their last trip down the runway....", 
        "intTime": 20090323, 
        "postID": 20, 
        "quote": "dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP.", 
        "reply": " I don't think it's a rebirth of the GOP--I think it died as a conservative party right about the same time the Democratic party died as an American one. At some point in the near future Americans not interested in committing politically correct suicide will reject the Democrats and the Republicans in favor of a party which represent them. The latter are aging beauty queens on their last trip down the runway....", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 15:57:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: quote: dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP. I don't think it's a rebirth of the GOP--I think it died as a conservative party right about the same time the Democratic party died as an American one. At some point in the near future Americans not interested in committing politically correct suicide will reject the Democrats and the Republicans in favor of a party which represent them. The latter are aging beuty queens on their last trip down the runway.... Power corrupts; absolute power corrupts absolutely", 
        "intTime": 20090323, 
        "postID": 21, 
        "quote": "Originally posted by ipw533: quote: dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP. I don't think it's a rebirth of the GOP--I think it died as a conservative party right about the same time the Democratic party died as an American one. At some point in the near future Americans not interested in committing politically correct suicide will reject the Democrats and the Republicans in favor of a party which represent them. The latter are aging beuty queens on their last trip down the runway....", 
        "reply": " Power corrupts; absolute power corrupts absolutely", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 15:59:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by ipw533: quote: dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP. I don't think it's a rebirth of the GOP--I think it died as a conservative party right about the same time the Democratic party died as an American one. At some point in the near future Americans not interested in committing politically correct suicide will reject the Democrats and the Republicans in favor of a party which represent them. The latter are aging beuty queens on their last trip down the runway.... Power corrupts; absolute power corrupts absolutely As has been seen in the blatant shenanigans of this administration who act like drunk frat boys with someone elses platinum master card.", 
        "intTime": 20090323, 
        "postID": 22, 
        "quote": "Originally posted by threerings: quote: Originally posted by ipw533: quote: dmuhler...its kind of funny watching you these days..as Obama paves the way for the rebirth of the GOP. I don't think it's a rebirth of the GOP--I think it died as a conservative party right about the same time the Democratic party died as an American one. At some point in the near future Americans not interested in committing politically correct suicide will reject the Democrats and the Republicans in favor of a party which represent them. The latter are aging beuty queens on their last trip down the runway.... Power corrupts; absolute power corrupts absolutely", 
        "reply": " As has been seen in the blatant shenanigans of this administration who act like drunk frat boys with someone elses platinum master card.", 
        "threadID": "409192893_5970006812001", 
        "time": "2009-03-23 16:31:00", 
        "title": "The party of No has become the party of Doom.", 
        "userID": "Mom2APAJ"
    }
]