[
    {
        "content": "Meet the bankers and brokers responsible for the financial crisis - and the officials who let them get away with it Don't worry it's a bi-partisan list. The Enabler ALAN GREENSPAN WAS Chairman of the Federal Reserve (1987-2006) WHAT HE DID Pushed for sweeping power to regulate Wall Street — and then failed to use it. Fueled \"irrational\" bubble with low interest rates. WORST MOVE Called derivatives like CDOs \"extraordinarily useful\"; regulating them would be a \"mistake.\" NOW ADMITS He was \"partially\" wrong to not impose tougher oversight. The Pioneer SANDY WEILL WAS CEO of Citigroup (1998-2003) WHAT HE DID Created the first too-big-to-fail company, Citigroup. Led the boom in subprime mortgages. RECENTLY Celebrated $45 billion taxpayer bailout of Citi by taking Mexican vacation on Citigroup jet, complete with $13,000 carpets, pillows made from Hermés scarves, and Baccarat crystal glassware. The Ideologue PHIL GRAMM WAS Senate Banking Committee chair (1995-2000) KNOWN AS \"High priest of deregulation\" WHAT HE DID Pushed repeal of Glass-Steagall Act, leading to rise of megabanks. WORST MOVE Wrote law that exempted disastrous CDS deals from all regulation. NOW ADMITS Nothing. Says there is \"no evidence\" his laws caused crash, which he dismissed as a \"mental recession.\" The Arsonist JOE CASSANO WAS Chief of AIG Financial Products (2001-2008) WHAT HE DID Blew a $500 billion hole in fabric of the universe by placing massive bet on the bubble economy with money he didn't have. WORST MOVE In August 2007 told investors his CDS deals could not lose even \"$1\"; lost $352 million that quarter. NOW Enjoying his $280 million in earnings. The Bagman ROBERT RUBIN WAS Treasury secretary (1995-1999) WHAT HE DID Opposed regulation of credit swaps; fought to overturn Glass-Steagall Act, leading to creation of Citigroup, where he later made $115 million. WORST MOVE Asked Treasury to pressure ratings agencies to delay downgrading Enron, a Citigroup debtor. NOW Still on Citi's board; mentor of Treasury Secretary Geithner. The Card Shark JIMMY CAYNE WAS CEO of Bear Stearns (1993-2008) WHAT HE DID Took card-playing vacations and allegedly smoked weed while Bear went bankrupt. WORST MOVE Cashed out his $61 million share after resigning shortly before Bear's sale to J.P. Morgan Chase. NOW SAYS Of Treasury Secretary Geithner: \"The guy thinks he's got a big dick. He's got nothing, except maybe a boyfriend.\" Mr. Buck Passer CHRISTOPHER COX WAS Chairman of the SEC (2005-2009) WHAT HE DID Gave the market a free ride, waiting until far too late to reverse the disastrous \"voluntary regulation\" program of 2004 and police the ratings agencies. LAME EXCUSE Insisted it wasn't his fault, claiming deregulatory policies tied his hands. NOW SAYS His \"greatest contribution\" during the crisis was staying \"calm.\" The Predator ANGELO MOZILO WAS Head of Countrywide Financial (1969-2008) WHAT HE DID Biggest provider of subprime mortgages; specialized in predatory loans that put broke people in mansions. WORST MOVE \"Friends of Angelo\" program gave favorable mortgages to Sens. Chris Dodd and Kent Conrad. NOW SAYS Called plea from homeowner facing foreclosure \"disgusting.\" The Decorator JOHN THAIN WAS Chief of Merrill Lynch (2007-2009) WHAT HE DID Concealed $15 billion hole in Merrill balance sheet until government subsidized the sale of his company. Went skiing in Vail just before revealing losses. WORST MOVE Proposed $10 million bonus for himself as company imploded; OK'd $1.2 million office refurbishing. IS NOW Facing class-action suit for concealing losses. The Maestro HENRY PAULSON WAS CEO of Goldman Sachs (1999-2006); Treasury secretary (2006-2009) WHAT HE DID Pushed for end to debt restrictions for banks like Goldman, then arranged big bailout for Goldman. WORST MOVE TARP proposal just three pages long; made his decisions \"non-reviewable.\" NOW SAYS \"I don't think we've made mistakes on the major decisions.\" The Big Loser DICK FULD WAS CEO of Lehman Brothers (1993-2008) WHAT HE DID Piloted Lehman to largest ­bankruptcy in U.S. history; earned $22 million the year firm went bust. WORST MOVE Tried to avoid lawsuits by selling his $13 million Florida home to his wife for $100. NOW SAYS Feels \"horrible\" about Lehman, but insists his management was \"prudent and appropriate.\" Mr. Too Big KEN LEWIS IS CEO of Bank of America (2001-present) WHAT HE DID Created ultimate too-big-to-fail company, buying up Fleet, MBNA, Countrywide and Merrill Lynch. WORST MOVE Failed to catch a $15 billion loss at Merrill before buying the firm; needed $20 billion bailout to close deal. NOW SAYS It's a false \"claim\" to say \"the banks that caused this mess must be held accountable.\" >>>http://www.rollingstone.com/politics/story/26868968/the_dirty_dozen Each and every one should be paraded down 'WALL STREET' wearing a dunce hat. Then sent to some Federal Prison (resort) for a very long extended ‘vacation’!", 
        "intTime": 20090331, 
        "postID": 1, 
        "quote": "", 
        "reply": "Meet the bankers and brokers responsible for the financial crisis - and the officials who let them get away with it Don't worry it's a bi-partisan list. The Enabler ALAN GREENSPAN WAS Chairman of the Federal Reserve (1987-2006) WHAT HE DID Pushed for sweeping power to regulate Wall Street — and then failed to use it. Fueled \"irrational\" bubble with low interest rates. WORST MOVE Called derivatives like CDOs \"extraordinarily useful\"; regulating them would be a \"mistake.\" NOW ADMITS He was \"partially\" wrong to not impose tougher oversight. The Pioneer SANDY WEILL WAS CEO of Citigroup (1998-2003) WHAT HE DID Created the first too-big-to-fail company, Citigroup. Led the boom in subprime mortgages. RECENTLY Celebrated $45 billion taxpayer bailout of Citi by taking Mexican vacation on Citigroup jet, complete with $13,000 carpets, pillows made from Hermés scarves, and Baccarat crystal glassware. The Ideologue PHIL GRAMM WAS Senate Banking Committee chair (1995-2000) KNOWN AS \"High priest of deregulation\" WHAT HE DID Pushed repeal of Glass-Steagall Act, leading to rise of megabanks. WORST MOVE Wrote law that exempted disastrous CDS deals from all regulation. NOW ADMITS Nothing. Says there is \"no evidence\" his laws caused crash, which he dismissed as a \"mental recession.\" The Arsonist JOE CASSANO WAS Chief of AIG Financial Products (2001-2008) WHAT HE DID Blew a $500 billion hole in fabric of the universe by placing massive bet on the bubble economy with money he didn't have. WORST MOVE In August 2007 told investors his CDS deals could not lose even \"$1\"; lost $352 million that quarter. NOW Enjoying his $280 million in earnings. The Bagman ROBERT RUBIN WAS Treasury secretary (1995-1999) WHAT HE DID Opposed regulation of credit swaps; fought to overturn Glass-Steagall Act, leading to creation of Citigroup, where he later made $115 million. WORST MOVE Asked Treasury to pressure ratings agencies to delay downgrading Enron, a Citigroup debtor. NOW Still on Citi's board; mentor of Treasury Secretary Geithner. The Card Shark JIMMY CAYNE WAS CEO of Bear Stearns (1993-2008) WHAT HE DID Took card-playing vacations and allegedly smoked weed while Bear went bankrupt. WORST MOVE Cashed out his $61 million share after resigning shortly before Bear's sale to J.P. Morgan Chase. NOW SAYS Of Treasury Secretary Geithner: \"The guy thinks he's got a big dick. He's got nothing, except maybe a boyfriend.\" Mr. Buck Passer CHRISTOPHER COX WAS Chairman of the SEC (2005-2009) WHAT HE DID Gave the market a free ride, waiting until far too late to reverse the disastrous \"voluntary regulation\" program of 2004 and police the ratings agencies. LAME EXCUSE Insisted it wasn't his fault, claiming deregulatory policies tied his hands. NOW SAYS His \"greatest contribution\" during the crisis was staying \"calm.\" The Predator ANGELO MOZILO WAS Head of Countrywide Financial (1969-2008) WHAT HE DID Biggest provider of subprime mortgages; specialized in predatory loans that put broke people in mansions. WORST MOVE \"Friends of Angelo\" program gave favorable mortgages to Sens. Chris Dodd and Kent Conrad. NOW SAYS Called plea from homeowner facing foreclosure \"disgusting.\" The Decorator JOHN THAIN WAS Chief of Merrill Lynch (2007-2009) WHAT HE DID Concealed $15 billion hole in Merrill balance sheet until government subsidized the sale of his company. Went skiing in Vail just before revealing losses. WORST MOVE Proposed $10 million bonus for himself as company imploded; OK'd $1.2 million office refurbishing. IS NOW Facing class-action suit for concealing losses. The Maestro HENRY PAULSON WAS CEO of Goldman Sachs (1999-2006); Treasury secretary (2006-2009) WHAT HE DID Pushed for end to debt restrictions for banks like Goldman, then arranged big bailout for Goldman. WORST MOVE TARP proposal just three pages long; made his decisions \"non-reviewable.\" NOW SAYS \"I don't think we've made mistakes on the major decisions.\" The Big Loser DICK FULD WAS CEO of Lehman Brothers (1993-2008) WHAT HE DID Piloted Lehman to largest ­bankruptcy in U.S. history; earned $22 million the year firm went bust. WORST MOVE Tried to avoid lawsuits by selling his $13 million Florida home to his wife for $100. NOW SAYS Feels \"horrible\" about Lehman, but insists his management was \"prudent and appropriate.\" Mr. Too Big KEN LEWIS IS CEO of Bank of America (2001-present) WHAT HE DID Created ultimate too-big-to-fail company, buying up Fleet, MBNA, Countrywide and Merrill Lynch. WORST MOVE Failed to catch a $15 billion loss at Merrill before buying the firm; needed $20 billion bailout to close deal. NOW SAYS It's a false \"claim\" to say \"the banks that caused this mess must be held accountable.\" >>>http://www.rollingstone.com/politics/story/26868968/the_dirty_dozen Each and every one should be paraded down 'WALL STREET' wearing a dunce hat. Then sent to some Federal Prison (resort) for a very long extended ‘vacation’!", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-03-31 16:19:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "LOL ... Rolling Stone no less. Since we've got a dozen ... let's toss in two more and make it a baker's dozen+. Since they focus on Gramm, add Clinton who strongly supported the bill ... and his SECTREAS (Rubin) who also strongly supported it and helped ensure its passage before resigning to go to work for Weill at Citibank, one of the largest and most immediate beneficiaries of the bill. He was also an advisor to Obama during his campaign. I admit, it was tough narrowing it down to two add-ons ... really wanted to get Franks and Dodd in there somewhere, particularly since Dodd is a proven liar on his involvement with things economic.", 
        "intTime": 20090331, 
        "postID": 2, 
        "quote": "", 
        "reply": "LOL ... Rolling Stone no less. Since we've got a dozen ... let's toss in two more and make it a baker's dozen+. Since they focus on Gramm, add Clinton who strongly supported the bill ... and his SECTREAS (Rubin) who also strongly supported it and helped ensure its passage before resigning to go to work for Weill at Citibank, one of the largest and most immediate beneficiaries of the bill. He was also an advisor to Obama during his campaign. I admit, it was tough narrowing it down to two add-ons ... really wanted to get Franks and Dodd in there somewhere, particularly since Dodd is a proven liar on his involvement with things economic.", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-03-31 16:36:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Franks and Dodd in there somewhere, particularly since Dodd is a proven liar 13 and 14. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090331, 
        "postID": 3, 
        "quote": "Franks and Dodd in there somewhere, particularly since Dodd is a proven liar", 
        "reply": " 13 and 14. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-03-31 17:03:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: LOL ... Rolling Stone no less. Since we've got a dozen ... let's toss in two more and make it a baker's dozen+. Since they focus on Gramm, add Clinton who strongly supported the bill ... and his SECTREAS (Rubin) who also strongly supported it and helped ensure its passage before resigning to go to work for Weill at Citibank, one of the largest and most immediate beneficiaries of the bill. He was also an advisor to Obama during his campaign. I admit, it was tough narrowing it down to two add-ons ... really wanted to get Franks and Dodd in there somewhere, particularly since Dodd is a proven liar on his involvement with things economic. and his SECTREAS (Rubin) Already on the list. The Bagman ROBERT RUBIN Frank and Dodd, maybe, but these were just congress critters. They had no input on the day to day running of anything, other than their mouth. If we put everyone who has some responsibility for the meltdown, the list could go on forever. IMO maybe it’s best to leave it to the top ‘dirtiest’ players. If we add Clinton then we should add Bush as well. He allowed this to continue to fester for eight years and did nothing. Remember Cox and Paulson worked for him.", 
        "intTime": 20090331, 
        "postID": 4, 
        "quote": "Originally posted by I_M_Qwerty: LOL ... Rolling Stone no less. Since we've got a dozen ... let's toss in two more and make it a baker's dozen+. Since they focus on Gramm, add Clinton who strongly supported the bill ... and his SECTREAS (Rubin) who also strongly supported it and helped ensure its passage before resigning to go to work for Weill at Citibank, one of the largest and most immediate beneficiaries of the bill. He was also an advisor to Obama during his campaign. I admit, it was tough narrowing it down to two add-ons ... really wanted to get Franks and Dodd in there somewhere, particularly since Dodd is a proven liar on his involvement with things economic.", 
        "reply": " and his SECTREAS (Rubin) Already on the list. The Bagman ROBERT RUBIN Frank and Dodd, maybe, but these were just congress critters. They had no input on the day to day running of anything, other than their mouth. If we put everyone who has some responsibility for the meltdown, the list could go on forever. IMO maybe it’s best to leave it to the top ‘dirtiest’ players. If we add Clinton then we should add Bush as well. He allowed this to continue to fester for eight years and did nothing. Remember Cox and Paulson worked for him.", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-03-31 17:17:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Didn't Franks & Co. give birth to the Community Reinvestment Act that gave unqualified people a mortgage? Doesn't all of this stem directly from that? \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090331, 
        "postID": 5, 
        "quote": "", 
        "reply": "Didn't Franks & Co. give birth to the Community Reinvestment Act that gave unqualified people a mortgage? Doesn't all of this stem directly from that? \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-03-31 18:53:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by rm444: Didn't Franks & Co. give birth to the Community Reinvestment Act that gave unqualified people a mortgage? Doesn't all of this stem directly from that? No and No. Frank wasn't elected to congress until September 16, 1980. The CRA was passed by the 95th United States Congress and signed into law by President Jimmy Carter in 1977. As far as CRA being responsible for the mess we have now it depends on who you listen to. Some say yes, some say no. Relation to 2008 financial crisis See also: Subprime mortgage crisis and Global financial crisis of 2008–2009 Some economists, politicians and other commentators have charged that the CRA contributed in part to the 2008 financial crisis by encouraging banks to make unsafe loans. Others however, including the economists from the Federal Reserve and the FDIC, dispute this contention. The Federal Reserve and the FDIC holds that empirical research has not validated any relationship between the CRA and the 2008 financial crisis.[56][57] Economist Stan Liebowitz wrote in the New York Post that a strengthening of the CRA in the 1990s encouraged a loosening of lending standards throughout the banking industry. He also charges the Federal Reserve with ignoring the negative impact of the CRA.[51] In a commentary for CNN, Congressman Ron Paul, who serves on the United States House Committee on Financial Services, charged the CRA with \"forcing banks to lend to people who normally would be rejected as bad credit risks.\"[58] In a Wall Street Journal opinion piece, Austrian school economist Russell Roberts wrote that the CRA subsidized low-income housing by pressuring banks to serve poor borrowers and poor regions of the country.[59] Jeffrey A. Miron, a senior lecturer in economics at Harvard University, in an opinion piece for CNN, calls for “getting rid” of Fannie Mae and Freddie Mac, as well as policies like the Community Reinvestment Act that “pressure banks into subprime lending.”[60] However, others dispute the involvement of the CRA in the subprime crisis. San Francisco Federal Reserve Bank Governor Randall Kroszner has stated that the claim that \"the law pushed banking institutions to undertake high-risk mortgage lending\" was contrary to their experience, and that no empirical evidence had been presented to support the claim.[56] In a Bank for International Settlements (BIS) working paper, economist Luci Ellis concluded that \"there is no evidence that the Community Reinvestment Act was responsible for encouraging the subprime lending boom and subsequent housing bust,\" relying partly on evidence that the housing bust has been a largely exurban event.[61] Others have also concluded that the CRA did not contribute to the financial crisis, for example, FDIC Chairman Sheila Bair,[62] Comptroller of the Currency John C. Dugan,[63] Tim Westrich of the Center for American Progress,[64] Robert Gordon of the American Prospect,[65] Daniel Gross of Slate, and Aaron Pressman from BusinessWeek.[66] Some legal and financial experts note that CRA regulated loans tend to be safe and profitable, and that subprime excesses came mainly from institutions not regulated by the CRA. In the February 2008 House hearing, law professor Michael S. Barr, a Treasury Department official under President Clinton,[67][34] stated that a Federal Reserve survey showed that affected institutions considered CRA loans profitable and not overly risky. He noted that approximately 50% of the subprime loans were made by independent mortgage companies that were not regulated by the CRA, and another 25% to 30% came from only partially CRA regulated bank subsidiaries and affiliates. Barr noted that institutions fully regulated by CRA made \"perhaps one in four\" sub-prime loans, and that \"the worst and most widespread abuses occurred in the institutions with the least federal oversight\".[68] According to Janet L. Yellen, President of the Federal Reserve Bank of San Francisco, independent mortgage companies made risky \"high-priced loans\" at more than twice the rate of the banks and thrifts; most CRA loans were responsibly made, and were not the higher-priced loans that have contributed to the current crisis.[69] A 2008 study by Traiger & Hinckley LLP, a law firm that counsels financial institutions on CRA compliance, found that CRA regulated institutions were less likely to make subprime loans, and when they did the interest rates were lower. CRA banks were also half as likely to resell the loans.[70] Emre Ergungor of the Federal Reserve Bank of Cleveland found that there was no statistical difference in foreclosure rates between regulated and less-regulated banks, although a local bank presence resulted in fewer foreclosures.[71] During a 2008 House Committee on Oversight and Government Reform hearing on the role of Fannie Mae and Freddie Mac in the financial crisis, including in relation to the Community Reinvestment Act, asked if the CRA provided the “fuel” for increasing subprime loans, former Fannie Mae CEO Franklin Raines said it might have been a catalyst encouraging bad behavior, but it was difficult to know. Raines also cited information that only a small percentage of risky loans originated as a result of the CRA. Bob McTeer, president of the Dallas Federal Reserve Bank from 1991 to 2004, said “There was a lot of pressure from Congress and generally everywhere to make homeownership affordable for poor and low-income people. Some mortgages were made that would not have ordinarily been made.” He also said “When a bank made a decision to purchase mortgaged-backed securities, they would somehow determine if some of them were in zip codes covered by the CRA, and therefore they could get CRA credit.”[72][73] >>>http://en.wikipedia.org/wiki/Community_Reinvestment_Act#Relation_to_2008_financial_crisis For a quick rundown I've posted what Wiki has. You can check out the references they use.", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by rm444: Didn't Franks & Co. give birth to the Community Reinvestment Act that gave unqualified people a mortgage? Doesn't all of this stem directly from that?", 
        "reply": " No and No. Frank wasn't elected to congress until September 16, 1980. The CRA was passed by the 95th United States Congress and signed into law by President Jimmy Carter in 1977. As far as CRA being responsible for the mess we have now it depends on who you listen to. Some say yes, some say no. Relation to 2008 financial crisis See also: Subprime mortgage crisis and Global financial crisis of 2008–2009 Some economists, politicians and other commentators have charged that the CRA contributed in part to the 2008 financial crisis by encouraging banks to make unsafe loans. Others however, including the economists from the Federal Reserve and the FDIC, dispute this contention. The Federal Reserve and the FDIC holds that empirical research has not validated any relationship between the CRA and the 2008 financial crisis.[56][57] Economist Stan Liebowitz wrote in the New York Post that a strengthening of the CRA in the 1990s encouraged a loosening of lending standards throughout the banking industry. He also charges the Federal Reserve with ignoring the negative impact of the CRA.[51] In a commentary for CNN, Congressman Ron Paul, who serves on the United States House Committee on Financial Services, charged the CRA with \"forcing banks to lend to people who normally would be rejected as bad credit risks.\"[58] In a Wall Street Journal opinion piece, Austrian school economist Russell Roberts wrote that the CRA subsidized low-income housing by pressuring banks to serve poor borrowers and poor regions of the country.[59] Jeffrey A. Miron, a senior lecturer in economics at Harvard University, in an opinion piece for CNN, calls for “getting rid” of Fannie Mae and Freddie Mac, as well as policies like the Community Reinvestment Act that “pressure banks into subprime lending.”[60] However, others dispute the involvement of the CRA in the subprime crisis. San Francisco Federal Reserve Bank Governor Randall Kroszner has stated that the claim that \"the law pushed banking institutions to undertake high-risk mortgage lending\" was contrary to their experience, and that no empirical evidence had been presented to support the claim.[56] In a Bank for International Settlements (BIS) working paper, economist Luci Ellis concluded that \"there is no evidence that the Community Reinvestment Act was responsible for encouraging the subprime lending boom and subsequent housing bust,\" relying partly on evidence that the housing bust has been a largely exurban event.[61] Others have also concluded that the CRA did not contribute to the financial crisis, for example, FDIC Chairman Sheila Bair,[62] Comptroller of the Currency John C. Dugan,[63] Tim Westrich of the Center for American Progress,[64] Robert Gordon of the American Prospect,[65] Daniel Gross of Slate, and Aaron Pressman from BusinessWeek.[66] Some legal and financial experts note that CRA regulated loans tend to be safe and profitable, and that subprime excesses came mainly from institutions not regulated by the CRA. In the February 2008 House hearing, law professor Michael S. Barr, a Treasury Department official under President Clinton,[67][34] stated that a Federal Reserve survey showed that affected institutions considered CRA loans profitable and not overly risky. He noted that approximately 50% of the subprime loans were made by independent mortgage companies that were not regulated by the CRA, and another 25% to 30% came from only partially CRA regulated bank subsidiaries and affiliates. Barr noted that institutions fully regulated by CRA made \"perhaps one in four\" sub-prime loans, and that \"the worst and most widespread abuses occurred in the institutions with the least federal oversight\".[68] According to Janet L. Yellen, President of the Federal Reserve Bank of San Francisco, independent mortgage companies made risky \"high-priced loans\" at more than twice the rate of the banks and thrifts; most CRA loans were responsibly made, and were not the higher-priced loans that have contributed to the current crisis.[69] A 2008 study by Traiger & Hinckley LLP, a law firm that counsels financial institutions on CRA compliance, found that CRA regulated institutions were less likely to make subprime loans, and when they did the interest rates were lower. CRA banks were also half as likely to resell the loans.[70] Emre Ergungor of the Federal Reserve Bank of Cleveland found that there was no statistical difference in foreclosure rates between regulated and less-regulated banks, although a local bank presence resulted in fewer foreclosures.[71] During a 2008 House Committee on Oversight and Government Reform hearing on the role of Fannie Mae and Freddie Mac in the financial crisis, including in relation to the Community Reinvestment Act, asked if the CRA provided the “fuel” for increasing subprime loans, former Fannie Mae CEO Franklin Raines said it might have been a catalyst encouraging bad behavior, but it was difficult to know. Raines also cited information that only a small percentage of risky loans originated as a result of the CRA. Bob McTeer, president of the Dallas Federal Reserve Bank from 1991 to 2004, said “There was a lot of pressure from Congress and generally everywhere to make homeownership affordable for poor and low-income people. Some mortgages were made that would not have ordinarily been made.” He also said “When a bank made a decision to purchase mortgaged-backed securities, they would somehow determine if some of them were in zip codes covered by the CRA, and therefore they could get CRA credit.”[72][73] >>>http://en.wikipedia.org/wiki/Community_Reinvestment_Act#Relation_to_2008_financial_crisis For a quick rundown I've posted what Wiki has. You can check out the references they use.", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 02:45:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Pushed repeal of Glass-Steagall Act Isn't this how we ended up with \"too big to fail\"?", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "Pushed repeal of Glass-Steagall Act", 
        "reply": " Isn't this how we ended up with \"too big to fail\"?", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 04:51:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "MAE and MAC are a major part of this downed economy and Frank and Dodd were agianst any regulation. Since 2002 people were trying to regulate and correct problems ans Lispy is on record numerous times in hearings saying there is nothing wrong so is Dood and Waters.", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "", 
        "reply": "MAE and MAC are a major part of this downed economy and Frank and Dodd were agianst any regulation. Since 2002 people were trying to regulate and correct problems ans Lispy is on record numerous times in hearings saying there is nothing wrong so is Dood and Waters.", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 04:56:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "http://www.house.gov/apps/list/press/financialsvcs_dem/press0312092.shtml", 
        "intTime": 20090401, 
        "postID": 9, 
        "quote": "", 
        "reply": "http://www.house.gov/apps/list/press/financialsvcs_dem/press0312092.shtml", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 05:18:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Damn, by the title of this thread I thought they were talking about the Obama nominees!", 
        "intTime": 20090401, 
        "postID": 10, 
        "quote": "", 
        "reply": "Damn, by the title of this thread I thought they were talking about the Obama nominees!", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 06:02:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "navy8086"
    }, 
    {
        "content": "TY jdk. So CRA was already in force but it was 'strengthened' in the 90s which loosened standards and encouraged bad lending. Who 'strengthened' it? \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090401, 
        "postID": 11, 
        "quote": "", 
        "reply": "TY jdk. So CRA was already in force but it was 'strengthened' in the 90s which loosened standards and encouraged bad lending. Who 'strengthened' it? \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 11:48:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: MAE and MAC are a major part of this downed economy and Frank and Dodd were agianst any regulation. Since 2002 people were trying to regulate and correct problems ans Lispy is on record numerous times in hearings saying there is nothing wrong so is Dood and Waters. I'm feelin' it, Gunny. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090401, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: MAE and MAC are a major part of this downed economy and Frank and Dodd were agianst any regulation. Since 2002 people were trying to regulate and correct problems ans Lispy is on record numerous times in hearings saying there is nothing wrong so is Dood and Waters.", 
        "reply": " I'm feelin' it, Gunny. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 11:50:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by rm444: quote: Originally posted by GunnyRet03: MAE and MAC are a major part of this downed economy and Frank and Dodd were agianst any regulation. Since 2002 people were trying to regulate and correct problems ans Lispy is on record numerous times in hearings saying there is nothing wrong so is Dood and Waters. I'm feelin' it, Gunny.", 
        "intTime": 20090401, 
        "postID": 13, 
        "quote": "Originally posted by rm444: quote: Originally posted by GunnyRet03: MAE and MAC are a major part of this downed economy and Frank and Dodd were agianst any regulation. Since 2002 people were trying to regulate and correct problems ans Lispy is on record numerous times in hearings saying there is nothing wrong so is Dood and Waters. I'm feelin' it, Gunny.", 
        "reply": "", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 11:53:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by rm444: TY jdk. So CRA was already in force but it was 'strengthened' in the 90s which loosened standards and encouraged bad lending. Who 'strengthened' it? Legislative changes 1989 The Financial Institutions Reform Recovery and Enforcement Act of 1989 (FIRREA) was enacted by the 101st Congress and signed into law by President George H. W. Bush in the wake of the savings and loan crisis of the 1980s. As part of a general reform of the banking industry, it increased public oversight of the process of issuing CRA ratings to banks. It required the agencies to issue CRA ratings publicly and written performance evaluations using facts and data to support the agencies' conclusions. It also required a four-tiered CRA examination rating system with performance levels of 'Outstanding', 'Satisfactory', 'Needs to Improve', or 'Substantial Noncompliance'.[15] According to Ben Bernanke, this law greatly increased the ability of advocacy groups, researchers, and other analysts to \"perform more-sophisticated, quantitative analyses of banks' records,\" thereby influencing the lending policies of banks. Over time, community groups and nonprofit organizations established \"more-formalized and more-productive partnerships with banks.\"[9] [edit] Legislative changes 1992 Although not part of the CRA, in order to achieve similar aims the Federal Housing Enterprises Financial Safety and Soundness Act of 1992 required Fannie Mae and Freddie Mac, the two government sponsored enterprises that purchase and securitize mortgages, to devote a percentage of their lending to support affordable housing.[9] In October 2000, in order to expand the secondary market for affordable community-based mortgages and to increase liquidity for CRA-eligible loans, Fannie Mae committed to purchase and securitize $2 billion of \"MyCommunityMortgage\" loans.[20][21] In November 2000 Fannie Mae announced that the Department of Housing and Urban Development (“HUD”) would soon require it to dedicate 50% of its business to low- and moderate-income families.\" It stated that since 1997 Fannie Mae had done nearly $7 billion in CRA business with depository institutions, but its goal was $20 billion.[22] In 2001 Fannie Mae announced that it had acquired $10 billion in specially-targeted Community Reinvestment Act (CRA) loans more than one and a half years ahead of schedule, and announced its goal to finance over $500 billion in CRA business by 2010, about one third of loans anticipated to be financed by Fannie Mae during that period.[23] [edit] Legislative changes 1994 The Riegle-Neal Interstate Banking and Branching Efficiency Act of 1994, which repealed restrictions on interstate banking, listed the CRA ratings received by the out-of-state bank as a consideration when determining whether to allow interstate branches.[24] According to Bernanke, a surge in bank merger and acquisition activities followed the passing of the act, and advocacy groups increasingly used the public comment process to protest bank applications on CRA grounds. When applications were highly contested, federal agencies held public hearings to allow public comment on the bank's lending record. In response many institutions established separate business units and subsidiary corporations to facilitate CRA-related lending. Local and regional public-private partnerships and multi-bank loan consortia were formed to expand and manage such CRA-related lending.[9] [edit] Regulatory changes 1995 In July 1993, President Clinton asked regulators to reform the CRA in order to make examinations more consistent, clarify performance standards, and reduce cost and compliance burden.[15] Robert Rubin, the Assistant to the President for Economic Policy, under President Clinton, explained that this was in line with President Clinton's strategy to \"deal with the problems of the inner city and distressed rural communities\". Discussing the reasons for the Clinton administration's proposal to strengthen the CRA and further reduce red-lining, Lloyd Bentsen, Secretary of the Treasury at that time, affirmed his belief that availability of credit should not depend on where a person lives, \"The only thing that ought to matter on a loan application is whether or not you can pay it back, not where you live.\" Bentsen said that the proposed changes would \"make it easier for lenders to show how they're complying with the Community Reinvestment Act\", and \"cut back a lot of the paperwork and the cost on small business loans\".[13] In 1995, the CRA regulations were substantially revised to address criticisms that the regulations, and the agencies' implementation of them through the examination process, were too process-oriented, burdensome, and not sufficiently focused on actual results. The agencies also changed the CRA examination process to incorporate these revisions.[15] Information about banking institutions' CRA ratings were made available via web page for public comment.[13] The Office of the Comptroller of the Currency (OCC) also revised its regulations, allowing lenders subject to the CRA to claim community development loan credits for loans made to help finance the environmental cleanup or redevelopment of industrial sites when it was part of an effort to revitalize the low- and moderate-income community where the site was located.[25] During March 1995 congressional hearings William A. Niskanen, chair of the Cato Institute, criticized the proposals for political favoritism in allocating credit and micromanagement by regulators, and that there was no assurance that banks would not be expected to operate at a loss. He predicted they would be very costly to the economy and banking system, and that the primary long term effect would be to contract the banking system. He recommended Congress repeal the Act.[26] Responding to concerns that the CRA would lower bank profitability, a 1997 research paper by economists at the Federal Reserve found that \"[CRA] lenders active in lower-income neighborhoods and with lower-income borrowers appear to be as profitable as other mortgage-oriented commercial banks\".[27] Speaking in 2007, Federal Reserve Chair Ben Bernanke noted that, \"managers of financial institutions found that these loan portfolios, if properly underwritten and managed, could be profitable\" and that the loans \"usually did not involve disproportionately higher levels of default\".[9] According to a 2000 United States Department of the Treasury study of lending trends in 305 U.S. cities between 1993 and 1998, $467 billion in mortgage credit flowed from CRA-covered lenders to low- and medium-income borrowers and areas. In that period, the total number of loans to poorer Americans by CRA-eligible institutions rose by 39% while loans to wealthier individuals by CRA-covered institutions rose by 17%. The share of total US lending to low and medium income borrowers rose from 25% in 1993 to 28% in 1998 as a consequence. [28] In October 1997, First Union Capital Markets and Bear, Stearns & Co launched the first publicly available securitization of Community Reinvestment Act loans, issuing $384.6 million of such securities. The securities were guaranteed by Freddie Mac and had an implied \"AAA\" rating.[29][22] The public offering was several times oversubscribed, predominantly by money managers and insurance companies who were not buying them for CRA credit.[30] [edit] Legislative changes 1999 In 1999 the Congress enacted and President Clinton signed into law the Gramm-Leach-Bliley Act, also known as the \"Financial Services Modernization Act,\" which repealed the part of the Glass-Steagall Act, which prohibited a bank from offering a full range of investment, commercial banking, and insurance services. The bill was killed in 1998 because Senator Phil Gramm wanted the bill to expand the number of banks which no longer would be covered by the CRA. He also demanded full disclosure of any financial deals which community groups had with banks, accusing such groups of \"extortion.\" In 1999 Senators Christopher Dodd and Charles E. Schumer broke another deadlock by forcing a compromise between Gramm and the Clinton administration which wanted to prevent banks from expanding into insurance or securities unless they were compliant with the CRA. In the final compromise, the CRA would cover bank expansions into new lines of business, community groups would have to disclose certain kinds of financial deals with banks, and smaller banks would be reviewed less frequently for CRA compliance.[31][32][33] On signing the Gramm-Leach-Bliley Act , President Clinton said that it, \"establishes the principles that, as we expand the powers of banks, we will expand the reach of the [Community Reinvestment] Act\".[34] Cut and paste is the only answer I have. However, it looks like the same deregulation (repeal of Glass-Steagall Act) that precipitated the current excess of financial criminality put the CRA at risk (not strengthened) as well. The repubs wrote and the demo President signed what has pretty much allowed the crooks to run the jailhouse. It just goes to prove that neither the repubs nor the demos have a lock on crooked politicians. It also proves that most everyone will lay the blame on those they want to, facts be damned.", 
        "intTime": 20090401, 
        "postID": 14, 
        "quote": "Originally posted by rm444: TY jdk. So CRA was already in force but it was 'strengthened' in the 90s which loosened standards and encouraged bad lending. Who 'strengthened' it?", 
        "reply": " Legislative changes 1989 The Financial Institutions Reform Recovery and Enforcement Act of 1989 (FIRREA) was enacted by the 101st Congress and signed into law by President George H. W. Bush in the wake of the savings and loan crisis of the 1980s. As part of a general reform of the banking industry, it increased public oversight of the process of issuing CRA ratings to banks. It required the agencies to issue CRA ratings publicly and written performance evaluations using facts and data to support the agencies' conclusions. It also required a four-tiered CRA examination rating system with performance levels of 'Outstanding', 'Satisfactory', 'Needs to Improve', or 'Substantial Noncompliance'.[15] According to Ben Bernanke, this law greatly increased the ability of advocacy groups, researchers, and other analysts to \"perform more-sophisticated, quantitative analyses of banks' records,\" thereby influencing the lending policies of banks. Over time, community groups and nonprofit organizations established \"more-formalized and more-productive partnerships with banks.\"[9] [edit] Legislative changes 1992 Although not part of the CRA, in order to achieve similar aims the Federal Housing Enterprises Financial Safety and Soundness Act of 1992 required Fannie Mae and Freddie Mac, the two government sponsored enterprises that purchase and securitize mortgages, to devote a percentage of their lending to support affordable housing.[9] In October 2000, in order to expand the secondary market for affordable community-based mortgages and to increase liquidity for CRA-eligible loans, Fannie Mae committed to purchase and securitize $2 billion of \"MyCommunityMortgage\" loans.[20][21] In November 2000 Fannie Mae announced that the Department of Housing and Urban Development (“HUD”) would soon require it to dedicate 50% of its business to low- and moderate-income families.\" It stated that since 1997 Fannie Mae had done nearly $7 billion in CRA business with depository institutions, but its goal was $20 billion.[22] In 2001 Fannie Mae announced that it had acquired $10 billion in specially-targeted Community Reinvestment Act (CRA) loans more than one and a half years ahead of schedule, and announced its goal to finance over $500 billion in CRA business by 2010, about one third of loans anticipated to be financed by Fannie Mae during that period.[23] [edit] Legislative changes 1994 The Riegle-Neal Interstate Banking and Branching Efficiency Act of 1994, which repealed restrictions on interstate banking, listed the CRA ratings received by the out-of-state bank as a consideration when determining whether to allow interstate branches.[24] According to Bernanke, a surge in bank merger and acquisition activities followed the passing of the act, and advocacy groups increasingly used the public comment process to protest bank applications on CRA grounds. When applications were highly contested, federal agencies held public hearings to allow public comment on the bank's lending record. In response many institutions established separate business units and subsidiary corporations to facilitate CRA-related lending. Local and regional public-private partnerships and multi-bank loan consortia were formed to expand and manage such CRA-related lending.[9] [edit] Regulatory changes 1995 In July 1993, President Clinton asked regulators to reform the CRA in order to make examinations more consistent, clarify performance standards, and reduce cost and compliance burden.[15] Robert Rubin, the Assistant to the President for Economic Policy, under President Clinton, explained that this was in line with President Clinton's strategy to \"deal with the problems of the inner city and distressed rural communities\". Discussing the reasons for the Clinton administration's proposal to strengthen the CRA and further reduce red-lining, Lloyd Bentsen, Secretary of the Treasury at that time, affirmed his belief that availability of credit should not depend on where a person lives, \"The only thing that ought to matter on a loan application is whether or not you can pay it back, not where you live.\" Bentsen said that the proposed changes would \"make it easier for lenders to show how they're complying with the Community Reinvestment Act\", and \"cut back a lot of the paperwork and the cost on small business loans\".[13] In 1995, the CRA regulations were substantially revised to address criticisms that the regulations, and the agencies' implementation of them through the examination process, were too process-oriented, burdensome, and not sufficiently focused on actual results. The agencies also changed the CRA examination process to incorporate these revisions.[15] Information about banking institutions' CRA ratings were made available via web page for public comment.[13] The Office of the Comptroller of the Currency (OCC) also revised its regulations, allowing lenders subject to the CRA to claim community development loan credits for loans made to help finance the environmental cleanup or redevelopment of industrial sites when it was part of an effort to revitalize the low- and moderate-income community where the site was located.[25] During March 1995 congressional hearings William A. Niskanen, chair of the Cato Institute, criticized the proposals for political favoritism in allocating credit and micromanagement by regulators, and that there was no assurance that banks would not be expected to operate at a loss. He predicted they would be very costly to the economy and banking system, and that the primary long term effect would be to contract the banking system. He recommended Congress repeal the Act.[26] Responding to concerns that the CRA would lower bank profitability, a 1997 research paper by economists at the Federal Reserve found that \"[CRA] lenders active in lower-income neighborhoods and with lower-income borrowers appear to be as profitable as other mortgage-oriented commercial banks\".[27] Speaking in 2007, Federal Reserve Chair Ben Bernanke noted that, \"managers of financial institutions found that these loan portfolios, if properly underwritten and managed, could be profitable\" and that the loans \"usually did not involve disproportionately higher levels of default\".[9] According to a 2000 United States Department of the Treasury study of lending trends in 305 U.S. cities between 1993 and 1998, $467 billion in mortgage credit flowed from CRA-covered lenders to low- and medium-income borrowers and areas. In that period, the total number of loans to poorer Americans by CRA-eligible institutions rose by 39% while loans to wealthier individuals by CRA-covered institutions rose by 17%. The share of total US lending to low and medium income borrowers rose from 25% in 1993 to 28% in 1998 as a consequence. [28] In October 1997, First Union Capital Markets and Bear, Stearns & Co launched the first publicly available securitization of Community Reinvestment Act loans, issuing $384.6 million of such securities. The securities were guaranteed by Freddie Mac and had an implied \"AAA\" rating.[29][22] The public offering was several times oversubscribed, predominantly by money managers and insurance companies who were not buying them for CRA credit.[30] [edit] Legislative changes 1999 In 1999 the Congress enacted and President Clinton signed into law the Gramm-Leach-Bliley Act, also known as the \"Financial Services Modernization Act,\" which repealed the part of the Glass-Steagall Act, which prohibited a bank from offering a full range of investment, commercial banking, and insurance services. The bill was killed in 1998 because Senator Phil Gramm wanted the bill to expand the number of banks which no longer would be covered by the CRA. He also demanded full disclosure of any financial deals which community groups had with banks, accusing such groups of \"extortion.\" In 1999 Senators Christopher Dodd and Charles E. Schumer broke another deadlock by forcing a compromise between Gramm and the Clinton administration which wanted to prevent banks from expanding into insurance or securities unless they were compliant with the CRA. In the final compromise, the CRA would cover bank expansions into new lines of business, community groups would have to disclose certain kinds of financial deals with banks, and smaller banks would be reviewed less frequently for CRA compliance.[31][32][33] On signing the Gramm-Leach-Bliley Act , President Clinton said that it, \"establishes the principles that, as we expand the powers of banks, we will expand the reach of the [Community Reinvestment] Act\".[34] Cut and paste is the only answer I have. However, it looks like the same deregulation (repeal of Glass-Steagall Act) that precipitated the current excess of financial criminality put the CRA at risk (not strengthened) as well. The repubs wrote and the demo President signed what has pretty much allowed the crooks to run the jailhouse. It just goes to prove that neither the repubs nor the demos have a lock on crooked politicians. It also proves that most everyone will lay the blame on those they want to, facts be damned.", 
        "threadID": "409192893_5440074912001", 
        "time": "2009-04-01 12:17:00", 
        "title": "The Dirty Dozen!  No not the movie.", 
        "userID": "jdksfcret"
    }
]