[
    {
        "content": "With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good.", 
        "intTime": 20090306, 
        "postID": 1, 
        "quote": "", 
        "reply": "With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 13:04:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "intTime": 20090306, 
        "postID": 2, 
        "quote": "", 
        "reply": "No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 13:51:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "Fankhouser"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "intTime": 20090306, 
        "postID": 3, 
        "quote": "Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "reply": "", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:02:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "blane"
    }, 
    {
        "content": "Is Rushbo and illegal?? Is that why he's at the top of the news and the dems agenda??", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "", 
        "reply": "Is Rushbo and illegal?? Is that why he's at the top of the news and the dems agenda??", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:03:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "transport1"
    }, 
    {
        "content": "Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules.", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "", 
        "reply": "Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:17:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules. That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "Originally posted by john2x: Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules.", 
        "reply": " That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:21:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "transport1"
    }, 
    {
        "content": "I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "intTime": 20090306, 
        "postID": 7, 
        "quote": "", 
        "reply": "I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:53:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 Damn!~ I kinda suspected you worked for ACORN!", 
        "intTime": 20090306, 
        "postID": 8, 
        "quote": "Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "reply": " Damn!~ I kinda suspected you worked for ACORN!", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:55:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "navy8086"
    }, 
    {
        "content": "well your a real Sherlock Holmes...", 
        "intTime": 20090306, 
        "postID": 9, 
        "quote": "", 
        "reply": "well your a real Sherlock Holmes...", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:58:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: well your a real Sherlock Holmes... Elementary Watson ,,,", 
        "intTime": 20090306, 
        "postID": 10, 
        "quote": "Originally posted by scottrj50: well your a real Sherlock Holmes...", 
        "reply": " Elementary Watson ,,,", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 15:38:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "navy8086"
    }, 
    {
        "content": "More crossing the border southbound than north these days. Let ride a year or so with the Obama Admin's \"stimulus\" and they'll be RUNNING home, leaving little to clean up on this side. Hell, the \"dopers\" won't even be able to pay up!", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "", 
        "reply": "More crossing the border southbound than north these days. Let ride a year or so with the Obama Admin's \"stimulus\" and they'll be RUNNING home, leaving little to clean up on this side. Hell, the \"dopers\" won't even be able to pay up!", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 17:55:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it.", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "reply": " An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 18:10:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be.", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it.", 
        "reply": " Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 21:46:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass.", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be.", 
        "reply": " LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 22:10:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical. However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours?? And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close.", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical. However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours?? And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close.", 
        "reply": "", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 23:24:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief!", 
        "intTime": 20090307, 
        "postID": 16, 
        "quote": "Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows", 
        "reply": " In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief!", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 09:38:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by NM11AZ: quote: Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief! The anti-prop 8 argument is so ludicrous: that constitutional amendments (twice) passed by state voters are unconstitutional , that it seems even the CA supreme court won't support it.", 
        "intTime": 20090307, 
        "postID": 17, 
        "quote": "Originally posted by NM11AZ: quote: Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief!", 
        "reply": " The anti-prop 8 argument is so ludicrous: that constitutional amendments (twice) passed by state voters are unconstitutional , that it seems even the CA supreme court won't support it.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 09:57:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Iam surprise we haven't seen Refugees heading north from the fighting down there.", 
        "intTime": 20090307, 
        "postID": 18, 
        "quote": "", 
        "reply": "Iam surprise we haven't seen Refugees heading north from the fighting down there.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 10:17:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by scottrj50: well your a real Sherlock Holmes... Elementary Watson ,,, no no no...its: Elementary my dear Watson Elementary", 
        "intTime": 20090307, 
        "postID": 19, 
        "quote": "Originally posted by navy8086: quote: Originally posted by scottrj50: well your a real Sherlock Holmes... Elementary Watson ,,,", 
        "reply": " no no no...its: Elementary my dear Watson Elementary", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 10:22:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090307, 
        "postID": 20, 
        "quote": "Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "reply": " So you are a lawbreaker? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 10:51:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? I'm fairly sure he's kidding, but would it really suprise you if he weren't?", 
        "intTime": 20090307, 
        "postID": 21, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker?", 
        "reply": " I'm fairly sure he's kidding, but would it really suprise you if he weren't?", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 11:42:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? I'm fairly sure he's kidding, but would it really suprise you if he weren't? No not really since most Americans hire migrants and illegals all the time to do the menial jobs they wont or cant do. Sometimes to save a few bucksother times out of necessity. I just notified my gardener who Ive been doing business with for over thirty five years now that I woudnt be using his services this year because he was starting to use illegals. I couldnt find any others that didnt. So I bought a mower and will do it myself this year unless i can find a neighborhood kid. Much as I hate the Idea I cant be part of the problem. And then we had a heavy snow fall last week and at 72 it was to much for me and when the mexicans showed up I paid them 75 bucks to shovel, had no choice because local spoiled kids dont need the money. How times have changed.", 
        "intTime": 20090307, 
        "postID": 22, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? I'm fairly sure he's kidding, but would it really suprise you if he weren't?", 
        "reply": " No not really since most Americans hire migrants and illegals all the time to do the menial jobs they wont or cant do. Sometimes to save a few bucksother times out of necessity. I just notified my gardener who Ive been doing business with for over thirty five years now that I woudnt be using his services this year because he was starting to use illegals. I couldnt find any others that didnt. So I bought a mower and will do it myself this year unless i can find a neighborhood kid. Much as I hate the Idea I cant be part of the problem. And then we had a heavy snow fall last week and at 72 it was to much for me and when the mexicans showed up I paid them 75 bucks to shovel, had no choice because local spoiled kids dont need the money. How times have changed.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 12:16:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? So turn me into the Gestapo.... Frau Bruan", 
        "intTime": 20090307, 
        "postID": 23, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker?", 
        "reply": " So turn me into the Gestapo.... Frau Bruan", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 12:17:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders.", 
        "intTime": 20090307, 
        "postID": 24, 
        "quote": "", 
        "reply": "It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 12:43:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders. Our immigrations laws and quotas are set in place for a very important reason that is in the best interest of America. Once you violate our laws and unbalance our system leave law abiding people who could be an asset to the nation waiting on long waiting lists, your no more than a comon criminal. And for our officials to reward such behavior is sending the wrong message to the masses waiting to come in and to the ones breaking our laws by sneaking in and being rewarded.", 
        "intTime": 20090307, 
        "postID": 25, 
        "quote": "Originally posted by foxred03: It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders.", 
        "reply": " Our immigrations laws and quotas are set in place for a very important reason that is in the best interest of America. Once you violate our laws and unbalance our system leave law abiding people who could be an asset to the nation waiting on long waiting lists, your no more than a comon criminal. And for our officials to reward such behavior is sending the wrong message to the masses waiting to come in and to the ones breaking our laws by sneaking in and being rewarded.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 13:06:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask.", 
        "intTime": 20090307, 
        "postID": 26, 
        "quote": "", 
        "reply": "Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 13:09:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask. I think thats all any of us are saying. Respect our laws, be Screened for backround, tested for comunicable,diseases,Quaranteed when necessary, and then welcomed. Thats the system already in place and is being ignored for political reasons.", 
        "intTime": 20090307, 
        "postID": 27, 
        "quote": "Originally posted by foxred03: Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask.", 
        "reply": " I think thats all any of us are saying. Respect our laws, be Screened for backround, tested for comunicable,diseases,Quaranteed when necessary, and then welcomed. Thats the system already in place and is being ignored for political reasons.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 13:54:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you.If you want me to be impressed by your education, you should post more intelligently. A person with an \"Ivy League\" education would, in most cases, apply more critical thinking to their thought processes. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical.But - isn't that what you want? However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I?Not overtly - but, be honest: When you see a Latino in those places, do you think of illegal aliens? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours??From your posts, especially in a previous thread, you appear have a habit of generalizing that is pretty close to, it not actually, prejudicial stereotyping. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now.That's right - it's why it's better to get your cheap labor any way you can. Any ideas on who's been relied upon to do that? I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? They didn't get out of reach, largely because of migrant farm workers who were being used as cheap labor. Chavez met a lot of resistance for his efforts, as I'm sure you know. And much of that resistance had to do with increased labor costs. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case.Why do you keep using the term \"black community\" as though it were some sort of monolith, operating under a similar standard? That's a myth. Let it go. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society.You'd be hard-pressed to actually prove that, given the tone and tenor of a lot of your posts. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it.So, what' s up with all this talk about blacks, then? Have you not learned, through your Ivy League education, that virtually all Americans have a similar experience climbing up the American socioeconomic ladder? If you recognize that, you'd see the folly in trying to apply a group dynamic to it. It goes without saying that because of racial or ethnic uniqueness, some individuals or groups have had more difficulty, but that doesn't erase the fact that we all have common experiences here. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close. THey hit \"close\" in that I'm tired of dealing with it - and to be honest, it was nice to live for 12 years without being one of the usual suspects, or being seen as \"exceptional\", or something similar. So - as I've accepted the fact that people like you still walk this Earth, it is still a drag to have to deal with it. Perhaps if I were my children's ages, it wouldn't be a problem. But, unlike them, I have memory of those things, and there are still people like me on the opposite side who play the same games, as well. Perhaps we should just hurry up and die or something...", 
        "intTime": 20090309, 
        "postID": 28, 
        "quote": "Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you.If you want me to be impressed by your education, you should post more intelligently. A person with an \"Ivy League\" education would, in most cases, apply more critical thinking to their thought processes. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical.But - isn't that what you want? However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I?Not overtly - but, be honest: When you see a Latino in those places, do you think of illegal aliens? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours??From your posts, especially in a previous thread, you appear have a habit of generalizing that is pretty close to, it not actually, prejudicial stereotyping. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now.That's right - it's why it's better to get your cheap labor any way you can. Any ideas on who's been relied upon to do that? I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? They didn't get out of reach, largely because of migrant farm workers who were being used as cheap labor. Chavez met a lot of resistance for his efforts, as I'm sure you know. And much of that resistance had to do with increased labor costs. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case.Why do you keep using the term \"black community\" as though it were some sort of monolith, operating under a similar standard? That's a myth. Let it go. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society.You'd be hard-pressed to actually prove that, given the tone and tenor of a lot of your posts. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it.So, what' s up with all this talk about blacks, then? Have you not learned, through your Ivy League education, that virtually all Americans have a similar experience climbing up the American socioeconomic ladder? If you recognize that, you'd see the folly in trying to apply a group dynamic to it. It goes without saying that because of racial or ethnic uniqueness, some individuals or groups have had more difficulty, but that doesn't erase the fact that we all have common experiences here. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close. THey hit \"close\" in that I'm tired of dealing with it - and to be honest, it was nice to live for 12 years without being one of the usual suspects, or being seen as \"exceptional\", or something similar. So - as I've accepted the fact that people like you still walk this Earth, it is still a drag to have to deal with it. Perhaps if I were my children's ages, it wouldn't be a problem. But, unlike them, I have memory of those things, and there are still people like me on the opposite side who play the same games, as well. Perhaps we should just hurry up and die or something...", 
        "reply": "", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-09 08:04:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good. Didn't you hear? He had a private meeting with Brad Pitt. Priorities! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090309, 
        "postID": 29, 
        "quote": "Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good.", 
        "reply": " Didn't you hear? He had a private meeting with Brad Pitt. Priorities! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-09 11:10:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good. Didn't you hear? He had a private meeting with Brad Pitt. Priorities! I dont care what he does as long as it works. the end results is all im concerned with so Ill just give him some time and let him do his job for now anyway.", 
        "intTime": 20090309, 
        "postID": 30, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good. Didn't you hear? He had a private meeting with Brad Pitt. Priorities!", 
        "reply": " I dont care what he does as long as it works. the end results is all im concerned with so Ill just give him some time and let him do his job for now anyway.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-09 11:30:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good.", 
        "intTime": 20090306, 
        "postID": 31, 
        "quote": "", 
        "reply": "With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 13:04:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "", 
        "reply": "No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 13:51:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "Fankhouser"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "reply": "", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:02:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "blane"
    }, 
    {
        "content": "Is Rushbo and illegal?? Is that why he's at the top of the news and the dems agenda??", 
        "intTime": 20090306, 
        "postID": 34, 
        "quote": "", 
        "reply": "Is Rushbo and illegal?? Is that why he's at the top of the news and the dems agenda??", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:03:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "transport1"
    }, 
    {
        "content": "Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules.", 
        "intTime": 20090306, 
        "postID": 35, 
        "quote": "", 
        "reply": "Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:17:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules. That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows", 
        "intTime": 20090306, 
        "postID": 36, 
        "quote": "Originally posted by john2x: Topic: has everyone forgotten about the illegals? Fankhouser Posted Fri 06 March 2009 01:51 PM No, I have not forgotten about the illegals. Looks like we have one in the White House. Wont really matter if we dont put a lid on it. At the rate were going and soon as they push this amnesty BS down our throats they will be the majority. And in America the Majority Rules.", 
        "reply": " That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:21:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "transport1"
    }, 
    {
        "content": "I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "intTime": 20090306, 
        "postID": 37, 
        "quote": "", 
        "reply": "I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:53:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 Damn!~ I kinda suspected you worked for ACORN!", 
        "intTime": 20090306, 
        "postID": 38, 
        "quote": "Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "reply": " Damn!~ I kinda suspected you worked for ACORN!", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:55:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "navy8086"
    }, 
    {
        "content": "well your a real Sherlock Holmes...", 
        "intTime": 20090306, 
        "postID": 39, 
        "quote": "", 
        "reply": "well your a real Sherlock Holmes...", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 14:58:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: well your a real Sherlock Holmes... Elementary Watson ,,,", 
        "intTime": 20090306, 
        "postID": 40, 
        "quote": "Originally posted by scottrj50: well your a real Sherlock Holmes...", 
        "reply": " Elementary Watson ,,,", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 15:38:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "navy8086"
    }, 
    {
        "content": "More crossing the border southbound than north these days. Let ride a year or so with the Obama Admin's \"stimulus\" and they'll be RUNNING home, leaving little to clean up on this side. Hell, the \"dopers\" won't even be able to pay up!", 
        "intTime": 20090306, 
        "postID": 41, 
        "quote": "", 
        "reply": "More crossing the border southbound than north these days. Let ride a year or so with the Obama Admin's \"stimulus\" and they'll be RUNNING home, leaving little to clean up on this side. Hell, the \"dopers\" won't even be able to pay up!", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 17:55:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it.", 
        "intTime": 20090306, 
        "postID": 42, 
        "quote": "Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House.", 
        "reply": " An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 18:10:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be.", 
        "intTime": 20090306, 
        "postID": 43, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it.", 
        "reply": " Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 21:46:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass.", 
        "intTime": 20090306, 
        "postID": 44, 
        "quote": "Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be.", 
        "reply": " LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 22:10:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical. However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours?? And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close.", 
        "intTime": 20090306, 
        "postID": 45, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical. However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours?? And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now. I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close.", 
        "reply": "", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-06 23:24:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief!", 
        "intTime": 20090307, 
        "postID": 46, 
        "quote": "Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows", 
        "reply": " In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief!", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 09:38:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by NM11AZ: quote: Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief! The anti-prop 8 argument is so ludicrous: that constitutional amendments (twice) passed by state voters are unconstitutional , that it seems even the CA supreme court won't support it.", 
        "intTime": 20090307, 
        "postID": 47, 
        "quote": "Originally posted by NM11AZ: quote: Originally posted by transport1: That's about a bunch of hooey anymore. Think the Kalifornia supremes are gonna throw out a bill that 52% of the popular vote passed, but a few loudmouth ****** are protesting. Look at some of them people, they oughta be in carnival side shows In a rare example of logical thought the CA supremes gave more credence to the validity of the majority opinion of voters on Proposition 8. I maintained that the question was not homosexual marriage so much as the democratic process on the local newsrag blog site but was branded a racist ( I guess gays are a seperate race now) by some posters. The moderator of the site didn't get any of the comments so blocked everything that used words longer than 5 letters. The air in CA is thick with smoke from the candlelight vigils and the tee shirt printers have gone into overtime production, good grief!", 
        "reply": " The anti-prop 8 argument is so ludicrous: that constitutional amendments (twice) passed by state voters are unconstitutional , that it seems even the CA supreme court won't support it.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 09:57:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Iam surprise we haven't seen Refugees heading north from the fighting down there.", 
        "intTime": 20090307, 
        "postID": 48, 
        "quote": "", 
        "reply": "Iam surprise we haven't seen Refugees heading north from the fighting down there.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 10:17:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by scottrj50: well your a real Sherlock Holmes... Elementary Watson ,,, no no no...its: Elementary my dear Watson Elementary", 
        "intTime": 20090307, 
        "postID": 49, 
        "quote": "Originally posted by navy8086: quote: Originally posted by scottrj50: well your a real Sherlock Holmes... Elementary Watson ,,,", 
        "reply": " no no no...its: Elementary my dear Watson Elementary", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 10:22:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090307, 
        "postID": 50, 
        "quote": "Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010", 
        "reply": " So you are a lawbreaker? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 10:51:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? I'm fairly sure he's kidding, but would it really suprise you if he weren't?", 
        "intTime": 20090307, 
        "postID": 51, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker?", 
        "reply": " I'm fairly sure he's kidding, but would it really suprise you if he weren't?", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 11:42:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? I'm fairly sure he's kidding, but would it really suprise you if he weren't? No not really since most Americans hire migrants and illegals all the time to do the menial jobs they wont or cant do. Sometimes to save a few bucksother times out of necessity. I just notified my gardener who Ive been doing business with for over thirty five years now that I woudnt be using his services this year because he was starting to use illegals. I couldnt find any others that didnt. So I bought a mower and will do it myself this year unless i can find a neighborhood kid. Much as I hate the Idea I cant be part of the problem. And then we had a heavy snow fall last week and at 72 it was to much for me and when the mexicans showed up I paid them 75 bucks to shovel, had no choice because local spoiled kids dont need the money. How times have changed.", 
        "intTime": 20090307, 
        "postID": 52, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? I'm fairly sure he's kidding, but would it really suprise you if he weren't?", 
        "reply": " No not really since most Americans hire migrants and illegals all the time to do the menial jobs they wont or cant do. Sometimes to save a few bucksother times out of necessity. I just notified my gardener who Ive been doing business with for over thirty five years now that I woudnt be using his services this year because he was starting to use illegals. I couldnt find any others that didnt. So I bought a mower and will do it myself this year unless i can find a neighborhood kid. Much as I hate the Idea I cant be part of the problem. And then we had a heavy snow fall last week and at 72 it was to much for me and when the mexicans showed up I paid them 75 bucks to shovel, had no choice because local spoiled kids dont need the money. How times have changed.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 12:16:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker? So turn me into the Gestapo.... Frau Bruan", 
        "intTime": 20090307, 
        "postID": 53, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by scottrj50: I hire them all the time and register them to vote...Worked out pretty good last November looking forward 2010 So you are a lawbreaker?", 
        "reply": " So turn me into the Gestapo.... Frau Bruan", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 12:17:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders.", 
        "intTime": 20090307, 
        "postID": 54, 
        "quote": "", 
        "reply": "It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 12:43:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders. Our immigrations laws and quotas are set in place for a very important reason that is in the best interest of America. Once you violate our laws and unbalance our system leave law abiding people who could be an asset to the nation waiting on long waiting lists, your no more than a comon criminal. And for our officials to reward such behavior is sending the wrong message to the masses waiting to come in and to the ones breaking our laws by sneaking in and being rewarded.", 
        "intTime": 20090307, 
        "postID": 55, 
        "quote": "Originally posted by foxred03: It is ridiculous to blame the people who come to this country looking for a better life. Especially when our government doesn't care. I'm all for immigration. I'm not a closet racist who decries \"illegal immigration\" and is ****ed off at darker skinned people. I just want people screened to check for a criminal background and put into the system so that they pay taxes and help support our society. This is the government's fault, not the immigrant's. We are responsible for securing our borders.", 
        "reply": " Our immigrations laws and quotas are set in place for a very important reason that is in the best interest of America. Once you violate our laws and unbalance our system leave law abiding people who could be an asset to the nation waiting on long waiting lists, your no more than a comon criminal. And for our officials to reward such behavior is sending the wrong message to the masses waiting to come in and to the ones breaking our laws by sneaking in and being rewarded.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 13:06:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask.", 
        "intTime": 20090307, 
        "postID": 56, 
        "quote": "", 
        "reply": "Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 13:09:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask. I think thats all any of us are saying. Respect our laws, be Screened for backround, tested for comunicable,diseases,Quaranteed when necessary, and then welcomed. Thats the system already in place and is being ignored for political reasons.", 
        "intTime": 20090307, 
        "postID": 57, 
        "quote": "Originally posted by foxred03: Whatever, it's the government's job to enforce these laws. Like the War on Drugs, the legislation against illegal immigration has been given little attention and is an abject failure. Immigrants built this country and continue to build it. I just want these people screened and put on the books. That is all I ask.", 
        "reply": " I think thats all any of us are saying. Respect our laws, be Screened for backround, tested for comunicable,diseases,Quaranteed when necessary, and then welcomed. Thats the system already in place and is being ignored for political reasons.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-07 13:54:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you.If you want me to be impressed by your education, you should post more intelligently. A person with an \"Ivy League\" education would, in most cases, apply more critical thinking to their thought processes. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical.But - isn't that what you want? However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I?Not overtly - but, be honest: When you see a Latino in those places, do you think of illegal aliens? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours??From your posts, especially in a previous thread, you appear have a habit of generalizing that is pretty close to, it not actually, prejudicial stereotyping. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now.That's right - it's why it's better to get your cheap labor any way you can. Any ideas on who's been relied upon to do that? I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? They didn't get out of reach, largely because of migrant farm workers who were being used as cheap labor. Chavez met a lot of resistance for his efforts, as I'm sure you know. And much of that resistance had to do with increased labor costs. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case.Why do you keep using the term \"black community\" as though it were some sort of monolith, operating under a similar standard? That's a myth. Let it go. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society.You'd be hard-pressed to actually prove that, given the tone and tenor of a lot of your posts. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it.So, what' s up with all this talk about blacks, then? Have you not learned, through your Ivy League education, that virtually all Americans have a similar experience climbing up the American socioeconomic ladder? If you recognize that, you'd see the folly in trying to apply a group dynamic to it. It goes without saying that because of racial or ethnic uniqueness, some individuals or groups have had more difficulty, but that doesn't erase the fact that we all have common experiences here. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close. THey hit \"close\" in that I'm tired of dealing with it - and to be honest, it was nice to live for 12 years without being one of the usual suspects, or being seen as \"exceptional\", or something similar. So - as I've accepted the fact that people like you still walk this Earth, it is still a drag to have to deal with it. Perhaps if I were my children's ages, it wouldn't be a problem. But, unlike them, I have memory of those things, and there are still people like me on the opposite side who play the same games, as well. Perhaps we should just hurry up and die or something...", 
        "intTime": 20090309, 
        "postID": 58, 
        "quote": "Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by john2x: quote: Originally posted by mcgreer: quote: Originally posted by Fankhouser: No, I have not forgotten about the illegals. Looks like we have one in the White House. An \"illegal\" what? As far as the illegal immigrant issue, it was used in 2004 as a means to hold up flagging political support - that's all. The majority of Americans and her elected officials don't really care about illegal immigration. If they did care, it would have been taken care of decades ago. They served as a nice means of cheap labor in this country for decades, and as long as your produce was cheap, you didn't care. As long as you had someone to do the dirty, low paying work you didn't want to do, you didn't care. Slavery was illegal, and they were the next best thing. They've been nothing more than indentured servants. I think this four-year \"outrage\" was fabricated, and, once again, a bunch of suckers got duped. Those illegals aren't going anywhere anytime soon, so you may as well face the facts and move on. There's nothing you can do about it. Cheap you say? What about the costs to school them give them medicaide,incarceration, and now social security benefits? How much more could a head of lettuce cost if we paid Americans a living wage? Why dont we just give them amnesty and reparations for thier indentured servatude. It would give Jessy and al something to do theve had plenty of practice and know the drill. Besides what more can they possibly do for the black segment of society they will soon be out of a job. These 12 to 20 million illegal aliens arent picking produce as you would like to portray we have that mechanized. They have infiltrated every segment of labor including all phases of construction,processing plants,slaughter houses meat packing, and they undermine American standards putting Americans out of work. The money they make is sent home and not circulated in the US many pay little or no tax. You got to be talking out your azz because your head knows better. When the vast majority of the nation wants them gone and the laws enforced thats what should be. Politicians work for us not the other way around, or so it should be. LOL Before you speak of someone who's talking from somewhere other than their mouths, you should take the time to educate yourself. News flash for you Mac I was well educated,Ivy league I might and had a 160+ IQ and always finished in the top 1% of any course I ever took. dont let the grammar and typos fool you.If you want me to be impressed by your education, you should post more intelligently. A person with an \"Ivy League\" education would, in most cases, apply more critical thinking to their thought processes. I don't know where you get your information - and I don't think I want to know, frankly - but you might do well to get some other sources. If someone can tell you that there are 12 to 20 million illegals here, that would imply that they're all accounted for, wouldn't it? So, why haven't they all been rounded up? Bet you never thought of that, did you? You might notice if you werent so defensive That between 12 to 20 million is quite a spread and obviously an estimate That has been constantly reported. so I might ask the same question where do you get your info from? And as far as finding and deporting that many people, The cost would be astronomical.But - isn't that what you want? However if the politicians really wanted them gone they would cut off all aid and fine heavily anyone who was found to employ or house them, and make schools responsible for checking green cards. They then would self deport at no costs to the taxpayers who have spent to much already. And to speed things up a bit they could offer rewards to whistle blowers. \"Infiltrated\"...are you serious? This \"infiltration\" you speak of has been facilitated by officials who allowed business owners to use illegals to keep their costs down. That is absolutely correct. And don't think that every Latino you see in a factory or on the street on a construction project is illegal. I never said they were did I?Not overtly - but, be honest: When you see a Latino in those places, do you think of illegal aliens? That's b.s. - but considering your attitudes toward nonwhites, not surprising. And don't start with that other nonsense you tried to peddle in the other thread. What attitude is that? And what nonsense are you refering to? A different view than yours??From your posts, especially in a previous thread, you appear have a habit of generalizing that is pretty close to, it not actually, prejudicial stereotyping. And, how much would a head of lettuce cost if we gave Americans a living wage? A hell of a lot more than it costs now.That's right - it's why it's better to get your cheap labor any way you can. Any ideas on who's been relied upon to do that? I suggest you do the math. Didnt Chavez organized the grape growers and get them a living wage. Did the price of grapes become out of reach? They didn't get out of reach, largely because of migrant farm workers who were being used as cheap labor. Chavez met a lot of resistance for his efforts, as I'm sure you know. And much of that resistance had to do with increased labor costs. \"What more can they possibly do for the black segment of society...\" What does that mean? What do \"Jessy and al\" have to do with this? It means theres not much more they can champion. They are the champions for the black community that lead the marches for equality, and foment unrest when police officer do thier jobs,But you already knew that so why do you ask? To make me appear rascist? Thats just not the case.Why do you keep using the term \"black community\" as though it were some sort of monolith, operating under a similar standard? That's a myth. Let it go. You have a racial problem. You'd never admit it, but that was pretty well established on that other stupid thread. If I had a racial problem, why wouldnt I admitt It? do you actually think I would give a rats azz what you or other thought? Please dont flatter youself I say it the way it is and dont pull my punches. Fact is I have no problem with any race, only the individuals in all races that refuse to conform to society.You'd be hard-pressed to actually prove that, given the tone and tenor of a lot of your posts. You have a problem with brown people, pal. There are just too damned many of 'em running around. Some of you guys with this siege mentality of yours are really a pain in the ass. As I said and will repeat I have no problem with any race, Its the individuals who use the color of thier skin to sit on thier azzes for generations milk the system while crying Racisim and expect me to pay for it.So, what' s up with all this talk about blacks, then? Have you not learned, through your Ivy League education, that virtually all Americans have a similar experience climbing up the American socioeconomic ladder? If you recognize that, you'd see the folly in trying to apply a group dynamic to it. It goes without saying that because of racial or ethnic uniqueness, some individuals or groups have had more difficulty, but that doesn't erase the fact that we all have common experiences here. And as far as to many running around I wouldnt notice that living in my lilly white Gated community as you would say. Get a grip McGreer you are you own worst enemy and a sensitive reverse rascist for finding fault with some of the things Ive made. Maybe they hit to close. THey hit \"close\" in that I'm tired of dealing with it - and to be honest, it was nice to live for 12 years without being one of the usual suspects, or being seen as \"exceptional\", or something similar. So - as I've accepted the fact that people like you still walk this Earth, it is still a drag to have to deal with it. Perhaps if I were my children's ages, it wouldn't be a problem. But, unlike them, I have memory of those things, and there are still people like me on the opposite side who play the same games, as well. Perhaps we should just hurry up and die or something...", 
        "reply": "", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-09 08:04:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good. Didn't you hear? He had a private meeting with Brad Pitt. Priorities! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090309, 
        "postID": 59, 
        "quote": "Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good.", 
        "reply": " Didn't you hear? He had a private meeting with Brad Pitt. Priorities! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-09 11:10:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good. Didn't you hear? He had a private meeting with Brad Pitt. Priorities! I dont care what he does as long as it works. the end results is all im concerned with so Ill just give him some time and let him do his job for now anyway.", 
        "intTime": 20090309, 
        "postID": 60, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by john2x: With the jobless rate climbing and the economy tanking Why isnt more focus being put on this illegal immigration problem and the balaance of inports vrs exports? Its really all about jobs if we want to fix the problem, the illegals have to go and the imports have to be limited to the amount we export. Throwing money around to aleviate the impact it has had on americans isnt going to fix the problem. Its like putting a band aid on a cancer. The problem must be attacked at its root cause. Its like the roof is leaking and were in the basement trying to fix it. I didnt vote for obama but am supporting him and giving him time to show us what he has and right now it aint looking to good. Didn't you hear? He had a private meeting with Brad Pitt. Priorities!", 
        "reply": " I dont care what he does as long as it works. the end results is all im concerned with so Ill just give him some time and let him do his job for now anyway.", 
        "threadID": "409192893_3530021712001", 
        "time": "2009-03-09 11:30:00", 
        "title": "has everyone forgotten about the illegals?", 
        "userID": "john2x"
    }
]