[
    {
        "content": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:10:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "", 
        "reply": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:45:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "reply": " I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 15:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Boospar"
    }, 
    {
        "content": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "", 
        "reply": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:06:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.'", 
        "reply": " Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "intTime": 20090309, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:11:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class. One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "intTime": 20090309, 
        "postID": 7, 
        "quote": "Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "reply": " One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:16:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "intTime": 20090309, 
        "postID": 8, 
        "quote": "", 
        "reply": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:22:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Duster6"
    }, 
    {
        "content": "Coulda been worse... A \"wally-world\" gift card", 
        "intTime": 20090309, 
        "postID": 9, 
        "quote": "", 
        "reply": "Coulda been worse... A \"wally-world\" gift card", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:24:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Yes disgraceful.", 
        "intTime": 20090309, 
        "postID": 10, 
        "quote": "", 
        "reply": "Yes disgraceful.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:31:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "intTime": 20090309, 
        "postID": 11, 
        "quote": "Originally posted by FrJohn1123: Yes disgraceful.", 
        "reply": " So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:37:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "intTime": 20090309, 
        "postID": 12, 
        "quote": "", 
        "reply": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "intTime": 20090309, 
        "postID": 13, 
        "quote": "", 
        "reply": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:53:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "MANFREDGERD"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him. what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "intTime": 20090309, 
        "postID": 14, 
        "quote": "Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "reply": " what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:04:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "intTime": 20090309, 
        "postID": 15, 
        "quote": "", 
        "reply": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:07:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "Maybe he should have given him the state of Texas?", 
        "intTime": 20090309, 
        "postID": 16, 
        "quote": "", 
        "reply": "Maybe he should have given him the state of Texas?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "intTime": 20090309, 
        "postID": 17, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "reply": " Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:13:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press). so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "intTime": 20090309, 
        "postID": 18, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "reply": " so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:23:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ... quote: GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\" Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "intTime": 20090309, 
        "postID": 19, 
        "quote": "GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\"", 
        "reply": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ...  Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:26:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: ... amateurs Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "intTime": 20090309, 
        "postID": 20, 
        "quote": "... amateurs", 
        "reply": " Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:34:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "intTime": 20090309, 
        "postID": 21, 
        "quote": "“You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged.", 
        "reply": " Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:38:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know. I'd like an example of mistake for the George Washington presidency.", 
        "intTime": 20090309, 
        "postID": 22, 
        "quote": "Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "reply": " I'd like an example of mistake for the George Washington presidency.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:39:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "intTime": 20090309, 
        "postID": 23, 
        "quote": "", 
        "reply": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:55:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "intTime": 20090309, 
        "postID": 24, 
        "quote": "Fact is all administrations have their share of mistakes.", 
        "reply": " True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:30:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama.... The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "intTime": 20090309, 
        "postID": 25, 
        "quote": "Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "reply": " The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:41:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "intTime": 20090309, 
        "postID": 26, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:46:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "intTime": 20090309, 
        "postID": 27, 
        "quote": "", 
        "reply": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "intTime": 20090309, 
        "postID": 28, 
        "quote": "", 
        "reply": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:50:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "intTime": 20090309, 
        "postID": 29, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "intTime": 20090309, 
        "postID": 30, 
        "quote": "", 
        "reply": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 19:12:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "intTime": 20090309, 
        "postID": 31, 
        "quote": "", 
        "reply": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:10:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "intTime": 20090309, 
        "postID": 32, 
        "quote": "", 
        "reply": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:45:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "intTime": 20090309, 
        "postID": 33, 
        "quote": "Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "reply": " I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 15:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Boospar"
    }, 
    {
        "content": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "intTime": 20090309, 
        "postID": 34, 
        "quote": "", 
        "reply": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:06:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "intTime": 20090309, 
        "postID": 35, 
        "quote": "Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.'", 
        "reply": " Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "intTime": 20090309, 
        "postID": 36, 
        "quote": "", 
        "reply": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:11:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class. One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "intTime": 20090309, 
        "postID": 37, 
        "quote": "Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "reply": " One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:16:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "intTime": 20090309, 
        "postID": 38, 
        "quote": "", 
        "reply": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:22:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Duster6"
    }, 
    {
        "content": "Coulda been worse... A \"wally-world\" gift card", 
        "intTime": 20090309, 
        "postID": 39, 
        "quote": "", 
        "reply": "Coulda been worse... A \"wally-world\" gift card", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:24:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Yes disgraceful.", 
        "intTime": 20090309, 
        "postID": 40, 
        "quote": "", 
        "reply": "Yes disgraceful.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:31:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "intTime": 20090309, 
        "postID": 41, 
        "quote": "Originally posted by FrJohn1123: Yes disgraceful.", 
        "reply": " So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:37:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "intTime": 20090309, 
        "postID": 42, 
        "quote": "", 
        "reply": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "intTime": 20090309, 
        "postID": 43, 
        "quote": "", 
        "reply": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:53:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "MANFREDGERD"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him. what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "intTime": 20090309, 
        "postID": 44, 
        "quote": "Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "reply": " what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:04:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "intTime": 20090309, 
        "postID": 45, 
        "quote": "", 
        "reply": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:07:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "Maybe he should have given him the state of Texas?", 
        "intTime": 20090309, 
        "postID": 46, 
        "quote": "", 
        "reply": "Maybe he should have given him the state of Texas?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "intTime": 20090309, 
        "postID": 47, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "reply": " Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:13:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press). so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "intTime": 20090309, 
        "postID": 48, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "reply": " so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:23:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ... quote: GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\" Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "intTime": 20090309, 
        "postID": 49, 
        "quote": "GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\"", 
        "reply": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ...  Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:26:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: ... amateurs Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "intTime": 20090309, 
        "postID": 50, 
        "quote": "... amateurs", 
        "reply": " Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:34:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "intTime": 20090309, 
        "postID": 51, 
        "quote": "“You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged.", 
        "reply": " Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:38:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know. I'd like an example of mistake for the George Washington presidency.", 
        "intTime": 20090309, 
        "postID": 52, 
        "quote": "Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "reply": " I'd like an example of mistake for the George Washington presidency.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:39:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "intTime": 20090309, 
        "postID": 53, 
        "quote": "", 
        "reply": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:55:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "intTime": 20090309, 
        "postID": 54, 
        "quote": "Fact is all administrations have their share of mistakes.", 
        "reply": " True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:30:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama.... The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "intTime": 20090309, 
        "postID": 55, 
        "quote": "Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "reply": " The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:41:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "intTime": 20090309, 
        "postID": 56, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:46:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "intTime": 20090309, 
        "postID": 57, 
        "quote": "", 
        "reply": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "intTime": 20090309, 
        "postID": 58, 
        "quote": "", 
        "reply": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:50:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "intTime": 20090309, 
        "postID": 59, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "intTime": 20090309, 
        "postID": 60, 
        "quote": "", 
        "reply": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 19:12:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "intTime": 20090309, 
        "postID": 61, 
        "quote": "", 
        "reply": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:10:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "intTime": 20090309, 
        "postID": 62, 
        "quote": "", 
        "reply": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:45:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "intTime": 20090309, 
        "postID": 63, 
        "quote": "Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "reply": " I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 15:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Boospar"
    }, 
    {
        "content": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "intTime": 20090309, 
        "postID": 64, 
        "quote": "", 
        "reply": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:06:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "intTime": 20090309, 
        "postID": 65, 
        "quote": "Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.'", 
        "reply": " Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "intTime": 20090309, 
        "postID": 66, 
        "quote": "", 
        "reply": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:11:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class. One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "intTime": 20090309, 
        "postID": 67, 
        "quote": "Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "reply": " One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:16:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "intTime": 20090309, 
        "postID": 68, 
        "quote": "", 
        "reply": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:22:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Duster6"
    }, 
    {
        "content": "Coulda been worse... A \"wally-world\" gift card", 
        "intTime": 20090309, 
        "postID": 69, 
        "quote": "", 
        "reply": "Coulda been worse... A \"wally-world\" gift card", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:24:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Yes disgraceful.", 
        "intTime": 20090309, 
        "postID": 70, 
        "quote": "", 
        "reply": "Yes disgraceful.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:31:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "intTime": 20090309, 
        "postID": 71, 
        "quote": "Originally posted by FrJohn1123: Yes disgraceful.", 
        "reply": " So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:37:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "intTime": 20090309, 
        "postID": 72, 
        "quote": "", 
        "reply": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "intTime": 20090309, 
        "postID": 73, 
        "quote": "", 
        "reply": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:53:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "MANFREDGERD"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him. what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "intTime": 20090309, 
        "postID": 74, 
        "quote": "Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "reply": " what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:04:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "intTime": 20090309, 
        "postID": 75, 
        "quote": "", 
        "reply": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:07:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "Maybe he should have given him the state of Texas?", 
        "intTime": 20090309, 
        "postID": 76, 
        "quote": "", 
        "reply": "Maybe he should have given him the state of Texas?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "intTime": 20090309, 
        "postID": 77, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "reply": " Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:13:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press). so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "intTime": 20090309, 
        "postID": 78, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "reply": " so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:23:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ... quote: GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\" Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "intTime": 20090309, 
        "postID": 79, 
        "quote": "GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\"", 
        "reply": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ...  Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:26:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: ... amateurs Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "intTime": 20090309, 
        "postID": 80, 
        "quote": "... amateurs", 
        "reply": " Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:34:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "intTime": 20090309, 
        "postID": 81, 
        "quote": "“You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged.", 
        "reply": " Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:38:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know. I'd like an example of mistake for the George Washington presidency.", 
        "intTime": 20090309, 
        "postID": 82, 
        "quote": "Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "reply": " I'd like an example of mistake for the George Washington presidency.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:39:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "intTime": 20090309, 
        "postID": 83, 
        "quote": "", 
        "reply": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:55:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "intTime": 20090309, 
        "postID": 84, 
        "quote": "Fact is all administrations have their share of mistakes.", 
        "reply": " True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:30:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama.... The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "intTime": 20090309, 
        "postID": 85, 
        "quote": "Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "reply": " The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:41:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "intTime": 20090309, 
        "postID": 86, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:46:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "intTime": 20090309, 
        "postID": 87, 
        "quote": "", 
        "reply": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "intTime": 20090309, 
        "postID": 88, 
        "quote": "", 
        "reply": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:50:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "intTime": 20090309, 
        "postID": 89, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "intTime": 20090309, 
        "postID": 90, 
        "quote": "", 
        "reply": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 19:12:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "intTime": 20090309, 
        "postID": 91, 
        "quote": "", 
        "reply": "What a great image Barry left.... \"British prime minister Gordon Brown thought long and hard about what gift to bring on his visit to the White House last week. Barack Obama is the first African-American president, so the prime minister gave him an ornamental desk-pen holder hewn from the timbers of one of the Royal Navy's anti-slaving ships of the 19th century, HMS Gannet. Even more appropriate, in 1909 the Gannet was renamed HMS President. The president's guest also presented him with the framed commission for HMS Resolute, the lost British ship retrieved from the Arctic and returned by America to London, and whose timbers were used for a thank-you gift Queen Victoria sent to Rutherford Hayes: the handsome desk that now sits in the Oval Office.And, just to round things out, as a little stocking stuffer, Gordon Brown gave President Obama a first edition of Sir Martin Gilbert's seven-volume biography of Winston Churchill. In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Evidently, the White House gift shop was all out of 'MY GOVERNMENT DELEGATION WENT TO WASHINGTON AND ALL I GOT WAS THIS LOUSY T-SHIRT' T-shirts. Still, the 'classic American movies' set is a pretty good substitute, and it can set you back as much as $38.99 at Wal-Mart.\" --columnist Mark Steyn", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:10:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "intTime": 20090309, 
        "postID": 92, 
        "quote": "", 
        "reply": "did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 14:45:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "intTime": 20090309, 
        "postID": 93, 
        "quote": "Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama", 
        "reply": " I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 15:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Boospar"
    }, 
    {
        "content": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "intTime": 20090309, 
        "postID": 94, 
        "quote": "", 
        "reply": "When I first read the title, the first thing that came to mind was a friggin basketball.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:06:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.' Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "intTime": 20090309, 
        "postID": 95, 
        "quote": "Originally posted by Mom2APAJ: In return, America's head of state gave the prime minister 25 DVDs of 'classic American movies.'", 
        "reply": " Unless Gordon Brown has a multi-region DVD player they won't work. The US is in region 1. The brits in region 2.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "intTime": 20090309, 
        "postID": 96, 
        "quote": "", 
        "reply": "\"k\" MART HAD A CLEARANCE OF ALL THE OLD BUSSBEE BERKLEY MOVIES FROM LATE 20'S Maybe he should have gotten a life time subscription to NetFlix", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:11:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class. One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "intTime": 20090309, 
        "postID": 97, 
        "quote": "Originally posted by Boospar: quote: Originally posted by Ira1945: did you expect something else from this administration??? somehow the words pompous azz come to mind. North Carolina Ocracoke island, has a British grave yard, buried there are WWII Brits that washed up on the beach during the war, victims of German U boats. The folks at Ocracoke, found them, and created the burial place and every day there is a Union Jack flying over the graves, this is the true relationship, not the jackass stunt by Obama I recall when Mrs Reagan went to the wedding of HRH Prince Charles to Lady Diana Spencer back in 1981. The wedding gift she brought was a colonial-era siver tea set. It would seem Mrs Reagan and the residents of Ocracoke Island share something .... a sense of class.", 
        "reply": " One would really have to see the grave yard, the individual markers, the 'always' maintained site, the flag (land ceded to the UK from the Islanders) I believe every year a delegation from Royal Navy attends a rededication as guest of the Islanders. could be wrong on this though real show of respect, i saw a photo of the WWII Boy Scout troop (mounted on wild poneys) as Color Guard, it is quite a sight to see the whole place... something to be said about Honor, Tradition, Integrity, Honesty, Ethics, something we seem to be missing Blackbeard the pirate hung in harbor and it is rumored that there is a considerable treasure buried in the vicinity ????", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:16:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "intTime": 20090309, 
        "postID": 98, 
        "quote": "", 
        "reply": "I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:22:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Duster6"
    }, 
    {
        "content": "Coulda been worse... A \"wally-world\" gift card", 
        "intTime": 20090309, 
        "postID": 99, 
        "quote": "", 
        "reply": "Coulda been worse... A \"wally-world\" gift card", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:24:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Yes disgraceful.", 
        "intTime": 20090309, 
        "postID": 100, 
        "quote": "", 
        "reply": "Yes disgraceful.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:31:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "intTime": 20090309, 
        "postID": 101, 
        "quote": "Originally posted by FrJohn1123: Yes disgraceful.", 
        "reply": " So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:37:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "intTime": 20090309, 
        "postID": 102, 
        "quote": "", 
        "reply": "Duster, I can appreciate and understand your sentiment but you are wrong. For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "intTime": 20090309, 
        "postID": 103, 
        "quote": "", 
        "reply": "AFTER REVIEW OF YOU POST I SEE IT AS OF BAD TASTE AND RACIST. THIS IS NOT WHAT THIS SITE IS LOOKING FOR IN POSTERS. YOU NOW HAVE 30 DAYS OFF TO THINK ABOUT YOUR WAY OF POSTING. ANYONES WIFE OR FAMILY HAS ALWAYS BEEN OFF LIMITS FOR TALKING TRASH AND YOU DID THAT ALSO. MAINEDAWG MODERATOR I LEFT YOUR COOL THING HERE JUST SO PEOPLE CAN SEE HOW COOL YOU ARE. This message has been edited. Last edited by: mainedawg, Tue 10 March 2009 01:44 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 16:53:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "MANFREDGERD"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him. what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "intTime": 20090309, 
        "postID": 104, 
        "quote": "Originally posted by Duster6: I support what President Obama did. He is our President and we elected him. We must stand by him and support him.", 
        "reply": " what!!! he is the unfortunate choice of people, he and his minions will try to bring the downfall of this country, hopefully the house will be restored in 2010 house re election give the liberals enough room and there wont be enough nooses to hang them with", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:04:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "intTime": 20090309, 
        "postID": 105, 
        "quote": "", 
        "reply": "give the conservatives enough time and the country will throw them out...oh wait they already have...", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:07:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "Maybe he should have given him the state of Texas?", 
        "intTime": 20090309, 
        "postID": 106, 
        "quote": "", 
        "reply": "Maybe he should have given him the state of Texas?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:08:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "intTime": 20090309, 
        "postID": 107, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual?", 
        "reply": " Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:13:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press). so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "intTime": 20090309, 
        "postID": 108, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: Yes disgraceful. So you don't agree that Obama's present to Brown was absolutely pathetic, generic, and meaningless in comparison to what Brown gave Obama? Do you have any argument at all to support that position; or are you just mindlessly supporting whatever Obama does, as per usual? Nah it has nothing to do with the gift, rather my disdain is for the posters of this crap. In the early days of any administration there will be Faux Pas. To say that this case was disgraceful is well the absolute height of partisan insanity (better left for the British press).", 
        "reply": " so you think some chintzy dvd's was the way to go?? how about returning the bust of winston, good move??", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:23:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ... quote: GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\" Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "intTime": 20090309, 
        "postID": 109, 
        "quote": "GENEVA — The United States and Russia tried to mend their frayed relationship by having their top diplomats sit down to dinner here on Friday. Before the appetizer was served, the diplomatic first date had gotten off to an awkward start because of a gag gift gone awry. Secretary of State Hillary Rodham Clinton, in greeting Sergey V. Lavrov, the Russian foreign minister, presented him with a red plastic button emblazoned with the English word “reset” and the Russian word “peregruzka.” The gift was a play on Vice President Joseph R. Biden Jr.’s call in Munich last month for the two countries to “press the reset button” on their relationship. “We worked hard to get the right Russian word,” Mrs. Clinton said, handing the button to Mr. Lavrov. “Do you think we got it?” “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. \"http://www.nytimes.com/2009/03/07/world/europe/07diplo.html?em\"", 
        "reply": "Whatever \"no-class\" bug POTUS 44 has, the SECSTATE apparently also caught ...  Doesn't say much for the translators at the State Department ... worked so hard and still screwed it up. Yep ... \"ready on Day 1\" ... amateurs.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:26:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: ... amateurs Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "intTime": 20090309, 
        "postID": 110, 
        "quote": "... amateurs", 
        "reply": " Nah, you guys are buying that \"messiah\" crap. Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:34:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: “You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged. Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "intTime": 20090309, 
        "postID": 111, 
        "quote": "“You got it wrong,” he replied, explaining that the Americans had come up with the Russian word for overcharged.", 
        "reply": " Secretary Clinton should have responded \"My bad, this one was meant for the American Taxpayer\"", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:38:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know. I'd like an example of mistake for the George Washington presidency.", 
        "intTime": 20090309, 
        "postID": 112, 
        "quote": "Fact is all administrations have their share of mistakes. Some more costly than others....if you want some example, let me know.", 
        "reply": " I'd like an example of mistake for the George Washington presidency.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:39:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "intTime": 20090309, 
        "postID": 113, 
        "quote": "", 
        "reply": "Ya mean like Clinton falling all over himself laughing like a loon, while Boris Yeltsin stands there wondering what the hell this loon has finally inhaled!!!! Are those the kinds of mistakes ya meant other administrations made???", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 17:55:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "intTime": 20090309, 
        "postID": 114, 
        "quote": "Fact is all administrations have their share of mistakes.", 
        "reply": " True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:30:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama.... The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "intTime": 20090309, 
        "postID": 115, 
        "quote": "Originally posted by ipw533: . . . For better or worse Obama is now our \"official face\", and he acted like a classless Chicago ward heeler. He embarrassed himself and us by being a self-centered cheapskate who did not care about the thought Brown put into his present and just pretty much blew him off. There are intimations of darker motives for that snub, and they reflect very badly upon Mr. Obama....", 
        "reply": " The sad thing is that this administration looks terribly inept--except to play purely polytickle games and fruitlessly try to portray Limbaugh as speaking for the pachyderm party. They seem oblivious to the needs of the nation.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:41:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "intTime": 20090309, 
        "postID": 116, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " MISSION ACCOMPLISHED is a much better record for judging a president... according to the american people", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:46:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "intTime": 20090309, 
        "postID": 117, 
        "quote": "", 
        "reply": "This bunch is oblivious to the needs of the nation--in my life I've never seen a more selfish bunch of incompetent jerks. These assplugs are in charge of our country. I'm a Roman Catholic but not a very good one. I'd much rather fight fight for my country--I'm better at that--but now all I can do is pray for it--God help us all.....", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:49:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "ipw533"
    }, 
    {
        "content": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "intTime": 20090309, 
        "postID": 118, 
        "quote": "", 
        "reply": "How anyone with any sense of reality can compare one of a kind gifts with what is little more than Blockbuster All Time Favorites Set boggles the mind. The latter is a thoughtful expression of national appreciation for a valued friend while the latter is what a college freshman would do when forced to grab a quick gift on the way to a distant aunts house for Christmas. Between this farce and the silliness with the Russians it was a shameful week for American diplomacy. This message has been edited. Last edited by: adminnco1, Mon 09 March 2009 07:13 PM", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:50:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days? Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "intTime": 20090309, 
        "postID": 119, 
        "quote": "Originally posted by I_M_Qwerty: quote: Fact is all administrations have their share of mistakes. True enough ... but did POTUS 44 and his administration have to set a record for the first 100 days?", 
        "reply": " Seriousness of the mistakes doesn't enter into the equation??? I am laughing my azz off on that one.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 18:57:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "intTime": 20090309, 
        "postID": 120, 
        "quote": "", 
        "reply": "Perhaps on his next visit the PM can bring the chair Karl Marx sat in the British Library while he lived off the sweat of workers in the Engels family factories. No doubt it would hold more meaning and relevance for the recipient.", 
        "threadID": "409192893_3830073712001", 
        "time": "2009-03-09 19:12:00", 
        "title": "Obama's Present to Gordon Brown - how disgraceful!", 
        "userID": "adminnco1"
    }
]