[
    {
        "content": "My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime.", 
        "intTime": 20090419, 
        "postID": 1, 
        "quote": "", 
        "reply": "My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 07:35:00", 
        "title": "Which would you donate too?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I'd go for that same vote. Don", 
        "intTime": 20090419, 
        "postID": 2, 
        "quote": "", 
        "reply": "I'd go for that same vote. Don", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 07:44:00", 
        "title": "Which would you donate too?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I would go for that same vote and donate. (unless of course there is some island we could drop them off too. Hey, reminds me of that movie escape from New York, But the Island woudl be like the movie Pappion..", 
        "intTime": 20090419, 
        "postID": 3, 
        "quote": "", 
        "reply": "I would go for that same vote and donate. (unless of course there is some island we could drop them off too. Hey, reminds me of that movie escape from New York, But the Island woudl be like the movie Pappion..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 07:48:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "How about we stop locking up drug users? Seems like simpler (and cheaper) solution.", 
        "intTime": 20090419, 
        "postID": 4, 
        "quote": "", 
        "reply": "How about we stop locking up drug users? Seems like simpler (and cheaper) solution.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:00:00", 
        "title": "Which would you donate too?", 
        "userID": "Bleah"
    }, 
    {
        "content": "Can we shoot them????", 
        "intTime": 20090419, 
        "postID": 5, 
        "quote": "", 
        "reply": "Can we shoot them????", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:29:00", 
        "title": "Which would you donate too?", 
        "userID": "tawodi"
    }, 
    {
        "content": "Only if they stopped building these luxury resort complexes they call prisons and made sheriff Joe the federal commissioner of prisons.", 
        "intTime": 20090419, 
        "postID": 6, 
        "quote": "", 
        "reply": "Only if they stopped building these luxury resort complexes they call prisons and made sheriff Joe the federal commissioner of prisons.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:34:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime. That seems a bit like surrendering before the battle has begun.", 
        "intTime": 20090419, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime.", 
        "reply": " That seems a bit like surrendering before the battle has begun.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:35:00", 
        "title": "Which would you donate too?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "No, I would not donate to build more prisons. The prison system is not working, so why should we expand it? It's the classic business joke - \"We're going to build the widget for $6, sell it for $4, and make up the loss by selling in bulk!\"", 
        "intTime": 20090419, 
        "postID": 8, 
        "quote": "", 
        "reply": "No, I would not donate to build more prisons. The prison system is not working, so why should we expand it? It's the classic business joke - \"We're going to build the widget for $6, sell it for $4, and make up the loss by selling in bulk!\"", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:48:00", 
        "title": "Which would you donate too?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution!", 
        "intTime": 20090419, 
        "postID": 9, 
        "quote": "Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution.", 
        "reply": " Perfect solution!", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:49:00", 
        "title": "Which would you donate too?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution! Maybe you should go live in an area full of them..", 
        "intTime": 20090419, 
        "postID": 10, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution!", 
        "reply": " Maybe you should go live in an area full of them..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:53:00", 
        "title": "Which would you donate too?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution! Maybe you should go live in an area full of them.. Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico.", 
        "intTime": 20090419, 
        "postID": 11, 
        "quote": "Originally posted by threerings: quote: Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution! Maybe you should go live in an area full of them..", 
        "reply": " Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:09:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. Safe to say Shades that this is the one thing in the world we agree on.", 
        "intTime": 20090419, 
        "postID": 12, 
        "quote": "Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico.", 
        "reply": " Safe to say Shades that this is the one thing in the world we agree on.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:15:00", 
        "title": "Which would you donate too?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. Safe to say Shades that this is the one thing in the world we agree on. Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business.", 
        "intTime": 20090419, 
        "postID": 13, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. Safe to say Shades that this is the one thing in the world we agree on.", 
        "reply": " Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:32:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business. Hey, you are getting libertarianism on my liberalism. (Psst, I kinda support a fair tax too. Don't tell anyone okay?)", 
        "intTime": 20090419, 
        "postID": 14, 
        "quote": "Originally posted by shades_of_grey: Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business.", 
        "reply": " Hey, you are getting libertarianism on my liberalism. (Psst, I kinda support a fair tax too. Don't tell anyone okay?)", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:35:00", 
        "title": "Which would you donate too?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "First of all we have more people in prisons than any other nation in the world! That is a bad idea. Second of all FDR did it with jobs programs like the CCC. If they don't work they don't eat and then they go for a trip to the local jail if they continue to be problems in society.", 
        "intTime": 20090419, 
        "postID": 15, 
        "quote": "", 
        "reply": "First of all we have more people in prisons than any other nation in the world! That is a bad idea. Second of all FDR did it with jobs programs like the CCC. If they don't work they don't eat and then they go for a trip to the local jail if they continue to be problems in society.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:56:00", 
        "title": "Which would you donate too?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that.", 
        "intTime": 20090419, 
        "postID": 16, 
        "quote": "", 
        "reply": "Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:19:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "intTime": 20090419, 
        "postID": 17, 
        "quote": "Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that.", 
        "reply": " The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:26:00", 
        "title": "Which would you donate too?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "ACEINFI Posted Sun 19 April 2009 10:19 AM Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that What about alcohol? Shouldnt that be made illegal as well?", 
        "intTime": 20090419, 
        "postID": 18, 
        "quote": "", 
        "reply": "ACEINFI Posted Sun 19 April 2009 10:19 AM Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that What about alcohol? Shouldnt that be made illegal as well?", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:35:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws.", 
        "intTime": 20090419, 
        "postID": 19, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "reply": " Exactly. I'm not proposing the revocation of DUI laws.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:39:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "You know what.... that's is so true I don't know what the solution to these problmes are but for the harden criminals, I stick with send them to an island or a part of the country cut off from the rest of us..", 
        "intTime": 20090419, 
        "postID": 20, 
        "quote": "", 
        "reply": "You know what.... that's is so true I don't know what the solution to these problmes are but for the harden criminals, I stick with send them to an island or a part of the country cut off from the rest of us..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:46:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why?", 
        "intTime": 20090419, 
        "postID": 21, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws.", 
        "reply": " True But your also not proposing the parity in the two. Why?", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:51:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }, 
    {
        "content": "U R Right. I think I just said \"I stand corrected.\" I don't know the answer to these problems. But I would donate to make it harder for criminals in general. Harden criminals to me would be like mass murdersm serial killers, rapist, molesters and well like them..", 
        "intTime": 20090419, 
        "postID": 22, 
        "quote": "", 
        "reply": "U R Right. I think I just said \"I stand corrected.\" I don't know the answer to these problems. But I would donate to make it harder for criminals in general. Harden criminals to me would be like mass murdersm serial killers, rapist, molesters and well like them..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:14:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. woohoo ----http://www.youtube.com/watch?v=Nlbwp5b25E4", 
        "intTime": 20090419, 
        "postID": 23, 
        "quote": "The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "reply": " woohoo ----http://www.youtube.com/watch?v=Nlbwp5b25E4", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:14:00", 
        "title": "Which would you donate too?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why? Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it.", 
        "intTime": 20090419, 
        "postID": 24, 
        "quote": "Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why?", 
        "reply": " Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:39:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: This would cripple criminal gangs both here and in Mexico. yup every gang member ive talk to said that there would put them out of business....", 
        "intTime": 20090419, 
        "postID": 25, 
        "quote": "This would cripple criminal gangs both here and in Mexico.", 
        "reply": " yup every gang member ive talk to said that there would put them out of business....", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:45:00", 
        "title": "Which would you donate too?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I couldn't donate money to build more prisons. Our crime rate and prison population is truly a national shame. Prisons are just a dam holding back the waters, we need to do something about the flood.", 
        "intTime": 20090419, 
        "postID": 26, 
        "quote": "", 
        "reply": "I couldn't donate money to build more prisons. Our crime rate and prison population is truly a national shame. Prisons are just a dam holding back the waters, we need to do something about the flood.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:46:00", 
        "title": "Which would you donate too?", 
        "userID": "foxred03"
    }, 
    {
        "content": "Ammo is cheeper and there is plenty of room in a 6X6X8 hole, lot cheeper then buildind a 100 million dollar building D.J.", 
        "intTime": 20090419, 
        "postID": 27, 
        "quote": "", 
        "reply": "Ammo is cheeper and there is plenty of room in a 6X6X8 hole, lot cheeper then buildind a 100 million dollar building D.J.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:47:00", 
        "title": "Which would you donate too?", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "This isn't 'Nam, there are rules here.", 
        "intTime": 20090419, 
        "postID": 28, 
        "quote": "", 
        "reply": "This isn't 'Nam, there are rules here.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:53:00", 
        "title": "Which would you donate too?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why? Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it. I stand corrected Thank you for pointing it out.", 
        "intTime": 20090419, 
        "postID": 29, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why? Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it.", 
        "reply": " I stand corrected Thank you for pointing it out.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:55:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }, 
    {
        "content": "My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime.", 
        "intTime": 20090419, 
        "postID": 30, 
        "quote": "", 
        "reply": "My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 07:35:00", 
        "title": "Which would you donate too?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I'd go for that same vote. Don", 
        "intTime": 20090419, 
        "postID": 31, 
        "quote": "", 
        "reply": "I'd go for that same vote. Don", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 07:44:00", 
        "title": "Which would you donate too?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I would go for that same vote and donate. (unless of course there is some island we could drop them off too. Hey, reminds me of that movie escape from New York, But the Island woudl be like the movie Pappion..", 
        "intTime": 20090419, 
        "postID": 32, 
        "quote": "", 
        "reply": "I would go for that same vote and donate. (unless of course there is some island we could drop them off too. Hey, reminds me of that movie escape from New York, But the Island woudl be like the movie Pappion..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 07:48:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "How about we stop locking up drug users? Seems like simpler (and cheaper) solution.", 
        "intTime": 20090419, 
        "postID": 33, 
        "quote": "", 
        "reply": "How about we stop locking up drug users? Seems like simpler (and cheaper) solution.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:00:00", 
        "title": "Which would you donate too?", 
        "userID": "Bleah"
    }, 
    {
        "content": "Can we shoot them????", 
        "intTime": 20090419, 
        "postID": 34, 
        "quote": "", 
        "reply": "Can we shoot them????", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:29:00", 
        "title": "Which would you donate too?", 
        "userID": "tawodi"
    }, 
    {
        "content": "Only if they stopped building these luxury resort complexes they call prisons and made sheriff Joe the federal commissioner of prisons.", 
        "intTime": 20090419, 
        "postID": 35, 
        "quote": "", 
        "reply": "Only if they stopped building these luxury resort complexes they call prisons and made sheriff Joe the federal commissioner of prisons.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:34:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime. That seems a bit like surrendering before the battle has begun.", 
        "intTime": 20090419, 
        "postID": 36, 
        "quote": "Originally posted by Duster6: My dear friends. I have a question for you all. Please think about it and answer it honestly. Please feel free to comment on why you would donate to either one. When I went to the polls this November to vote I was asked if I wanted to donate to the democratic or republican parties. I said NO because I don't believe in donating money to unworthy causes. However, If they would have said,\"would you like to donate to your state or government to build more prisons\" I would have gladly donated $50.00 bucks. I feel we are going to need more and more prisons to meet the future needs of this country with the economy the way it is. Seems like more and more illegal aliens, drug users, and gangs are coming out in the open now and since they can't find jobs there is nothing else left for them to do but turn to crime.", 
        "reply": " That seems a bit like surrendering before the battle has begun.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:35:00", 
        "title": "Which would you donate too?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "No, I would not donate to build more prisons. The prison system is not working, so why should we expand it? It's the classic business joke - \"We're going to build the widget for $6, sell it for $4, and make up the loss by selling in bulk!\"", 
        "intTime": 20090419, 
        "postID": 37, 
        "quote": "", 
        "reply": "No, I would not donate to build more prisons. The prison system is not working, so why should we expand it? It's the classic business joke - \"We're going to build the widget for $6, sell it for $4, and make up the loss by selling in bulk!\"", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:48:00", 
        "title": "Which would you donate too?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution!", 
        "intTime": 20090419, 
        "postID": 38, 
        "quote": "Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution.", 
        "reply": " Perfect solution!", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:49:00", 
        "title": "Which would you donate too?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution! Maybe you should go live in an area full of them..", 
        "intTime": 20090419, 
        "postID": 39, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution!", 
        "reply": " Maybe you should go live in an area full of them..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 08:53:00", 
        "title": "Which would you donate too?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution! Maybe you should go live in an area full of them.. Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico.", 
        "intTime": 20090419, 
        "postID": 40, 
        "quote": "Originally posted by threerings: quote: Originally posted by SeaWitch1220: quote: Originally posted by Bleah: How about we stop locking up drug users? Seems like simpler (and cheaper) solution. Perfect solution! Maybe you should go live in an area full of them..", 
        "reply": " Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:09:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. Safe to say Shades that this is the one thing in the world we agree on.", 
        "intTime": 20090419, 
        "postID": 41, 
        "quote": "Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico.", 
        "reply": " Safe to say Shades that this is the one thing in the world we agree on.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:15:00", 
        "title": "Which would you donate too?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. Safe to say Shades that this is the one thing in the world we agree on. Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business.", 
        "intTime": 20090419, 
        "postID": 42, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by shades_of_grey: Everyone already does \"live in an area full of them..\" (drug users), whether you realize it or not. The \"War on Drugs\" is a war against human nature and personal liberty.. it's futile, ignoble, extremely costly and ultimately accomplishes nothing more than jailing nonviolent citizens while enriching criminal gangs, (by driving up the price of drugs). It seems that those hardcore supporters of this quite frankly unAmerican effort have learned absolutely nothing from the failure of Prohibition and the rise of organized crime that it engendered. Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. Safe to say Shades that this is the one thing in the world we agree on.", 
        "reply": " Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:32:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business. Hey, you are getting libertarianism on my liberalism. (Psst, I kinda support a fair tax too. Don't tell anyone okay?)", 
        "intTime": 20090419, 
        "postID": 43, 
        "quote": "Originally posted by shades_of_grey: Yep. I'm conservative but I'm also libertarian, and believe that whatever substances a person chooses to ingest are none of the government's damn business.", 
        "reply": " Hey, you are getting libertarianism on my liberalism. (Psst, I kinda support a fair tax too. Don't tell anyone okay?)", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:35:00", 
        "title": "Which would you donate too?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "First of all we have more people in prisons than any other nation in the world! That is a bad idea. Second of all FDR did it with jobs programs like the CCC. If they don't work they don't eat and then they go for a trip to the local jail if they continue to be problems in society.", 
        "intTime": 20090419, 
        "postID": 44, 
        "quote": "", 
        "reply": "First of all we have more people in prisons than any other nation in the world! That is a bad idea. Second of all FDR did it with jobs programs like the CCC. If they don't work they don't eat and then they go for a trip to the local jail if they continue to be problems in society.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 09:56:00", 
        "title": "Which would you donate too?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that.", 
        "intTime": 20090419, 
        "postID": 45, 
        "quote": "", 
        "reply": "Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:19:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "intTime": 20090419, 
        "postID": 46, 
        "quote": "Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that.", 
        "reply": " The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:26:00", 
        "title": "Which would you donate too?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "ACEINFI Posted Sun 19 April 2009 10:19 AM Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that What about alcohol? Shouldnt that be made illegal as well?", 
        "intTime": 20090419, 
        "postID": 47, 
        "quote": "", 
        "reply": "ACEINFI Posted Sun 19 April 2009 10:19 AM Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that What about alcohol? Shouldnt that be made illegal as well?", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:35:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws.", 
        "intTime": 20090419, 
        "postID": 48, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "reply": " Exactly. I'm not proposing the revocation of DUI laws.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:39:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "You know what.... that's is so true I don't know what the solution to these problmes are but for the harden criminals, I stick with send them to an island or a part of the country cut off from the rest of us..", 
        "intTime": 20090419, 
        "postID": 49, 
        "quote": "", 
        "reply": "You know what.... that's is so true I don't know what the solution to these problmes are but for the harden criminals, I stick with send them to an island or a part of the country cut off from the rest of us..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:46:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why?", 
        "intTime": 20090419, 
        "postID": 50, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws.", 
        "reply": " True But your also not proposing the parity in the two. Why?", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 10:51:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }, 
    {
        "content": "U R Right. I think I just said \"I stand corrected.\" I don't know the answer to these problems. But I would donate to make it harder for criminals in general. Harden criminals to me would be like mass murdersm serial killers, rapist, molesters and well like them..", 
        "intTime": 20090419, 
        "postID": 51, 
        "quote": "", 
        "reply": "U R Right. I think I just said \"I stand corrected.\" I don't know the answer to these problems. But I would donate to make it harder for criminals in general. Harden criminals to me would be like mass murdersm serial killers, rapist, molesters and well like them..", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:14:00", 
        "title": "Which would you donate too?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. woohoo ----http://www.youtube.com/watch?v=Nlbwp5b25E4", 
        "intTime": 20090419, 
        "postID": 52, 
        "quote": "The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip.", 
        "reply": " woohoo ----http://www.youtube.com/watch?v=Nlbwp5b25E4", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:14:00", 
        "title": "Which would you donate too?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why? Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it.", 
        "intTime": 20090419, 
        "postID": 53, 
        "quote": "Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why?", 
        "reply": " Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:39:00", 
        "title": "Which would you donate too?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: This would cripple criminal gangs both here and in Mexico. yup every gang member ive talk to said that there would put them out of business....", 
        "intTime": 20090419, 
        "postID": 54, 
        "quote": "This would cripple criminal gangs both here and in Mexico.", 
        "reply": " yup every gang member ive talk to said that there would put them out of business....", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:45:00", 
        "title": "Which would you donate too?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I couldn't donate money to build more prisons. Our crime rate and prison population is truly a national shame. Prisons are just a dam holding back the waters, we need to do something about the flood.", 
        "intTime": 20090419, 
        "postID": 55, 
        "quote": "", 
        "reply": "I couldn't donate money to build more prisons. Our crime rate and prison population is truly a national shame. Prisons are just a dam holding back the waters, we need to do something about the flood.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:46:00", 
        "title": "Which would you donate too?", 
        "userID": "foxred03"
    }, 
    {
        "content": "Ammo is cheeper and there is plenty of room in a 6X6X8 hole, lot cheeper then buildind a 100 million dollar building D.J.", 
        "intTime": 20090419, 
        "postID": 56, 
        "quote": "", 
        "reply": "Ammo is cheeper and there is plenty of room in a 6X6X8 hole, lot cheeper then buildind a 100 million dollar building D.J.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:47:00", 
        "title": "Which would you donate too?", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "This isn't 'Nam, there are rules here.", 
        "intTime": 20090419, 
        "postID": 57, 
        "quote": "", 
        "reply": "This isn't 'Nam, there are rules here.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:53:00", 
        "title": "Which would you donate too?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why? Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it. I stand corrected Thank you for pointing it out.", 
        "intTime": 20090419, 
        "postID": 58, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by john2x: quote: Originally posted by shades_of_grey: quote: Originally posted by adminnco1: quote: Originally posted by ACEINFI: Unfortunatly at any given time a person who takes the liberty of doing illegal drugs can be on the road driving next to me. I'm not okay with that. The same is true for some jamoke who decides to drink a six pack of Bud before heading out for a road trip. Exactly. I'm not proposing the revocation of DUI laws. True But your also not proposing the parity in the two. Why? Yes I am, john. Here's an excerpt from my first post on this thread: quote: Originally posted by shades_of_grey: ...Drugs need to be legalized and taxed, (treated like alcohol, which is just another drug after all). This would cripple criminal gangs both here and in Mexico. I've italicized the most relevant part there, so you can't miss it.", 
        "reply": " I stand corrected Thank you for pointing it out.", 
        "threadID": "409192893_1550081122001", 
        "time": "2009-04-19 11:55:00", 
        "title": "Which would you donate too?", 
        "userID": "john2x"
    }
]