[
    {
        "content": "quote: Originally posted by R102: Why do the Marines get to listen to President Obama speak? While on active duty in the army I was forced to listen to dick cheney speak while in the rain. Story of my life. See the dot on this letter i? It's not really a dot. It's the worlds smallest violin playing My Heart Bleeds for You. When President Clinton and VP Al Gore came to town in 1996 for a campaign stop I delt with the huge crowds just to see them. Even though I voted for Dole. But that was the President and VP. In my town! If Obama were to come to town I'll go see him too. And had Bush and or Cheney showed up, same deal. I may not agree with our nation's leaders but....I respect them.", 
        "intTime": 20090301, 
        "postID": 20, 
        "quote": "Originally posted by R102: Why do the Marines get to listen to President Obama speak? While on active duty in the army I was forced to listen to dick cheney speak while in the rain. Story of my life.", 
        "reply": " See the dot on this letter i? It's not really a dot. It's the worlds smallest violin playing My Heart Bleeds for You. When President Clinton and VP Al Gore came to town in 1996 for a campaign stop I delt with the huge crowds just to see them. Even though I voted for Dole. But that was the President and VP. In my town! If Obama were to come to town I'll go see him too. And had Bush and or Cheney showed up, same deal. I may not agree with our nation's leaders but....I respect them.", 
        "threadID": "409192893_3090073612001", 
        "time": "2009-03-01 23:10:00", 
        "title": "NOT FAIR", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: s******_mech: And had Bush and or Cheney showed up Hay, that's right... President Bush did come to town and the wife and I were given tickets to attend the event. The President was very personable in the town hall setting. Didn't even utter a Bushism he bacame so famous for. ***http://www.npr.org/templates/story/story.php?storyId=5280947&ft=1&f=3*** President Goes Local with Trip to New York by David Greene Morning Edition, March 15, 2006 · President Bush visited Rochester, N.Y., on Tuesday. The President spoke to the local high school in a nearby town. The trip was a big event for local media and offered the president a chance to boost his image outside of the Washington media circus.", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "s******_mech: And had Bush and or Cheney showed up", 
        "reply": " Hay, that's right... President Bush did come to town and the wife and I were given tickets to attend the event. The President was very personable in the town hall setting. Didn't even utter a Bushism he bacame so famous for. ***http://www.npr.org/templates/story/story.php?storyId=5280947&ft=1&f=3*** President Goes Local with Trip to New York by David Greene Morning Edition, March 15, 2006 · President Bush visited Rochester, N.Y., on Tuesday. The President spoke to the local high school in a nearby town. The trip was a big event for local media and offered the president a chance to boost his image outside of the Washington media circus.", 
        "threadID": "409192893_3090073612001", 
        "time": "2009-03-02 11:09:00", 
        "title": "NOT FAIR", 
        "userID": "bill_kananen"
    }
]