[
    {
        "content": "Ron Paul, as many of you may know, has offered his opinion that the Constitutional issuing letters of marque and reprisal would be the most economical and most diplomatic way of dealing with the pirates of Somalia. Well, here is a letter that he wrote on 'Campaign for Liberty' that describes his reasoning. He also makes a case for why gun laws make it easier for criminals to take advantage of those that follow the law. Pretty good read and pretty short and to the point. ---http://www.campaignforliberty.com/article.php?view=58", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "", 
        "reply": "Ron Paul, as many of you may know, has offered his opinion that the Constitutional issuing letters of marque and reprisal would be the most economical and most diplomatic way of dealing with the pirates of Somalia. Well, here is a letter that he wrote on 'Campaign for Liberty' that describes his reasoning. He also makes a case for why gun laws make it easier for criminals to take advantage of those that follow the law. Pretty good read and pretty short and to the point. ---http://www.campaignforliberty.com/article.php?view=58", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-20 23:13:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "10Tenths"
    }, 
    {
        "content": "And pretty awful as a solution to organized piracy. Then again, I wouldn't expect a Libertarian medical physician to solve a military/political/legal problem. No offense, but I seriously doubt Ron Paul has any more insight into the matter than Rue Paul. The man just doesn't have the background nor inclination for solving the problem. He is an isolationist to the core and would be the first to abdicate our position as the only blue water Navy given half the chance. Sullivan013", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "And pretty awful as a solution to organized piracy. Then again, I wouldn't expect a Libertarian medical physician to solve a military/political/legal problem. No offense, but I seriously doubt Ron Paul has any more insight into the matter than Rue Paul. The man just doesn't have the background nor inclination for solving the problem. He is an isolationist to the core and would be the first to abdicate our position as the only blue water Navy given half the chance. Sullivan013", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-21 05:13:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Please elaborate as to why this isn't a good solution. I think it perfectly suits the conditions.", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "", 
        "reply": "Please elaborate as to why this isn't a good solution. I think it perfectly suits the conditions.", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-21 22:29:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Please elaborate as to why this isn't a good solution. The main incentive of being a privateer is the money is it not? and any cargo seized by a privateer would have to be returned. so the question is. who would risk their life over the sale price of a junked up speed boat and a rusty AK-47?", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "Please elaborate as to why this isn't a good solution.", 
        "reply": " The main incentive of being a privateer is the money is it not? and any cargo seized by a privateer would have to be returned. so the question is. who would risk their life over the sale price of a junked up speed boat and a rusty AK-47?", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 00:50:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "While the idea of issuing a letter of marque is that the government can do so at no cost to themselves. But, there is nothing barring the government issuing rewards as they did with terrorists. That is not beyond the bounds of the Constitution. So, say $250,000 for each boat and $1 million or $2 million for each mother-ship and we are in business. And, even if you double, triple or even quadruple those figures you would probably still be well below the cost of utilizing military resources. Those figures coupled with allowing the privateers to keep whatever they find and I am sure that you will have a line out the door of people signing up. Shoot, myself and a few guys that I know would be first in line.", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "", 
        "reply": "While the idea of issuing a letter of marque is that the government can do so at no cost to themselves. But, there is nothing barring the government issuing rewards as they did with terrorists. That is not beyond the bounds of the Constitution. So, say $250,000 for each boat and $1 million or $2 million for each mother-ship and we are in business. And, even if you double, triple or even quadruple those figures you would probably still be well below the cost of utilizing military resources. Those figures coupled with allowing the privateers to keep whatever they find and I am sure that you will have a line out the door of people signing up. Shoot, myself and a few guys that I know would be first in line.", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 02:14:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: $500,000 for every boat and $1.5 million for every mothership would probably be far cheaper than utilizing our military. You could probably double, triple or even quadruple those figures and still be far below the costs if we were to use military resources. and what happens when a fishing boat gets labeled as \"pirates\"? 500K is a lot of money especially when you have no one to answer to.", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "$500,000 for every boat and $1.5 million for every mothership would probably be far cheaper than utilizing our military. You could probably double, triple or even quadruple those figures and still be far below the costs if we were to use military resources.", 
        "reply": " and what happens when a fishing boat gets labeled as \"pirates\"? 500K is a lot of money especially when you have no one to answer to.", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 02:17:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: coupled with allowing the privateers to keep whatever they find never happen. that would be a HUGE legal battle between the shipping companies, their insurance companies, and the US government.", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "coupled with allowing the privateers to keep whatever they find", 
        "reply": " never happen. that would be a HUGE legal battle between the shipping companies, their insurance companies, and the US government.", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 02:19:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Please elaborate as to why this isn't a good solution. I think it perfectly suits the conditions. 1. It's illegal, unless they are specifically marked as warships or counter piracy ships as per UN law of the sea: quote: Article107 Ships and aircraft which are entitled to seize on account of piracy A seizure on account of piracy may be carried out only by warships or military aircraft, or other ships or aircraft clearly marked and identifiable as being on government service and authorized to that effect. 2. It is an act of piracy itself to fire upon a ship before it fires upon you, even if they are brandishing weapons. Until the pirates actually fire, any non-warship is in danger of being accused of piracy itself if it takes aggressive action. 3. Capturing pirates is almost as sticky a problem as killing them. As soon as they are on board, they fall under the legal system of the country of the ship's flag, entitled to legal representation and countless hours of court proceedings that most companies would be loath to incure. The British Royal Navy was recently ordered to NOT detain pirates on any warship as thier human rights legislation would allow the pirates to claim asylum in Britain if their host country's laws allowed execution or mutilation as punishment for piracy. 4. Despite the news hype, the majority of attacks are foiled simply by vigilance and avoidance by the ship's captain. 5. The only time there was a DROP in piracy off the Somali coastline was during a brief period of government control in the early 1990s. This would indicate that the only realistic means of combating piracy is at the source of their operations: the ports that they issue from. 6. All of this would be VERY expensive in both court costs and bad press for shipping companies. The IMB already reports that piracy activity is grossly under-reported as it is in the interests of shipping companies to hide the fact that their goods are being hijacked (much like banks with credit-card fraud reporting - the bean counters have already figured out the the loss in consumer confidence costs more than the financial loss of the theft). Again, this is not as simple as it appears. Only idiots like Ron/Rue Paul are stupid enough to spout off 'solutions' when they haven't a clue about the true nature of the problem. Picture this: A fast mover approaches your container ship and brandishes weapons. Your crew fires upon them. Their engine is hit and they hold up their hands. Your crew is now guilty of piracy and has violated international law. In addition, you are duty bound to stop to render aid (failure to do so is also a serious violation punishable by imprisonment in your home nation). As soon as they are on your ship, you are now responsible for the pirate's safety, legal rights, asylum if they request it and must change your course to take them to the nearest port. There isn't a shipping company in the world that is willing to risk such actions. Sullivan013", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "Please elaborate as to why this isn't a good solution. I think it perfectly suits the conditions.", 
        "reply": " 1. It's illegal, unless they are specifically marked as warships or counter piracy ships as per UN law of the sea: quote: Article107 Ships and aircraft which are entitled to seize on account of piracy A seizure on account of piracy may be carried out only by warships or military aircraft, or other ships or aircraft clearly marked and identifiable as being on government service and authorized to that effect. 2. It is an act of piracy itself to fire upon a ship before it fires upon you, even if they are brandishing weapons. Until the pirates actually fire, any non-warship is in danger of being accused of piracy itself if it takes aggressive action. 3. Capturing pirates is almost as sticky a problem as killing them. As soon as they are on board, they fall under the legal system of the country of the ship's flag, entitled to legal representation and countless hours of court proceedings that most companies would be loath to incure. The British Royal Navy was recently ordered to NOT detain pirates on any warship as thier human rights legislation would allow the pirates to claim asylum in Britain if their host country's laws allowed execution or mutilation as punishment for piracy. 4. Despite the news hype, the majority of attacks are foiled simply by vigilance and avoidance by the ship's captain. 5. The only time there was a DROP in piracy off the Somali coastline was during a brief period of government control in the early 1990s. This would indicate that the only realistic means of combating piracy is at the source of their operations: the ports that they issue from. 6. All of this would be VERY expensive in both court costs and bad press for shipping companies. The IMB already reports that piracy activity is grossly under-reported as it is in the interests of shipping companies to hide the fact that their goods are being hijacked (much like banks with credit-card fraud reporting - the bean counters have already figured out the the loss in consumer confidence costs more than the financial loss of the theft). Again, this is not as simple as it appears. Only idiots like Ron/Rue Paul are stupid enough to spout off 'solutions' when they haven't a clue about the true nature of the problem. Picture this: A fast mover approaches your container ship and brandishes weapons. Your crew fires upon them. Their engine is hit and they hold up their hands. Your crew is now guilty of piracy and has violated international law. In addition, you are duty bound to stop to render aid (failure to do so is also a serious violation punishable by imprisonment in your home nation). As soon as they are on your ship, you are now responsible for the pirate's safety, legal rights, asylum if they request it and must change your course to take them to the nearest port. There isn't a shipping company in the world that is willing to risk such actions. Sullivan013", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 07:42:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "sullivan013"
    }, 
    {
        "content": "His Libertarian view of the piracy situation is endemic of Libertarianism...the political ideology often leaves to much up to the notion that individual efforts based on interest can overcome just about any problem. No coordinated private action against piracy was much like the approach taken in 17 and 1800's...and it worked to some extent. But, the real enforcement of law was the national navies pursuing pirates to their dens and destroying them.", 
        "intTime": 20090422, 
        "postID": 9, 
        "quote": "", 
        "reply": "His Libertarian view of the piracy situation is endemic of Libertarianism...the political ideology often leaves to much up to the notion that individual efforts based on interest can overcome just about any problem. No coordinated private action against piracy was much like the approach taken in 17 and 1800's...and it worked to some extent. But, the real enforcement of law was the national navies pursuing pirates to their dens and destroying them.", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 09:21:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Ok, so spend billions going after Somali teenagers when we are in the greatest recession since the depression (and, the fat lady still hasn't sung yet)? That is the problem I am having, how much money do you think the Fed can loan us before we fall face first into the dirt?", 
        "intTime": 20090422, 
        "postID": 10, 
        "quote": "", 
        "reply": "Ok, so spend billions going after Somali teenagers when we are in the greatest recession since the depression (and, the fat lady still hasn't sung yet)? That is the problem I am having, how much money do you think the Fed can loan us before we fall face first into the dirt?", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 19:12:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Frankly, I don't know. This discussion was about Rue/Ron Paul's hairbrained ideas on piracy not a discussion on fixing the economy or dictating the Federal Reserve's actions in our current crisis. You asked why his ideas were worthless. I told you. I never advocated 'spending billions going after Somali teenagers', I was merely calling Mr. Paul a poor problem solver for maritime issues. I don't claim to know what to do about either problem, but I can at least recognize what NOT to do and why with less than ten minutes and a web browser. Kinda makes you wonder what else Ron/Rue Paul is mistaken on when he doesn't even take the time to do that miniscule amount of research before he spouts his \"plans\". And people actually vote for this guy? WTF?!! Sullivan013", 
        "intTime": 20090422, 
        "postID": 11, 
        "quote": "", 
        "reply": "Frankly, I don't know. This discussion was about Rue/Ron Paul's hairbrained ideas on piracy not a discussion on fixing the economy or dictating the Federal Reserve's actions in our current crisis. You asked why his ideas were worthless. I told you. I never advocated 'spending billions going after Somali teenagers', I was merely calling Mr. Paul a poor problem solver for maritime issues. I don't claim to know what to do about either problem, but I can at least recognize what NOT to do and why with less than ten minutes and a web browser. Kinda makes you wonder what else Ron/Rue Paul is mistaken on when he doesn't even take the time to do that miniscule amount of research before he spouts his \"plans\". And people actually vote for this guy? WTF?!! Sullivan013", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 19:31:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "sullivan013"
    }, 
    {
        "content": "My main problem with the military solution is that as a former sailor, I am not at all happy with the Navy being the babysitter of private companies. There is Optimum Manning, Surge Ready, and other programs directed at downsizing the Navy in terms of personnel. I went through Surge Ready Program, Optimum Manning and CrewSwap and I will tell you that none of those things bode well for the morale of the crew. Add to that private shipping company babysitter and I think that will make things worse on sailors who already have too much on their plate. I myself never got much more than 2-4 hours of sleep a night during a WestPac, I wouldn't have wanted to add more stuff on top of the huge pile of stuff I already had on my plate. Sure, the money issue is there, as well. But, ultimately, I do not want my Navy having to deal with this. This is a private matter, not a national security matter.", 
        "intTime": 20090422, 
        "postID": 12, 
        "quote": "", 
        "reply": "My main problem with the military solution is that as a former sailor, I am not at all happy with the Navy being the babysitter of private companies. There is Optimum Manning, Surge Ready, and other programs directed at downsizing the Navy in terms of personnel. I went through Surge Ready Program, Optimum Manning and CrewSwap and I will tell you that none of those things bode well for the morale of the crew. Add to that private shipping company babysitter and I think that will make things worse on sailors who already have too much on their plate. I myself never got much more than 2-4 hours of sleep a night during a WestPac, I wouldn't have wanted to add more stuff on top of the huge pile of stuff I already had on my plate. Sure, the money issue is there, as well. But, ultimately, I do not want my Navy having to deal with this. This is a private matter, not a national security matter.", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 21:38:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Sullivan013 said it all much better than I ever could", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "", 
        "reply": "Sullivan013 said it all much better than I ever could", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-22 21:38:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "When you consider all the entanglements of maritime and international law, it becomes apparent that the pirates have some pretty solid advantages. How to best eliminate the problem has caveats too. Why don't we just insert some heavy assault teams on the Somali mainland and destroy the pirate's nests? Fine but what about the 200+ hostages they hold? You want to write them off as collateral? Of course the hostage problem could be quickly solved by paying ransom. So with the hostages no longer a burden, then we could freely wreak havoc on Somalia pirate havens. Or could we? It would have to be highly surgical. Above all, we don't want to turn these guys into terrorist recruits. Right now they are just laissez-faire capitalists. Turning Somalia into an aQ resort is the last thing we need to do. Sorry but in this case there is no way around nation building. And there will always be pirates.", 
        "intTime": 20090423, 
        "postID": 14, 
        "quote": "", 
        "reply": "When you consider all the entanglements of maritime and international law, it becomes apparent that the pirates have some pretty solid advantages. How to best eliminate the problem has caveats too. Why don't we just insert some heavy assault teams on the Somali mainland and destroy the pirate's nests? Fine but what about the 200+ hostages they hold? You want to write them off as collateral? Of course the hostage problem could be quickly solved by paying ransom. So with the hostages no longer a burden, then we could freely wreak havoc on Somalia pirate havens. Or could we? It would have to be highly surgical. Above all, we don't want to turn these guys into terrorist recruits. Right now they are just laissez-faire capitalists. Turning Somalia into an aQ resort is the last thing we need to do. Sorry but in this case there is no way around nation building. And there will always be pirates.", 
        "threadID": "409192893_3810043122001", 
        "time": "2009-04-23 07:30:00", 
        "title": "Ron Paul writes about the pirate situation", 
        "userID": "Thud357L"
    }
]