[
    {
        "content": "This hatred of western civilization will not and can not be won in an attempt to Change a culture. Once we expanded into Iraq and declared an Ideological global war that cemented the hatred and rallied every sleeping Arab muslim in the world. Had we dealt Afganistan a punishing blow that would have set them back a hundred years and then left,We would have been far better off. It would have been considered a retalitory strike by the super power and a warning to the next nation of what happens when you anger America. But by playing these hearts and mind games and surges then rebuilding the whole country,8 years and no win in sight,They are emboldened and hate us more than ever they consider us weak. They mock us and laugh at us being divided vulnerable, broke, and weakened militarily. And once we leave they will go back to sq one and bask in the glory that they defeated the giant Infidel. So what are the choices at this point? \"http://www.tangle.com/view_video.php?viewkey=0861ff3eabea1ceb73e4\"", 
        "intTime": 20090412, 
        "postID": 1, 
        "quote": "", 
        "reply": "This hatred of western civilization will not and can not be won in an attempt to Change a culture. Once we expanded into Iraq and declared an Ideological global war that cemented the hatred and rallied every sleeping Arab muslim in the world. Had we dealt Afganistan a punishing blow that would have set them back a hundred years and then left,We would have been far better off. It would have been considered a retalitory strike by the super power and a warning to the next nation of what happens when you anger America. But by playing these hearts and mind games and surges then rebuilding the whole country,8 years and no win in sight,They are emboldened and hate us more than ever they consider us weak. They mock us and laugh at us being divided vulnerable, broke, and weakened militarily. And once we leave they will go back to sq one and bask in the glory that they defeated the giant Infidel. So what are the choices at this point? \"http://www.tangle.com/view_video.php?viewkey=0861ff3eabea1ceb73e4\"", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-12 21:25:00", 
        "title": "This is what were up against", 
        "userID": "john2x"
    }, 
    {
        "content": "Radical Islam is truely the scourge of the Earth. While I usually can't stomach the tripe that comes from the religious right or the Foxnews type Republican, they only worry me because they're misinformed or just plain dumb. These Muslim religious nuts on the other hand, are truly civilization's greatest threat. There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. I am proud Barack Hussein Obama is our President and I'm counting on him to take a pragmatic approach to this problem, like he usually does on all things. I could use a break from the George W. Bush born evangelical again ideology when it comes to foreign policy.", 
        "intTime": 20090412, 
        "postID": 2, 
        "quote": "", 
        "reply": "Radical Islam is truely the scourge of the Earth. While I usually can't stomach the tripe that comes from the religious right or the Foxnews type Republican, they only worry me because they're misinformed or just plain dumb. These Muslim religious nuts on the other hand, are truly civilization's greatest threat. There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. I am proud Barack Hussein Obama is our President and I'm counting on him to take a pragmatic approach to this problem, like he usually does on all things. I could use a break from the George W. Bush born evangelical again ideology when it comes to foreign policy.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-12 21:47:00", 
        "title": "This is what were up against", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right", 
        "intTime": 20090412, 
        "postID": 3, 
        "quote": "Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists.", 
        "reply": " you mean beyond the united states right", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-12 23:08:00", 
        "title": "This is what were up against", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right Classic, never miss a chance to bash the USA.", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right", 
        "reply": " Classic, never miss a chance to bash the USA.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 02:43:00", 
        "title": "This is what were up against", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by john2x: This hatred of western civilization will not and can not be won in an attempt to Change a culture. Once we expanded into Iraq and declared an Ideological global war that cemented the hatred and rallied every sleeping Arab muslim in the world. Had we dealt Afganistan a punishing blow that would have set them back a hundred years and then left,We would have been far better off. It would have been considered a retalitory strike by the super power and a warning to the next nation of what happens when you anger America. But by playing these hearts and mind games and surges then rebuilding the whole country,8 years and no win in sight,They are emboldened and hate us more than ever they consider us weak. They mock us and laugh at us being divided vulnerable, broke, and weakened militarily. And once we leave they will go back to sq one and bask in the glory that they defeated the giant Infidel. So what are the choices at this point? \"http://www.tangle.com/view_video.php?viewkey=0861ff3eabea1ceb73e4\" I'd be 100% behind you..if we had not suffered through dozens of attacks prior to our invasion.", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "Originally posted by john2x: This hatred of western civilization will not and can not be won in an attempt to Change a culture. Once we expanded into Iraq and declared an Ideological global war that cemented the hatred and rallied every sleeping Arab muslim in the world. Had we dealt Afganistan a punishing blow that would have set them back a hundred years and then left,We would have been far better off. It would have been considered a retalitory strike by the super power and a warning to the next nation of what happens when you anger America. But by playing these hearts and mind games and surges then rebuilding the whole country,8 years and no win in sight,They are emboldened and hate us more than ever they consider us weak. They mock us and laugh at us being divided vulnerable, broke, and weakened militarily. And once we leave they will go back to sq one and bask in the glory that they defeated the giant Infidel. So what are the choices at this point? \"http://www.tangle.com/view_video.php?viewkey=0861ff3eabea1ceb73e4\"", 
        "reply": " I'd be 100% behind you..if we had not suffered through dozens of attacks prior to our invasion.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 05:19:00", 
        "title": "This is what were up against", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. I'd love to send you back in time to lead the invasion of Japan. you mean beyond the united states right", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. I'd love to send you back in time to lead the invasion of Japan. you mean beyond the united states right", 
        "reply": "", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 05:28:00", 
        "title": "This is what were up against", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Radical Islam is truely the scourge of the Earth. While I usually can't stomach the tripe that comes from the religious right or the Foxnews type Republican, they only worry me because they're misinformed or just plain dumb. These Muslim religious nuts on the other hand, are truly civilization's greatest threat. There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. I am proud Barack Hussein Obama is our President and I'm counting on him to take a pragmatic approach to this problem, like he usually does on all things. I could use a break from the George W. Bush born evangelical again ideology when it comes to foreign policy. I agree! We must HATE, CONDEM, AND KILL what we don't understand, or what doesn't meet OUR set of standards. Because GOD is on our side!", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "Originally posted by Boots_: Radical Islam is truely the scourge of the Earth. While I usually can't stomach the tripe that comes from the religious right or the Foxnews type Republican, they only worry me because they're misinformed or just plain dumb. These Muslim religious nuts on the other hand, are truly civilization's greatest threat. There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. I am proud Barack Hussein Obama is our President and I'm counting on him to take a pragmatic approach to this problem, like he usually does on all things. I could use a break from the George W. Bush born evangelical again ideology when it comes to foreign policy.", 
        "reply": " I agree! We must HATE, CONDEM, AND KILL what we don't understand, or what doesn't meet OUR set of standards. Because GOD is on our side!", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 05:40:00", 
        "title": "This is what were up against", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "MOD HAT OFF quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right Oh, yeah! How dare the United States fight back against a treacherous, war-mongering nation who was talking \"peace\" out one side of their mouth while planning--and carrying out--a merciless war of conquest! How dare the United States use a weapon to bring a swift end to the most destructive war in human history! How dare the United States to not have needlessly sacrificed more of it's most valuable resource to appease wrist-wringers 60+ years later who decry the \"inhumanity\" of the use of the bomb! \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right", 
        "reply": "MOD HAT OFF  Oh, yeah! How dare the United States fight back against a treacherous, war-mongering nation who was talking \"peace\" out one side of their mouth while planning--and carrying out--a merciless war of conquest! How dare the United States use a weapon to bring a swift end to the most destructive war in human history! How dare the United States to not have needlessly sacrificed more of it's most valuable resource to appease wrist-wringers 60+ years later who decry the \"inhumanity\" of the use of the bomb! \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 05:53:00", 
        "title": "This is what were up against", 
        "userID": "USNVet940"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right Classic, never miss a chance to bash the USA. no joke...", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right Classic, never miss a chance to bash the USA.", 
        "reply": " no joke...", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 06:04:00", 
        "title": "This is what were up against", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: I agree! We must HATE, CONDEM, AND KILL what we don't understand, or what doesn't meet OUR set of standards. Because GOD is on our side! You're talking to the wrong person about God. I think people that believe only their religion knows the absolute truth and understands what happens in the afterlife is the root cause of this problem. Here's my standard: Do not kill people because you think you'll have 72 virgins after you die. Do not steal land from people because you think an area must be sufficiently Jewish before the Messiah comes back. Do not support these practices beacuse you think only these policies will bring Jesus back for the rapture.", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "Originally posted by EspritDeCorps: I agree! We must HATE, CONDEM, AND KILL what we don't understand, or what doesn't meet OUR set of standards. Because GOD is on our side!", 
        "reply": " You're talking to the wrong person about God. I think people that believe only their religion knows the absolute truth and understands what happens in the afterlife is the root cause of this problem. Here's my standard: Do not kill people because you think you'll have 72 virgins after you die. Do not steal land from people because you think an area must be sufficiently Jewish before the Messiah comes back. Do not support these practices beacuse you think only these policies will bring Jesus back for the rapture.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 06:37:00", 
        "title": "This is what were up against", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right You mean in a war that had already claimed hundreds of thousands, or even millions, lives? You mean to end the war where the opposition was fielding suicide weapons in order to kill us? You mean the US where after the two deployed in WWII has never used them again despite taking large numbers of casualties in conflicts? As has already been said, you never miss a chance to bash this country.", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right", 
        "reply": " You mean in a war that had already claimed hundreds of thousands, or even millions, lives? You mean to end the war where the opposition was fielding suicide weapons in order to kill us? You mean the US where after the two deployed in WWII has never used them again despite taking large numbers of casualties in conflicts? As has already been said, you never miss a chance to bash this country.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 06:46:00", 
        "title": "This is what were up against", 
        "userID": "sw614"
    }, 
    {
        "content": "After thirty some years of STATE SPONSORED terrorism when is it all right, O.K., justified, Approved by YOU to strike BACK!!! Did you approve of Afghanistan at first and now are criticising only after the known resultys are in or were you cheering them on when we were killing them any way we could?? After all how much of a strike would have been enough?? A burned tent and a couple of dead camels?? A dead janitor in an aspirin factory?? How much would have been enough?? AND, just WHO SPECIFICALLY would YOU have killed?? Kabul, Tora Bora? Carpet bomb the entire northeastern section of A-Stan WHO??? WHERE??? How many???? Would you have termed a strike of sufficient strenghth to \"teach a lesson\" or in the present day euphemism \"send a message\" The military is to kill people and break things, it IS NOT for delivering messages, or the Pizza, as in the Clinton administration!!!!", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "", 
        "reply": "After thirty some years of STATE SPONSORED terrorism when is it all right, O.K., justified, Approved by YOU to strike BACK!!! Did you approve of Afghanistan at first and now are criticising only after the known resultys are in or were you cheering them on when we were killing them any way we could?? After all how much of a strike would have been enough?? A burned tent and a couple of dead camels?? A dead janitor in an aspirin factory?? How much would have been enough?? AND, just WHO SPECIFICALLY would YOU have killed?? Kabul, Tora Bora? Carpet bomb the entire northeastern section of A-Stan WHO??? WHERE??? How many???? Would you have termed a strike of sufficient strenghth to \"teach a lesson\" or in the present day euphemism \"send a message\" The military is to kill people and break things, it IS NOT for delivering messages, or the Pizza, as in the Clinton administration!!!!", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 06:51:00", 
        "title": "This is what were up against", 
        "userID": "tawodi"
    }, 
    {
        "content": "it's astounding how much is read into my post when it's a historical fact that the only nation, group, or individual ever to use a nuclear bomb deliberately to kill people is the united states justifications aren't really relevant; i'm sure if nuclear weapons are ever used again, their user will feel justified in doing so.", 
        "intTime": 20090413, 
        "postID": 13, 
        "quote": "", 
        "reply": "it's astounding how much is read into my post when it's a historical fact that the only nation, group, or individual ever to use a nuclear bomb deliberately to kill people is the united states justifications aren't really relevant; i'm sure if nuclear weapons are ever used again, their user will feel justified in doing so.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 07:25:00", 
        "title": "This is what were up against", 
        "userID": "liberal90"
    }, 
    {
        "content": "The ONLY justification needed is that over one million American and allied casualties were expected with the invasion of Japan. The incendiary bombing of her cities and towns, had all but eliminated the true ability to resist. BUT, the invasion of Okinawa proved that fanatical resistance was to be expected when invasion of Japanese soil was contemplated. Also the taking of Iwo Jima proved this as well. The brutality of the Japanese toward their own soldiers as a form of \"discipline\" was noted as well in these considerations and is what led to the decision to use the bomb. As I mentioned, the fire bombing of Tokyo and Okohama as well as Kyoto killed approx. three times as many human beings, as the a- bombs did and that is just three of the cities that were so bombed, with incendiaries. The fire bombing of Dresden and Hamburg in germany, also killed more human beings than either of the or both of the A-bombs did. These are facts. Easily researched and then it must be remembered, we didn't start the war and, the tenor of the times. If for instance we had used a nuclear weapon on Kabul for the attacks on the towers THAT would have been unconcienable. Quite frankly, I was concerned, VERY concerned, that we would do just that. As when G.W.B. somewhat intemperately used the phrase \"clear and present danger\" When he gave the ulimatum to the Taliban government about turning over those responsible for the attack on Afghanistan's soil, or we would retaliate with \"every means at our command\" THAT was scary stuff!! T", 
        "intTime": 20090413, 
        "postID": 14, 
        "quote": "", 
        "reply": "The ONLY justification needed is that over one million American and allied casualties were expected with the invasion of Japan. The incendiary bombing of her cities and towns, had all but eliminated the true ability to resist. BUT, the invasion of Okinawa proved that fanatical resistance was to be expected when invasion of Japanese soil was contemplated. Also the taking of Iwo Jima proved this as well. The brutality of the Japanese toward their own soldiers as a form of \"discipline\" was noted as well in these considerations and is what led to the decision to use the bomb. As I mentioned, the fire bombing of Tokyo and Okohama as well as Kyoto killed approx. three times as many human beings, as the a- bombs did and that is just three of the cities that were so bombed, with incendiaries. The fire bombing of Dresden and Hamburg in germany, also killed more human beings than either of the or both of the A-bombs did. These are facts. Easily researched and then it must be remembered, we didn't start the war and, the tenor of the times. If for instance we had used a nuclear weapon on Kabul for the attacks on the towers THAT would have been unconcienable. Quite frankly, I was concerned, VERY concerned, that we would do just that. As when G.W.B. somewhat intemperately used the phrase \"clear and present danger\" When he gave the ulimatum to the Taliban government about turning over those responsible for the attack on Afghanistan's soil, or we would retaliate with \"every means at our command\" THAT was scary stuff!! T", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 07:44:00", 
        "title": "This is what were up against", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by john2x: This hatred of western civilization will not and can not be won in an attempt to Change a culture. Once we expanded into Iraq and declared an Ideological global war that cemented the hatred and rallied every sleeping Arab muslim in the world. Had we dealt Afganistan a punishing blow that would have set them back a hundred years and then left,We would have been far better off. It would have been considered a retalitory strike by the super power and a warning to the next nation of what happens when you anger America. But by playing these hearts and mind games and surges then rebuilding the whole country,8 years and no win in sight,They are emboldened and hate us more than ever they consider us weak. They mock us and laugh at us being divided vulnerable, broke, and weakened militarily. And once we leave they will go back to sq one and bask in the glory that they defeated the giant Infidel. So what are the choices at this point? \"http://www.tangle.com/view_video.php?viewkey=0861ff3eabea1ceb73e4\" I'd be 100% behind you..if we had not suffered through dozens of attacks prior to our invasion. Thats because we never responded strongly enough and set a proper example. When you dont give them something to think about it only encourages further attacks if they believe they can survive the response. Anyone can withstand a slap in the face and walk away angry thinking of a way to to get back. the idea is to cripple them and walk away not rebuild them.", 
        "intTime": 20090413, 
        "postID": 15, 
        "quote": "Originally posted by threerings: quote: Originally posted by john2x: This hatred of western civilization will not and can not be won in an attempt to Change a culture. Once we expanded into Iraq and declared an Ideological global war that cemented the hatred and rallied every sleeping Arab muslim in the world. Had we dealt Afganistan a punishing blow that would have set them back a hundred years and then left,We would have been far better off. It would have been considered a retalitory strike by the super power and a warning to the next nation of what happens when you anger America. But by playing these hearts and mind games and surges then rebuilding the whole country,8 years and no win in sight,They are emboldened and hate us more than ever they consider us weak. They mock us and laugh at us being divided vulnerable, broke, and weakened militarily. And once we leave they will go back to sq one and bask in the glory that they defeated the giant Infidel. So what are the choices at this point? \"http://www.tangle.com/view_video.php?viewkey=0861ff3eabea1ceb73e4\" I'd be 100% behind you..if we had not suffered through dozens of attacks prior to our invasion.", 
        "reply": " Thats because we never responded strongly enough and set a proper example. When you dont give them something to think about it only encourages further attacks if they believe they can survive the response. Anyone can withstand a slap in the face and walk away angry thinking of a way to to get back. the idea is to cripple them and walk away not rebuild them.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 09:40:00", 
        "title": "This is what were up against", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by tawodi: After thirty some years of STATE SPONSORED terrorism when is it all right, O.K., justified, Approved by YOU to strike BACK!!! Did you approve of Afghanistan at first and now are criticising only after the known resultys are in or were you cheering them on when we were killing them any way we could?? After all how much of a strike would have been enough?? A burned tent and a couple of dead camels?? A dead janitor in an aspirin factory?? How much would have been enough?? AND, just WHO SPECIFICALLY would YOU have killed?? Kabul, Tora Bora? Carpet bomb the entire northeastern section of A-Stan WHO??? WHERE??? How many???? Would you have termed a strike of sufficient strenghth to \"teach a lesson\" or in the present day euphemism \"send a message\" The military is to kill people and break things, it IS NOT for delivering messages, or the Pizza, as in the Clinton administration!!!! Carpet bomb them into the stone age and walk away leaving them to rebuild themselves. That would get the attention of those willing to risk a retaliation. once you decide to unleash the dogs of war total destruction should be the only agenda. Whats the point in being a super power where unarmed sand maggots dont fear or respect you and continue to **** with and threaten you?", 
        "intTime": 20090413, 
        "postID": 16, 
        "quote": "Originally posted by tawodi: After thirty some years of STATE SPONSORED terrorism when is it all right, O.K., justified, Approved by YOU to strike BACK!!! Did you approve of Afghanistan at first and now are criticising only after the known resultys are in or were you cheering them on when we were killing them any way we could?? After all how much of a strike would have been enough?? A burned tent and a couple of dead camels?? A dead janitor in an aspirin factory?? How much would have been enough?? AND, just WHO SPECIFICALLY would YOU have killed?? Kabul, Tora Bora? Carpet bomb the entire northeastern section of A-Stan WHO??? WHERE??? How many???? Would you have termed a strike of sufficient strenghth to \"teach a lesson\" or in the present day euphemism \"send a message\" The military is to kill people and break things, it IS NOT for delivering messages, or the Pizza, as in the Clinton administration!!!!", 
        "reply": " Carpet bomb them into the stone age and walk away leaving them to rebuild themselves. That would get the attention of those willing to risk a retaliation. once you decide to unleash the dogs of war total destruction should be the only agenda. Whats the point in being a super power where unarmed sand maggots dont fear or respect you and continue to **** with and threaten you?", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 09:55:00", 
        "title": "This is what were up against", 
        "userID": "john2x"
    }, 
    {
        "content": "Radical Islam is a trend that has been growing for at least the last 60 years. It has taken hold across the world. It is very unfortunate because the majority of Muslims are like the majority of people everywhere, good, honest, and kind. The thing is we should know by now that fighting counter insurgencies is difficult. We will never be able to kill enough terrorists to make ourselves completely safe from terrorist attacks.", 
        "intTime": 20090413, 
        "postID": 17, 
        "quote": "", 
        "reply": "Radical Islam is a trend that has been growing for at least the last 60 years. It has taken hold across the world. It is very unfortunate because the majority of Muslims are like the majority of people everywhere, good, honest, and kind. The thing is we should know by now that fighting counter insurgencies is difficult. We will never be able to kill enough terrorists to make ourselves completely safe from terrorist attacks.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 10:00:00", 
        "title": "This is what were up against", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right Keep in mind that little Boy and Fat man were prototypes and better that we were the first to show the world the devastation of nuclear energy on an enemy so deserving of being the test subjects. Germany and Japan were well on thier way of developing the bomb and further advanced than we were we just beat them to it. It was inevitable someone would have used it and better us than them.", 
        "intTime": 20090413, 
        "postID": 18, 
        "quote": "Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right", 
        "reply": " Keep in mind that little Boy and Fat man were prototypes and better that we were the first to show the world the devastation of nuclear energy on an enemy so deserving of being the test subjects. Germany and Japan were well on thier way of developing the bomb and further advanced than we were we just beat them to it. It was inevitable someone would have used it and better us than them.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 11:11:00", 
        "title": "This is what were up against", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by liberal90: it's astounding how much is read into my post when it's a historical fact that the only nation, group, or individual ever to use a nuclear bomb deliberately to kill people is the united states justifications aren't really relevant; i'm sure if nuclear weapons are ever used again, their user will feel justified in doing so. WTF?--Justifications aren't really relevant? Who makes that determination...you? It was certainly relevant to all the moms, dads, sons, daughters, wives and sweethearts of our guys who were spared from invading Japan in 1945. Better them than us...and with your kind of attitude, better you than me-lol \"You'd better be able to sandpaper a Bobcat's butt in a phone booth if you want some of this.", 
        "intTime": 20090413, 
        "postID": 19, 
        "quote": "Originally posted by liberal90: it's astounding how much is read into my post when it's a historical fact that the only nation, group, or individual ever to use a nuclear bomb deliberately to kill people is the united states justifications aren't really relevant; i'm sure if nuclear weapons are ever used again, their user will feel justified in doing so.", 
        "reply": " WTF?--Justifications aren't really relevant? Who makes that determination...you? It was certainly relevant to all the moms, dads, sons, daughters, wives and sweethearts of our guys who were spared from invading Japan in 1945. Better them than us...and with your kind of attitude, better you than me-lol \"You'd better be able to sandpaper a Bobcat's butt in a phone booth if you want some of this.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 11:11:00", 
        "title": "This is what were up against", 
        "userID": "pickerfromhell"
    }, 
    {
        "content": "quote: Keep in mind that little Boy and Fat man were prototypes and better that we were the first to show the world the devastation of nuclear energy on an enemy so deserving of being the test subjects. Germany and Japan were well on thier way of developing the bomb and further advanced than we were we just beat them to it. It was inevitable someone would have used it and better us than them. You know you're trying logic on someone who thinks we should give America back to the indians and then jump in the ocean and drown. Of course Lib90 is waiting for others to do it first and then he will follow.", 
        "intTime": 20090413, 
        "postID": 20, 
        "quote": "Keep in mind that little Boy and Fat man were prototypes and better that we were the first to show the world the devastation of nuclear energy on an enemy so deserving of being the test subjects. Germany and Japan were well on thier way of developing the bomb and further advanced than we were we just beat them to it. It was inevitable someone would have used it and better us than them.", 
        "reply": " You know you're trying logic on someone who thinks we should give America back to the indians and then jump in the ocean and drown. Of course Lib90 is waiting for others to do it first and then he will follow.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 11:14:00", 
        "title": "This is what were up against", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by tawodi: The ONLY justification needed is that over one million American and allied casualties were expected with the invasion of Japan. The incendiary bombing of her cities and towns, had all but eliminated the true ability to resist. BUT, the invasion of Okinawa proved that fanatical resistance was to be expected when invasion of Japanese soil was contemplated. Also the taking of Iwo Jima proved this as well. The brutality of the Japanese toward their own soldiers as a form of \"discipline\" was noted as well in these considerations and is what led to the decision to use the bomb. As I mentioned, the fire bombing of Tokyo and Okohama as well as Kyoto killed approx. three times as many human beings, as the a- bombs did and that is just three of the cities that were so bombed, with incendiaries. The fire bombing of Dresden and Hamburg in germany, also killed more human beings than either of the or both of the A-bombs did. These are facts. Easily researched and then it must be remembered, we didn't start the war and, the tenor of the times. If for instance we had used a nuclear weapon on Kabul for the attacks on the towers THAT would have been unconcienable. Quite frankly, I was concerned, VERY concerned, that we would do just that. As when G.W.B. somewhat intemperately used the phrase \"clear and present danger\" When he gave the ulimatum to the Taliban government about turning over those responsible for the attack on Afghanistan's soil, or we would retaliate with \"every means at our command\" THAT was scary stuff!! T", 
        "intTime": 20090413, 
        "postID": 21, 
        "quote": "Originally posted by tawodi: The ONLY justification needed is that over one million American and allied casualties were expected with the invasion of Japan. The incendiary bombing of her cities and towns, had all but eliminated the true ability to resist. BUT, the invasion of Okinawa proved that fanatical resistance was to be expected when invasion of Japanese soil was contemplated. Also the taking of Iwo Jima proved this as well. The brutality of the Japanese toward their own soldiers as a form of \"discipline\" was noted as well in these considerations and is what led to the decision to use the bomb. As I mentioned, the fire bombing of Tokyo and Okohama as well as Kyoto killed approx. three times as many human beings, as the a- bombs did and that is just three of the cities that were so bombed, with incendiaries. The fire bombing of Dresden and Hamburg in germany, also killed more human beings than either of the or both of the A-bombs did. These are facts. Easily researched and then it must be remembered, we didn't start the war and, the tenor of the times. If for instance we had used a nuclear weapon on Kabul for the attacks on the towers THAT would have been unconcienable. Quite frankly, I was concerned, VERY concerned, that we would do just that. As when G.W.B. somewhat intemperately used the phrase \"clear and present danger\" When he gave the ulimatum to the Taliban government about turning over those responsible for the attack on Afghanistan's soil, or we would retaliate with \"every means at our command\" THAT was scary stuff!! T", 
        "reply": "", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "This is what were up against", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Quite frankly, I was concerned, VERY concerned, that we would do just that. As when G.W.B. somewhat intemperately used the phrase \"clear and present danger\" When he gave the ulimatum to the Taliban government about turning over those responsible for the attack on Afghanistan's soil, or we would retaliate with \"every means at our command\" THAT was scary stuff!! I suppose your mindset leads you that way. The whole conspiracy around every turn/worse case scenerio thing. Few people gave any thought to an idea that we would use nuclear weapons in Afghanistan.", 
        "intTime": 20090413, 
        "postID": 22, 
        "quote": "Quite frankly, I was concerned, VERY concerned, that we would do just that. As when G.W.B. somewhat intemperately used the phrase \"clear and present danger\" When he gave the ulimatum to the Taliban government about turning over those responsible for the attack on Afghanistan's soil, or we would retaliate with \"every means at our command\" THAT was scary stuff!!", 
        "reply": " I suppose your mindset leads you that way. The whole conspiracy around every turn/worse case scenerio thing. Few people gave any thought to an idea that we would use nuclear weapons in Afghanistan.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 11:53:00", 
        "title": "This is what were up against", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: I suppose your mindset leads you that way. The whole conspiracy around every turn/worse case scenerio thing. Few people gave any thought to an idea that we would use nuclear weapons in Afghanistan. I don't think we would either. According to Donald Rumsfeld, there weren't enough targets in Afghanistan.", 
        "intTime": 20090413, 
        "postID": 23, 
        "quote": "Originally posted by foxred03: I suppose your mindset leads you that way. The whole conspiracy around every turn/worse case scenerio thing. Few people gave any thought to an idea that we would use nuclear weapons in Afghanistan.", 
        "reply": " I don't think we would either. According to Donald Rumsfeld, there weren't enough targets in Afghanistan.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 13:19:00", 
        "title": "This is what were up against", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Keep in mind that little Boy and Fat man were prototypes and better that we were the first to show the world the devastation of nuclear energy on an enemy so deserving of being the test subjects. Germany and Japan were well on thier way of developing the bomb and further advanced than we were we just beat them to it. It was inevitable someone would have used it and better us than them. You know you're trying logic on someone who thinks we should give America back to the indians and then jump in the ocean and drown. Of course Lib90 is waiting for others to do it first and then he will follow. No, he'll declare himself part native american and start shoving whites into the ocean.", 
        "intTime": 20090413, 
        "postID": 24, 
        "quote": "Originally posted by soscorpio: quote: Keep in mind that little Boy and Fat man were prototypes and better that we were the first to show the world the devastation of nuclear energy on an enemy so deserving of being the test subjects. Germany and Japan were well on thier way of developing the bomb and further advanced than we were we just beat them to it. It was inevitable someone would have used it and better us than them. You know you're trying logic on someone who thinks we should give America back to the indians and then jump in the ocean and drown. Of course Lib90 is waiting for others to do it first and then he will follow.", 
        "reply": " No, he'll declare himself part native american and start shoving whites into the ocean.", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-13 14:14:00", 
        "title": "This is what were up against", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by USNVet940: MOD HAT OFF quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right Oh, yeah! How dare the United States fight back against a treacherous, war-mongering nation who was talking \"peace\" out one side of their mouth while planning--and carrying out--a merciless war of conquest! How dare the United States use a weapon to bring a swift end to the most destructive war in human history! How dare the United States to not have needlessly sacrificed more of it's most valuable resource to appease wrist-wringers 60+ years later who decry the \"inhumanity\" of the use of the bomb! Thank you USNVet940! Well said!", 
        "intTime": 20090414, 
        "postID": 25, 
        "quote": "Originally posted by USNVet940: MOD HAT OFF quote: Originally posted by liberal90: quote: Originally posted by Boots_: There is no other group in the world that has ever claimed the desire to obtain nuclear weapons in order to actually use them. Only radical islamists. you mean beyond the united states right Oh, yeah! How dare the United States fight back against a treacherous, war-mongering nation who was talking \"peace\" out one side of their mouth while planning--and carrying out--a merciless war of conquest! How dare the United States use a weapon to bring a swift end to the most destructive war in human history! How dare the United States to not have needlessly sacrificed more of it's most valuable resource to appease wrist-wringers 60+ years later who decry the \"inhumanity\" of the use of the bomb!", 
        "reply": " Thank you USNVet940! Well said!", 
        "threadID": "409192893_3460055022001", 
        "time": "2009-04-14 00:41:00", 
        "title": "This is what were up against", 
        "userID": "TomGustafson"
    }
]