[
    {
        "content": "Remember \"General Betrayus\" and the faux outrage that elicited here on this board? Funny, not a peep about this: \"http://www.youtube.com/watch?v=3nR68lqbxs8\" What should be \"buttoned up\" is Limbaugh's mouth...", 
        "intTime": 20090528, 
        "postID": 1, 
        "quote": "", 
        "reply": "Remember \"General Betrayus\" and the faux outrage that elicited here on this board? Funny, not a peep about this: \"http://www.youtube.com/watch?v=3nR68lqbxs8\" What should be \"buttoned up\" is Limbaugh's mouth...", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:09:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Fuax outrage huh, no Sea it was real dems calling a Gen in a combat zone leading our troops a lyer before he has even spoken it is real outrage. Didnt think you got it then and no surprise you still havent figured it out. Cant get stupidtube from where I am but if he did say it it was probably in humor and if so it was sophomoric, funny how libs are the only ones that can make comedic statements. Just like that stupid fuggn comedy at the WH press dinner that Obama yucked it up at, you know the stupid fuggn rag that wished death on someone and got a laugh from Mr 'Bring Us Together' Obama. And if we 'conservatives' havent made comments it is because we are not on the Daily Kook newsletter mailing list.", 
        "intTime": 20090528, 
        "postID": 2, 
        "quote": "", 
        "reply": "Fuax outrage huh, no Sea it was real dems calling a Gen in a combat zone leading our troops a lyer before he has even spoken it is real outrage. Didnt think you got it then and no surprise you still havent figured it out. Cant get stupidtube from where I am but if he did say it it was probably in humor and if so it was sophomoric, funny how libs are the only ones that can make comedic statements. Just like that stupid fuggn comedy at the WH press dinner that Obama yucked it up at, you know the stupid fuggn rag that wished death on someone and got a laugh from Mr 'Bring Us Together' Obama. And if we 'conservatives' havent made comments it is because we are not on the Daily Kook newsletter mailing list.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:28:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"The World's Finest\"", 
        "intTime": 20090528, 
        "postID": 3, 
        "quote": "", 
        "reply": "The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"The World's Finest\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:35:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I guess I should have been outraged that a member here kept calling me Gummy. I mean how dare someone make fun of my rank, after all I am a retired Marine and therefore immune to those kind of things.", 
        "intTime": 20090528, 
        "postID": 4, 
        "quote": "", 
        "reply": "I guess I should have been outraged that a member here kept calling me Gummy. I mean how dare someone make fun of my rank, after all I am a retired Marine and therefore immune to those kind of things.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:40:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "intTime": 20090528, 
        "postID": 5, 
        "quote": "", 
        "reply": "Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:44:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Agree. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 6, 
        "quote": "Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "reply": " Agree. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 06:18:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "Rush is determined to destroy the Republican Party.", 
        "intTime": 20090528, 
        "postID": 7, 
        "quote": "", 
        "reply": "Rush is determined to destroy the Republican Party.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:12:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "What's really sad is that people here fall into the same category with the name calling.. If it is wrong for Rush to do so, then it's JUST as wrong for others to do the same.. (pot meet kettle) And kegler, I agree, it really is interesting to hear that so many liberals listen more to Rush than do some of us who are more conservative..the only time I hear about Rush and what he is saying is when liberals on here rant and rave about it.. and personally, I have no idea WHO Rush leads, sounds like some folks who hate him follow after him more than others..", 
        "intTime": 20090528, 
        "postID": 8, 
        "quote": "", 
        "reply": "What's really sad is that people here fall into the same category with the name calling.. If it is wrong for Rush to do so, then it's JUST as wrong for others to do the same.. (pot meet kettle) And kegler, I agree, it really is interesting to hear that so many liberals listen more to Rush than do some of us who are more conservative..the only time I hear about Rush and what he is saying is when liberals on here rant and rave about it.. and personally, I have no idea WHO Rush leads, sounds like some folks who hate him follow after him more than others..", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:15:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"betrayed the republican party\" that is lovely... more like he fell on his sword for the republican party's war agenda. if any one was betrayed, it was he, by the republican party.", 
        "intTime": 20090528, 
        "postID": 9, 
        "quote": "Originally posted by Kegler300: The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party.", 
        "reply": " \"betrayed the republican party\" that is lovely... more like he fell on his sword for the republican party's war agenda. if any one was betrayed, it was he, by the republican party.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:24:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Elesso"
    }, 
    {
        "content": "to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "intTime": 20090528, 
        "postID": 10, 
        "quote": "", 
        "reply": "to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:27:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. Now as far as Powell he had his moderate in McCain but he went for a leftist and socialist. Obama is not a mod and never has been so yeh, powell doesnt make since. I still repsect the made but his opinions on politics are suspect.", 
        "intTime": 20090528, 
        "postID": 11, 
        "quote": "Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "reply": " So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. Now as far as Powell he had his moderate in McCain but he went for a leftist and socialist. Obama is not a mod and never has been so yeh, powell doesnt make since. I still repsect the made but his opinions on politics are suspect.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:36:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "intTime": 20090528, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs.", 
        "reply": " When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:38:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "intTime": 20090528, 
        "postID": 13, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "reply": " LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:46:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is.", 
        "intTime": 20090528, 
        "postID": 14, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "reply": " In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:06:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try", 
        "intTime": 20090528, 
        "postID": 15, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point.", 
        "reply": " nice try", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:10:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 16, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:18:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "intTime": 20090528, 
        "postID": 17, 
        "quote": "", 
        "reply": "Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:21:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing. Greatest scam in American history...make the people believe there is an actual difference between the two! Throw them a bone periodically; i.e. abortion debate, and they’ll be content & drink the Kool-aid forever. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 18, 
        "quote": "Originally posted by soscorpio: Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "reply": " Greatest scam in American history...make the people believe there is an actual difference between the two! Throw them a bone periodically; i.e. abortion debate, and they’ll be content & drink the Kool-aid forever. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:31:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "10-4", 
        "intTime": 20090528, 
        "postID": 19, 
        "quote": "", 
        "reply": "10-4", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:53:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try Gunny, if you want to say Rush does not represent conservatives, I'm squarely behind you. And I agree that the DNC has spent a lot of time tying Rush to the RNC. But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. It looks more and more like denying or defying Rush is denying and defying the party. You may want to consider jumping ship - there are other conservative parties out there, most of them much less objectionable right now.", 
        "intTime": 20090528, 
        "postID": 20, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try", 
        "reply": " Gunny, if you want to say Rush does not represent conservatives, I'm squarely behind you. And I agree that the DNC has spent a lot of time tying Rush to the RNC. But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. It looks more and more like denying or defying Rush is denying and defying the party. You may want to consider jumping ship - there are other conservative parties out there, most of them much less objectionable right now.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 09:07:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "intTime": 20090528, 
        "postID": 21, 
        "quote": "But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it.", 
        "reply": "cosmicfish;  Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:02:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say.. No group is truly homogenous - even clones would disagree. Nonetheless, the purpose of a party is to use the collective strength of shared beliefs. If you do not share the majority of those beliefs, you are in the wrong party. Nonetheless, it seems as though the majority of the Republican Party is giving a tacit acceptance that Rush is a national leader of the party. To what extent do you disagree? Who do you feel better represents your opinions in the party, and what is the strength of their voice?", 
        "intTime": 20090528, 
        "postID": 22, 
        "quote": "Originally posted by 3678131: cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "reply": " No group is truly homogenous - even clones would disagree. Nonetheless, the purpose of a party is to use the collective strength of shared beliefs. If you do not share the majority of those beliefs, you are in the wrong party. Nonetheless, it seems as though the majority of the Republican Party is giving a tacit acceptance that Rush is a national leader of the party. To what extent do you disagree? Who do you feel better represents your opinions in the party, and what is the strength of their voice?", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:25:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. So if we don't fall all over ourselves attacking Limbaugh that hardly equates to supporting him. Limpballs? The only difference getween Rush and Seawitch is that Rush is a millionare. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Like the hypocracy of using name calling to point out Rush Limbaugh is doing the same thing?", 
        "intTime": 20090528, 
        "postID": 23, 
        "quote": "Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. So if we don't fall all over ourselves attacking Limbaugh that hardly equates to supporting him. Limpballs? The only difference getween Rush and Seawitch is that Rush is a millionare. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Like the hypocracy of using name calling to point out Rush Limbaugh is doing the same thing?", 
        "reply": "", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:27:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "intTime": 20090528, 
        "postID": 24, 
        "quote": "", 
        "reply": "Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 12:21:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!! He quite clearly says \"genital\" vice general. Perhaps you should take your own advice regarding ear cleaning. \"http://www.youtube.com/watch?v=3nR68lqbxs8\"", 
        "intTime": 20090528, 
        "postID": 25, 
        "quote": "Originally posted by charlie_echo: Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "reply": " He quite clearly says \"genital\" vice general. Perhaps you should take your own advice regarding ear cleaning. \"http://www.youtube.com/watch?v=3nR68lqbxs8\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 13:56:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Rush is determined to destroy the Republican Party. Limbaugh and Cheney combined don't have Powell's approval rating... \"http://www.newser.com/story/60115/cheney-limbaugh-cant-touch-powell-in-popularity.html?utm_source=syn&utm_medium=rss&utm_campaign=hom\"", 
        "intTime": 20090528, 
        "postID": 26, 
        "quote": "Originally posted by PhoenixDark: Rush is determined to destroy the Republican Party.", 
        "reply": " Limbaugh and Cheney combined don't have Powell's approval rating... \"http://www.newser.com/story/60115/cheney-limbaugh-cant-touch-powell-in-popularity.html?utm_source=syn&utm_medium=rss&utm_campaign=hom\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:02:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "My personal opnion is ANYONE who professes a one party platform...or undying loyalty or fealty to the ENTIRE doctrine ISN'T entirely honest. Although I'm sure some may be incentivized to declare such... We the People of America are an individualistic bunch of miscreants... That being said, who really buys what these sort of people say...in the entirety? Whether left wing or right wing sheet stirrers?", 
        "intTime": 20090528, 
        "postID": 27, 
        "quote": "", 
        "reply": "My personal opnion is ANYONE who professes a one party platform...or undying loyalty or fealty to the ENTIRE doctrine ISN'T entirely honest. Although I'm sure some may be incentivized to declare such... We the People of America are an individualistic bunch of miscreants... That being said, who really buys what these sort of people say...in the entirety? Whether left wing or right wing sheet stirrers?", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:05:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: That being said, who really buys what these sort of people say.. The ones that got their undies in a bunch over the moveon.org ad sure \"bought\" it. Funny that this isn't even a \"blip\" on their radar though. Just proves the \"faux\" outrage claim.", 
        "intTime": 20090528, 
        "postID": 28, 
        "quote": "Originally posted by strobelvets: That being said, who really buys what these sort of people say..", 
        "reply": " The ones that got their undies in a bunch over the moveon.org ad sure \"bought\" it. Funny that this isn't even a \"blip\" on their radar though. Just proves the \"faux\" outrage claim.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:17:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Well SisterVET..we disagree many topics...but I have to admit that our reps focusing on \"politics as usual\" BS in these times seems damning to their actual agendas... As I watch the local economy hereabouts...crumble...I wonder why our Reps still don't get it...", 
        "intTime": 20090528, 
        "postID": 29, 
        "quote": "", 
        "reply": "Well SisterVET..we disagree many topics...but I have to admit that our reps focusing on \"politics as usual\" BS in these times seems damning to their actual agendas... As I watch the local economy hereabouts...crumble...I wonder why our Reps still don't get it...", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:22:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=3nR68lqbxs8 Well just listened to it and you people are so fuggn desperate to get dirt on anyone that opposes your view will actually make scheisen up now. He said Gen you freakin _________.! Freakin pathetic! Talk about faux. We have a poster here comparing this to Moveon calling a AD Gen a betrayer of the US and a Dem Sen calling him a lyer and this poster compares this youboob vid to that good god talk about ate up! As far as not a blip on our screen it is because you got suckered with this, from one of your lefty newsletters. And I dont remember you complaining about Kerry, Durbin, Murtha's and others negative remarks about the military. Oh, wait a minute I think that is when you were on vacation for slamming the 'Marlboro Marine'. Hypocrite....", 
        "intTime": 20090528, 
        "postID": 30, 
        "quote": "http://www.youtube.com/watch?v=3nR68lqbxs8", 
        "reply": " Well just listened to it and you people are so fuggn desperate to get dirt on anyone that opposes your view will actually make scheisen up now. He said Gen you freakin _________.! Freakin pathetic! Talk about faux. We have a poster here comparing this to Moveon calling a AD Gen a betrayer of the US and a Dem Sen calling him a lyer and this poster compares this youboob vid to that good god talk about ate up! As far as not a blip on our screen it is because you got suckered with this, from one of your lefty newsletters. And I dont remember you complaining about Kerry, Durbin, Murtha's and others negative remarks about the military. Oh, wait a minute I think that is when you were on vacation for slamming the 'Marlboro Marine'. Hypocrite....", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:33:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Remember \"General Betrayus\" and the faux outrage that elicited here on this board? Funny, not a peep about this: \"http://www.youtube.com/watch?v=3nR68lqbxs8\" What should be \"buttoned up\" is Limbaugh's mouth...", 
        "intTime": 20090528, 
        "postID": 31, 
        "quote": "", 
        "reply": "Remember \"General Betrayus\" and the faux outrage that elicited here on this board? Funny, not a peep about this: \"http://www.youtube.com/watch?v=3nR68lqbxs8\" What should be \"buttoned up\" is Limbaugh's mouth...", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:09:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Fuax outrage huh, no Sea it was real dems calling a Gen in a combat zone leading our troops a lyer before he has even spoken it is real outrage. Didnt think you got it then and no surprise you still havent figured it out. Cant get stupidtube from where I am but if he did say it it was probably in humor and if so it was sophomoric, funny how libs are the only ones that can make comedic statements. Just like that stupid fuggn comedy at the WH press dinner that Obama yucked it up at, you know the stupid fuggn rag that wished death on someone and got a laugh from Mr 'Bring Us Together' Obama. And if we 'conservatives' havent made comments it is because we are not on the Daily Kook newsletter mailing list.", 
        "intTime": 20090528, 
        "postID": 32, 
        "quote": "", 
        "reply": "Fuax outrage huh, no Sea it was real dems calling a Gen in a combat zone leading our troops a lyer before he has even spoken it is real outrage. Didnt think you got it then and no surprise you still havent figured it out. Cant get stupidtube from where I am but if he did say it it was probably in humor and if so it was sophomoric, funny how libs are the only ones that can make comedic statements. Just like that stupid fuggn comedy at the WH press dinner that Obama yucked it up at, you know the stupid fuggn rag that wished death on someone and got a laugh from Mr 'Bring Us Together' Obama. And if we 'conservatives' havent made comments it is because we are not on the Daily Kook newsletter mailing list.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:28:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"The World's Finest\"", 
        "intTime": 20090528, 
        "postID": 33, 
        "quote": "", 
        "reply": "The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"The World's Finest\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:35:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I guess I should have been outraged that a member here kept calling me Gummy. I mean how dare someone make fun of my rank, after all I am a retired Marine and therefore immune to those kind of things.", 
        "intTime": 20090528, 
        "postID": 34, 
        "quote": "", 
        "reply": "I guess I should have been outraged that a member here kept calling me Gummy. I mean how dare someone make fun of my rank, after all I am a retired Marine and therefore immune to those kind of things.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:40:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "intTime": 20090528, 
        "postID": 35, 
        "quote": "", 
        "reply": "Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:44:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Agree. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 36, 
        "quote": "Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "reply": " Agree. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 06:18:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "Rush is determined to destroy the Republican Party.", 
        "intTime": 20090528, 
        "postID": 37, 
        "quote": "", 
        "reply": "Rush is determined to destroy the Republican Party.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:12:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "What's really sad is that people here fall into the same category with the name calling.. If it is wrong for Rush to do so, then it's JUST as wrong for others to do the same.. (pot meet kettle) And kegler, I agree, it really is interesting to hear that so many liberals listen more to Rush than do some of us who are more conservative..the only time I hear about Rush and what he is saying is when liberals on here rant and rave about it.. and personally, I have no idea WHO Rush leads, sounds like some folks who hate him follow after him more than others..", 
        "intTime": 20090528, 
        "postID": 38, 
        "quote": "", 
        "reply": "What's really sad is that people here fall into the same category with the name calling.. If it is wrong for Rush to do so, then it's JUST as wrong for others to do the same.. (pot meet kettle) And kegler, I agree, it really is interesting to hear that so many liberals listen more to Rush than do some of us who are more conservative..the only time I hear about Rush and what he is saying is when liberals on here rant and rave about it.. and personally, I have no idea WHO Rush leads, sounds like some folks who hate him follow after him more than others..", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:15:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"betrayed the republican party\" that is lovely... more like he fell on his sword for the republican party's war agenda. if any one was betrayed, it was he, by the republican party.", 
        "intTime": 20090528, 
        "postID": 39, 
        "quote": "Originally posted by Kegler300: The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party.", 
        "reply": " \"betrayed the republican party\" that is lovely... more like he fell on his sword for the republican party's war agenda. if any one was betrayed, it was he, by the republican party.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:24:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Elesso"
    }, 
    {
        "content": "to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "intTime": 20090528, 
        "postID": 40, 
        "quote": "", 
        "reply": "to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:27:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. Now as far as Powell he had his moderate in McCain but he went for a leftist and socialist. Obama is not a mod and never has been so yeh, powell doesnt make since. I still repsect the made but his opinions on politics are suspect.", 
        "intTime": 20090528, 
        "postID": 41, 
        "quote": "Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "reply": " So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. Now as far as Powell he had his moderate in McCain but he went for a leftist and socialist. Obama is not a mod and never has been so yeh, powell doesnt make since. I still repsect the made but his opinions on politics are suspect.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:36:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "intTime": 20090528, 
        "postID": 42, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs.", 
        "reply": " When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:38:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "intTime": 20090528, 
        "postID": 43, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "reply": " LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:46:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is.", 
        "intTime": 20090528, 
        "postID": 44, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "reply": " In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:06:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try", 
        "intTime": 20090528, 
        "postID": 45, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point.", 
        "reply": " nice try", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:10:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 46, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:18:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "intTime": 20090528, 
        "postID": 47, 
        "quote": "", 
        "reply": "Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:21:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing. Greatest scam in American history...make the people believe there is an actual difference between the two! Throw them a bone periodically; i.e. abortion debate, and they’ll be content & drink the Kool-aid forever. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 48, 
        "quote": "Originally posted by soscorpio: Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "reply": " Greatest scam in American history...make the people believe there is an actual difference between the two! Throw them a bone periodically; i.e. abortion debate, and they’ll be content & drink the Kool-aid forever. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:31:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "10-4", 
        "intTime": 20090528, 
        "postID": 49, 
        "quote": "", 
        "reply": "10-4", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:53:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try Gunny, if you want to say Rush does not represent conservatives, I'm squarely behind you. And I agree that the DNC has spent a lot of time tying Rush to the RNC. But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. It looks more and more like denying or defying Rush is denying and defying the party. You may want to consider jumping ship - there are other conservative parties out there, most of them much less objectionable right now.", 
        "intTime": 20090528, 
        "postID": 50, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try", 
        "reply": " Gunny, if you want to say Rush does not represent conservatives, I'm squarely behind you. And I agree that the DNC has spent a lot of time tying Rush to the RNC. But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. It looks more and more like denying or defying Rush is denying and defying the party. You may want to consider jumping ship - there are other conservative parties out there, most of them much less objectionable right now.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 09:07:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "intTime": 20090528, 
        "postID": 51, 
        "quote": "But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it.", 
        "reply": "cosmicfish;  Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:02:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say.. No group is truly homogenous - even clones would disagree. Nonetheless, the purpose of a party is to use the collective strength of shared beliefs. If you do not share the majority of those beliefs, you are in the wrong party. Nonetheless, it seems as though the majority of the Republican Party is giving a tacit acceptance that Rush is a national leader of the party. To what extent do you disagree? Who do you feel better represents your opinions in the party, and what is the strength of their voice?", 
        "intTime": 20090528, 
        "postID": 52, 
        "quote": "Originally posted by 3678131: cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "reply": " No group is truly homogenous - even clones would disagree. Nonetheless, the purpose of a party is to use the collective strength of shared beliefs. If you do not share the majority of those beliefs, you are in the wrong party. Nonetheless, it seems as though the majority of the Republican Party is giving a tacit acceptance that Rush is a national leader of the party. To what extent do you disagree? Who do you feel better represents your opinions in the party, and what is the strength of their voice?", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:25:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. So if we don't fall all over ourselves attacking Limbaugh that hardly equates to supporting him. Limpballs? The only difference getween Rush and Seawitch is that Rush is a millionare. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Like the hypocracy of using name calling to point out Rush Limbaugh is doing the same thing?", 
        "intTime": 20090528, 
        "postID": 53, 
        "quote": "Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. So if we don't fall all over ourselves attacking Limbaugh that hardly equates to supporting him. Limpballs? The only difference getween Rush and Seawitch is that Rush is a millionare. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Like the hypocracy of using name calling to point out Rush Limbaugh is doing the same thing?", 
        "reply": "", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:27:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "intTime": 20090528, 
        "postID": 54, 
        "quote": "", 
        "reply": "Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 12:21:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!! He quite clearly says \"genital\" vice general. Perhaps you should take your own advice regarding ear cleaning. \"http://www.youtube.com/watch?v=3nR68lqbxs8\"", 
        "intTime": 20090528, 
        "postID": 55, 
        "quote": "Originally posted by charlie_echo: Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "reply": " He quite clearly says \"genital\" vice general. Perhaps you should take your own advice regarding ear cleaning. \"http://www.youtube.com/watch?v=3nR68lqbxs8\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 13:56:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Rush is determined to destroy the Republican Party. Limbaugh and Cheney combined don't have Powell's approval rating... \"http://www.newser.com/story/60115/cheney-limbaugh-cant-touch-powell-in-popularity.html?utm_source=syn&utm_medium=rss&utm_campaign=hom\"", 
        "intTime": 20090528, 
        "postID": 56, 
        "quote": "Originally posted by PhoenixDark: Rush is determined to destroy the Republican Party.", 
        "reply": " Limbaugh and Cheney combined don't have Powell's approval rating... \"http://www.newser.com/story/60115/cheney-limbaugh-cant-touch-powell-in-popularity.html?utm_source=syn&utm_medium=rss&utm_campaign=hom\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:02:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "My personal opnion is ANYONE who professes a one party platform...or undying loyalty or fealty to the ENTIRE doctrine ISN'T entirely honest. Although I'm sure some may be incentivized to declare such... We the People of America are an individualistic bunch of miscreants... That being said, who really buys what these sort of people say...in the entirety? Whether left wing or right wing sheet stirrers?", 
        "intTime": 20090528, 
        "postID": 57, 
        "quote": "", 
        "reply": "My personal opnion is ANYONE who professes a one party platform...or undying loyalty or fealty to the ENTIRE doctrine ISN'T entirely honest. Although I'm sure some may be incentivized to declare such... We the People of America are an individualistic bunch of miscreants... That being said, who really buys what these sort of people say...in the entirety? Whether left wing or right wing sheet stirrers?", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:05:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: That being said, who really buys what these sort of people say.. The ones that got their undies in a bunch over the moveon.org ad sure \"bought\" it. Funny that this isn't even a \"blip\" on their radar though. Just proves the \"faux\" outrage claim.", 
        "intTime": 20090528, 
        "postID": 58, 
        "quote": "Originally posted by strobelvets: That being said, who really buys what these sort of people say..", 
        "reply": " The ones that got their undies in a bunch over the moveon.org ad sure \"bought\" it. Funny that this isn't even a \"blip\" on their radar though. Just proves the \"faux\" outrage claim.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:17:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Well SisterVET..we disagree many topics...but I have to admit that our reps focusing on \"politics as usual\" BS in these times seems damning to their actual agendas... As I watch the local economy hereabouts...crumble...I wonder why our Reps still don't get it...", 
        "intTime": 20090528, 
        "postID": 59, 
        "quote": "", 
        "reply": "Well SisterVET..we disagree many topics...but I have to admit that our reps focusing on \"politics as usual\" BS in these times seems damning to their actual agendas... As I watch the local economy hereabouts...crumble...I wonder why our Reps still don't get it...", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:22:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=3nR68lqbxs8 Well just listened to it and you people are so fuggn desperate to get dirt on anyone that opposes your view will actually make scheisen up now. He said Gen you freakin _________.! Freakin pathetic! Talk about faux. We have a poster here comparing this to Moveon calling a AD Gen a betrayer of the US and a Dem Sen calling him a lyer and this poster compares this youboob vid to that good god talk about ate up! As far as not a blip on our screen it is because you got suckered with this, from one of your lefty newsletters. And I dont remember you complaining about Kerry, Durbin, Murtha's and others negative remarks about the military. Oh, wait a minute I think that is when you were on vacation for slamming the 'Marlboro Marine'. Hypocrite....", 
        "intTime": 20090528, 
        "postID": 60, 
        "quote": "http://www.youtube.com/watch?v=3nR68lqbxs8", 
        "reply": " Well just listened to it and you people are so fuggn desperate to get dirt on anyone that opposes your view will actually make scheisen up now. He said Gen you freakin _________.! Freakin pathetic! Talk about faux. We have a poster here comparing this to Moveon calling a AD Gen a betrayer of the US and a Dem Sen calling him a lyer and this poster compares this youboob vid to that good god talk about ate up! As far as not a blip on our screen it is because you got suckered with this, from one of your lefty newsletters. And I dont remember you complaining about Kerry, Durbin, Murtha's and others negative remarks about the military. Oh, wait a minute I think that is when you were on vacation for slamming the 'Marlboro Marine'. Hypocrite....", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:33:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Remember \"General Betrayus\" and the faux outrage that elicited here on this board? Funny, not a peep about this: \"http://www.youtube.com/watch?v=3nR68lqbxs8\" What should be \"buttoned up\" is Limbaugh's mouth...", 
        "intTime": 20090528, 
        "postID": 61, 
        "quote": "", 
        "reply": "Remember \"General Betrayus\" and the faux outrage that elicited here on this board? Funny, not a peep about this: \"http://www.youtube.com/watch?v=3nR68lqbxs8\" What should be \"buttoned up\" is Limbaugh's mouth...", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:09:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Fuax outrage huh, no Sea it was real dems calling a Gen in a combat zone leading our troops a lyer before he has even spoken it is real outrage. Didnt think you got it then and no surprise you still havent figured it out. Cant get stupidtube from where I am but if he did say it it was probably in humor and if so it was sophomoric, funny how libs are the only ones that can make comedic statements. Just like that stupid fuggn comedy at the WH press dinner that Obama yucked it up at, you know the stupid fuggn rag that wished death on someone and got a laugh from Mr 'Bring Us Together' Obama. And if we 'conservatives' havent made comments it is because we are not on the Daily Kook newsletter mailing list.", 
        "intTime": 20090528, 
        "postID": 62, 
        "quote": "", 
        "reply": "Fuax outrage huh, no Sea it was real dems calling a Gen in a combat zone leading our troops a lyer before he has even spoken it is real outrage. Didnt think you got it then and no surprise you still havent figured it out. Cant get stupidtube from where I am but if he did say it it was probably in humor and if so it was sophomoric, funny how libs are the only ones that can make comedic statements. Just like that stupid fuggn comedy at the WH press dinner that Obama yucked it up at, you know the stupid fuggn rag that wished death on someone and got a laugh from Mr 'Bring Us Together' Obama. And if we 'conservatives' havent made comments it is because we are not on the Daily Kook newsletter mailing list.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:28:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"The World's Finest\"", 
        "intTime": 20090528, 
        "postID": 63, 
        "quote": "", 
        "reply": "The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"The World's Finest\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:35:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I guess I should have been outraged that a member here kept calling me Gummy. I mean how dare someone make fun of my rank, after all I am a retired Marine and therefore immune to those kind of things.", 
        "intTime": 20090528, 
        "postID": 64, 
        "quote": "", 
        "reply": "I guess I should have been outraged that a member here kept calling me Gummy. I mean how dare someone make fun of my rank, after all I am a retired Marine and therefore immune to those kind of things.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:40:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "intTime": 20090528, 
        "postID": 65, 
        "quote": "", 
        "reply": "Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 05:44:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Agree. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 66, 
        "quote": "Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. (I'm really NOT shocked by the hypocrisy. It is standard fare...)", 
        "reply": " Agree. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 06:18:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "Rush is determined to destroy the Republican Party.", 
        "intTime": 20090528, 
        "postID": 67, 
        "quote": "", 
        "reply": "Rush is determined to destroy the Republican Party.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:12:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "What's really sad is that people here fall into the same category with the name calling.. If it is wrong for Rush to do so, then it's JUST as wrong for others to do the same.. (pot meet kettle) And kegler, I agree, it really is interesting to hear that so many liberals listen more to Rush than do some of us who are more conservative..the only time I hear about Rush and what he is saying is when liberals on here rant and rave about it.. and personally, I have no idea WHO Rush leads, sounds like some folks who hate him follow after him more than others..", 
        "intTime": 20090528, 
        "postID": 68, 
        "quote": "", 
        "reply": "What's really sad is that people here fall into the same category with the name calling.. If it is wrong for Rush to do so, then it's JUST as wrong for others to do the same.. (pot meet kettle) And kegler, I agree, it really is interesting to hear that so many liberals listen more to Rush than do some of us who are more conservative..the only time I hear about Rush and what he is saying is when liberals on here rant and rave about it.. and personally, I have no idea WHO Rush leads, sounds like some folks who hate him follow after him more than others..", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:15:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party. \"betrayed the republican party\" that is lovely... more like he fell on his sword for the republican party's war agenda. if any one was betrayed, it was he, by the republican party.", 
        "intTime": 20090528, 
        "postID": 69, 
        "quote": "Originally posted by Kegler300: The libs are so consumed with Rush it's hilarious! They must be suffering from RDS - Rush Derangement Syndrome! Seriously though, the libs here were very quiet when the democrats and NY Slimes were calling an active duty general, leading troops in combat, a liar and General \"Betrayus.\" But they get wrapped around the axle when Rush uses humor to refer to a long time retired general who has betrayed the republican party.", 
        "reply": " \"betrayed the republican party\" that is lovely... more like he fell on his sword for the republican party's war agenda. if any one was betrayed, it was he, by the republican party.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:24:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Elesso"
    }, 
    {
        "content": "to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "intTime": 20090528, 
        "postID": 70, 
        "quote": "", 
        "reply": "to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:27:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. Now as far as Powell he had his moderate in McCain but he went for a leftist and socialist. Obama is not a mod and never has been so yeh, powell doesnt make since. I still repsect the made but his opinions on politics are suspect.", 
        "intTime": 20090528, 
        "postID": 71, 
        "quote": "Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto.", 
        "reply": " So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. Now as far as Powell he had his moderate in McCain but he went for a leftist and socialist. Obama is not a mod and never has been so yeh, powell doesnt make since. I still repsect the made but his opinions on politics are suspect.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:36:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "intTime": 20090528, 
        "postID": 72, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs.", 
        "reply": " When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:38:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "intTime": 20090528, 
        "postID": 73, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled.", 
        "reply": " LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 07:46:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is.", 
        "intTime": 20090528, 
        "postID": 74, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers.", 
        "reply": " In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:06:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try", 
        "intTime": 20090528, 
        "postID": 75, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point.", 
        "reply": " nice try", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:10:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 76, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:18:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "intTime": 20090528, 
        "postID": 77, 
        "quote": "", 
        "reply": "Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:21:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing. Greatest scam in American history...make the people believe there is an actual difference between the two! Throw them a bone periodically; i.e. abortion debate, and they’ll be content & drink the Kool-aid forever. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090528, 
        "postID": 78, 
        "quote": "Originally posted by soscorpio: Don't forget NSNN, That \"crap pile\" benefits washington and our career power-brokers. No mistakes are made in washington, it is very calculated, and \"partisan BS\" is just a smooth way to keep the masses guessing.", 
        "reply": " Greatest scam in American history...make the people believe there is an actual difference between the two! Throw them a bone periodically; i.e. abortion debate, and they’ll be content & drink the Kool-aid forever. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:31:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "NSNN"
    }, 
    {
        "content": "10-4", 
        "intTime": 20090528, 
        "postID": 79, 
        "quote": "", 
        "reply": "10-4", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 08:53:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try Gunny, if you want to say Rush does not represent conservatives, I'm squarely behind you. And I agree that the DNC has spent a lot of time tying Rush to the RNC. But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. It looks more and more like denying or defying Rush is denying and defying the party. You may want to consider jumping ship - there are other conservative parties out there, most of them much less objectionable right now.", 
        "intTime": 20090528, 
        "postID": 80, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: to the original point there is absolutely Nothing that Rush says that can outrage me. the guy is a walking case of verbal diahrrea (sp?) that anyone thinks he is the voice of republicans is what amazes me. he is the voice of the disenfranchized americans who need some one to cling onto. So why do you listen to him? btw, maybe you havent figured this out, he gets paid to talk hence your verbal diarrhea. Are you amazed at Dems? They are the ones portraying him as the voice of repubs. When the Chairman of the RNC backtracks and apologizes to Rush for saying he isn't the Republican Party, the matter is settled. LMAO, in the mind of a lib. Funny how libs here and in the msm are giving advice to repubs on how to better the party. A party that they dont vote in. Repubs/conservs dont breath on word from the rnc. Do you jump when Dean hollers. In the mind of a Lib? The whole affair of Steele apologizing to Limbaugh is very well documented. The facts are easy to find - and the fact is that Steele backtracked from his statement that Rush was not the leader of the GOP and apologized to Rush for making that comment. FYI, John Dean isn't the head of the DNC - Tim Kaine is. Proves my point. nice try", 
        "reply": " Gunny, if you want to say Rush does not represent conservatives, I'm squarely behind you. And I agree that the DNC has spent a lot of time tying Rush to the RNC. But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. It looks more and more like denying or defying Rush is denying and defying the party. You may want to consider jumping ship - there are other conservative parties out there, most of them much less objectionable right now.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 09:07:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "intTime": 20090528, 
        "postID": 81, 
        "quote": "But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it.", 
        "reply": "cosmicfish;  Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:02:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say.. No group is truly homogenous - even clones would disagree. Nonetheless, the purpose of a party is to use the collective strength of shared beliefs. If you do not share the majority of those beliefs, you are in the wrong party. Nonetheless, it seems as though the majority of the Republican Party is giving a tacit acceptance that Rush is a national leader of the party. To what extent do you disagree? Who do you feel better represents your opinions in the party, and what is the strength of their voice?", 
        "intTime": 20090528, 
        "postID": 82, 
        "quote": "Originally posted by 3678131: cosmicfish; quote: But I am not aware of anyone with any clout in the Republican Party saying \"Rush does not represent us, does not represent Republican views or opinions.\" Michael Steele tried, and then had to frantically back-pedal. For all the work the Dems have done to make Rush the voice of Republicans, the Repubs have done virtually nothing to refute it. Personally, I don't listen to people who claim to have clout in either Party..because the ONLY reason ppl assume they have any clout in either party is because others assume they do.. I can't speak for EVERYONE who is a registered Republican any more than Rush speaks for EVERYONE registered to vote Republican.. Anymore than Hillary Clinton, Howard Dean or even Joe Biden speaks for EVERY registered Democrat.. everyone has their own views, and their own opinions on a variety of topics, and they don't always fall lock step with everything these folks say..", 
        "reply": " No group is truly homogenous - even clones would disagree. Nonetheless, the purpose of a party is to use the collective strength of shared beliefs. If you do not share the majority of those beliefs, you are in the wrong party. Nonetheless, it seems as though the majority of the Republican Party is giving a tacit acceptance that Rush is a national leader of the party. To what extent do you disagree? Who do you feel better represents your opinions in the party, and what is the strength of their voice?", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:25:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. So if we don't fall all over ourselves attacking Limbaugh that hardly equates to supporting him. Limpballs? The only difference getween Rush and Seawitch is that Rush is a millionare. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Like the hypocracy of using name calling to point out Rush Limbaugh is doing the same thing?", 
        "intTime": 20090528, 
        "postID": 83, 
        "quote": "Originally posted by SeaWitch1220: Yup, like I said \"faux\" outrage. Got their panties in a wad over \"Betrayus\" but will defend their leader Rush Limpballs even though he referred to General Colin Powell as \"Genital\" Powell. So if we don't fall all over ourselves attacking Limbaugh that hardly equates to supporting him. Limpballs? The only difference getween Rush and Seawitch is that Rush is a millionare. (I'm really NOT shocked by the hypocrisy. It is standard fare...) Like the hypocracy of using name calling to point out Rush Limbaugh is doing the same thing?", 
        "reply": "", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 10:27:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "intTime": 20090528, 
        "postID": 84, 
        "quote": "", 
        "reply": "Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 12:21:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!! He quite clearly says \"genital\" vice general. Perhaps you should take your own advice regarding ear cleaning. \"http://www.youtube.com/watch?v=3nR68lqbxs8\"", 
        "intTime": 20090528, 
        "postID": 85, 
        "quote": "Originally posted by charlie_echo: Now that the grandbabies are asleep and I could listen to this again... Rush isn't saying GENITAL he is saying GENERAL Powell. Go to the store. Buy some Q-tips and clean out those ears!!", 
        "reply": " He quite clearly says \"genital\" vice general. Perhaps you should take your own advice regarding ear cleaning. \"http://www.youtube.com/watch?v=3nR68lqbxs8\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 13:56:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Rush is determined to destroy the Republican Party. Limbaugh and Cheney combined don't have Powell's approval rating... \"http://www.newser.com/story/60115/cheney-limbaugh-cant-touch-powell-in-popularity.html?utm_source=syn&utm_medium=rss&utm_campaign=hom\"", 
        "intTime": 20090528, 
        "postID": 86, 
        "quote": "Originally posted by PhoenixDark: Rush is determined to destroy the Republican Party.", 
        "reply": " Limbaugh and Cheney combined don't have Powell's approval rating... \"http://www.newser.com/story/60115/cheney-limbaugh-cant-touch-powell-in-popularity.html?utm_source=syn&utm_medium=rss&utm_campaign=hom\"", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:02:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "My personal opnion is ANYONE who professes a one party platform...or undying loyalty or fealty to the ENTIRE doctrine ISN'T entirely honest. Although I'm sure some may be incentivized to declare such... We the People of America are an individualistic bunch of miscreants... That being said, who really buys what these sort of people say...in the entirety? Whether left wing or right wing sheet stirrers?", 
        "intTime": 20090528, 
        "postID": 87, 
        "quote": "", 
        "reply": "My personal opnion is ANYONE who professes a one party platform...or undying loyalty or fealty to the ENTIRE doctrine ISN'T entirely honest. Although I'm sure some may be incentivized to declare such... We the People of America are an individualistic bunch of miscreants... That being said, who really buys what these sort of people say...in the entirety? Whether left wing or right wing sheet stirrers?", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:05:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: That being said, who really buys what these sort of people say.. The ones that got their undies in a bunch over the moveon.org ad sure \"bought\" it. Funny that this isn't even a \"blip\" on their radar though. Just proves the \"faux\" outrage claim.", 
        "intTime": 20090528, 
        "postID": 88, 
        "quote": "Originally posted by strobelvets: That being said, who really buys what these sort of people say..", 
        "reply": " The ones that got their undies in a bunch over the moveon.org ad sure \"bought\" it. Funny that this isn't even a \"blip\" on their radar though. Just proves the \"faux\" outrage claim.", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:17:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Well SisterVET..we disagree many topics...but I have to admit that our reps focusing on \"politics as usual\" BS in these times seems damning to their actual agendas... As I watch the local economy hereabouts...crumble...I wonder why our Reps still don't get it...", 
        "intTime": 20090528, 
        "postID": 89, 
        "quote": "", 
        "reply": "Well SisterVET..we disagree many topics...but I have to admit that our reps focusing on \"politics as usual\" BS in these times seems damning to their actual agendas... As I watch the local economy hereabouts...crumble...I wonder why our Reps still don't get it...", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:22:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=3nR68lqbxs8 Well just listened to it and you people are so fuggn desperate to get dirt on anyone that opposes your view will actually make scheisen up now. He said Gen you freakin _________.! Freakin pathetic! Talk about faux. We have a poster here comparing this to Moveon calling a AD Gen a betrayer of the US and a Dem Sen calling him a lyer and this poster compares this youboob vid to that good god talk about ate up! As far as not a blip on our screen it is because you got suckered with this, from one of your lefty newsletters. And I dont remember you complaining about Kerry, Durbin, Murtha's and others negative remarks about the military. Oh, wait a minute I think that is when you were on vacation for slamming the 'Marlboro Marine'. Hypocrite....", 
        "intTime": 20090528, 
        "postID": 90, 
        "quote": "http://www.youtube.com/watch?v=3nR68lqbxs8", 
        "reply": " Well just listened to it and you people are so fuggn desperate to get dirt on anyone that opposes your view will actually make scheisen up now. He said Gen you freakin _________.! Freakin pathetic! Talk about faux. We have a poster here comparing this to Moveon calling a AD Gen a betrayer of the US and a Dem Sen calling him a lyer and this poster compares this youboob vid to that good god talk about ate up! As far as not a blip on our screen it is because you got suckered with this, from one of your lefty newsletters. And I dont remember you complaining about Kerry, Durbin, Murtha's and others negative remarks about the military. Oh, wait a minute I think that is when you were on vacation for slamming the 'Marlboro Marine'. Hypocrite....", 
        "threadID": "409192893_6650064422001", 
        "time": "2009-05-28 14:33:00", 
        "title": "Rush Limbaugh refers to Gen Powell as \"Genital\" Powell...", 
        "userID": "GunnyRet03"
    }
]