[
    {
        "content": "From the Scientific American Magazine ScientificAmerican.com In 2006, soon after returning from military service in Ramadi, Iraq, during the bloodiest period of the war, Captain Matt Stevens of the Vermont National Guard began to have a problem with PTSD, or post-traumatic stress disorder. Stevens's problem was not that he had PTSD. It was that he began to have doubts about PTSD: the condition was real enough, but as a diagnosis he saw it being wildly, even dangerously, overextended. Stevens led the medics tending an armored brigade of 800 soldiers, and his team patched together GIs and Iraqi citizens almost every day. He saw horrific things. Once home, he said he had his share of \"nights where I'd wake up and it would be clear I wasn't going to sleep again.\" He was not surprised: \"I would expect people to have nightmares for a while when they came back.\" But as he kept track of his unit in the U.S., he saw troops greeted by both a larger culture and a medical culture especially in the Veterans Administration (VA) that seemed reflexively to view bad memories, nightmares and any other sign of distress as an indicator of PTSD. \"Clinicians aren't separating the few who really have PTSD from those who are experiencing things like depression or anxiety or social and reintegration problems or who are just taking some time getting over it,\" Stevens says. He worries that many of these men and women are being pulled into a treatment and disability regime that will mire them in a self-fulfilling vision of a brain rewired, a psyche permanently haunted. Stevens, now a major and still on reserve duty while he works as a physician's assistant, is far from alone in worrying about the reach of PTSD. Over the past five years or so, a long-simmering academic debate over PTSD's conceptual basis and incidence has begun to boil over. It is now splitting the practice of trauma psychology and roiling military culture. Critiques originally raised by military historians and a few psychologists are now advanced by a broad array of experts indeed, giants of psychology, psychiatry and epidemiology. They include Columbia University's Robert L. Spitzer and Michael B. First, who oversaw the last two editions of the American Psychiatric Association's Diagnostic and Statistical Manual of Mental Disorders, the DSM-III and DSM-IV; Paul McHugh, former chair of Johns Hopkins University's psychiatry department; Michigan State University epidemiologist Naomi Breslau; and Harvard University psychologist Richard J. McNally, a leading authority in the dynamics of memory and trauma and perhaps the most forceful of the critics. The diagnostic criteria for PTSD, they assert, represent a faulty, outdated construct that has been badly overstretched so that it routinely mistakes depression, anxiety or even normal adjustment for a unique and especially stubborn ailment. This quest to scale back the definition of PTSD and its application stands to affect the expenditure of billions of dollars, the diagnostic framework of psychiatry, the effectiveness of a huge treatment and disability infrastructure, and, most important, the mental health and future lives of hundreds of thousands of U.S. combat veterans and other PTSD patients. Standing in the way of reform is conventional wisdom, deep cultural resistance and foundational concepts of trauma psychology. Nevertheless, it is time, as Spitzer recently argued, to \"save PTSD from itself.\" Casting a Wide Net The overdiagnosis of PTSD, critics say, shows in the numbers, starting with the seminal study of PTSD prevalence, the 1990 National Vietnam Veterans Readjustment Survey (NVVRS). The NVVRS covered more than 1,000 male Vietnam vets in 1988 and reported that 15.4 percent of them had PTSD at the time and that 31 percent had suffered it at some point since the war. That 31 percent has been the standard estimate of PTSD incidence among veterans ever since. In 2006, however, Columbia epidemiologist Bruce P. Dohrenwend, hoping to resolve nagging questions about the study, reworked the numbers. When he had culled the poorly documented diagnoses, he found that the 1988 rate was 9 percent and the lifetime rate 18 percent. McNally shares the general admiration for Dohrenwend's careful work. Soon after it was published, however, McNally asserted that Dohrenwend's numbers were still too high because he counted as PTSD cases those veterans with only mild, subdiagnostic symptoms, people rated as \"generally functioning pretty well.\" If you included only those suffering \"clinically significant impairment\" the level generally required for diagnosis and insurance compensation in most mental illness the rates fell yet further, to 5.4 percent at the time of the survey and 11 percent lifetime. It was not one in three veterans who eventually developed PTSD, but one in nine and only one in 18 had it at any given time. The NVVRS, in other words, appears to have overstated PTSD rates in Vietnam vets by almost 300 percent. \"PTSD is a real thing, without a doubt,\" McNally says. \"But as a diagnosis, PTSD has become so flabby and overstretched, so much a part of the culture, that we are almost certainly mistaking other problems for PTSD and thus mistreating them.\" The idea that PTSD is overdiagnosed seems to contradict reports of resistance in the military and the VA to recognizing PTSD denials of PTSD diagnoses and disability benefits, military clinicians discharging soldiers instead of treating them, and a disturbing increase in suicides among veterans of the Middle East wars. Yet the two trends are consistent. The VA's PTSD caseload has more than doubled since 2000, mostly because of newly diagnosed Vietnam veterans. The poor and erratic response to current soldiers and recent vets, with some being pulled quickly into PTSD treatments and others discouraged or denied, may be the panicked stumbling of an overloaded system. Overhauling both the diagnosis and the VA's care system, critics say, will ensure better care for genuine PTSD patients as well as those being misdiagnosed. But the would-be reformers face fierce opposition. \"This argument,\" McNally notes, \"tends to really **** some people off.\" Veterans send him threatening e-mails. Colleagues accuse him of dishonoring veterans, dismissing suffering, discounting the costs of war. Dean G. Kilpatrick, a University of South Carolina traumatologist and former president of the Inter national Society for Traumatic Stress Studies (ISTSS), once essentially called McNally a liar. A Problematic Diagnosis The DSM-IV, the most recent edition (published in 1994), defines PTSD as the presence of three symptom clusters reexperiencing via nightmares or flashbacks; avoidance by numbing or withdrawal; and hyperarousal, evident in irritability, insomnia, aggression or poor concentration that arise in response to a life-threatening event [To see related sidebar please purchase the digital edition]. The construction of this definition is suspect. To start with, the link to a traumatic event, which makes PTSD almost unique among complex psychiatric diagnoses in being defined by an external cause, also makes it uniquely problematic, for the tie is really to the memory of an event. When PTSD was first added to the DSM-III in 1980, traumatic memories were considered reasonably faithful recordings of actual events. But as research since then has repeatedly shown, memory is spectacularly unreliable and malleable. We routinely add or subtract people, details, settings and actions to and from our memories. We conflate, invent and edit. In one study by Washington University memory researcher Elizabeth F. Loftus, one out of four adults who were told they were lost in a shopping mall as children came to believe it. Some insisted the event happened even after the ruse was exposed. Subsequently, bounteous research has confirmed that such false memories are common [see \"Creating False Memories,\" by Elizabeth F. Loftus; Scientific American, September 1997]. Soldiers enjoy no immunity from this tendency. A 1990s study at the New Haven, Conn., VA hospital asked 59 Gulf War veterans about their experiences a month after their return and again two years later. The researchers asked about 19 specific types of potentially traumatic events, such as witnessing deaths, losing friends and seeing people disfigured. Two years out, 70 percent of the veterans reported at least one traumatic event they had not mentioned a month after returning, and 24 percent reported at least three such events for the first time. And the veterans recounting the most \"new memories\" also reported the most PTSD symptoms. To McNally, such results suggest that some veterans experiencing \"late-onset\" PTSD may be attributing symptoms of depression, anxiety or other subtle disorders to a memory that has been elaborated and given new significance or even unconsciously fabricated. \"This has nothing to do with gaming or working the system or consciously looking for sympathy,\" McNally says. \"We all do this: we cast our lives in terms of narratives that help us understand them. A vet who's having a difficult life may remember a trauma, which may or may not have actually traumatized him, and everything makes sense.\" To make the diagnosis of PTSD more rigorous, some have suggested that blood chemistry, brain imaging or other tests might be able to detect physiological signatures of the disorder. Some studies of stress hormones in groups of PTSD patients show differences from normal subjects, but the overlap between the normal and the PTSD groups is huge, making individual profiles useless for diagnostics. Brain imaging has similar limitations, with the abnormal dynamics in PTSD heavily overlapping those of depression and anxiety. With memory unreliable and biological markers elusive, diagnosis depends on clinical symptoms. But as a study in 2007 starkly showed, the symptom profile for PTSD is as slippery as the would-be biomarkers. J. Alexander Bodkin, a psychiatrist at Harvard's McLean Hospital, screened 90 clinically depressed patients separately for PTSD symptoms and for trauma, then compared the results. First he and a colleague used a standardized screening interview to assess symptoms. Then two other PTSD diagnosticians, ignorant of the symptom reports, used another standard interview to see which patients had ever experienced trauma fitting DSM-IV criteria. If PTSD arose from trauma, the patients with PTSD symptoms should have histories of trauma, and those with trauma should show more PTSD. It was not so. Although the symptom screens rated 70 of the 90 patients positive for PTSD, the trauma screens found only 54 who had suffered trauma: the diagnosed PTSD \"cases\" outnumbered those who had experienced traumatic events. Things got worse when Bodkin compared the diagnoses one on one. If PTSD required trauma, then the 54 trauma-exposed patients should account for most of the 70 PTSD-positive patients. But the PTSD-symptomatic patients were equally distributed among the trauma-positive and the trauma-negative groups. The PTSD rate had zero relation to the trauma rate. It was, Bodkin observed, \"a scientifically unacceptable situation.\" More practically, as McNally points out, \"To give the best treatment, you have to have the right diagnosis.\" The most effective treatment for patients whose symptoms arise from trauma is exposure-based cognitive-behavioral therapy (CBT), which concentrates on altering the response to a specific traumatic memory by repeated, controlled exposure to it. \"And it works,\" McNally says. \"If someone with genuine PTSD goes to the people who do this really well, they have a good chance of getting better.\" CBT for depression, in contrast, teaches the patient to recognize dysfunctional loops of thought and emotion and develop new responses to normal, present-day events. \"If a depressed person takes on a PTSD interpretation of their troubles and gets exposure-based CBT, you're going to miss the boat,\" McNally says. \"You're going to spend your time chasing this memory down instead of dealing with the way the patient misinterprets present events.\"To complicate matters, recent studies showing that traumatic brain injuries from bomb blasts, common among soldiers in Iraq, produce symptoms almost indistinguishable from PTSD. One more overlapping symptom set. \"The overlap issue worries me tremendously,\" says Gerald M. Rosen, a University of Washington psychiatrist who has worked extensively with PTSD patients. \"We have to ask how we got here. We have to ask ourselves, 'What do we gain by having this diagnosis?'\" Disabling Conditions Rosen is thinking of clinicians when he asks about gain. But what does a veteran gain with a PTSD diagnosis? One would hope, of course, that it grants access to effective treatment and support. This is not happening. In civilian populations, two thirds of PTSD patients respond to treatment. But as psychologist Christopher Frueh, who researched and treated PTSD for the VA from the early 1990s until 2006, notes, \"In the two largest VA studies of combat veterans, neither showed a treatment effect. Vets getting PTSD treatment from the VA are no more likely to get better than they would on their own.\" The reason, Frueh says, is the collision of the PTSD construct's vagaries with the VA's disability system, in which every benefit seems structured to discourage recovery. The first benefit is health care. PTSD is by far the easiest mental health diagnosis to have declared \"service-connected,\" a designation that often means the difference between little or no care and broad, lasting health coverage. Service connection also makes a vet eligible for monthly disability payments of up to $3,000. That link may explain why most veterans getting PTSD treatment from the VA report worsening symptoms until they are designated 100 percent disabled at which point their use of VA mental health services drops by 82 percent. It may also help explain why, although the risk of PTSD from a traumatic event drops as time passes, the number of Vietnam veterans applying for PTSD disability almost doubled between 1999 and 2004, driving total PTSD disability payments to more than $4 billion annually. Perhaps most disastrously, these payments continue only if you are sick. For unlike a vet who has lost a leg, a vet with PTSD loses disability benefits as soon as he recovers or starts working. The entire system seems designed to encourage chronic disability. \"In the several years I spent in VA PTSD clinics,\" Frueh says, \"I can't think of a single PTSD patient who left treatment because he got better. But the problem is not the veterans. The problem is that the VA's disability system, which is 60 years old now, ignores all the intervening research we have on resilience, on the power of expectancy, and on the effects of incentives and disincentives. Sometimes I think they should just blow it up and start over.\" But with what? Richard A. Bryant, an Australian PTSD researcher and clinician, suggests a disability system more like that in place Down Under. An Australian soldier injured in combat receives a lifelong \"noneconomic\" disability payment of $300 to $1,200 monthly. If the injury keeps him from working, he also gets an \"incapacity\" payment, as well as job training and help finding work. Finally a crucial feature he retains all these benefits for two years once he goes back to work. After that, incapacity payments taper to zero over five years. But noneconomic payments a kind of financial Purple Heart continue forever. And like all Australians, the soldier gets free lifetime health care. Australian vets come home to an utterly different support system from ours: theirs is a scaffold they can climb. Ours is a low-hanging \"safety net\" liable to trap anyone who falls in. Two Ways to Carry a Rifle When a soldier comes home, he must try to reconcile his war experience with the person he was beforehand and the society and family he returns to. He must engage in what psychologist Rachel Yehuda, who researches PTSD at the Bronx VA Hospital, calls \"recontextualization\" the process of integrating trauma into normal experience. It is what we all do, on various scales, when we suffer breakups, job losses or the deaths of loved ones. Initially the event seems an impossible aberration. Then slowly we accept the trauma as part of the complex context that is life. Major Matt Stevens recognizes that this adjustment can take time. Even after two years at home, the war still occupies his dreams. Sometimes, for instance, he dreams that he is doing something completely normal while carrying his combat rifle: \"One night I dreamt I was bird-watching with my wife. When we saw a bird, she would lift her binoculars, and I would lift my rifle and watch the bird through the scope. No thought of shooting it. Just how I looked at the birds.\" It would be easy to read Stevens's dream as a symptom of PTSD, expressing fear, hypervigilance and avoidance. Yet it can also be seen as demonstrating his success in recontextualizing his experience: reconciling the man who once used a gun with the man who no longer does. Saving PTSD from itself, Spitzer, McNally, Frueh and other critics say, will require a similar shift seeing most postcombat distress not as a disorder but as part of normal, if painful, healing. This turnaround will involve, for starters, revising the rubric for diagnosing PTSD currently under review for the new DSM-V due to be published in 2012 so it accounts for the unreliability of memory and better distinguishes depression, anxiety and phobia from true PTSD. Mental health evaluations need similar revisions so they can detect genuine cases without leading patients to impose trauma narratives on other mental health problems. Finally, Congress should replace the VA's disability system with an evidence-based approach that removes disincentives to recovery and even go the extra mile and give all combat veterans, injured or not, lifetime health care. These changes will be hard to sell in a culture that resists any suggestion that PTSD is not a common, even inevitable, consequence of combat. Mistaking its horror for its prevalence, most people assume PTSD is epidemic, ignoring all evidence to the contrary. The biggest longitudinal study of soldiers returning from Iraq, led by VA researcher Charles Milliken and published in 2007, seemed to confirm that we should expect a high incidence of PTSD. It surveyed combat troops immediately on return from deployment and again about six months later and found around 20 percent symptomatically \"at risk\" of PTSD. But of those reporting symptoms in the first survey, half had improved by the second survey, and many who first claimed few or no symptoms later reported serious symptoms. How many of the early \"symptoms\" were just normal adjustment? How many of the later symptoms were the imposition of a trauma narrative onto other problems? Stevens, for one, is certain these screens are mistaking many going through normal adjustment as dangerously at risk of PTSD. Even he, though functioning fine at work and home and in society, scored positive in both surveys; he is, in other words, one of the 20 percent at risk. Finally, and weirdly, both screens missed about 75 percent of those who actually sought counseling a finding that raises further doubts about the evaluations' accuracy. Yet this study received prominent media coverage emphasizing that PTSD rates were probably being badly undercounted. A few months later another study the first to track large numbers of soldiers through the wars in Iraq and Afghanistan provided a clearer and more consistent picture. Led by U.S. Navy researcher Tyler Smith and published in the British Medical Journal, the study monitored mental health and combat exposure in 50,000 U.S. soldiers from 2001 to 2006. The researchers took particular care to tie symptoms to types of combat exposure. Among some 12,000 troops who went to Iraq or Afghanistan, 4.3 percent developed diagnosis-level symptoms of PTSD. The rate ran about 8 percent in those with combat exposure and 2 percent in those not exposed. These numbers are about a quarter of the rates Milliken found. But they are a close match to PTSD rates seen in British Iraq War vets and to rates McNally calculated for Vietnam veterans. The contrast to the Milliken study, along with the consistency with British rates and with McNally's NVVRS calculation, should have made the Smith study big news. Yet the media, the VA and the trauma psychology community almost completely ignored the study. \"The silence,\" McNally wryly noted, \"was deafening.\" This silence may be merely a matter of good news going unremarked. Yet it supports McNally's contention that we have a cultural obsession with trauma. The selective attention also supports the assertion by military historian and PTSD critic Ben Shephard that American society itself gained something from the creation of the PTSD diagnosis in the late 1970s: a vision of war's costs that, by transforming warriors into victims, lets us declare our recognition of war's horror and absolves us for sending them for we were victimized, too, fooled into supporting a war we later regretted. We should recognize war's horror. We should feel the soldier's pain. But to impose on a distressed soldier the notion that his memories are inescapable, that he lacks the strength to incorporate his past into his future, is to highlight our moral sensitivity at the soldier's expense. PTSD exists. Where it exists we must treat it. But our cultural obsession with PTSD has magnified and finally perhaps become the thing itself a prolonged failure to contextualize and accept our own collective aggression. It may be our own postwar neurosis.", 
        "intTime": 20090516, 
        "postID": 1, 
        "quote": "", 
        "reply": "From the Scientific American Magazine ScientificAmerican.com In 2006, soon after returning from military service in Ramadi, Iraq, during the bloodiest period of the war, Captain Matt Stevens of the Vermont National Guard began to have a problem with PTSD, or post-traumatic stress disorder. Stevens's problem was not that he had PTSD. It was that he began to have doubts about PTSD: the condition was real enough, but as a diagnosis he saw it being wildly, even dangerously, overextended. Stevens led the medics tending an armored brigade of 800 soldiers, and his team patched together GIs and Iraqi citizens almost every day. He saw horrific things. Once home, he said he had his share of \"nights where I'd wake up and it would be clear I wasn't going to sleep again.\" He was not surprised: \"I would expect people to have nightmares for a while when they came back.\" But as he kept track of his unit in the U.S., he saw troops greeted by both a larger culture and a medical culture especially in the Veterans Administration (VA) that seemed reflexively to view bad memories, nightmares and any other sign of distress as an indicator of PTSD. \"Clinicians aren't separating the few who really have PTSD from those who are experiencing things like depression or anxiety or social and reintegration problems or who are just taking some time getting over it,\" Stevens says. He worries that many of these men and women are being pulled into a treatment and disability regime that will mire them in a self-fulfilling vision of a brain rewired, a psyche permanently haunted. Stevens, now a major and still on reserve duty while he works as a physician's assistant, is far from alone in worrying about the reach of PTSD. Over the past five years or so, a long-simmering academic debate over PTSD's conceptual basis and incidence has begun to boil over. It is now splitting the practice of trauma psychology and roiling military culture. Critiques originally raised by military historians and a few psychologists are now advanced by a broad array of experts indeed, giants of psychology, psychiatry and epidemiology. They include Columbia University's Robert L. Spitzer and Michael B. First, who oversaw the last two editions of the American Psychiatric Association's Diagnostic and Statistical Manual of Mental Disorders, the DSM-III and DSM-IV; Paul McHugh, former chair of Johns Hopkins University's psychiatry department; Michigan State University epidemiologist Naomi Breslau; and Harvard University psychologist Richard J. McNally, a leading authority in the dynamics of memory and trauma and perhaps the most forceful of the critics. The diagnostic criteria for PTSD, they assert, represent a faulty, outdated construct that has been badly overstretched so that it routinely mistakes depression, anxiety or even normal adjustment for a unique and especially stubborn ailment. This quest to scale back the definition of PTSD and its application stands to affect the expenditure of billions of dollars, the diagnostic framework of psychiatry, the effectiveness of a huge treatment and disability infrastructure, and, most important, the mental health and future lives of hundreds of thousands of U.S. combat veterans and other PTSD patients. Standing in the way of reform is conventional wisdom, deep cultural resistance and foundational concepts of trauma psychology. Nevertheless, it is time, as Spitzer recently argued, to \"save PTSD from itself.\" Casting a Wide Net The overdiagnosis of PTSD, critics say, shows in the numbers, starting with the seminal study of PTSD prevalence, the 1990 National Vietnam Veterans Readjustment Survey (NVVRS). The NVVRS covered more than 1,000 male Vietnam vets in 1988 and reported that 15.4 percent of them had PTSD at the time and that 31 percent had suffered it at some point since the war. That 31 percent has been the standard estimate of PTSD incidence among veterans ever since. In 2006, however, Columbia epidemiologist Bruce P. Dohrenwend, hoping to resolve nagging questions about the study, reworked the numbers. When he had culled the poorly documented diagnoses, he found that the 1988 rate was 9 percent and the lifetime rate 18 percent. McNally shares the general admiration for Dohrenwend's careful work. Soon after it was published, however, McNally asserted that Dohrenwend's numbers were still too high because he counted as PTSD cases those veterans with only mild, subdiagnostic symptoms, people rated as \"generally functioning pretty well.\" If you included only those suffering \"clinically significant impairment\" the level generally required for diagnosis and insurance compensation in most mental illness the rates fell yet further, to 5.4 percent at the time of the survey and 11 percent lifetime. It was not one in three veterans who eventually developed PTSD, but one in nine and only one in 18 had it at any given time. The NVVRS, in other words, appears to have overstated PTSD rates in Vietnam vets by almost 300 percent. \"PTSD is a real thing, without a doubt,\" McNally says. \"But as a diagnosis, PTSD has become so flabby and overstretched, so much a part of the culture, that we are almost certainly mistaking other problems for PTSD and thus mistreating them.\" The idea that PTSD is overdiagnosed seems to contradict reports of resistance in the military and the VA to recognizing PTSD denials of PTSD diagnoses and disability benefits, military clinicians discharging soldiers instead of treating them, and a disturbing increase in suicides among veterans of the Middle East wars. Yet the two trends are consistent. The VA's PTSD caseload has more than doubled since 2000, mostly because of newly diagnosed Vietnam veterans. The poor and erratic response to current soldiers and recent vets, with some being pulled quickly into PTSD treatments and others discouraged or denied, may be the panicked stumbling of an overloaded system. Overhauling both the diagnosis and the VA's care system, critics say, will ensure better care for genuine PTSD patients as well as those being misdiagnosed. But the would-be reformers face fierce opposition. \"This argument,\" McNally notes, \"tends to really **** some people off.\" Veterans send him threatening e-mails. Colleagues accuse him of dishonoring veterans, dismissing suffering, discounting the costs of war. Dean G. Kilpatrick, a University of South Carolina traumatologist and former president of the Inter national Society for Traumatic Stress Studies (ISTSS), once essentially called McNally a liar. A Problematic Diagnosis The DSM-IV, the most recent edition (published in 1994), defines PTSD as the presence of three symptom clusters reexperiencing via nightmares or flashbacks; avoidance by numbing or withdrawal; and hyperarousal, evident in irritability, insomnia, aggression or poor concentration that arise in response to a life-threatening event [To see related sidebar please purchase the digital edition]. The construction of this definition is suspect. To start with, the link to a traumatic event, which makes PTSD almost unique among complex psychiatric diagnoses in being defined by an external cause, also makes it uniquely problematic, for the tie is really to the memory of an event. When PTSD was first added to the DSM-III in 1980, traumatic memories were considered reasonably faithful recordings of actual events. But as research since then has repeatedly shown, memory is spectacularly unreliable and malleable. We routinely add or subtract people, details, settings and actions to and from our memories. We conflate, invent and edit. In one study by Washington University memory researcher Elizabeth F. Loftus, one out of four adults who were told they were lost in a shopping mall as children came to believe it. Some insisted the event happened even after the ruse was exposed. Subsequently, bounteous research has confirmed that such false memories are common [see \"Creating False Memories,\" by Elizabeth F. Loftus; Scientific American, September 1997]. Soldiers enjoy no immunity from this tendency. A 1990s study at the New Haven, Conn., VA hospital asked 59 Gulf War veterans about their experiences a month after their return and again two years later. The researchers asked about 19 specific types of potentially traumatic events, such as witnessing deaths, losing friends and seeing people disfigured. Two years out, 70 percent of the veterans reported at least one traumatic event they had not mentioned a month after returning, and 24 percent reported at least three such events for the first time. And the veterans recounting the most \"new memories\" also reported the most PTSD symptoms. To McNally, such results suggest that some veterans experiencing \"late-onset\" PTSD may be attributing symptoms of depression, anxiety or other subtle disorders to a memory that has been elaborated and given new significance or even unconsciously fabricated. \"This has nothing to do with gaming or working the system or consciously looking for sympathy,\" McNally says. \"We all do this: we cast our lives in terms of narratives that help us understand them. A vet who's having a difficult life may remember a trauma, which may or may not have actually traumatized him, and everything makes sense.\" To make the diagnosis of PTSD more rigorous, some have suggested that blood chemistry, brain imaging or other tests might be able to detect physiological signatures of the disorder. Some studies of stress hormones in groups of PTSD patients show differences from normal subjects, but the overlap between the normal and the PTSD groups is huge, making individual profiles useless for diagnostics. Brain imaging has similar limitations, with the abnormal dynamics in PTSD heavily overlapping those of depression and anxiety. With memory unreliable and biological markers elusive, diagnosis depends on clinical symptoms. But as a study in 2007 starkly showed, the symptom profile for PTSD is as slippery as the would-be biomarkers. J. Alexander Bodkin, a psychiatrist at Harvard's McLean Hospital, screened 90 clinically depressed patients separately for PTSD symptoms and for trauma, then compared the results. First he and a colleague used a standardized screening interview to assess symptoms. Then two other PTSD diagnosticians, ignorant of the symptom reports, used another standard interview to see which patients had ever experienced trauma fitting DSM-IV criteria. If PTSD arose from trauma, the patients with PTSD symptoms should have histories of trauma, and those with trauma should show more PTSD. It was not so. Although the symptom screens rated 70 of the 90 patients positive for PTSD, the trauma screens found only 54 who had suffered trauma: the diagnosed PTSD \"cases\" outnumbered those who had experienced traumatic events. Things got worse when Bodkin compared the diagnoses one on one. If PTSD required trauma, then the 54 trauma-exposed patients should account for most of the 70 PTSD-positive patients. But the PTSD-symptomatic patients were equally distributed among the trauma-positive and the trauma-negative groups. The PTSD rate had zero relation to the trauma rate. It was, Bodkin observed, \"a scientifically unacceptable situation.\" More practically, as McNally points out, \"To give the best treatment, you have to have the right diagnosis.\" The most effective treatment for patients whose symptoms arise from trauma is exposure-based cognitive-behavioral therapy (CBT), which concentrates on altering the response to a specific traumatic memory by repeated, controlled exposure to it. \"And it works,\" McNally says. \"If someone with genuine PTSD goes to the people who do this really well, they have a good chance of getting better.\" CBT for depression, in contrast, teaches the patient to recognize dysfunctional loops of thought and emotion and develop new responses to normal, present-day events. \"If a depressed person takes on a PTSD interpretation of their troubles and gets exposure-based CBT, you're going to miss the boat,\" McNally says. \"You're going to spend your time chasing this memory down instead of dealing with the way the patient misinterprets present events.\"To complicate matters, recent studies showing that traumatic brain injuries from bomb blasts, common among soldiers in Iraq, produce symptoms almost indistinguishable from PTSD. One more overlapping symptom set. \"The overlap issue worries me tremendously,\" says Gerald M. Rosen, a University of Washington psychiatrist who has worked extensively with PTSD patients. \"We have to ask how we got here. We have to ask ourselves, 'What do we gain by having this diagnosis?'\" Disabling Conditions Rosen is thinking of clinicians when he asks about gain. But what does a veteran gain with a PTSD diagnosis? One would hope, of course, that it grants access to effective treatment and support. This is not happening. In civilian populations, two thirds of PTSD patients respond to treatment. But as psychologist Christopher Frueh, who researched and treated PTSD for the VA from the early 1990s until 2006, notes, \"In the two largest VA studies of combat veterans, neither showed a treatment effect. Vets getting PTSD treatment from the VA are no more likely to get better than they would on their own.\" The reason, Frueh says, is the collision of the PTSD construct's vagaries with the VA's disability system, in which every benefit seems structured to discourage recovery. The first benefit is health care. PTSD is by far the easiest mental health diagnosis to have declared \"service-connected,\" a designation that often means the difference between little or no care and broad, lasting health coverage. Service connection also makes a vet eligible for monthly disability payments of up to $3,000. That link may explain why most veterans getting PTSD treatment from the VA report worsening symptoms until they are designated 100 percent disabled at which point their use of VA mental health services drops by 82 percent. It may also help explain why, although the risk of PTSD from a traumatic event drops as time passes, the number of Vietnam veterans applying for PTSD disability almost doubled between 1999 and 2004, driving total PTSD disability payments to more than $4 billion annually. Perhaps most disastrously, these payments continue only if you are sick. For unlike a vet who has lost a leg, a vet with PTSD loses disability benefits as soon as he recovers or starts working. The entire system seems designed to encourage chronic disability. \"In the several years I spent in VA PTSD clinics,\" Frueh says, \"I can't think of a single PTSD patient who left treatment because he got better. But the problem is not the veterans. The problem is that the VA's disability system, which is 60 years old now, ignores all the intervening research we have on resilience, on the power of expectancy, and on the effects of incentives and disincentives. Sometimes I think they should just blow it up and start over.\" But with what? Richard A. Bryant, an Australian PTSD researcher and clinician, suggests a disability system more like that in place Down Under. An Australian soldier injured in combat receives a lifelong \"noneconomic\" disability payment of $300 to $1,200 monthly. If the injury keeps him from working, he also gets an \"incapacity\" payment, as well as job training and help finding work. Finally a crucial feature he retains all these benefits for two years once he goes back to work. After that, incapacity payments taper to zero over five years. But noneconomic payments a kind of financial Purple Heart continue forever. And like all Australians, the soldier gets free lifetime health care. Australian vets come home to an utterly different support system from ours: theirs is a scaffold they can climb. Ours is a low-hanging \"safety net\" liable to trap anyone who falls in. Two Ways to Carry a Rifle When a soldier comes home, he must try to reconcile his war experience with the person he was beforehand and the society and family he returns to. He must engage in what psychologist Rachel Yehuda, who researches PTSD at the Bronx VA Hospital, calls \"recontextualization\" the process of integrating trauma into normal experience. It is what we all do, on various scales, when we suffer breakups, job losses or the deaths of loved ones. Initially the event seems an impossible aberration. Then slowly we accept the trauma as part of the complex context that is life. Major Matt Stevens recognizes that this adjustment can take time. Even after two years at home, the war still occupies his dreams. Sometimes, for instance, he dreams that he is doing something completely normal while carrying his combat rifle: \"One night I dreamt I was bird-watching with my wife. When we saw a bird, she would lift her binoculars, and I would lift my rifle and watch the bird through the scope. No thought of shooting it. Just how I looked at the birds.\" It would be easy to read Stevens's dream as a symptom of PTSD, expressing fear, hypervigilance and avoidance. Yet it can also be seen as demonstrating his success in recontextualizing his experience: reconciling the man who once used a gun with the man who no longer does. Saving PTSD from itself, Spitzer, McNally, Frueh and other critics say, will require a similar shift seeing most postcombat distress not as a disorder but as part of normal, if painful, healing. This turnaround will involve, for starters, revising the rubric for diagnosing PTSD currently under review for the new DSM-V due to be published in 2012 so it accounts for the unreliability of memory and better distinguishes depression, anxiety and phobia from true PTSD. Mental health evaluations need similar revisions so they can detect genuine cases without leading patients to impose trauma narratives on other mental health problems. Finally, Congress should replace the VA's disability system with an evidence-based approach that removes disincentives to recovery and even go the extra mile and give all combat veterans, injured or not, lifetime health care. These changes will be hard to sell in a culture that resists any suggestion that PTSD is not a common, even inevitable, consequence of combat. Mistaking its horror for its prevalence, most people assume PTSD is epidemic, ignoring all evidence to the contrary. The biggest longitudinal study of soldiers returning from Iraq, led by VA researcher Charles Milliken and published in 2007, seemed to confirm that we should expect a high incidence of PTSD. It surveyed combat troops immediately on return from deployment and again about six months later and found around 20 percent symptomatically \"at risk\" of PTSD. But of those reporting symptoms in the first survey, half had improved by the second survey, and many who first claimed few or no symptoms later reported serious symptoms. How many of the early \"symptoms\" were just normal adjustment? How many of the later symptoms were the imposition of a trauma narrative onto other problems? Stevens, for one, is certain these screens are mistaking many going through normal adjustment as dangerously at risk of PTSD. Even he, though functioning fine at work and home and in society, scored positive in both surveys; he is, in other words, one of the 20 percent at risk. Finally, and weirdly, both screens missed about 75 percent of those who actually sought counseling a finding that raises further doubts about the evaluations' accuracy. Yet this study received prominent media coverage emphasizing that PTSD rates were probably being badly undercounted. A few months later another study the first to track large numbers of soldiers through the wars in Iraq and Afghanistan provided a clearer and more consistent picture. Led by U.S. Navy researcher Tyler Smith and published in the British Medical Journal, the study monitored mental health and combat exposure in 50,000 U.S. soldiers from 2001 to 2006. The researchers took particular care to tie symptoms to types of combat exposure. Among some 12,000 troops who went to Iraq or Afghanistan, 4.3 percent developed diagnosis-level symptoms of PTSD. The rate ran about 8 percent in those with combat exposure and 2 percent in those not exposed. These numbers are about a quarter of the rates Milliken found. But they are a close match to PTSD rates seen in British Iraq War vets and to rates McNally calculated for Vietnam veterans. The contrast to the Milliken study, along with the consistency with British rates and with McNally's NVVRS calculation, should have made the Smith study big news. Yet the media, the VA and the trauma psychology community almost completely ignored the study. \"The silence,\" McNally wryly noted, \"was deafening.\" This silence may be merely a matter of good news going unremarked. Yet it supports McNally's contention that we have a cultural obsession with trauma. The selective attention also supports the assertion by military historian and PTSD critic Ben Shephard that American society itself gained something from the creation of the PTSD diagnosis in the late 1970s: a vision of war's costs that, by transforming warriors into victims, lets us declare our recognition of war's horror and absolves us for sending them for we were victimized, too, fooled into supporting a war we later regretted. We should recognize war's horror. We should feel the soldier's pain. But to impose on a distressed soldier the notion that his memories are inescapable, that he lacks the strength to incorporate his past into his future, is to highlight our moral sensitivity at the soldier's expense. PTSD exists. Where it exists we must treat it. But our cultural obsession with PTSD has magnified and finally perhaps become the thing itself a prolonged failure to contextualize and accept our own collective aggression. It may be our own postwar neurosis.", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-16 16:44:00", 
        "title": "New Research PTSD", 
        "userID": "21169869"
    }, 
    {
        "content": "A good review of PTSD with exceptions. Personally as a staff person on the House Veterans Affairs Committee in Congress pushed for the recognition of PTSD, Agent Orange, and Judicial Review... With PTSD I saw it in relatives returning from WWII and when I came back from a combat assignment in Vietnam I saw the same symptions...and today I see the same symptions in those returning from Iraq and A-stan...and they discuss them with me but with reticence... I understand that as well. To be branded is not going to help you find a job or stay in the military. The \"Research\" does not show what happened to returning WWII vets... they were brought home by their families without the bureaucratic paranoia of being sued or have to pay for this readjustment of this particular grunt facing the government counselor! For awhile now I believe the VA and DOD are not the place to review returning veterans for service - connected disablities...it is a conflict of interest..in Great Britain Universal Health Care picks up the vets and the Warrant Courts pursues his arguement that he is service connected for a disabilility and the court gives him an award...why not here? The veteran is constantly harrassed and chastened as to what he experienced and as an enlisted man he is not well documented in the system, so he has to beg, borrow and steal his former orders if at all possible and show that he is who he says he is.... all the while he is suffering mental or physical pain due to his/her service to his country...now is that a reasonable place to put the cause and effect? Absolutely not! This message has been edited. Last edited by: dragonflyer04, Sun 17 May 2009 03:09 PM", 
        "intTime": 20090516, 
        "postID": 2, 
        "quote": "", 
        "reply": "A good review of PTSD with exceptions. Personally as a staff person on the House Veterans Affairs Committee in Congress pushed for the recognition of PTSD, Agent Orange, and Judicial Review... With PTSD I saw it in relatives returning from WWII and when I came back from a combat assignment in Vietnam I saw the same symptions...and today I see the same symptions in those returning from Iraq and A-stan...and they discuss them with me but with reticence... I understand that as well. To be branded is not going to help you find a job or stay in the military. The \"Research\" does not show what happened to returning WWII vets... they were brought home by their families without the bureaucratic paranoia of being sued or have to pay for this readjustment of this particular grunt facing the government counselor! For awhile now I believe the VA and DOD are not the place to review returning veterans for service - connected disablities...it is a conflict of interest..in Great Britain Universal Health Care picks up the vets and the Warrant Courts pursues his arguement that he is service connected for a disabilility and the court gives him an award...why not here? The veteran is constantly harrassed and chastened as to what he experienced and as an enlisted man he is not well documented in the system, so he has to beg, borrow and steal his former orders if at all possible and show that he is who he says he is.... all the while he is suffering mental or physical pain due to his/her service to his country...now is that a reasonable place to put the cause and effect? Absolutely not! This message has been edited. Last edited by: dragonflyer04, Sun 17 May 2009 03:09 PM", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-16 17:59:00", 
        "title": "New Research PTSD", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Comments...", 
        "intTime": 20090517, 
        "postID": 3, 
        "quote": "", 
        "reply": "Comments...", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-17 23:27:00", 
        "title": "New Research PTSD", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "I'm sure that there are many Veterans out there collecting a rating of 100% for PTSD that don't have it. I agree with the findings of the above article. Something like 80% of those vets never go back for care once they get their 100%? Ray Charles could see that something fishy was up with that. IMO if a Vet sees a buddy die in combat and then gets PTSD for life then maybe he shouldn't have been allowed in the service to begin with. And whats up with this rape thing getting rated at 100% also. Just like in the past. One person gets an award and everyone else wants an award too.", 
        "intTime": 20090518, 
        "postID": 4, 
        "quote": "", 
        "reply": "I'm sure that there are many Veterans out there collecting a rating of 100% for PTSD that don't have it. I agree with the findings of the above article. Something like 80% of those vets never go back for care once they get their 100%? Ray Charles could see that something fishy was up with that. IMO if a Vet sees a buddy die in combat and then gets PTSD for life then maybe he shouldn't have been allowed in the service to begin with. And whats up with this rape thing getting rated at 100% also. Just like in the past. One person gets an award and everyone else wants an award too.", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-18 03:45:00", 
        "title": "New Research PTSD", 
        "userID": "Duster6"
    }, 
    {
        "content": "It sounds to me like an attempt to solve the problem by simply re-defining it away.", 
        "intTime": 20090518, 
        "postID": 5, 
        "quote": "", 
        "reply": "It sounds to me like an attempt to solve the problem by simply re-defining it away.", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-18 04:16:00", 
        "title": "New Research PTSD", 
        "userID": "stillkit"
    }, 
    {
        "content": "Interesting point ... there might be something to that. Duster any idea how many PTSD 100%'ers there are? That would be an interesting statistic.", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "", 
        "reply": "Interesting point ... there might be something to that. Duster any idea how many PTSD 100%'ers there are? That would be an interesting statistic.", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-18 09:46:00", 
        "title": "New Research PTSD", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: This silence may be merely a matter of good news going unremarked. Yet it supports McNally's contention that we have a cultural obsession with trauma. The selective attention also supports the assertion by military historian and PTSD critic Ben Shephard that American society itself gained something from the creation of the PTSD diagnosis in the late 1970s: a vision of war's costs that, by transforming warriors into victims, lets us declare our recognition of war's horror and absolves us for sending them for we were victimized, too, fooled into supporting a war we later regretted. We should recognize war's horror. We should feel the soldier's pain. But to impose on a distressed soldier the notion that his memories are inescapable, that he lacks the strength to incorporate his past into his future, is to highlight our moral sensitivity at the soldier's expense. PTSD exists. Where it exists we must treat it. But our cultural obsession with PTSD has magnified and finally perhaps become the thing itself a prolonged failure to contextualize and accept our own collective aggression. It may be our own postwar neurosis. I work with PTSD victims 5 days a week, about 50 weeks a year, as I usually do not never have time to take all my vacation. This is an article mixing some fact with mostly subjective written opinion. There is much more to say and it is said in VA Clinics across America. On Sound Off Dave Barker you will find PTSD discussed in detail. Please take a look at the opinions there, before firming up your opinions on this complicated issue. Here are some topics to review, it is easy just click, read and decide for yourself. Personality disorder, or is it PTSD? (some tricks used by Army and VA doctors against the troops and veterans http://forums.military.com/eve/forums/a/tpc/f/8280047191001/m/1070020212001 PTSD still under fire http://forums.military.com/eve/forums/a/tpc/f/8280047191001/m/6710008191001 My short book on PTSD \"The Combat Veteran From World War II to the Present\" http://forums.military.com/eve/forums/a/tpc/f/8280047191001/m/8290078391001 Audie Murphy spent much time and a lot of money getting this condition recognized. I wonder how much \"Scientific American Magazine\" checked Audie Murphy out? I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "This silence may be merely a matter of good news going unremarked. Yet it supports McNally's contention that we have a cultural obsession with trauma. The selective attention also supports the assertion by military historian and PTSD critic Ben Shephard that American society itself gained something from the creation of the PTSD diagnosis in the late 1970s: a vision of war's costs that, by transforming warriors into victims, lets us declare our recognition of war's horror and absolves us for sending them for we were victimized, too, fooled into supporting a war we later regretted. We should recognize war's horror. We should feel the soldier's pain. But to impose on a distressed soldier the notion that his memories are inescapable, that he lacks the strength to incorporate his past into his future, is to highlight our moral sensitivity at the soldier's expense. PTSD exists. Where it exists we must treat it. But our cultural obsession with PTSD has magnified and finally perhaps become the thing itself a prolonged failure to contextualize and accept our own collective aggression. It may be our own postwar neurosis.", 
        "reply": " I work with PTSD victims 5 days a week, about 50 weeks a year, as I usually do not never have time to take all my vacation. This is an article mixing some fact with mostly subjective written opinion. There is much more to say and it is said in VA Clinics across America. On Sound Off Dave Barker you will find PTSD discussed in detail. Please take a look at the opinions there, before firming up your opinions on this complicated issue. Here are some topics to review, it is easy just click, read and decide for yourself. Personality disorder, or is it PTSD? (some tricks used by Army and VA doctors against the troops and veterans http://forums.military.com/eve/forums/a/tpc/f/8280047191001/m/1070020212001 PTSD still under fire http://forums.military.com/eve/forums/a/tpc/f/8280047191001/m/6710008191001 My short book on PTSD \"The Combat Veteran From World War II to the Present\" http://forums.military.com/eve/forums/a/tpc/f/8280047191001/m/8290078391001 Audie Murphy spent much time and a lot of money getting this condition recognized. I wonder how much \"Scientific American Magazine\" checked Audie Murphy out? I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-18 09:49:00", 
        "title": "New Research PTSD", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "Dave thank you for your comments and hard work for the veterans...", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "", 
        "reply": "Dave thank you for your comments and hard work for the veterans...", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-18 10:06:00", 
        "title": "New Research PTSD", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "... ...Very interesting atticle Dave regarding the \"use' of labeling one with a personality disorder,... ...I, myself was labeled, and discharged in 1980 after disarming a gunman who opened fire at a crowded street festival in louisanna after dragging a woman, and her infant child from under the wounded man,... ...came home, and buried it for 19 years until a second surgery was required on my arm that blew out in a 3 + minute struggle, 2 hearing aids later for acustic truma at close range, and the reality of, hey, I didn't do anything wrong, I decieded to try clean up my DD214, and get it removed,Dept of the Air Force did. the AFBMCR is still fighting me as I never hung around for the cameras that night, and I never made the papers as I was also covered in the perps pizz, and I'm not ashamed to admit any of it now,... ...The first time they told me I had PTSD, I asked if there was a cream for it, never understood the nightmares, and sweats, stressors, etc,... ...just hated the label of \"39-12 personality disorder\", didn't have one when I joined,... ...", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "", 
        "reply": "... ...Very interesting atticle Dave regarding the \"use' of labeling one with a personality disorder,... ...I, myself was labeled, and discharged in 1980 after disarming a gunman who opened fire at a crowded street festival in louisanna after dragging a woman, and her infant child from under the wounded man,... ...came home, and buried it for 19 years until a second surgery was required on my arm that blew out in a 3 + minute struggle, 2 hearing aids later for acustic truma at close range, and the reality of, hey, I didn't do anything wrong, I decieded to try clean up my DD214, and get it removed,Dept of the Air Force did. the AFBMCR is still fighting me as I never hung around for the cameras that night, and I never made the papers as I was also covered in the perps pizz, and I'm not ashamed to admit any of it now,... ...The first time they told me I had PTSD, I asked if there was a cream for it, never understood the nightmares, and sweats, stressors, etc,... ...just hated the label of \"39-12 personality disorder\", didn't have one when I joined,... ...", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-18 10:10:00", 
        "title": "New Research PTSD", 
        "userID": "Terrror"
    }, 
    {
        "content": "I thought I had PTSD, then I got a divorce. OK, you're right if you say that it's no laughing matter. I've had friends who served in combat, which I didn't, and I've seen it with my own eyes. One of my Bros. lived in a single wide mobile home, and carried his AK when he went from room to room. Kept it next to him even in the bath. Never slept a full night, and the only thing that stopped it, was that he died of agent orange disease. Of course at that time the VA wasn't recognizing agent orange disease. They weren't real sure about PTSD. At least now they recognize PTSD. They always seem to go from extreme to extreme. If now they see it too much, it's better than not seeing it at all. I'll Allow No Megalomania When I Rule The World", 
        "intTime": 20090518, 
        "postID": 10, 
        "quote": "", 
        "reply": "I thought I had PTSD, then I got a divorce. OK, you're right if you say that it's no laughing matter. I've had friends who served in combat, which I didn't, and I've seen it with my own eyes. One of my Bros. lived in a single wide mobile home, and carried his AK when he went from room to room. Kept it next to him even in the bath. Never slept a full night, and the only thing that stopped it, was that he died of agent orange disease. Of course at that time the VA wasn't recognizing agent orange disease. They weren't real sure about PTSD. At least now they recognize PTSD. They always seem to go from extreme to extreme. If now they see it too much, it's better than not seeing it at all. I'll Allow No Megalomania When I Rule The World", 
        "threadID": "409192893_5920074322001", 
        "time": "2009-05-18 11:01:00", 
        "title": "New Research PTSD", 
        "userID": "redjohn48"
    }
]