[
    {
        "content": "\"http://www.nytimes.com/interactive/2009/03/22/us/20090322-workplace-audioss/index.html?hp#\" to beat it all it's all over the poor little illegal aleins. boo hoo, there are more americans laid off and nobody is feeling sorry for them!", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.nytimes.com/interactive/2009/03/22/us/20090322-workplace-audioss/index.html?hp#\" to beat it all it's all over the poor little illegal aleins. boo hoo, there are more americans laid off and nobody is feeling sorry for them!", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 06:07:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "blane"
    }, 
    {
        "content": "I really do not feel for those who come here illegally and not even try to become citizens. And that last guy...Here for 8 years and still not able to communicate in english? What little time I spent in Monterrey, Nuevo Leon, I did try to communicate in Spanish. If I had been there for 8 years, I know I could have mastered it....", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "I really do not feel for those who come here illegally and not even try to become citizens. And that last guy...Here for 8 years and still not able to communicate in english? What little time I spent in Monterrey, Nuevo Leon, I did try to communicate in Spanish. If I had been there for 8 years, I know I could have mastered it....", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 06:57:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Why bother learning English when the welfare forms are bi-lingual?", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "", 
        "reply": "Why bother learning English when the welfare forms are bi-lingual?", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 07:00:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "navy8086"
    }, 
    {
        "content": "Well damn Navy, you do have a valid point......", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well damn Navy, you do have a valid point......", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 07:18:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "the koch foods plant they showed the pic of used to be constaltly raided, the usual catch from there was 120 at a time, but they haven't raided it in over 4 yrs. it's also the place where numerous id theft are committed. there has been people as far away as california have their ssn used at this plant, and nothing has been done by local goevernment. these people have driven wages down, if you go by the ss office or the welfare office you can't get in, at the dmv, you have to make an appointment to get your license renewed, our violent crime rate has increased, drugs are everywhere now, hep a,b, and c along with some tb cases are on the rise, there are 2 sections in town that have gone from nice to slums, the school system is drained because the school board would rather pay for tranlators versus books, out of the two hospitals, one filed chapter 11 because of over $400M debt from treating illegals, it has now been bought by doctors and is a private hospital, our county jail is 98% hispanic, although they haven't made much noise outside the hispanic community, ms-13 is here. and the ny times think i feel sorry for them? the one auto factory they showed with an empty parking lot is where i used to work, there was no hispanics working there! out of all the americans they showed, all but one came from this plant, the lone exception being the guy at five rivers career center, but they are overwhelemd, (btw our jobs went to mexico!), there is always a protest from the illegals here, but when someone tries to protest the illegals, they can't get a permit or the permit gets pulled before it starts. the most violent place in town is in the heart of the hispanic community, there are two bars there that will serve anyone, including juveniles, but they will not even attempt to raid it, even though on any given night you can drive by there and see drug deals being made constantly, but the police will not enter their parking lot. no wonder america is in such pityful shape, people worrying about people that shouldn't even be here to start with!", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "", 
        "reply": "the koch foods plant they showed the pic of used to be constaltly raided, the usual catch from there was 120 at a time, but they haven't raided it in over 4 yrs. it's also the place where numerous id theft are committed. there has been people as far away as california have their ssn used at this plant, and nothing has been done by local goevernment. these people have driven wages down, if you go by the ss office or the welfare office you can't get in, at the dmv, you have to make an appointment to get your license renewed, our violent crime rate has increased, drugs are everywhere now, hep a,b, and c along with some tb cases are on the rise, there are 2 sections in town that have gone from nice to slums, the school system is drained because the school board would rather pay for tranlators versus books, out of the two hospitals, one filed chapter 11 because of over $400M debt from treating illegals, it has now been bought by doctors and is a private hospital, our county jail is 98% hispanic, although they haven't made much noise outside the hispanic community, ms-13 is here. and the ny times think i feel sorry for them? the one auto factory they showed with an empty parking lot is where i used to work, there was no hispanics working there! out of all the americans they showed, all but one came from this plant, the lone exception being the guy at five rivers career center, but they are overwhelemd, (btw our jobs went to mexico!), there is always a protest from the illegals here, but when someone tries to protest the illegals, they can't get a permit or the permit gets pulled before it starts. the most violent place in town is in the heart of the hispanic community, there are two bars there that will serve anyone, including juveniles, but they will not even attempt to raid it, even though on any given night you can drive by there and see drug deals being made constantly, but the police will not enter their parking lot. no wonder america is in such pityful shape, people worrying about people that shouldn't even be here to start with!", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 07:57:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "blane"
    }, 
    {
        "content": "quote: Originally posted by blane: the koch foods plant they showed the pic of used to be constaltly raided, the usual catch from there was 120 at a time, but they haven't raided it in over 4 yrs. it's also the place where numerous id theft are committed. there has been people as far away as california have their ssn used at this plant, and nothing has been done by local goevernment. these people have driven wages down, if you go by the ss office or the welfare office you can't get in, at the dmv, you have to make an appointment to get your license renewed, our violent crime rate has increased, drugs are everywhere now, hep a,b, and c along with some tb cases are on the rise, there are 2 sections in town that have gone from nice to slums, the school system is drained because the school board would rather pay for tranlators versus books, out of the two hospitals, one filed chapter 11 because of over $400M debt from treating illegals, it has now been bought by doctors and is a private hospital, our county jail is 98% hispanic, although they haven't made much noise outside the hispanic community, ms-13 is here. and the ny times think i feel sorry for them? the one auto factory they showed with an empty parking lot is where i used to work, there was no hispanics working there! out of all the americans they showed, all but one came from this plant, the lone exception being the guy at five rivers career center, but they are overwhelemd, (btw our jobs went to mexico!), there is always a protest from the illegals here, but when someone tries to protest the illegals, they can't get a permit or the permit gets pulled before it starts. the most violent place in town is in the heart of the hispanic community, there are two bars there that will serve anyone, including juveniles, but they will not even attempt to raid it, even though on any given night you can drive by there and see drug deals being made constantly, but the police will not enter their parking lot. no wonder america is in such pityful shape, people worrying about people that shouldn't even be here to start with! The ONLY effective way to end the illegal worker problem is go after the COMPANIES and MANAGERS that hire the illegals or look the other way when others in the company hire the illegals. They also need to especially go after companies that RECRUIT illegals and that help illegals get \"documentation\" that makes them look like they are legal workers. Once compnaies are paying fines big enough to affect profits and a few CEOs and other top managers spend some time in jail and pay big fines companies will find cheap legal ways to determine who is a legal worker rather than find excuses to not check.", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "Originally posted by blane: the koch foods plant they showed the pic of used to be constaltly raided, the usual catch from there was 120 at a time, but they haven't raided it in over 4 yrs. it's also the place where numerous id theft are committed. there has been people as far away as california have their ssn used at this plant, and nothing has been done by local goevernment. these people have driven wages down, if you go by the ss office or the welfare office you can't get in, at the dmv, you have to make an appointment to get your license renewed, our violent crime rate has increased, drugs are everywhere now, hep a,b, and c along with some tb cases are on the rise, there are 2 sections in town that have gone from nice to slums, the school system is drained because the school board would rather pay for tranlators versus books, out of the two hospitals, one filed chapter 11 because of over $400M debt from treating illegals, it has now been bought by doctors and is a private hospital, our county jail is 98% hispanic, although they haven't made much noise outside the hispanic community, ms-13 is here. and the ny times think i feel sorry for them? the one auto factory they showed with an empty parking lot is where i used to work, there was no hispanics working there! out of all the americans they showed, all but one came from this plant, the lone exception being the guy at five rivers career center, but they are overwhelemd, (btw our jobs went to mexico!), there is always a protest from the illegals here, but when someone tries to protest the illegals, they can't get a permit or the permit gets pulled before it starts. the most violent place in town is in the heart of the hispanic community, there are two bars there that will serve anyone, including juveniles, but they will not even attempt to raid it, even though on any given night you can drive by there and see drug deals being made constantly, but the police will not enter their parking lot. no wonder america is in such pityful shape, people worrying about people that shouldn't even be here to start with!", 
        "reply": " The ONLY effective way to end the illegal worker problem is go after the COMPANIES and MANAGERS that hire the illegals or look the other way when others in the company hire the illegals. They also need to especially go after companies that RECRUIT illegals and that help illegals get \"documentation\" that makes them look like they are legal workers. Once compnaies are paying fines big enough to affect profits and a few CEOs and other top managers spend some time in jail and pay big fines companies will find cheap legal ways to determine who is a legal worker rather than find excuses to not check.", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 08:25:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "rayld2"
    }, 
    {
        "content": "Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals.", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "", 
        "reply": "Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals.", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 08:33:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "they will stop kids from going to the mall on weekends after 6pm without an escort 21 and over, \"http://blogs.knoxnews.com/knx/harrington/2009/03/morristown_mall_implements_tee.html\" but they will not try to stem the dui's by illegals that don't have ins, a proper tag and push drugs in club parking lots...pitiful", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "", 
        "reply": "they will stop kids from going to the mall on weekends after 6pm without an escort 21 and over, \"http://blogs.knoxnews.com/knx/harrington/2009/03/morristown_mall_implements_tee.html\" but they will not try to stem the dui's by illegals that don't have ins, a proper tag and push drugs in club parking lots...pitiful", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 08:47:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "blane"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals. Going after the illegals is NOT cost effective. People that are willing to risk death to come and get the jobs will not be stopped by raids but the people hiring them have a lot to lose and will be stopped by a realistic threat of jail time and large fines.", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals.", 
        "reply": " Going after the illegals is NOT cost effective. People that are willing to risk death to come and get the jobs will not be stopped by raids but the people hiring them have a lot to lose and will be stopped by a realistic threat of jail time and large fines.", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 14:06:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "rayld2"
    }, 
    {
        "content": "yea my town is fore closer capitol of the usa...", 
        "intTime": 20090325, 
        "postID": 10, 
        "quote": "", 
        "reply": "yea my town is fore closer capitol of the usa...", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 14:24:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "outlaws93"
    }, 
    {
        "content": "i had a friend that use to build docks he got laid off a year ago.,.. well he recently went back there to see if he could work again and they said no way... they are hiring illegals(mexicans) for $4-$5 an hour cheaper then what he was being payed....", 
        "intTime": 20090325, 
        "postID": 11, 
        "quote": "", 
        "reply": "i had a friend that use to build docks he got laid off a year ago.,.. well he recently went back there to see if he could work again and they said no way... they are hiring illegals(mexicans) for $4-$5 an hour cheaper then what he was being payed....", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 14:26:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals. And when you catch up to them say, \"Take my 401k, please\". \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals.", 
        "reply": " And when you catch up to them say, \"Take my 401k, please\". \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 14:33:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals. Going after the illegals is NOT cost effective. People that are willing to risk death to come and get the jobs will not be stopped by raids but the people hiring them have a lot to lose and will be stopped by a realistic threat of jail time and large fines. So then we have a bunch of unemployed wetbacks running around committing crimes to get by? Nice. Throw the rubbish out. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 13, 
        "quote": "Originally posted by rayld2: quote: Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals. Going after the illegals is NOT cost effective. People that are willing to risk death to come and get the jobs will not be stopped by raids but the people hiring them have a lot to lose and will be stopped by a realistic threat of jail time and large fines.", 
        "reply": " So then we have a bunch of unemployed wetbacks running around committing crimes to get by? Nice. Throw the rubbish out. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 14:35:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals. Going after the illegals is NOT cost effective. People that are willing to risk death to come and get the jobs will not be stopped by raids but the people hiring them have a lot to lose and will be stopped by a realistic threat of jail time and large fines. Maybe you should read what he posted a little closer. He said BOTH!", 
        "intTime": 20090325, 
        "postID": 14, 
        "quote": "Originally posted by rayld2: quote: Originally posted by GunnyRet03: Guess, you havent heard raids are over. They way to end it is both. Go after businesses and Illegals. Going after the illegals is NOT cost effective. People that are willing to risk death to come and get the jobs will not be stopped by raids but the people hiring them have a lot to lose and will be stopped by a realistic threat of jail time and large fines.", 
        "reply": " Maybe you should read what he posted a little closer. He said BOTH!", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 17:14:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Why bother learning English when the welfare forms are bi-lingual? No need to now that Wal mart is opening Spainish only stores.. Mercado de Wal. Guarde Dinero. Viva Mejor. Enrosque América.", 
        "intTime": 20090325, 
        "postID": 15, 
        "quote": "Originally posted by navy8086: Why bother learning English when the welfare forms are bi-lingual?", 
        "reply": " No need to now that Wal mart is opening Spainish only stores.. Mercado de Wal. Guarde Dinero. Viva Mejor. Enrosque América.", 
        "threadID": "409192893_2430048812001", 
        "time": "2009-03-25 18:09:00", 
        "title": "wow, my little town made the nytimes.", 
        "userID": "crackerjacks61"
    }
]