[
    {
        "content": "received a rather large envelope from BofA and when i opened it I discovered a rate increase on a Platinum Master Card This particular acct had a zero balance and in fact had not been used since it was paid off in 2006, moderate limit of 20k.. was 5.799 and they raised it to 17.99% have no idea why, other than they can do just about whatever they want. called them and spend a long long time listening to a lot of ads telling me how great BofA is and how important my call is finally after listening to speaker phone for 45 minutes someone came up. i told them i would not accept the rate increase and why were they doing this, got the usual song and dance routine then i said \"close the acct and make sure that the credit rpt agencies write on it closed by consumer\" then i asked her off the record how many calls like this had she been receiving and she said \"this is all i am getting\" I then told her BofA gas a lot of nerve. and did get her tag number and location and shift cycle in case the credit rpt agencies do not put on there what i want.. then called a friend who is upper level mgt BofA and he said they are doing this across the board but i had expected it since it has been on news for a long time, that the credit card companies were raising rates just thought i would pass it on", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "", 
        "reply": "received a rather large envelope from BofA and when i opened it I discovered a rate increase on a Platinum Master Card This particular acct had a zero balance and in fact had not been used since it was paid off in 2006, moderate limit of 20k.. was 5.799 and they raised it to 17.99% have no idea why, other than they can do just about whatever they want. called them and spend a long long time listening to a lot of ads telling me how great BofA is and how important my call is finally after listening to speaker phone for 45 minutes someone came up. i told them i would not accept the rate increase and why were they doing this, got the usual song and dance routine then i said \"close the acct and make sure that the credit rpt agencies write on it closed by consumer\" then i asked her off the record how many calls like this had she been receiving and she said \"this is all i am getting\" I then told her BofA gas a lot of nerve. and did get her tag number and location and shift cycle in case the credit rpt agencies do not put on there what i want.. then called a friend who is upper level mgt BofA and he said they are doing this across the board but i had expected it since it has been on news for a long time, that the credit card companies were raising rates just thought i would pass it on", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-07 14:12:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Bank of America just took over Country Wide which informed me that Bank of America holds the mortgage on my home. Now I am going to Wells Fargo to refinance in a few days. Just say NO to these scam artists.", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "", 
        "reply": "Bank of America just took over Country Wide which informed me that Bank of America holds the mortgage on my home. Now I am going to Wells Fargo to refinance in a few days. Just say NO to these scam artists.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-07 15:25:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Duster6"
    }, 
    {
        "content": "you need the same deal the Dodd got", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "", 
        "reply": "you need the same deal the Dodd got", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-07 15:39:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I just pulled the family's emergency fund outta BoA. They fund leftist causes; let 'em do it with other people's money.", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "", 
        "reply": "I just pulled the family's emergency fund outta BoA. They fund leftist causes; let 'em do it with other people's money.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-07 15:46:00", 
        "title": "Bank of America hitting hard", 
        "userID": "RRR52"
    }, 
    {
        "content": "Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em.", 
        "intTime": 20090407, 
        "postID": 5, 
        "quote": "", 
        "reply": "Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-07 15:54:00", 
        "title": "Bank of America hitting hard", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Originally posted by DCookeUSA1: Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em. Maybe I am missing something, but why not produce your statements of two charges and one payment application? Wouldn't that be enough?", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "Originally posted by DCookeUSA1: Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em.", 
        "reply": " Maybe I am missing something, but why not produce your statements of two charges and one payment application? Wouldn't that be enough?", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 06:02:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I pulled out of BofA two years ago and never looked back. They are hardly a friend of deployed servicemembers. USAA takes good care of me now.", 
        "intTime": 20090408, 
        "postID": 7, 
        "quote": "", 
        "reply": "I pulled out of BofA two years ago and never looked back. They are hardly a friend of deployed servicemembers. USAA takes good care of me now.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 06:04:00", 
        "title": "Bank of America hitting hard", 
        "userID": "AKinNC"
    }, 
    {
        "content": "I don't care what the charge card rate is because I never carry a balance. If the card issuer trys to impose some transaction fee or other bogus charge I just close the account. Since I don't need a mortgage or other credit I don't mind the closure on my credit record.", 
        "intTime": 20090408, 
        "postID": 8, 
        "quote": "", 
        "reply": "I don't care what the charge card rate is because I never carry a balance. If the card issuer trys to impose some transaction fee or other bogus charge I just close the account. Since I don't need a mortgage or other credit I don't mind the closure on my credit record.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 06:08:00", 
        "title": "Bank of America hitting hard", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "they have closed down a bunch of bofa down here... yup they all became something else...", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "", 
        "reply": "they have closed down a bunch of bofa down here... yup they all became something else...", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 07:45:00", 
        "title": "Bank of America hitting hard", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by AKinNC: I pulled out of BofA two years ago and never looked back. They are hardly a friend of deployed servicemembers. USAA takes good care of me now. i bank at a small independent bank... edison national bank... my grandfather help start it...he started up about 5 banks including barnett bank...which is closed now but was popular in florida...", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "Originally posted by AKinNC: I pulled out of BofA two years ago and never looked back. They are hardly a friend of deployed servicemembers. USAA takes good care of me now.", 
        "reply": " i bank at a small independent bank... edison national bank... my grandfather help start it...he started up about 5 banks including barnett bank...which is closed now but was popular in florida...", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 07:57:00", 
        "title": "Bank of America hitting hard", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: I don't care what the charge card rate is because I never carry a balance. If the card issuer trys to impose some transaction fee or other bogus charge I just close the account. Since I don't need a mortgage or other credit I don't mind the closure on my credit record. But haven't you heard? There are these \"No activity\" charges now...lol", 
        "intTime": 20090408, 
        "postID": 11, 
        "quote": "Originally posted by bill_kananen: I don't care what the charge card rate is because I never carry a balance. If the card issuer trys to impose some transaction fee or other bogus charge I just close the account. Since I don't need a mortgage or other credit I don't mind the closure on my credit record.", 
        "reply": " But haven't you heard? There are these \"No activity\" charges now...lol", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 08:32:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by AKinNC: I pulled out of BofA two years ago and never looked back. They are hardly a friend of deployed servicemembers. USAA takes good care of me now. i bank at a small independent bank... edison national bank... my grandfather help start it...he started up about 5 banks including barnett bank...which is closed now but was popular in florida... independent small banks are getting rare, and in this area, i just do not even know or ANY rural eastern north carolina, but independents sure would like to look into one if there was one", 
        "intTime": 20090408, 
        "postID": 12, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by AKinNC: I pulled out of BofA two years ago and never looked back. They are hardly a friend of deployed servicemembers. USAA takes good care of me now. i bank at a small independent bank... edison national bank... my grandfather help start it...he started up about 5 banks including barnett bank...which is closed now but was popular in florida...", 
        "reply": " independent small banks are getting rare, and in this area, i just do not even know or ANY rural eastern north carolina, but independents sure would like to look into one if there was one", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 09:10:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Irwin_R_Schyster: But haven't you heard? There are these \"No activity\" charges now...lol I have heard of accounts being closed for no activity. I haven't heard of charges being imposed for no activity. If I receive an account change notice that includes such a charge that account will become history.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "Irwin_R_Schyster: But haven't you heard? There are these \"No activity\" charges now...lol", 
        "reply": " I have heard of accounts being closed for no activity. I haven't heard of charges being imposed for no activity. If I receive an account change notice that includes such a charge that account will become history.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 09:14:00", 
        "title": "Bank of America hitting hard", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: Irwin_R_Schyster: But haven't you heard? There are these \"No activity\" charges now...lol I have heard of accounts being closed for no activity. I haven't heard of charges being imposed for no activity. If I receive an account change notice that includes such a charge that account will become history. providian tried that crap had a acct with them, did not use it much but one day got a statement that had \"services availability charge\" for $6.89 on it and i called and said whats this, and they said it was a charge that they put on there to see if i had used the card . I replied that there are no annual fees and she said this is not a fee, it is a serviceablity charge, i said forget it and close acct.... and bank of america is one of the leading toxic waste mtg lender.........In calif it helped them to have loand papers in espanol", 
        "intTime": 20090408, 
        "postID": 14, 
        "quote": "Originally posted by bill_kananen: quote: Irwin_R_Schyster: But haven't you heard? There are these \"No activity\" charges now...lol I have heard of accounts being closed for no activity. I haven't heard of charges being imposed for no activity. If I receive an account change notice that includes such a charge that account will become history.", 
        "reply": " providian tried that crap had a acct with them, did not use it much but one day got a statement that had \"services availability charge\" for $6.89 on it and i called and said whats this, and they said it was a charge that they put on there to see if i had used the card . I replied that there are no annual fees and she said this is not a fee, it is a serviceablity charge, i said forget it and close acct.... and bank of america is one of the leading toxic waste mtg lender.........In calif it helped them to have loand papers in espanol", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 09:24:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Be very vigilant when dealing with B of A... they are a \"national bank\" meaning to complain about them you have to go the the COC... Comptroller of the Currency in the federal government. A complaint to your Attorney General does not make it. I complained about B of A and won at the federal level...after contacting our AG here in Washington. I was discussing a mortgage loan with a Senior Bank official at our local branch... I needed the dollar figures to compare their deal to another bank I had been talking to. As you know the details and fees do vary. After handing me a packet on many of their policies and programs he said, \"in that packet you will find a form to sign and put a credit number in for our Application Fee which is $550\". I said we did not need to do that we would just take it out of our checking account. He said okay and I left...getting home I noticed he did not give me the \"sheet\" that tells you what your costs are and interest rate might be. So the next day I went back and picked up the information he left out from the Bank Manager. That night I went over the two proposals with my wife and we looked up our accounts on line...and discovered that B of A (the Senior official) took the money out of our account with a notation that it was verbally approved by the depositer and it named my wife?? We were really upset on seeing that. They took the money out of our account without a signature or okay from either of us. Needless to say I complained to the Bank, the State and the COC in the federal government. After all this a Bank official called (did not identify themselves) and said they wanted to deposit $550 in my account and needed an account number. No apologies, nothing else.", 
        "intTime": 20090408, 
        "postID": 15, 
        "quote": "", 
        "reply": "Be very vigilant when dealing with B of A... they are a \"national bank\" meaning to complain about them you have to go the the COC... Comptroller of the Currency in the federal government. A complaint to your Attorney General does not make it. I complained about B of A and won at the federal level...after contacting our AG here in Washington. I was discussing a mortgage loan with a Senior Bank official at our local branch... I needed the dollar figures to compare their deal to another bank I had been talking to. As you know the details and fees do vary. After handing me a packet on many of their policies and programs he said, \"in that packet you will find a form to sign and put a credit number in for our Application Fee which is $550\". I said we did not need to do that we would just take it out of our checking account. He said okay and I left...getting home I noticed he did not give me the \"sheet\" that tells you what your costs are and interest rate might be. So the next day I went back and picked up the information he left out from the Bank Manager. That night I went over the two proposals with my wife and we looked up our accounts on line...and discovered that B of A (the Senior official) took the money out of our account with a notation that it was verbally approved by the depositer and it named my wife?? We were really upset on seeing that. They took the money out of our account without a signature or okay from either of us. Needless to say I complained to the Bank, the State and the COC in the federal government. After all this a Bank official called (did not identify themselves) and said they wanted to deposit $550 in my account and needed an account number. No apologies, nothing else.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 09:39:00", 
        "title": "Bank of America hitting hard", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Be very vigilant when dealing with B of A... they are a \"national bank\" meaning to complain about them you have to go the the COC... Comptroller of the Currency in the federal government. A complaint to your Attorney General does not make it. I complained about B of A and won at the federal level...after contacting our AG here in Washington. I was discussing a mortgage loan with a Senior Bank official at our local branch... I needed the dollar figures to compare their deal to another bank I had been talking to. As you know the details and fees do vary. After handing me a packet on many of their policies and programs he said, \"in that packet you will find a form to sign and put a credit number in for our Application Fee which is $550\". I said we did not need to do that we would just take it out of our checking account. He said okay and I left...getting home I noticed he did not give me the \"sheet\" that tells you what your costs are and interest rate might be. So the next day I went back and picked up the information he left out from the Bank Manager. That night I went over the two proposals with my wife and we looked up our accounts on line...and discovered that B of A (the Senior official) took the money out of our account with a notation that it was verbally approved by the depositer and it named my wife?? We were really upset on seeing that. They took the money out of our account without a signature or okay from either of us. Needless to say I complained to the Bank, the State and the COC in the federal government. After all this a Bank official called (did not identify themselves) and said they wanted to deposit $550 in my account and needed an account number. No apologies, nothing else. what can we do as peons to minimize this in the future... i can only say couple of things \"if it is too good to be true then it usually is\" watch the *******s like a hawk, in writing and readable with notations and initials if needed No closing without your atty of choice", 
        "intTime": 20090408, 
        "postID": 16, 
        "quote": "Originally posted by dragonflyer04: Be very vigilant when dealing with B of A... they are a \"national bank\" meaning to complain about them you have to go the the COC... Comptroller of the Currency in the federal government. A complaint to your Attorney General does not make it. I complained about B of A and won at the federal level...after contacting our AG here in Washington. I was discussing a mortgage loan with a Senior Bank official at our local branch... I needed the dollar figures to compare their deal to another bank I had been talking to. As you know the details and fees do vary. After handing me a packet on many of their policies and programs he said, \"in that packet you will find a form to sign and put a credit number in for our Application Fee which is $550\". I said we did not need to do that we would just take it out of our checking account. He said okay and I left...getting home I noticed he did not give me the \"sheet\" that tells you what your costs are and interest rate might be. So the next day I went back and picked up the information he left out from the Bank Manager. That night I went over the two proposals with my wife and we looked up our accounts on line...and discovered that B of A (the Senior official) took the money out of our account with a notation that it was verbally approved by the depositer and it named my wife?? We were really upset on seeing that. They took the money out of our account without a signature or okay from either of us. Needless to say I complained to the Bank, the State and the COC in the federal government. After all this a Bank official called (did not identify themselves) and said they wanted to deposit $550 in my account and needed an account number. No apologies, nothing else.", 
        "reply": " what can we do as peons to minimize this in the future... i can only say couple of things \"if it is too good to be true then it usually is\" watch the *******s like a hawk, in writing and readable with notations and initials if needed No closing without your atty of choice", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 10:26:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Bank of America just took over Country Wide which informed me that Bank of America holds the mortgage on my home. Now I am going to Wells Fargo to refinance in a few days. Just say NO to these scam artists. countrywide is who has my mortgage, i'm having a hard time debating whether or not to refinance through my credit union since i only owe around 6.5 yrs. i'm not really wanting to refinace for another 15, but countrywide does suck, so does BofA..", 
        "intTime": 20090408, 
        "postID": 17, 
        "quote": "Originally posted by Duster6: Bank of America just took over Country Wide which informed me that Bank of America holds the mortgage on my home. Now I am going to Wells Fargo to refinance in a few days. Just say NO to these scam artists.", 
        "reply": " countrywide is who has my mortgage, i'm having a hard time debating whether or not to refinance through my credit union since i only owe around 6.5 yrs. i'm not really wanting to refinace for another 15, but countrywide does suck, so does BofA..", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 11:14:00", 
        "title": "Bank of America hitting hard", 
        "userID": "blane"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Originally posted by DCookeUSA1: Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em. Maybe I am missing something, but why not produce your statements of two charges and one payment application? Wouldn't that be enough? This was on a BofA credit card. I was paying it off through my checking account, and my checking account at that time was with Washington Mutual. So after I got nowhere on the phone I went down to WAMU, got printouts of everything, walked into BofA, talked to that manager, showed her what happened. She sided with me, she got on the phone to someone. The told her the same thing they told me on the phone - which was that they couldn't do anything that I had to write in a request and MAIL it in! And they refused to simply pull the phone conversation, I had to write in a request or talk to a lawyer. I was exasperated and disgusted by the whole thing and never bothered pursuing it further.", 
        "intTime": 20090408, 
        "postID": 18, 
        "quote": "Originally posted by Woody_in_La: quote: Originally posted by DCookeUSA1: Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em. Maybe I am missing something, but why not produce your statements of two charges and one payment application? Wouldn't that be enough?", 
        "reply": " This was on a BofA credit card. I was paying it off through my checking account, and my checking account at that time was with Washington Mutual. So after I got nowhere on the phone I went down to WAMU, got printouts of everything, walked into BofA, talked to that manager, showed her what happened. She sided with me, she got on the phone to someone. The told her the same thing they told me on the phone - which was that they couldn't do anything that I had to write in a request and MAIL it in! And they refused to simply pull the phone conversation, I had to write in a request or talk to a lawyer. I was exasperated and disgusted by the whole thing and never bothered pursuing it further.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 12:24:00", 
        "title": "Bank of America hitting hard", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Originally posted by DCookeUSA1: quote: Originally posted by Woody_in_La: quote: Originally posted by DCookeUSA1: Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em. Maybe I am missing something, but why not produce your statements of two charges and one payment application? Wouldn't that be enough? This was on a BofA credit card. I was paying it off through my checking account, and my checking account at that time was with Washington Mutual. So after I got nowhere on the phone I went down to WAMU, got printouts of everything, walked into BofA, talked to that manager, showed her what happened. She sided with me, she got on the phone to someone. The told her the same thing they told me on the phone - which was that they couldn't do anything that I had to write in a request and MAIL it in! And they refused to simply pull the phone conversation, I had to write in a request or talk to a lawyer. I was exasperated and disgusted by the whole thing and never bothered pursuing it further. sorry that it happened however (you might not like this) but you let the *******s win", 
        "intTime": 20090408, 
        "postID": 19, 
        "quote": "Originally posted by DCookeUSA1: quote: Originally posted by Woody_in_La: quote: Originally posted by DCookeUSA1: Fug em. A couple of years ago they stole 3k from me. I made a payment on something then they called me the next day and said \"we lost your payment info. can you give it to us again\". So I gave it to them again. Lo and behold they double charged me but applied only one payment! They then refused to admit their mistake, and said that they only charged me once. The charge was made twice from the same source, and the bank verified that. They said I had to talk to an attorney and try to pull the tape recording of the conversation, which may or may not exist. I'm still sore over that, I haven't pursued it, but I'm gonna get em. Maybe I am missing something, but why not produce your statements of two charges and one payment application? Wouldn't that be enough? This was on a BofA credit card. I was paying it off through my checking account, and my checking account at that time was with Washington Mutual. So after I got nowhere on the phone I went down to WAMU, got printouts of everything, walked into BofA, talked to that manager, showed her what happened. She sided with me, she got on the phone to someone. The told her the same thing they told me on the phone - which was that they couldn't do anything that I had to write in a request and MAIL it in! And they refused to simply pull the phone conversation, I had to write in a request or talk to a lawyer. I was exasperated and disgusted by the whole thing and never bothered pursuing it further.", 
        "reply": " sorry that it happened however (you might not like this) but you let the *******s win", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 12:47:00", 
        "title": "Bank of America hitting hard", 
        "userID": "Ira1945"
    }, 
    {
        "content": "BofA raising salieries up to 70% Bank of America Corp. plans to increase some investment bankers’ salaries by as much as 70 percent following the takeover earlier this year of Merrill Lynch & Co., people familiar with the proposal said. “The concepts we are considering would not increase total compensation,” Brian Moynihan, Bank of America’s president of investment banking and wealth management, wrote yesterday in a memo to employees obtained by Bloomberg News. “Rather, we believe it is responsible, and consistent with the emerging public consensus, that a greater percentage of overall compensation come from fixed base salary.” Bank of America, which has received $45 billion of taxpayers’ money, may raise the annual base pay for some managing directors to about $300,000 from $180,000, said the people, who declined to be identified because the final numbers are still under discussion. Salaries for less-senior directors would climb to about $250,000 from $150,000, and vice presidents would get $200,000, up from about $125,000, the people said. Bonuses will become a “smaller” portion of total compensation, Moynihan wrote in the memo. from \"bloomberg\" Good thing those poor bankers got our help, in the nick of time no doubt.", 
        "intTime": 20090408, 
        "postID": 20, 
        "quote": "", 
        "reply": "BofA raising salieries up to 70% Bank of America Corp. plans to increase some investment bankers’ salaries by as much as 70 percent following the takeover earlier this year of Merrill Lynch & Co., people familiar with the proposal said. “The concepts we are considering would not increase total compensation,” Brian Moynihan, Bank of America’s president of investment banking and wealth management, wrote yesterday in a memo to employees obtained by Bloomberg News. “Rather, we believe it is responsible, and consistent with the emerging public consensus, that a greater percentage of overall compensation come from fixed base salary.” Bank of America, which has received $45 billion of taxpayers’ money, may raise the annual base pay for some managing directors to about $300,000 from $180,000, said the people, who declined to be identified because the final numbers are still under discussion. Salaries for less-senior directors would climb to about $250,000 from $150,000, and vice presidents would get $200,000, up from about $125,000, the people said. Bonuses will become a “smaller” portion of total compensation, Moynihan wrote in the memo. from \"bloomberg\" Good thing those poor bankers got our help, in the nick of time no doubt.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 17:04:00", 
        "title": "Bank of America hitting hard", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by _cash_: We now pay off our credit card purchases on each billing period. That must **** them off! I honestly don't think they care. We haven't had a credit card balance in over 20 years and they raised our rate to 17.99%. It makes not sense but since we never carry a balance it really makes little or no difference.", 
        "intTime": 20090408, 
        "postID": 21, 
        "quote": "Originally posted by _cash_: We now pay off our credit card purchases on each billing period. That must **** them off!", 
        "reply": " I honestly don't think they care. We haven't had a credit card balance in over 20 years and they raised our rate to 17.99%. It makes not sense but since we never carry a balance it really makes little or no difference.", 
        "threadID": "409192893_9900001022001", 
        "time": "2009-04-08 19:13:00", 
        "title": "Bank of America hitting hard", 
        "userID": "adminnco1"
    }
]