[
    {
        "content": "Hey, Lisp-boy and Dudd where you at? Outrage anyone outrage? Obama you going to make another angry speech? 'http://online.wsj.com/article/SB123739512036672809.html' Fannie Mae is due to pay retention bonuses of as much $470,000 to $611,000 this year to some executives despite enormous losses at the government-backed mortgage company. Fannie's main rival, Freddie Mac, also plans to pay such bonuses but hasn't yet provided details. Fannie's bonuses are smaller than ones paid by American International Group Inc. that have caused a political firestorm for that company. Many AIG executives got retention payments of more than $1 million recently. But the Fannie bonuses are still considerable and come at a time when Fannie and Freddie are receiving increasing amounts of funding from the Treasury. For 2008, Fannie and Freddie reported combined losses of about $108 billion, largely stemming from a surge in home-mortgage defaults. The U.S. Treasury has agreed to provide as much as $200 billion of capital apiece to Fannie and Freddie in exchange for senior preferred stock. The two companies already have said they will need a combined $60 billion of that money to cover their losses so far. A recent Fannie securities filing says that Michael Williams, the company's chief operating officer, is due to receive cash retention awards of $611,000 this year, atop a similar award of $260,000 in 2008. His base salary is $676,000 a year. The company also disclosed plans to pay retention awards this year of $517,000 to David Hisey and $470,000 each to Thomas Lund and Kenneth Bacon. All three of them are executive vice presidents. Officials at the Federal Housing Finance Agency, or FHFA, which regulates Fannie and Freddie, had no immediate comment on whether the bonuses will be reconsidered in light of the uproar over the AIG bonuses. Hundreds of other Fannie employees also are eligible for retention awards, but the company disclosed only the largest of the bonuses. It said there are no plans for a retention bonus for the chief executive officer, Herbert Allison, who elected to serve without any salary or bonus in 2008. Freddie has a similar retention-bonus plan but hasn't yet disclosed the amounts due to be paid to its top executives. That disclosure is due by the end of April. The companies' regulator, the FHFA, approved the retention bonuses last year, saying they would help the companies keep critical employees at a time when it isn't clear what long-term role, if any, Fannie and Freddie will play in the U.S. mortgage-finance industry. Congress is starting to debate how to restructure the companies and perhaps replace them with new entities. <edit>", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "Hey, Lisp-boy and Dudd where you at? Outrage anyone outrage? Obama you going to make another angry speech? 'http://online.wsj.com/article/SB123739512036672809.html' Fannie Mae is due to pay retention bonuses of as much $470,000 to $611,000 this year to some executives despite enormous losses at the government-backed mortgage company. Fannie's main rival, Freddie Mac, also plans to pay such bonuses but hasn't yet provided details. Fannie's bonuses are smaller than ones paid by American International Group Inc. that have caused a political firestorm for that company. Many AIG executives got retention payments of more than $1 million recently. But the Fannie bonuses are still considerable and come at a time when Fannie and Freddie are receiving increasing amounts of funding from the Treasury. For 2008, Fannie and Freddie reported combined losses of about $108 billion, largely stemming from a surge in home-mortgage defaults. The U.S. Treasury has agreed to provide as much as $200 billion of capital apiece to Fannie and Freddie in exchange for senior preferred stock. The two companies already have said they will need a combined $60 billion of that money to cover their losses so far. A recent Fannie securities filing says that Michael Williams, the company's chief operating officer, is due to receive cash retention awards of $611,000 this year, atop a similar award of $260,000 in 2008. His base salary is $676,000 a year. The company also disclosed plans to pay retention awards this year of $517,000 to David Hisey and $470,000 each to Thomas Lund and Kenneth Bacon. All three of them are executive vice presidents. Officials at the Federal Housing Finance Agency, or FHFA, which regulates Fannie and Freddie, had no immediate comment on whether the bonuses will be reconsidered in light of the uproar over the AIG bonuses. Hundreds of other Fannie employees also are eligible for retention awards, but the company disclosed only the largest of the bonuses. It said there are no plans for a retention bonus for the chief executive officer, Herbert Allison, who elected to serve without any salary or bonus in 2008. Freddie has a similar retention-bonus plan but hasn't yet disclosed the amounts due to be paid to its top executives. That disclosure is due by the end of April. The companies' regulator, the FHFA, approved the retention bonuses last year, saying they would help the companies keep critical employees at a time when it isn't clear what long-term role, if any, Fannie and Freddie will play in the U.S. mortgage-finance industry. Congress is starting to debate how to restructure the companies and perhaps replace them with new entities. <edit>", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-18 11:55:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "AIN'T IT JUST GRAND!!! MAN YOU CAN'T WRITE THIS STUFF NO FRIGGIN' BODY WOULD BELIEVE IT!!!", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "AIN'T IT JUST GRAND!!! MAN YOU CAN'T WRITE THIS STUFF NO FRIGGIN' BODY WOULD BELIEVE IT!!!", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-18 12:36:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: AIN'T IT JUST GRAND!!! MAN YOU CAN'T WRITE THIS STUFF NO FRIGGIN' BODY WOULD BELIEVE IT!!! I believe it and frankly not surprised. This congress is responsible for a lot of this mess.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "Originally posted by tawodi: AIN'T IT JUST GRAND!!! MAN YOU CAN'T WRITE THIS STUFF NO FRIGGIN' BODY WOULD BELIEVE IT!!!", 
        "reply": " I believe it and frankly not surprised. This congress is responsible for a lot of this mess.", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-18 15:19:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Although the amounts of the bonuses are not near the equal of the AIG BS. They are a failed company that should not be giving bonuses to anyone. Let's see if Rep Frank speaks out as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "Although the amounts of the bonuses are not near the equal of the AIG BS. They are a failed company that should not be giving bonuses to anyone. Let's see if Rep Frank speaks out as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-18 15:38:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Although the amounts of the bonuses are not near the equal of the AIG BS. They are a failed company that should not be giving bonuses to anyone. Let's see if Rep Frank speaks out as well. The msm is asleep again, they mention it in a 'oh by the way' manner. Some reporter needs to grow some fugn ballz and ask lisp-boy why is his baby still goving out bonuses. When I heard a congressman say AIG stands for Arrogance, Incompetence, Greed I laughed my azz off on the hypocrisy of that statement. I wish someone that gets called to congress for a dog and pony azz chewing would turn the tables on these pompous self righteous turds.", 
        "intTime": 20090319, 
        "postID": 5, 
        "quote": "Originally posted by L0A1: Although the amounts of the bonuses are not near the equal of the AIG BS. They are a failed company that should not be giving bonuses to anyone. Let's see if Rep Frank speaks out as well.", 
        "reply": " The msm is asleep again, they mention it in a 'oh by the way' manner. Some reporter needs to grow some fugn ballz and ask lisp-boy why is his baby still goving out bonuses. When I heard a congressman say AIG stands for Arrogance, Incompetence, Greed I laughed my azz off on the hypocrisy of that statement. I wish someone that gets called to congress for a dog and pony azz chewing would turn the tables on these pompous self righteous turds.", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-19 05:25:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "TO THE TOPIC:BUMP!", 
        "intTime": 20090322, 
        "postID": 6, 
        "quote": "", 
        "reply": "TO THE TOPIC:BUMP!", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 02:55:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "I guess it just boils down to the fact that it is not who you know, its who you blow.", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "", 
        "reply": "I guess it just boils down to the fact that it is not who you know, its who you blow.", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 03:17:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "dhd123"
    }, 
    {
        "content": "Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy.", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "", 
        "reply": "Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy.", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 03:41:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy. In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business?", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy.", 
        "reply": " In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business?", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 04:12:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy. In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business? So you advocate that we not communicate with our elected officials?", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "Originally posted by threerings: quote: Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy. In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business?", 
        "reply": " So you advocate that we not communicate with our elected officials?", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 04:16:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by threerings: quote: Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy. In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business? So you advocate that we not communicate with our elected officials? Sorry, sarcasm dos not translate well.. try this +++http://www.youtube.com/watch?v=Wbo3xlh7vSc My tonge was firmly in cheek..but clearly those in power dont care what we have to say.", 
        "intTime": 20090322, 
        "postID": 11, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by threerings: quote: Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy. In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business? So you advocate that we not communicate with our elected officials?", 
        "reply": " Sorry, sarcasm dos not translate well.. try this +++http://www.youtube.com/watch?v=Wbo3xlh7vSc My tonge was firmly in cheek..but clearly those in power dont care what we have to say.", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 07:59:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "\"Put that coffee down! Coffee is for closers!\" - Glengarry Glenross", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "", 
        "reply": "\"Put that coffee down! Coffee is for closers!\" - Glengarry Glenross", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 10:09:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: They are a failed company that should not be giving bonuses to anyone. yup.", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "They are a failed company that should not be giving bonuses to anyone.", 
        "reply": " yup.", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 10:13:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by adminnco1: quote: Originally posted by threerings: quote: Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy. In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business? So you advocate that we not communicate with our elected officials? Sorry, sarcasm dos not translate well.. try this +++http://www.youtube.com/watch?v=Wbo3xlh7vSc My tonge was firmly in cheek..but clearly those in power dont care what we have to say. Understood. Generally I agree, but at the moment our Congressman is very interested in running for a state position, Commissioner of Agriculture, so he is being very, very attention to local opinion. It's a big cynical I suppose, but we have 2 years to get as much as we can out of him...", 
        "intTime": 20090322, 
        "postID": 14, 
        "quote": "Originally posted by threerings: quote: Originally posted by adminnco1: quote: Originally posted by threerings: quote: Originally posted by adminnco1: Definitely time to bombard the congresscritters with email demanding an explanation for this hypocrisy. In the words of Charlie Rangel (D) New York: Why dont you mind your own GD business? So you advocate that we not communicate with our elected officials? Sorry, sarcasm dos not translate well.. try this +++http://www.youtube.com/watch?v=Wbo3xlh7vSc My tonge was firmly in cheek..but clearly those in power dont care what we have to say.", 
        "reply": " Understood. Generally I agree, but at the moment our Congressman is very interested in running for a state position, Commissioner of Agriculture, so he is being very, very attention to local opinion. It's a big cynical I suppose, but we have 2 years to get as much as we can out of him...", 
        "threadID": "409192893_5040022812001", 
        "time": "2009-03-22 11:51:00", 
        "title": "MAE and MAC Pay Bonuses", 
        "userID": "adminnco1"
    }
]