[
    {
        "content": "It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists.", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "", 
        "reply": "It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-29 20:44:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "eventually, this Nation is going to split in half. barak hussien obama is going to drive the wedge that does it.", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "eventually, this Nation is going to split in half. barak hussien obama is going to drive the wedge that does it.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 03:53:00", 
        "title": "Right returning to its birthplace", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). HA! Wanna buy a bridge?", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government).", 
        "reply": " HA! Wanna buy a bridge?", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 04:00:00", 
        "title": "Right returning to its birthplace", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists. Searching the raging seas for straws...", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "Originally posted by ACR26: It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists.", 
        "reply": " Searching the raging seas for straws...", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 04:52:00", 
        "title": "Right returning to its birthplace", 
        "userID": "Thud357L"
    }, 
    {
        "content": "The left seems to be running fast and far from their founding principles. They are persuading each other that National Healthcare is the new American Way. Taxing the \"wealthy\" who employ the majority of workers which is punishment for doing good is proper and just. I'll take heading towards the right. Keep up with the coke bottle glasses dems", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "", 
        "reply": "The left seems to be running fast and far from their founding principles. They are persuading each other that National Healthcare is the new American Way. Taxing the \"wealthy\" who employ the majority of workers which is punishment for doing good is proper and just. I'll take heading towards the right. Keep up with the coke bottle glasses dems", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 05:45:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists. There's a term for what you're doing here. It's called gilding a turd.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by ACR26: It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists.", 
        "reply": " There's a term for what you're doing here. It's called gilding a turd.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 05:47:00", 
        "title": "Right returning to its birthplace", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: There's a term for what you're doing here. It's called gilding a turd. Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "There's a term for what you're doing here. It's called gilding a turd.", 
        "reply": " Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 05:57:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "What is necessary in todays world for happiness is that one NOT think!! In fact thinking is deemed dangerous now by the dept of Homeland security!! So! Don't do it! Simply take from the government that which they see fit to give you from what you have earned....oh...wait a minute.... you didn't earn enough to be taxed???? WELL THEN!! Step right up, file for the \"Earned income credit, the child tax credit and!! The EXTRA child income tax credit and collect your $4,780.00 average gift from Barry DA MAN Obama!! You don't want to do that..it's stealing from those who earned it?? Don't be prosaic and reactionary, what's the matter with you!!?? This is America!! You have a right to what somebody else has earned!! You just don't have the right to what YOU have earned!! Do we understand each other now?? That's good, now if you've got it, give it UP!! If you don't..... well then here's what we stole from that poor slob of a capitolist over there!! Yeah we know he just works in a hardware store but he made enough to pay taxes!! The filthy B***tard!!!", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "", 
        "reply": "What is necessary in todays world for happiness is that one NOT think!! In fact thinking is deemed dangerous now by the dept of Homeland security!! So! Don't do it! Simply take from the government that which they see fit to give you from what you have earned....oh...wait a minute.... you didn't earn enough to be taxed???? WELL THEN!! Step right up, file for the \"Earned income credit, the child tax credit and!! The EXTRA child income tax credit and collect your $4,780.00 average gift from Barry DA MAN Obama!! You don't want to do that..it's stealing from those who earned it?? Don't be prosaic and reactionary, what's the matter with you!!?? This is America!! You have a right to what somebody else has earned!! You just don't have the right to what YOU have earned!! Do we understand each other now?? That's good, now if you've got it, give it UP!! If you don't..... well then here's what we stole from that poor slob of a capitolist over there!! Yeah we know he just works in a hardware store but he made enough to pay taxes!! The filthy B***tard!!!", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 06:15:00", 
        "title": "Right returning to its birthplace", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by ACR26: The left seems to be running fast and far from their founding principles. They are persuading each other that National Healthcare is the new American Way. Did you know that HMO’s have only been around for a few decades? Taxing the \"wealthy\" who employ the majority of workers SE Asia is thrilled that they are helping their unemployment rate. which is punishment for doing good is proper and just. I'll take heading towards the right. Keep up with the coke bottle glasses dems +http://www.urbandictionary.com/define.php?term=drink+the+kool-aid \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "Originally posted by ACR26: The left seems to be running fast and far from their founding principles. They are persuading each other that National Healthcare is the new American Way. Did you know that HMO’s have only been around for a few decades? Taxing the \"wealthy\" who employ the majority of workers SE Asia is thrilled that they are helping their unemployment rate. which is punishment for doing good is proper and just. I'll take heading towards the right. Keep up with the coke bottle glasses dems", 
        "reply": " +http://www.urbandictionary.com/define.php?term=drink+the+kool-aid \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 06:26:00", 
        "title": "Right returning to its birthplace", 
        "userID": "NSNN"
    }, 
    {
        "content": "There will always be people who follow a right or far right philosophy. That doesn't make them Republican but it is more likely they will identify with Republicans rather then Democrats. The Republican party leaders realize they have lost the support of the 18 to 34 demographic. Now they must find a Republican identy and philosophy different from the Democrats and appealing to moderate and conservative voters. It's not going to be a \"big tent\" party but one independent and ambitious people can identify with.", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "", 
        "reply": "There will always be people who follow a right or far right philosophy. That doesn't make them Republican but it is more likely they will identify with Republicans rather then Democrats. The Republican party leaders realize they have lost the support of the 18 to 34 demographic. Now they must find a Republican identy and philosophy different from the Democrats and appealing to moderate and conservative voters. It's not going to be a \"big tent\" party but one independent and ambitious people can identify with.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 07:00:00", 
        "title": "Right returning to its birthplace", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: There will always be people who follow a right or far right philosophy. That doesn't make them Republican but it is more likely they will identify with Republicans rather then Democrats. The Republican party leaders realize they have lost the support of the 18 to 34 demographic. Now they must find a Republican identy and philosophy different from the Democrats and appealing to moderate and conservative voters. It's not going to be a \"big tent\" party but one independent and ambitious people can identify with. They won't have to move very much closer to center to do it, either, if the Dems keep tracking further left. I'm thinking a nice, fat \"far left\" issue will get passed such as a new gun ban that will once again drive the \"middle third\" of the electorate back to the GOP as happened in 94. These things always come full circle. Dems and Repubs can't help it...they are programmed to take their majority and try to push the country further left or right than it really wants to go.", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "Originally posted by bill_kananen: There will always be people who follow a right or far right philosophy. That doesn't make them Republican but it is more likely they will identify with Republicans rather then Democrats. The Republican party leaders realize they have lost the support of the 18 to 34 demographic. Now they must find a Republican identy and philosophy different from the Democrats and appealing to moderate and conservative voters. It's not going to be a \"big tent\" party but one independent and ambitious people can identify with.", 
        "reply": " They won't have to move very much closer to center to do it, either, if the Dems keep tracking further left. I'm thinking a nice, fat \"far left\" issue will get passed such as a new gun ban that will once again drive the \"middle third\" of the electorate back to the GOP as happened in 94. These things always come full circle. Dems and Repubs can't help it...they are programmed to take their majority and try to push the country further left or right than it really wants to go.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 07:14:00", 
        "title": "Right returning to its birthplace", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: There's a term for what you're doing here. It's called gilding a turd. Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand. Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots.", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "Originally posted by ACR26: quote: There's a term for what you're doing here. It's called gilding a turd. Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand.", 
        "reply": " Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 07:25:00", 
        "title": "Right returning to its birthplace", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by ACR26: quote: There's a term for what you're doing here. It's called gilding a turd. Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand. Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots. The present-day Democratic Party was founded by Thomas Jefferson and James Madison (not by John Kennedy) to oppose the Federalists of Alexander Hamilton. The Federalists believed in \"government of wealthy White men, by wealthy White men and for wealthy White men\" as did their successors the Whigs, the Know-Nothings and the present-day Republicans.", 
        "intTime": 20090430, 
        "postID": 13, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by ACR26: quote: There's a term for what you're doing here. It's called gilding a turd. Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand. Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots.", 
        "reply": " The present-day Democratic Party was founded by Thomas Jefferson and James Madison (not by John Kennedy) to oppose the Federalists of Alexander Hamilton. The Federalists believed in \"government of wealthy White men, by wealthy White men and for wealthy White men\" as did their successors the Whigs, the Know-Nothings and the present-day Republicans.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 08:07:00", 
        "title": "Right returning to its birthplace", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by ACR26: It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists. Actually I don't believe the Republican Party is moving more and more to the Fiscal Responsibility and Personal Freedom from Burdensome Government. Their ACTIONS say they are actually moving towards control by the Religous and Social extremes (who control most local party orgs) who want MORE Government control and MORE spending on their issues. IMO the party platforms are mostly propaganda what is important are the ACTIONS of the party and the way the parties react to events.", 
        "intTime": 20090430, 
        "postID": 14, 
        "quote": "Originally posted by ACR26: It has been recently stated that the Republican Party is moving more and more to the right (Conservative Beliefs =Fiscal Responsibility + Personal Freedom from Burdensome Government). In my understanding, that means we are struggling to get back to the partys’ Founding Fathers intent for this country. Meanwhile at full speed ahead the Democrat Party is moving away from their birthplace and are morphing into Progressivism and Socialism (Stated By Hillary and the actions of this administration/congress). At first it was denial, now it is becoming a banner. So that has to mean Republicans vs Progressive Socialists.", 
        "reply": " Actually I don't believe the Republican Party is moving more and more to the Fiscal Responsibility and Personal Freedom from Burdensome Government. Their ACTIONS say they are actually moving towards control by the Religous and Social extremes (who control most local party orgs) who want MORE Government control and MORE spending on their issues. IMO the party platforms are mostly propaganda what is important are the ACTIONS of the party and the way the parties react to events.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 08:40:00", 
        "title": "Right returning to its birthplace", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Actually I don't believe the Republican Party is moving more and more to the Fiscal Responsibility and Personal Freedom from Burdensome Government. Their ACTIONS say they are actually moving towards control by the Religous and Social extremes (who control most local party orgs) who want MORE Government control and MORE spending on their issues. IMO the party platforms are mostly propaganda what is important are the ACTIONS of the party and the way the parties react to events. Absolutly agree which is why when Little miss McCain speaks I shudder. She does not speak for me, nor the ideals I hold no more than code pink speaks for the left", 
        "intTime": 20090430, 
        "postID": 15, 
        "quote": "Actually I don't believe the Republican Party is moving more and more to the Fiscal Responsibility and Personal Freedom from Burdensome Government. Their ACTIONS say they are actually moving towards control by the Religous and Social extremes (who control most local party orgs) who want MORE Government control and MORE spending on their issues. IMO the party platforms are mostly propaganda what is important are the ACTIONS of the party and the way the parties react to events.", 
        "reply": " Absolutly agree which is why when Little miss McCain speaks I shudder. She does not speak for me, nor the ideals I hold no more than code pink speaks for the left", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 09:05:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots. Progressive roots from the 1940's or progressive roots from 1776? Which do you mean? Is there even a progressive roots movement from 1776? You lambaste me for mentioning Kennedy who is constantly held up as the model democrat by democrats and I use it as a point and you laugh. Which means you are laughing at yourself I guess.", 
        "intTime": 20090430, 
        "postID": 16, 
        "quote": "Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots.", 
        "reply": " Progressive roots from the 1940's or progressive roots from 1776? Which do you mean? Is there even a progressive roots movement from 1776? You lambaste me for mentioning Kennedy who is constantly held up as the model democrat by democrats and I use it as a point and you laugh. Which means you are laughing at yourself I guess.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 09:08:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: What is necessary in todays world for happiness is that one NOT think!! In fact thinking is deemed dangerous now by the dept of Homeland security!! So! Don't do it! Simply take from the government that which they see fit to give you from what you have earned....oh...wait a minute.... you didn't earn enough to be taxed???? WELL THEN!! Step right up, file for the \"Earned income credit, the child tax credit and!! The EXTRA child income tax credit and collect your $4,780.00 average gift from Barry DA MAN Obama!! You don't want to do that..it's stealing from those who earned it?? Don't be prosaic and reactionary, what's the matter with you!!?? This is America!! You have a right to what somebody else has earned!! You just don't have the right to what YOU have earned!! Do we understand each other now?? That's good, now if you've got it, give it UP!! If you don't..... well then here's what we stole from that poor slob of a capitolist over there!! Yeah we know he just works in a hardware store but he made enough to pay taxes!! The filthy B***tard!!! When you read what you write it is funny. When you notice that it is EXACTLY what is going on around you..is F-ing scary.", 
        "intTime": 20090430, 
        "postID": 17, 
        "quote": "What is necessary in todays world for happiness is that one NOT think!! In fact thinking is deemed dangerous now by the dept of Homeland security!! So! Don't do it! Simply take from the government that which they see fit to give you from what you have earned....oh...wait a minute.... you didn't earn enough to be taxed???? WELL THEN!! Step right up, file for the \"Earned income credit, the child tax credit and!! The EXTRA child income tax credit and collect your $4,780.00 average gift from Barry DA MAN Obama!! You don't want to do that..it's stealing from those who earned it?? Don't be prosaic and reactionary, what's the matter with you!!?? This is America!! You have a right to what somebody else has earned!! You just don't have the right to what YOU have earned!! Do we understand each other now?? That's good, now if you've got it, give it UP!! If you don't..... well then here's what we stole from that poor slob of a capitolist over there!! Yeah we know he just works in a hardware store but he made enough to pay taxes!! The filthy B***tard!!!", 
        "reply": " When you read what you write it is funny. When you notice that it is EXACTLY what is going on around you..is F-ing scary.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 09:09:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: They won't have to move very much closer to center to do it, either, if the Dems keep tracking further left. I'm thinking a nice, fat \"far left\" issue will get passed such as a new gun ban that will once again drive the \"middle third\" of the electorate back to the GOP as happened in 94. These things always come full circle. Dems and Repubs can't help it...they are programmed to take their majority and try to push the country further left or right than it really wants to go. So we have the pendulum effect...the farther we go back and forth the more chaotic it will become. My issue is that when the country “swings right” I feel it is getting back to the basics. Today on swinging left…we are NOT getting back to the basics. I do not call John McCain a “swinging right movement” however. Respect the heck out of him but he is not to be confused with a conservative.", 
        "intTime": 20090430, 
        "postID": 18, 
        "quote": "They won't have to move very much closer to center to do it, either, if the Dems keep tracking further left. I'm thinking a nice, fat \"far left\" issue will get passed such as a new gun ban that will once again drive the \"middle third\" of the electorate back to the GOP as happened in 94. These things always come full circle. Dems and Repubs can't help it...they are programmed to take their majority and try to push the country further left or right than it really wants to go.", 
        "reply": " So we have the pendulum effect...the farther we go back and forth the more chaotic it will become. My issue is that when the country “swings right” I feel it is getting back to the basics. Today on swinging left…we are NOT getting back to the basics. I do not call John McCain a “swinging right movement” however. Respect the heck out of him but he is not to be confused with a conservative.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 09:16:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: The Republican party leaders realize they have lost the support of the 18 to 34 demographic. Now they must find a Republican identy and philosophy different from the Democrats and appealing to moderate and conservative voters. It's not going to be a \"big tent\" party but one independent and ambitious people can identify with. I think they have lost the support of the city folk. When you look at Governmental elections the blue are large cities in general. This means the country/non-large cities are soon to be under represented.", 
        "intTime": 20090430, 
        "postID": 19, 
        "quote": "The Republican party leaders realize they have lost the support of the 18 to 34 demographic. Now they must find a Republican identy and philosophy different from the Democrats and appealing to moderate and conservative voters. It's not going to be a \"big tent\" party but one independent and ambitious people can identify with.", 
        "reply": " I think they have lost the support of the city folk. When you look at Governmental elections the blue are large cities in general. This means the country/non-large cities are soon to be under represented.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 09:20:00", 
        "title": "Right returning to its birthplace", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by FrJohn1123: quote: Originally posted by ACR26: quote: There's a term for what you're doing here. It's called gilding a turd. Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand. Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots. The present-day Democratic Party was founded by Thomas Jefferson and James Madison (not by John Kennedy) to oppose the Federalists of Alexander Hamilton. The Federalists believed in \"government of wealthy White men, by wealthy White men and for wealthy White men\" as did their successors the Whigs, the Know-Nothings and the present-day Republicans. Pretty much spot-on until the late 70's and 80's, when the Democrats went from \"social justice\" to \"socialism\" and the GOP had to take up the torch of religeous freedom, family values and small government. It's kind of ironic...the Democratic party is founded by a slave-owning super-wealthy state's rights champion, and the GOP has it's roots with the \"all powerful central government\" crowd, and in a mere 200 years they pretty much completely switched. FYI, if group can be called the \"rich white man's club\", I think the Democratic party from it's founding until the present day DEFINITLY qualifies. So, in my book, have no fear...in 200 years, the Dems will once again be led by slave-owning super-rich white men, and the GOP will be the \"I don't care who you are as long as you want absolute power consolidated in Washington\" club.", 
        "intTime": 20090430, 
        "postID": 20, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by FrJohn1123: quote: Originally posted by ACR26: quote: There's a term for what you're doing here. It's called gilding a turd. Not trying to do anything. Specter leaves because the Republican Party is moving more to the right. What does that mean exactly? The Dems of today are NOT LIKE Pres Kennedy. What does that mean? The Queen herself says she is a Progressive. Thinking is not everybody’s strong suit I understand. Kennedy founded the democratic party? Now that is funny. Fact is the democratic party has been all over the map. Oh and they in fact have progressive roots. The present-day Democratic Party was founded by Thomas Jefferson and James Madison (not by John Kennedy) to oppose the Federalists of Alexander Hamilton. The Federalists believed in \"government of wealthy White men, by wealthy White men and for wealthy White men\" as did their successors the Whigs, the Know-Nothings and the present-day Republicans.", 
        "reply": " Pretty much spot-on until the late 70's and 80's, when the Democrats went from \"social justice\" to \"socialism\" and the GOP had to take up the torch of religeous freedom, family values and small government. It's kind of ironic...the Democratic party is founded by a slave-owning super-wealthy state's rights champion, and the GOP has it's roots with the \"all powerful central government\" crowd, and in a mere 200 years they pretty much completely switched. FYI, if group can be called the \"rich white man's club\", I think the Democratic party from it's founding until the present day DEFINITLY qualifies. So, in my book, have no fear...in 200 years, the Dems will once again be led by slave-owning super-rich white men, and the GOP will be the \"I don't care who you are as long as you want absolute power consolidated in Washington\" club.", 
        "threadID": "409192893_8050021222001", 
        "time": "2009-04-30 11:01:00", 
        "title": "Right returning to its birthplace", 
        "userID": "jwr6"
    }
]