[
    {
        "content": "Mahmoud Ahmadinejad will pontificate, will lead Obama on and on and on, will cease all talks, will balk, will agree to agree, will negotiate. will do the state department two step, hillary will be encouraged that he talks, will give glowing reports all this will go on and on and on Iran will continue the quest for nukes in about 24 months Mahmoud Ahmadinejad will have what he wants and a test will happen... checkmate for the weak obama", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "Mahmoud Ahmadinejad will pontificate, will lead Obama on and on and on, will cease all talks, will balk, will agree to agree, will negotiate. will do the state department two step, hillary will be encouraged that he talks, will give glowing reports all this will go on and on and on Iran will continue the quest for nukes in about 24 months Mahmoud Ahmadinejad will have what he wants and a test will happen... checkmate for the weak obama", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 05:15:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: ... in about 24 months Mahmoud Ahmadinejad will have what he wants and a test will happen... LOL In about two months he'll most likely no longer even be President of Iran. I recommend getting to know this guy: http://en.wikipedia.org/wiki/Mir-Hossein_Mousavi And, talking of a chess game, a friendlier attitude from the West will assure the reformists get the presidency. (Not sure I agree with the precondition thing though.)", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "... in about 24 months Mahmoud Ahmadinejad will have what he wants and a test will happen...", 
        "reply": " LOL In about two months he'll most likely no longer even be President of Iran. I recommend getting to know this guy: http://en.wikipedia.org/wiki/Mir-Hossein_Mousavi And, talking of a chess game, a friendlier attitude from the West will assure the reformists get the presidency. (Not sure I agree with the precondition thing though.)", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 05:43:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "Who are the Iatola's backing? That's who will be President of Iraq. So far, I see no withdrawl of support for Ach....etcetc.", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "Who are the Iatola's backing? That's who will be President of Iraq. So far, I see no withdrawl of support for Ach....etcetc.", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 15:59:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: ... in about 24 months Mahmoud Ahmadinejad will have what he wants and a test will happen... LOL In about two months he'll most likely no longer even be President of Iran. I recommend getting to know this guy: http://en.wikipedia.org/wiki/Mir-Hossein_Mousavi And, talking of a chess game, a friendlier attitude from the West will assure the reformists get the presidency. (Not sure I agree with the precondition thing though.) Has the Guardian Council finally tired of Afterdinnermint's posturing then do you think? There had been signs of it (he's been slapped down a couple of times) but I thought they were going to give him another crack at it, albeit with a reduced majority. That said it could be that without the Bush administration to kick against it might be that they're worried about an America that can't be portrayed as overtly threatening. Obama's invitation to talk might have spiked one of their main weapons.", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: ... in about 24 months Mahmoud Ahmadinejad will have what he wants and a test will happen... LOL In about two months he'll most likely no longer even be President of Iran. I recommend getting to know this guy: http://en.wikipedia.org/wiki/Mir-Hossein_Mousavi And, talking of a chess game, a friendlier attitude from the West will assure the reformists get the presidency. (Not sure I agree with the precondition thing though.)", 
        "reply": " Has the Guardian Council finally tired of Afterdinnermint's posturing then do you think? There had been signs of it (he's been slapped down a couple of times) but I thought they were going to give him another crack at it, albeit with a reduced majority. That said it could be that without the Bush administration to kick against it might be that they're worried about an America that can't be portrayed as overtly threatening. Obama's invitation to talk might have spiked one of their main weapons.", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 16:16:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "1. According to the Iranian Constitution, their Supreme Leader - Ali Hoseyni Khamenei is their highest leader in charge of the country. Their President (Ahmadinejad) is more like an elected VP or Secretary of State (like Hillary Clinton). He doesn't have any control over the armed forces or nuclear policy. 2. Ahmadinejad is up for reelection on 12 June 2009. According to the Iranian press, he has a slight lead in the polls. The Iranians are not all that happy with him. If Obama plays his cards right(and especially avoids confrontation), he could push him over the edge. I'm sure they are working on some strategy for his meetings.", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "", 
        "reply": "1. According to the Iranian Constitution, their Supreme Leader - Ali Hoseyni Khamenei is their highest leader in charge of the country. Their President (Ahmadinejad) is more like an elected VP or Secretary of State (like Hillary Clinton). He doesn't have any control over the armed forces or nuclear policy. 2. Ahmadinejad is up for reelection on 12 June 2009. According to the Iranian press, he has a slight lead in the polls. The Iranians are not all that happy with him. If Obama plays his cards right(and especially avoids confrontation), he could push him over the edge. I'm sure they are working on some strategy for his meetings.", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 17:23:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "ColdWarGranny"
    }, 
    {
        "content": "Chess? Iran has already out plyed the U.S. Iran is playing chess. We are playing checkers.", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "", 
        "reply": "Chess? Iran has already out plyed the U.S. Iran is playing chess. We are playing checkers.", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 17:35:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "threerings"
    }, 
    {
        "content": "GD it Threerings! You beat me to it. Not as effective but... Chess? More like go fish. You have any threes? Nope go fish. You have any Kings? Nope Go fish Do you have any weapons grade plutonium? Ummm. Nope go fish?", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "", 
        "reply": "GD it Threerings! You beat me to it. Not as effective but... Chess? More like go fish. You have any threes? Nope go fish. You have any Kings? Nope Go fish Do you have any weapons grade plutonium? Ummm. Nope go fish?", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 18:06:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "ACR26"
    }, 
    {
        "content": "obama would have a better chance getting a tree stump to recite hamlet then getting iran to do this....", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "", 
        "reply": "obama would have a better chance getting a tree stump to recite hamlet then getting iran to do this....", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 18:08:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "outlaws93"
    }, 
    {
        "content": "On this topic Let us say Iran is making a nuclear bomb. Will we do anything about? I look at Iraq (taking out the crap if Pres Bush \"lied\"( which I do not believe so)) and the threat was real and a lot of countries said the same. Yet the fresh stuff was not found. Now concerning Iran and this admin...they would be stupid to not go for a bomb IMO. From a global perspective it is better to go in and prevent Iran from getting a bomb now. But I do not think we will and I do not think Iran will immediately use their bomb until they have more than one. That is when I would really begin to worry (more than I am now about Israel) so…what political game can have an impact?", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "On this topic Let us say Iran is making a nuclear bomb. Will we do anything about? I look at Iraq (taking out the crap if Pres Bush \"lied\"( which I do not believe so)) and the threat was real and a lot of countries said the same. Yet the fresh stuff was not found. Now concerning Iran and this admin...they would be stupid to not go for a bomb IMO. From a global perspective it is better to go in and prevent Iran from getting a bomb now. But I do not think we will and I do not think Iran will immediately use their bomb until they have more than one. That is when I would really begin to worry (more than I am now about Israel) so…what political game can have an impact?", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 18:18:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: obama would have a better chance getting a tree stump to recite hamlet then getting iran to do this.... Too late. I think Keanu Reeves has already played the doubtful Dane.", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "Originally posted by outlaws93: obama would have a better chance getting a tree stump to recite hamlet then getting iran to do this....", 
        "reply": " Too late. I think Keanu Reeves has already played the doubtful Dane.", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 18:22:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "so what happens when two people or two countries play chess with only one opponent? Nk part of the mix now shall we hear from Hillary about stern consequences??? what will she do slap the little guy with a post menopause sanitary napkin no substance but it smells??? at this point neither have the capability to strike very far, and maybe someone will knock the little Hennesy drinker and former US embassy terrorist out", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "", 
        "reply": "so what happens when two people or two countries play chess with only one opponent? Nk part of the mix now shall we hear from Hillary about stern consequences??? what will she do slap the little guy with a post menopause sanitary napkin no substance but it smells??? at this point neither have the capability to strike very far, and maybe someone will knock the little Hennesy drinker and former US embassy terrorist out", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 19:51:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Ira, I appreciate the humor but I gotta go puke now...thanks", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "", 
        "reply": "Ira, I appreciate the humor but I gotta go puke now...thanks", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-16 19:53:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Has the Guardian Council finally tired of Afterdinnermint's posturing then do you think? There had been signs of it (he's been slapped down a couple of times) but I thought they were going to give him another crack at it, albeit with a reduced majority. Frankly, I think their main concern is to hold elections that make them look good. That is to say, they cannot overtly interfere after they've accepted the candidates. (They can always block the new president's actions afterwards, when there's not so many eyes on them.) I think it comes down to whether the reformists can unite behind one candidate, and whether the reformist candidate can appeal to moderate conservatists. Also, Khatami stepping down made it a lot more difficult for the principlists to unite against the reformist candidate, while giving Mousavi a lot more votes. Just this week there were reports of the major reformist organizations expressing support for Mousavi, and that he may also get principlist votes. Of course, Khamenei might decide to \"pull rank\" late in the election and get the Revolutionary Guards and Basij to vote his way. As of now, he has explicitly stated that even though he agrees with current government actions, it shouldn't be seen as an endorsement for re-election. quote: That said it could be that without the Bush administration to kick against it might be that they're worried about an America that can't be portrayed as overtly threatening. Obama's invitation to talk might have spiked one of their main weapons. They can still use Israel as an outside threath to unite the voters behind the current president. Conveniently, the more Ahmadinejad releases reports of advances in nuclear technology, the more threats there will be from Israel.", 
        "intTime": 20090417, 
        "postID": 13, 
        "quote": "Has the Guardian Council finally tired of Afterdinnermint's posturing then do you think? There had been signs of it (he's been slapped down a couple of times) but I thought they were going to give him another crack at it, albeit with a reduced majority.", 
        "reply": " Frankly, I think their main concern is to hold elections that make them look good. That is to say, they cannot overtly interfere after they've accepted the candidates. (They can always block the new president's actions afterwards, when there's not so many eyes on them.) I think it comes down to whether the reformists can unite behind one candidate, and whether the reformist candidate can appeal to moderate conservatists. Also, Khatami stepping down made it a lot more difficult for the principlists to unite against the reformist candidate, while giving Mousavi a lot more votes. Just this week there were reports of the major reformist organizations expressing support for Mousavi, and that he may also get principlist votes. Of course, Khamenei might decide to \"pull rank\" late in the election and get the Revolutionary Guards and Basij to vote his way. As of now, he has explicitly stated that even though he agrees with current government actions, it shouldn't be seen as an endorsement for re-election. quote: That said it could be that without the Bush administration to kick against it might be that they're worried about an America that can't be portrayed as overtly threatening. Obama's invitation to talk might have spiked one of their main weapons. They can still use Israel as an outside threath to unite the voters behind the current president. Conveniently, the more Ahmadinejad releases reports of advances in nuclear technology, the more threats there will be from Israel.", 
        "threadID": "409192893_3340098022001", 
        "time": "2009-04-17 10:00:00", 
        "title": "the chess game Obama versus Mahmoud Ahmadinejad might begin", 
        "userID": "2nd_freedomfighter"
    }
]