[
    {
        "content": "\"http://www.youtube.com/watch?v=xIHz5tevLAw\" President Bush greeting versus President Obama greeting,,,,,,,,,,,, by US Marines", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.youtube.com/watch?v=xIHz5tevLAw\" President Bush greeting versus President Obama greeting,,,,,,,,,,,, by US Marines", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 05:10:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Sure looks like two different venues which changes the \"atmosphere\" quite a bit...", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "Sure looks like two different venues which changes the \"atmosphere\" quite a bit...", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 05:21:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "That video was posted on youtube by an outfit called realrevo. They are an intensely partisan, anti-Obama organization which you can see for yourself at their website: 'www.realrevo.com' Note that there is no indication regarding who they are or who owns the site. A domain name search reveals that they spread their hate via a proxy server in Scottsdale, AZ and hide the names of anyone associated with it. Interestingly, this isn't the first hate Obama website I've found which uses the same proxy server in Scottsdale. Don't believe me just because I said it. Do a domain-name search for yourself at 'www.godaddy.com' Obviously, this group has an agenda wouldn't you say? Here's another thing about that video: Note that when G.W. Bush is introduced, the troops are in the position of \"at ease,\" but when Obama enters, they are at the position of \"attention.\" Anyone who knows anything about drill and ceremony knows that applause is not allowed from attention, but it is from at ease.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "That video was posted on youtube by an outfit called realrevo. They are an intensely partisan, anti-Obama organization which you can see for yourself at their website: 'www.realrevo.com' Note that there is no indication regarding who they are or who owns the site. A domain name search reveals that they spread their hate via a proxy server in Scottsdale, AZ and hide the names of anyone associated with it. Interestingly, this isn't the first hate Obama website I've found which uses the same proxy server in Scottsdale. Don't believe me just because I said it. Do a domain-name search for yourself at 'www.godaddy.com' Obviously, this group has an agenda wouldn't you say? Here's another thing about that video: Note that when G.W. Bush is introduced, the troops are in the position of \"at ease,\" but when Obama enters, they are at the position of \"attention.\" Anyone who knows anything about drill and ceremony knows that applause is not allowed from attention, but it is from at ease.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 05:34:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "stillkit"
    }, 
    {
        "content": "One can interpret this any way they like. How about this one: Seeing how Bush was in Anbar, it was basically an \"unannounced\" visit, as he never went to Iraq any other way. How much formal preparation would/could be made without divluging his whereabouts? Also, that visit was in 2007, when public opinion on both the President and our involvement in Iraq were at a low point. I don't think they'd have wanted him to walk into a room full of Marines and not receive anything less than a rousing welcome. Cut to the present tense, with Obama's first (I believe) formal encounter with a group of GIs. It was all done by the numbers, as it should have been. This is how GIs at a mass briefing usually greet a commander in a formal setting, especially a new one.", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "", 
        "reply": "One can interpret this any way they like. How about this one: Seeing how Bush was in Anbar, it was basically an \"unannounced\" visit, as he never went to Iraq any other way. How much formal preparation would/could be made without divluging his whereabouts? Also, that visit was in 2007, when public opinion on both the President and our involvement in Iraq were at a low point. I don't think they'd have wanted him to walk into a room full of Marines and not receive anything less than a rousing welcome. Cut to the present tense, with Obama's first (I believe) formal encounter with a group of GIs. It was all done by the numbers, as it should have been. This is how GIs at a mass briefing usually greet a commander in a formal setting, especially a new one.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 07:55:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=xIHz5tevLAw Another dumb ass thread.", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "http://www.youtube.com/watch?v=xIHz5tevLAw", 
        "reply": " Another dumb ass thread.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 08:03:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "I was at Al Faw palace on Victory for President Bush's last visit to Iraq. The video there with President Bush looks a lot like the reception he received from us a few months ago. When I saw the President the 4 ID band was there before the President playing rock and country. There were speakers set up playing music for the several hours before the President arrived. When the President left and was shaking hands with the Soldiers music was blasting. It was a party atmosphere. President Obama's visit was a more formal policy announcement. The Marines were at attention when he walked in so of course they didn't applaud. It was a different venue with a very different purpose. President Bush's purpose was to visit the troops and say thanks. President Obama was making the announcement of US troop withdrawals in Iraq. If President Obama makes a trip to Iraq to visit the troops he would receive the same kind of reception President Bush did.", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "", 
        "reply": "I was at Al Faw palace on Victory for President Bush's last visit to Iraq. The video there with President Bush looks a lot like the reception he received from us a few months ago. When I saw the President the 4 ID band was there before the President playing rock and country. There were speakers set up playing music for the several hours before the President arrived. When the President left and was shaking hands with the Soldiers music was blasting. It was a party atmosphere. President Obama's visit was a more formal policy announcement. The Marines were at attention when he walked in so of course they didn't applaud. It was a different venue with a very different purpose. President Bush's purpose was to visit the troops and say thanks. President Obama was making the announcement of US troop withdrawals in Iraq. If President Obama makes a trip to Iraq to visit the troops he would receive the same kind of reception President Bush did.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 08:17:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: ...this isn't the first hate Obama website I've found which uses the same proxy server in Scottsdale.", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "...this isn't the first hate Obama website I've found which uses the same proxy server in Scottsdale.", 
        "reply": "", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 08:28:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: http://www.youtube.com/watch?v=xIHz5tevLAw Another dumb ass thread. guess it takes a dumb ass to read it??", 
        "intTime": 20090310, 
        "postID": 8, 
        "quote": "Originally posted by FrJohn1123: quote: http://www.youtube.com/watch?v=xIHz5tevLAw Another dumb ass thread.", 
        "reply": " guess it takes a dumb ass to read it??", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 09:51:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "Ira1945"
    }, 
    {
        "content": "This reminds me of the \"Marines don't salute President Clinton\" postings. I suppose if you like BS then eat it up. Yum... Yum...", 
        "intTime": 20090310, 
        "postID": 9, 
        "quote": "", 
        "reply": "This reminds me of the \"Marines don't salute President Clinton\" postings. I suppose if you like BS then eat it up. Yum... Yum...", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 10:30:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Wow, first people whine because Obama was too friendly and shook the hand of the Marine guard who saluted him, and now you're complaining because the troops who were standing AT ATTENTION didn't break formation during a formal briefing to applaud. First Obama is too casual and doesn't follow military protocol, so you complain. Then he's too formal when conducting a formal briefing, so you complain. Some people want it all, so they can hate it all. Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah. Complain about policies all you want. Agree or disagree. Argue and debate. But to whine about this... is WEAK.", 
        "intTime": 20090310, 
        "postID": 10, 
        "quote": "", 
        "reply": "Wow, first people whine because Obama was too friendly and shook the hand of the Marine guard who saluted him, and now you're complaining because the troops who were standing AT ATTENTION didn't break formation during a formal briefing to applaud. First Obama is too casual and doesn't follow military protocol, so you complain. Then he's too formal when conducting a formal briefing, so you complain. Some people want it all, so they can hate it all. Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah. Complain about policies all you want. Agree or disagree. Argue and debate. But to whine about this... is WEAK.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 11:17:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Damn Whirled_Peas don't make me agree with you.", 
        "intTime": 20090310, 
        "postID": 11, 
        "quote": "", 
        "reply": "Damn Whirled_Peas don't make me agree with you.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 12:18:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: Wow, first people whine because Obama was too friendly and shook the hand of the Marine guard who saluted him, and now you're complaining because the troops who were standing AT ATTENTION didn't break formation during a formal briefing to applaud. First Obama is too casual and doesn't follow military protocol, so you complain. Then he's too formal when conducting a formal briefing, so you complain. Some people want it all, so they can hate it all. Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah. Complain about policies all you want. Agree or disagree. Argue and debate. But to whine about this... is WEAK. This is what happens when there's inconsistency in rule enforcement.", 
        "intTime": 20090310, 
        "postID": 12, 
        "quote": "Originally posted by Whirled_Peas: Wow, first people whine because Obama was too friendly and shook the hand of the Marine guard who saluted him, and now you're complaining because the troops who were standing AT ATTENTION didn't break formation during a formal briefing to applaud. First Obama is too casual and doesn't follow military protocol, so you complain. Then he's too formal when conducting a formal briefing, so you complain. Some people want it all, so they can hate it all. Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah. Complain about policies all you want. Agree or disagree. Argue and debate. But to whine about this... is WEAK.", 
        "reply": " This is what happens when there's inconsistency in rule enforcement.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 13:02:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by FrJohn1123: quote: http://www.youtube.com/watch?v=xIHz5tevLAw Another dumb ass thread. guess it takes a dumb ass to read it?? Not really, but next time title the thread: \"Just another dumb ass thread\" and I will surely not look. Actually check that, I'll just look for your name. How is that?", 
        "intTime": 20090310, 
        "postID": 13, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by FrJohn1123: quote: http://www.youtube.com/watch?v=xIHz5tevLAw Another dumb ass thread. guess it takes a dumb ass to read it??", 
        "reply": " Not really, but next time title the thread: \"Just another dumb ass thread\" and I will surely not look. Actually check that, I'll just look for your name. How is that?", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 13:13:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: I was at Al Faw palace on Victory for President Bush's last visit to Iraq. The video there with President Bush looks a lot like the reception he received from us a few months ago. When I saw the President the 4 ID band was there before the President playing rock and country. There were speakers set up playing music for the several hours before the President arrived. When the President left and was shaking hands with the Soldiers music was blasting. It was a party atmosphere. President Obama's visit was a more formal policy announcement. The Marines were at attention when he walked in so of course they didn't applaud. It was a different venue with a very different purpose. President Bush's purpose was to visit the troops and say thanks. President Obama was making the announcement of US troop withdrawals in Iraq. If President Obama makes a trip to Iraq to visit the troops he would receive the same kind of reception President Bush did. Seems pretty simple doesn't it?", 
        "intTime": 20090310, 
        "postID": 14, 
        "quote": "Originally posted by nspreitler: I was at Al Faw palace on Victory for President Bush's last visit to Iraq. The video there with President Bush looks a lot like the reception he received from us a few months ago. When I saw the President the 4 ID band was there before the President playing rock and country. There were speakers set up playing music for the several hours before the President arrived. When the President left and was shaking hands with the Soldiers music was blasting. It was a party atmosphere. President Obama's visit was a more formal policy announcement. The Marines were at attention when he walked in so of course they didn't applaud. It was a different venue with a very different purpose. President Bush's purpose was to visit the troops and say thanks. President Obama was making the announcement of US troop withdrawals in Iraq. If President Obama makes a trip to Iraq to visit the troops he would receive the same kind of reception President Bush did.", 
        "reply": " Seems pretty simple doesn't it?", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 13:20:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by Ira1945: quote: Originally posted by FrJohn1123: quote: http://www.youtube.com/watch?v=xIHz5tevLAw Another dumb ass thread. guess it takes a dumb ass to read it?? Not really, but next time title the thread: \"Just another dumb ass thread\" and I will surely not look. Actually check that, I'll just look for your name. How is that? whatever floats your boat bub", 
        "intTime": 20090310, 
        "postID": 15, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by Ira1945: quote: Originally posted by FrJohn1123: quote: http://www.youtube.com/watch?v=xIHz5tevLAw Another dumb ass thread. guess it takes a dumb ass to read it?? Not really, but next time title the thread: \"Just another dumb ass thread\" and I will surely not look. Actually check that, I'll just look for your name. How is that?", 
        "reply": " whatever floats your boat bub", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 15:23:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Reminds of what the sailors thought on the USS Lincoln when bush pulled his stunt...NOT CIC friendly", 
        "intTime": 20090310, 
        "postID": 16, 
        "quote": "", 
        "reply": "Reminds of what the sailors thought on the USS Lincoln when bush pulled his stunt...NOT CIC friendly", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-03-10 17:21:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "scottrj50"
    }, 
    {
        "content": "What a difference a venue makes... Obama Pays Surprise Visit to Troops in Iraq April 07, 2009 Associated Press BAGHDAD - Cheered wildly by U.S. troops, President Barack Obama flew unannounced into Iraq on Tuesday and promptly declared it was time for Iraqis to \"take responsibility for their country\" after America's commitment of six years and thousands of lives. \"You have given Iraq the opportunity to stand on its own as a democratic country,\" the president said as he made a brief inspection of a war he opposed as candidate and now vows to end as commander in chief. \"That is an extraordinary achievement.\"", 
        "intTime": 20090408, 
        "postID": 17, 
        "quote": "", 
        "reply": "What a difference a venue makes... Obama Pays Surprise Visit to Troops in Iraq April 07, 2009 Associated Press BAGHDAD - Cheered wildly by U.S. troops, President Barack Obama flew unannounced into Iraq on Tuesday and promptly declared it was time for Iraqis to \"take responsibility for their country\" after America's commitment of six years and thousands of lives. \"You have given Iraq the opportunity to stand on its own as a democratic country,\" the president said as he made a brief inspection of a war he opposed as candidate and now vows to end as commander in chief. \"That is an extraordinary achievement.\"", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-08 05:05:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: This reminds me of the \"Marines don't salute President Clinton\" postings. I suppose if you like BS then eat it up. Yum... Yum... ---http://www.youtube.com/watch?v=cTpUVAcvWfU&feature=related", 
        "intTime": 20090408, 
        "postID": 18, 
        "quote": "Originally posted by bill_kananen: This reminds me of the \"Marines don't salute President Clinton\" postings. I suppose if you like BS then eat it up. Yum... Yum...", 
        "reply": " ---http://www.youtube.com/watch?v=cTpUVAcvWfU&feature=related", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-08 07:49:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by stillkit: That video was posted on youtube by an outfit called realrevo. They are an intensely partisan, anti-Obama organization which you can see for yourself at their website: 'www.realrevo.com' Note that there is no indication regarding who they are or who owns the site. A domain name search reveals that they spread their hate via a proxy server in Scottsdale, AZ and hide the names of anyone associated with it. Interestingly, this isn't the first hate Obama website I've found which uses the same proxy server in Scottsdale. Don't believe me just because I said it. Do a domain-name search for yourself at 'www.godaddy.com' Obviously, this group has an agenda wouldn't you say? Here's another thing about that video: Note that when G.W. Bush is introduced, the troops are in the position of \"at ease,\" but when Obama enters, they are at the position of \"attention.\" Anyone who knows anything about drill and ceremony knows that applause is not allowed from attention, but it is from at ease. Thanks for keeping reality current with the hate-wacko websites CPT........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090409, 
        "postID": 19, 
        "quote": "Originally posted by stillkit: That video was posted on youtube by an outfit called realrevo. They are an intensely partisan, anti-Obama organization which you can see for yourself at their website: 'www.realrevo.com' Note that there is no indication regarding who they are or who owns the site. A domain name search reveals that they spread their hate via a proxy server in Scottsdale, AZ and hide the names of anyone associated with it. Interestingly, this isn't the first hate Obama website I've found which uses the same proxy server in Scottsdale. Don't believe me just because I said it. Do a domain-name search for yourself at 'www.godaddy.com' Obviously, this group has an agenda wouldn't you say? Here's another thing about that video: Note that when G.W. Bush is introduced, the troops are in the position of \"at ease,\" but when Obama enters, they are at the position of \"attention.\" Anyone who knows anything about drill and ceremony knows that applause is not allowed from attention, but it is from at ease.", 
        "reply": " Thanks for keeping reality current with the hate-wacko websites CPT........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-09 12:20:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "ProgMod"
    }, 
    {
        "content": "As most of the Obama supporters know, I don't support most of the Presidents policies. That said, anyone that has been in the military can see this was a different venue all together. You an see this is more of an OFFICIAL visit, therefore you won't see the party like atmosphere you would have seen as former president Bush's last visit. Come on guys, there are plenty of Obama's policies out there, like he so called illegal immigration reform bill, that you can comment on. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090409, 
        "postID": 20, 
        "quote": "", 
        "reply": "As most of the Obama supporters know, I don't support most of the Presidents policies. That said, anyone that has been in the military can see this was a different venue all together. You an see this is more of an OFFICIAL visit, therefore you won't see the party like atmosphere you would have seen as former president Bush's last visit. Come on guys, there are plenty of Obama's policies out there, like he so called illegal immigration reform bill, that you can comment on. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-09 12:36:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "L0A1"
    }, 
    {
        "content": "What a stupid stupid thread. Clearly the venues are not similar at all. Only a Foxnews type could fall for such a mindless trick. Embaressingly bad attack on the POTUS.", 
        "intTime": 20090409, 
        "postID": 21, 
        "quote": "", 
        "reply": "What a stupid stupid thread. Clearly the venues are not similar at all. Only a Foxnews type could fall for such a mindless trick. Embaressingly bad attack on the POTUS.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-09 18:31:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: What a stupid stupid thread. Clearly the venues are not similar at all. Only a Foxnews type could fall for such a mindless trick. Embaressingly bad attack on the POTUS. Great Picture!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090410, 
        "postID": 22, 
        "quote": "Originally posted by Boots_: What a stupid stupid thread. Clearly the venues are not similar at all. Only a Foxnews type could fall for such a mindless trick. Embaressingly bad attack on the POTUS.", 
        "reply": " Great Picture!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-10 07:00:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: What a difference a venue makes... Obama Pays Surprise Visit to Troops in Iraq April 07, 2009 Associated Press BAGHDAD - Cheered wildly by U.S. troops, President Barack Obama flew unannounced into Iraq on Tuesday and promptly declared it was time for Iraqis to \"take responsibility for their country\" after America's commitment of six years and thousands of lives. \"You have given Iraq the opportunity to stand on its own as a democratic country,\" the president said as he made a brief inspection of a war he opposed as candidate and now vows to end as commander in chief. \"That is an extraordinary achievement.\" Nice reality check there SeaWithc \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090410, 
        "postID": 23, 
        "quote": "Originally posted by SeaWitch1220: What a difference a venue makes... Obama Pays Surprise Visit to Troops in Iraq April 07, 2009 Associated Press BAGHDAD - Cheered wildly by U.S. troops, President Barack Obama flew unannounced into Iraq on Tuesday and promptly declared it was time for Iraqis to \"take responsibility for their country\" after America's commitment of six years and thousands of lives. \"You have given Iraq the opportunity to stand on its own as a democratic country,\" the president said as he made a brief inspection of a war he opposed as candidate and now vows to end as commander in chief. \"That is an extraordinary achievement.\"", 
        "reply": " Nice reality check there SeaWithc \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-10 08:09:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "quote: Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah. Didn't the dems write that song about 8 years ago? You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 24, 
        "quote": "Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah.", 
        "reply": " Didn't the dems write that song about 8 years ago? You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-10 09:13:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah. Didn't the dems write that song about 8 years ago? You can keep your change, I'll continue to hug my guns and religion. Actually I think it was in '92 When Sr Lost to Slick \"The Man\" Willy Electoral vote 370 168 quote: Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah.", 
        "intTime": 20090410, 
        "postID": 25, 
        "quote": "Originally posted by mnoble1066: quote: Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah. Didn't the dems write that song about 8 years ago? You can keep your change, I'll continue to hug my guns and religion.", 
        "reply": " Actually I think it was in '92 When Sr Lost to Slick \"The Man\" Willy Electoral vote 370 168 quote: Whine, whine, pout, groan, moan, complain, fuss, whine, snivel, wah wah wah.", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-10 19:22:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: why is there such a big difference in greeting and respect Could it be because greetings have little or nothing to do with actual respect ? Everyone cheers when Norm walks into the bar, but they do it because he is funny, not because they respect or admire him (well, maybe Clavin). regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090411, 
        "postID": 26, 
        "quote": "why is there such a big difference in greeting and respect", 
        "reply": " Could it be because greetings have little or nothing to do with actual respect ? Everyone cheers when Norm walks into the bar, but they do it because he is funny, not because they respect or admire him (well, maybe Clavin). regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_8450024712001", 
        "time": "2009-04-11 04:39:00", 
        "title": "why is there such a big difference in greeting and respect", 
        "userID": "JakobA_DK"
    }
]