[
    {
        "content": "passing this on to the board not necessarily for comment, (but comment if you will) but to let all know about a organization that i am proud to hold membership. I have not received a M1 in this program but my bride and i have donated M1's to this organization, and it has been very successful, some of you know the pains both physical and emotional that one goes thru when wounded, and when a young man is given one of these and you see the lights come back in their eyes it is worth every bit, this young man was injured while on combat ops in Iraq, lost vision in one eye and has steel in his skull, he was awarded the m1 in dec last year and his wife came to me crying and said that she now has a husband again and he actually wants to start doing things again and i beleive it was the M1 for vets program. just wanted to share some of this with you guys and to also say that this is not a formal dod event, nor is it a 'official sanctioned' event it is just a bunch of old farts like me that help out the youngsters, in our own little way here is some more information in case someone might want to participate regards \"\"http://www.m1forvets.com/About_M1_for_Vets.php\"", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "passing this on to the board not necessarily for comment, (but comment if you will) but to let all know about a organization that i am proud to hold membership. I have not received a M1 in this program but my bride and i have donated M1's to this organization, and it has been very successful, some of you know the pains both physical and emotional that one goes thru when wounded, and when a young man is given one of these and you see the lights come back in their eyes it is worth every bit, this young man was injured while on combat ops in Iraq, lost vision in one eye and has steel in his skull, he was awarded the m1 in dec last year and his wife came to me crying and said that she now has a husband again and he actually wants to start doing things again and i beleive it was the M1 for vets program. just wanted to share some of this with you guys and to also say that this is not a formal dod event, nor is it a 'official sanctioned' event it is just a bunch of old farts like me that help out the youngsters, in our own little way here is some more information in case someone might want to participate regards \"\"http://www.m1forvets.com/About_M1_for_Vets.php\"", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-01 17:38:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "AMEN!", 
        "intTime": 20090402, 
        "postID": 2, 
        "quote": "", 
        "reply": "AMEN!", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 02:11:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "could you explain the M1? i do not think i have EVER heard of it...or maybe i know it under a diffrent name... thanks Scott", 
        "intTime": 20090402, 
        "postID": 3, 
        "quote": "", 
        "reply": "could you explain the M1? i do not think i have EVER heard of it...or maybe i know it under a diffrent name... thanks Scott", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 09:39:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: could you explain the M1? i do not think i have EVER heard of it...or maybe i know it under a diffrent name... thanks Scott The M1 for vets program is funds that are raised that will purchase the old M1 rifles to be given to vets to participate in the National Matches. Helps them to get motivated again.", 
        "intTime": 20090402, 
        "postID": 4, 
        "quote": "Originally posted by Elesso: could you explain the M1? i do not think i have EVER heard of it...or maybe i know it under a diffrent name... thanks Scott", 
        "reply": " The M1 for vets program is funds that are raised that will purchase the old M1 rifles to be given to vets to participate in the National Matches. Helps them to get motivated again.", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 09:45:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Elesso: could you explain the M1? i do not think i have EVER heard of it...or maybe i know it under a diffrent name... thanks Scott as General Patton said, 'best damn battle rifle ever made' \"http://www.memorableplaces.com/m1garand/\"", 
        "intTime": 20090402, 
        "postID": 5, 
        "quote": "Originally posted by Elesso: could you explain the M1? i do not think i have EVER heard of it...or maybe i know it under a diffrent name... thanks Scott", 
        "reply": " as General Patton said, 'best damn battle rifle ever made' \"http://www.memorableplaces.com/m1garand/\"", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 10:19:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "shoot!! you are talking about the Garand? then to that i ask, WHAT does giving the injured troops a rifle accomplish? other than a keepsake, what does it accomplish? here i thought you were talking about a VA program... now i feel pretty stupid, now....", 
        "intTime": 20090402, 
        "postID": 6, 
        "quote": "", 
        "reply": "shoot!! you are talking about the Garand? then to that i ask, WHAT does giving the injured troops a rifle accomplish? other than a keepsake, what does it accomplish? here i thought you were talking about a VA program... now i feel pretty stupid, now....", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 11:24:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: then to that i ask, WHAT does giving the injured troops a rifle accomplish ARE YOU FOR REAL how about a sense of accomplishment when they can still compete on a level playing field are you sure you want to stand by your statement of what good does it do?? i can not believe you said that This message has been edited. Last edited by: Ira1945, Thu 02 April 2009 12:32 PM", 
        "intTime": 20090402, 
        "postID": 7, 
        "quote": "then to that i ask, WHAT does giving the injured troops a rifle accomplish", 
        "reply": " ARE YOU FOR REAL how about a sense of accomplishment when they can still compete on a level playing field are you sure you want to stand by your statement of what good does it do?? i can not believe you said that This message has been edited. Last edited by: Ira1945, Thu 02 April 2009 12:32 PM", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 12:11:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1?", 
        "intTime": 20090402, 
        "postID": 8, 
        "quote": "", 
        "reply": "well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1?", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 22:29:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1? M1 is in 30.06!! HISTORY you P.O.G. WW2!!!!", 
        "intTime": 20090402, 
        "postID": 9, 
        "quote": "Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1?", 
        "reply": " M1 is in 30.06!! HISTORY you P.O.G. WW2!!!!", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 22:45:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "15614626"
    }, 
    {
        "content": "well an m-1 is symbolic nice program.... i love going shooting i would do it everyday if it was possible... it is fun to do and relieves stress....", 
        "intTime": 20090402, 
        "postID": 10, 
        "quote": "", 
        "reply": "well an m-1 is symbolic nice program.... i love going shooting i would do it everyday if it was possible... it is fun to do and relieves stress....", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 23:00:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well an m-1 is symbolic nice program.... i love going shooting i would do it everyday if it was possible... it is fun to do and relieves stress.... AMEN BROTHER!!!!", 
        "intTime": 20090402, 
        "postID": 11, 
        "quote": "Originally posted by outlaws93: well an m-1 is symbolic nice program.... i love going shooting i would do it everyday if it was possible... it is fun to do and relieves stress....", 
        "reply": " AMEN BROTHER!!!!", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-02 23:10:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "15614626"
    }, 
    {
        "content": "quote: reasoning behind it eludes me. not hard to understand why it eludes you, and probably a good thing that it does. of the many many wounded vets i have counseled and assisted.\\; not sure you would be welcome in their world well lets just say, they probably are glad that it does elude you and that you just do not participate, and leave it at that", 
        "intTime": 20090403, 
        "postID": 12, 
        "quote": "reasoning behind it eludes me.", 
        "reply": " not hard to understand why it eludes you, and probably a good thing that it does. of the many many wounded vets i have counseled and assisted.\\; not sure you would be welcome in their world well lets just say, they probably are glad that it does elude you and that you just do not participate, and leave it at that", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-03 07:32:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Thank You Ira for your Honorable and Selfless Service to our Wounded Warriors. GOD Bless Our Warriors and those that help them. You have my eternal respect and appreciation for your deeds.", 
        "intTime": 20090403, 
        "postID": 13, 
        "quote": "", 
        "reply": "Thank You Ira for your Honorable and Selfless Service to our Wounded Warriors. GOD Bless Our Warriors and those that help them. You have my eternal respect and appreciation for your deeds.", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-03 11:47:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1? If you have to ask you need not know.", 
        "intTime": 20090403, 
        "postID": 14, 
        "quote": "Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1?", 
        "reply": " If you have to ask you need not know.", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-03 12:35:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: Thank You Ira for your Honorable and Selfless Service to our Wounded Warriors. GOD Bless Our Warriors and those that help them. You have my eternal respect and appreciation for your deeds. i wish i had a picture of this and i might if i dig long enough, but we had a young Marine, lost his left arm, and both legs below the knee. I was able to work up a position with his prosthesus for left arm and he was able to do a rapid fire relay, load two shoot them and load eight more and complete the course in less than 60 seconds...... and the group he shot was about the size of a softball. want to see a bunch of old farts cry............ this year we hope to pass out 100 M1's all completely re habed to 100%seviceable condition and ready to issue. wouldn't it be great though to next year no more wounded warriors", 
        "intTime": 20090403, 
        "postID": 15, 
        "quote": "Originally posted by ELLIOTT1980: Thank You Ira for your Honorable and Selfless Service to our Wounded Warriors. GOD Bless Our Warriors and those that help them. You have my eternal respect and appreciation for your deeds.", 
        "reply": " i wish i had a picture of this and i might if i dig long enough, but we had a young Marine, lost his left arm, and both legs below the knee. I was able to work up a position with his prosthesus for left arm and he was able to do a rapid fire relay, load two shoot them and load eight more and complete the course in less than 60 seconds...... and the group he shot was about the size of a softball. want to see a bunch of old farts cry............ this year we hope to pass out 100 M1's all completely re habed to 100%seviceable condition and ready to issue. wouldn't it be great though to next year no more wounded warriors", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-03 13:17:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Their wounds are a reminder to all the price of freedom. As long as we are willing to fight for our freedom, there will be Wounded Warriors. GOD Bless Our Warriors", 
        "intTime": 20090403, 
        "postID": 16, 
        "quote": "", 
        "reply": "Their wounds are a reminder to all the price of freedom. As long as we are willing to fight for our freedom, there will be Wounded Warriors. GOD Bless Our Warriors", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-03 13:22:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: reasoning behind it eludes me. not hard to understand why it eludes you, and probably a good thing that it does. of the many many wounded vets i have counseled and assisted not sure you would be welcome in their world well lets just say, they probably are glad that it does elude you and that you just do not participate, and leave it at that look here. not all of us had the joy of being wounded in combat. i ask, because i WANT to know. i don't need the arrogant superiority you are feeding me. i just want an EDUCATED answer. surely you can do better than that. you are a COUNSELOR for Christ's sake. for once in your life, pretend that ignorance is not a sign of weakness, and that lay people actually WANT TO LEARN!!! pretend that i am a big contributor and my pockets are burning a hole in my leg. you want money to fund your program, and i MIGHT fund it... IF i can get a straight, honest answer,,,, is that t6oo much to ask for?", 
        "intTime": 20090403, 
        "postID": 17, 
        "quote": "Originally posted by Ira1945: quote: reasoning behind it eludes me. not hard to understand why it eludes you, and probably a good thing that it does. of the many many wounded vets i have counseled and assisted not sure you would be welcome in their world well lets just say, they probably are glad that it does elude you and that you just do not participate, and leave it at that", 
        "reply": " look here. not all of us had the joy of being wounded in combat. i ask, because i WANT to know. i don't need the arrogant superiority you are feeding me. i just want an EDUCATED answer. surely you can do better than that. you are a COUNSELOR for Christ's sake. for once in your life, pretend that ignorance is not a sign of weakness, and that lay people actually WANT TO LEARN!!! pretend that i am a big contributor and my pockets are burning a hole in my leg. you want money to fund your program, and i MIGHT fund it... IF i can get a straight, honest answer,,,, is that t6oo much to ask for?", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-03 13:33:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1? If you have to ask you need not know. ok, do YOU know the answer? educate me.", 
        "intTime": 20090403, 
        "postID": 18, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1? If you have to ask you need not know.", 
        "reply": " ok, do YOU know the answer? educate me.", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-03 13:35:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "byt eh glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters..", 
        "intTime": 20090405, 
        "postID": 19, 
        "quote": "", 
        "reply": "byt eh glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters..", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-05 07:07:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: byt eh glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters.. HERE IS YOUR CHANCE TO PUT UP OR SHUT UP BE THERE PT CLINTON OHIO, NATIONAL MATCHES 8 Aug CMP Garand Match AND SEE FOR YOURSELF YOU IDIOT BUT YOU WONT BECAUSE YOU ARE A NUTCASE", 
        "intTime": 20090405, 
        "postID": 20, 
        "quote": "Originally posted by Elesso: byt eh glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters..", 
        "reply": " HERE IS YOUR CHANCE TO PUT UP OR SHUT UP BE THERE PT CLINTON OHIO, NATIONAL MATCHES 8 Aug CMP Garand Match AND SEE FOR YOURSELF YOU IDIOT BUT YOU WONT BECAUSE YOU ARE A NUTCASE", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-05 07:18:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Elesso: by the glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters.. Elesso, Go to the National Match that Ira has mentioned above. You have my word, it will be a life altering experience for you. I promise you, it will humble you, and bring you to realization as to why the M-1 Garand is such an endearing symbol to Our Warriors. In the future..., be more on the \"receive mode\" instead of the diarrhea \"transmit mode.\" You'll pick up more INTEL that way...", 
        "intTime": 20090405, 
        "postID": 21, 
        "quote": "Originally posted by Elesso: by the glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters..", 
        "reply": " Elesso, Go to the National Match that Ira has mentioned above. You have my word, it will be a life altering experience for you. I promise you, it will humble you, and bring you to realization as to why the M-1 Garand is such an endearing symbol to Our Warriors. In the future..., be more on the \"receive mode\" instead of the diarrhea \"transmit mode.\" You'll pick up more INTEL that way...", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-05 14:05:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by Elesso: by the glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters.. Elesso, Go to the National Match that Ira has mentioned above. You have my word, it will be a life altering experience for you. I promise you, it will humble you, and bring you to realization as to why the M-1 Garand is such an endearing symbol to Our Warriors. In the future..., be more on the \"receive mode\" instead of the diarrhea \"transmit mode.\" You'll pick up more INTEL that way... LAST YEAR I PARTICIPATED WITH THE \"M1 FOR VETS\" And had the distinct honor and pleasure to win the overall Garand Match senior division, This year i will (by Gods Grace) participate again, and i will use a 1943 M1 Garand. And also this year my wife and i will host a bar b que for all the participants. Not a big deal, but just a bunch of wounded vets some in wheel chairs some hurt in different ways all share a comraderie. You go on line, pay the entry fees, and you can use my M1, or i can bring a extra M1 if you would prefer to use a different one \"http://www.odcmp.com/NationalMatches.htm\" it is your choice, but it will be a event that you will remember for the rest of your life and if you have donated funds to the Military Order of the Purple Heart, thank you, all of my childred received scholarships thru that organization, all attended University's and State Colleges and graduated, UNC, Missouri State. If you did participate thru donations then you helped my children gradate", 
        "intTime": 20090405, 
        "postID": 22, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by Elesso: by the glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters.. Elesso, Go to the National Match that Ira has mentioned above. You have my word, it will be a life altering experience for you. I promise you, it will humble you, and bring you to realization as to why the M-1 Garand is such an endearing symbol to Our Warriors. In the future..., be more on the \"receive mode\" instead of the diarrhea \"transmit mode.\" You'll pick up more INTEL that way...", 
        "reply": " LAST YEAR I PARTICIPATED WITH THE \"M1 FOR VETS\" And had the distinct honor and pleasure to win the overall Garand Match senior division, This year i will (by Gods Grace) participate again, and i will use a 1943 M1 Garand. And also this year my wife and i will host a bar b que for all the participants. Not a big deal, but just a bunch of wounded vets some in wheel chairs some hurt in different ways all share a comraderie. You go on line, pay the entry fees, and you can use my M1, or i can bring a extra M1 if you would prefer to use a different one \"http://www.odcmp.com/NationalMatches.htm\" it is your choice, but it will be a event that you will remember for the rest of your life and if you have donated funds to the Military Order of the Purple Heart, thank you, all of my childred received scholarships thru that organization, all attended University's and State Colleges and graduated, UNC, Missouri State. If you did participate thru donations then you helped my children gradate", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-05 15:21:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Elesso: byt eh glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters.. HERE IS YOUR CHANCE TO PUT UP OR SHUT UP BE THERE PT CLINTON OHIO, NATIONAL MATCHES 8 Aug CMP Garand Match AND SEE FOR YOURSELF YOU IDIOT BUT YOU WONT BECAUSE YOU ARE A NUTCASE ira, baby... stop beating your chest. if i can make it, i will... august 5th is the beginning of a semester, but lemme see how my fundage adds up. i really am curious, and would like an answer. i am afraoid i made my bed on thois one, considering how you and i fight incessantly over trivial crap. my request was real, and legitimate. i plainly asked \"why an M-1 and not any other rifle the army used. i asked why not an M-14, or a springfield rifle, or a thompson machine gun. those werre weapons that won us the war in Europe, the Pacific, and were successfully used in war until the M-16 came out. it is obvious that you are seeing me as an enemy, and i actually understand. but not all i ask is inconsecuential. if one of your patienta asked the exact question, what would you answer HIM? or would you call HIM an idiot and demean his curiosity as a jackass? i will accept either A) an anwer, or B) an apology.", 
        "intTime": 20090405, 
        "postID": 23, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Elesso: byt eh glowing explanation i am getting , i see that neither one of you actually KNOWS why the M1 is given... just sheep to the slaughter...\"because it is cool\" so much for donating funds to a worth while orgabization. i'll stick with the Purple heart foundation, and Veterans homeless shelters.. HERE IS YOUR CHANCE TO PUT UP OR SHUT UP BE THERE PT CLINTON OHIO, NATIONAL MATCHES 8 Aug CMP Garand Match AND SEE FOR YOURSELF YOU IDIOT BUT YOU WONT BECAUSE YOU ARE A NUTCASE", 
        "reply": " ira, baby... stop beating your chest. if i can make it, i will... august 5th is the beginning of a semester, but lemme see how my fundage adds up. i really am curious, and would like an answer. i am afraoid i made my bed on thois one, considering how you and i fight incessantly over trivial crap. my request was real, and legitimate. i plainly asked \"why an M-1 and not any other rifle the army used. i asked why not an M-14, or a springfield rifle, or a thompson machine gun. those werre weapons that won us the war in Europe, the Pacific, and were successfully used in war until the M-16 came out. it is obvious that you are seeing me as an enemy, and i actually understand. but not all i ask is inconsecuential. if one of your patienta asked the exact question, what would you answer HIM? or would you call HIM an idiot and demean his curiosity as a jackass? i will accept either A) an anwer, or B) an apology.", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-05 21:25:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: M-14, or a springfield rifle, or a thompson machine gun M14 IS FULL AUTO CAPABLE LICENSE IS EXPENSIVE AND SO IS RIFLE, CLOSE TO 13K FOR A M14 IF YOU CAN FIND ONE, ALL STATE OWNED M14'S HAD TO BE TURNED BACK TO US GOV FOR POTENTIAL ISSUE TO COMNBAT TROOPS, STATE USED TO HAVE M14'S TO ISSUE FOR COMPETITION TO LEGITIMATE COMPETITORS THOMPSON IS FULL AUTO, LICENSE IS EXPENSIVE AND SO IS WEAPON, VERY VERY COSTLY SPRINGFIELDS ARE JUST NOT AVAILABLE IN NUMBERS M1 WAS THE KING OF BATTLE RIFLES I DO NOT HAVE PATIENTS, I HAVE FRIENDS THAT COME TO ME FOR ASSISTANCE AT TIME MY APOLOGY IS THIS: I WILL BE ON THE FIRING LINE IN AUG WILL YOU?", 
        "intTime": 20090406, 
        "postID": 24, 
        "quote": "M-14, or a springfield rifle, or a thompson machine gun", 
        "reply": " M14 IS FULL AUTO CAPABLE LICENSE IS EXPENSIVE AND SO IS RIFLE, CLOSE TO 13K FOR A M14 IF YOU CAN FIND ONE, ALL STATE OWNED M14'S HAD TO BE TURNED BACK TO US GOV FOR POTENTIAL ISSUE TO COMNBAT TROOPS, STATE USED TO HAVE M14'S TO ISSUE FOR COMPETITION TO LEGITIMATE COMPETITORS THOMPSON IS FULL AUTO, LICENSE IS EXPENSIVE AND SO IS WEAPON, VERY VERY COSTLY SPRINGFIELDS ARE JUST NOT AVAILABLE IN NUMBERS M1 WAS THE KING OF BATTLE RIFLES I DO NOT HAVE PATIENTS, I HAVE FRIENDS THAT COME TO ME FOR ASSISTANCE AT TIME MY APOLOGY IS THIS: I WILL BE ON THE FIRING LINE IN AUG WILL YOU?", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-06 05:36:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: M-14, or a springfield rifle, or a thompson machine gun M14 IS FULL AUTO CAPABLE LICENSE IS EXPENSIVE AND SO IS RIFLE, CLOSE TO 13K FOR A M14 IF YOU CAN FIND ONE, ALL STATE OWNED M14'S HAD TO BE TURNED BACK TO US GOV FOR POTENTIAL ISSUE TO COMNBAT TROOPS, STATE USED TO HAVE M14'S TO ISSUE FOR COMPETITION TO LEGITIMATE COMPETITORS THOMPSON IS FULL AUTO, LICENSE IS EXPENSIVE AND SO IS WEAPON, VERY VERY COSTLY SPRINGFIELDS ARE JUST NOT AVAILABLE IN NUMBERS M1 WAS THE KING OF BATTLE RIFLES I DO NOT HAVE PATIENTS, I HAVE FRIENDS THAT COME TO ME FOR ASSISTANCE AT TIME MY APOLOGY IS THIS: I WILL BE ON THE FIRING LINE IN AUG WILL YOU? Actually, there is no need for an apology, if that's what that was, since you FINALLY gave me an answer. and it was a VERY good answer. did that hurt so much? if you had given me that answer 6 posts ago, we'd have been done with this... thank you very much for helping our veterans, and i'll see what i can do about seeing you in Clinton august 8th...", 
        "intTime": 20090406, 
        "postID": 25, 
        "quote": "Originally posted by Ira1945: quote: M-14, or a springfield rifle, or a thompson machine gun M14 IS FULL AUTO CAPABLE LICENSE IS EXPENSIVE AND SO IS RIFLE, CLOSE TO 13K FOR A M14 IF YOU CAN FIND ONE, ALL STATE OWNED M14'S HAD TO BE TURNED BACK TO US GOV FOR POTENTIAL ISSUE TO COMNBAT TROOPS, STATE USED TO HAVE M14'S TO ISSUE FOR COMPETITION TO LEGITIMATE COMPETITORS THOMPSON IS FULL AUTO, LICENSE IS EXPENSIVE AND SO IS WEAPON, VERY VERY COSTLY SPRINGFIELDS ARE JUST NOT AVAILABLE IN NUMBERS M1 WAS THE KING OF BATTLE RIFLES I DO NOT HAVE PATIENTS, I HAVE FRIENDS THAT COME TO ME FOR ASSISTANCE AT TIME MY APOLOGY IS THIS: I WILL BE ON THE FIRING LINE IN AUG WILL YOU?", 
        "reply": " Actually, there is no need for an apology, if that's what that was, since you FINALLY gave me an answer. and it was a VERY good answer. did that hurt so much? if you had given me that answer 6 posts ago, we'd have been done with this... thank you very much for helping our veterans, and i'll see what i can do about seeing you in Clinton august 8th...", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-06 09:42:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1? If you have to ask you need not know. ok, do YOU know the answer? educate me. The answers were posted, but you werent paying attention You come off as having an issue with giving weapons to wounded vets. quote: look here. not all of us had the joy of being wounded in combat. As far as the M1 Garand, it is known by most to be one the best infantry combat weapons of all times. And cost effective. I own one too.", 
        "intTime": 20090406, 
        "postID": 26, 
        "quote": "Originally posted by Elesso: quote: Originally posted by GunnyRet03: quote: Originally posted by Elesso: well... could they NOT before they got the rifle? a 30.06 would have done the same... i UNDERSTAND the gesture, but the reasoning behind it eludes me... \"WHY an M1 Garand, and not an M-14? or a tommy gun? or a .45?\" what was so special about the M1? If you have to ask you need not know. ok, do YOU know the answer? educate me.", 
        "reply": " The answers were posted, but you werent paying attention You come off as having an issue with giving weapons to wounded vets. quote: look here. not all of us had the joy of being wounded in combat. As far as the M1 Garand, it is known by most to be one the best infantry combat weapons of all times. And cost effective. I own one too.", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-06 10:26:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Ira, Do you have a way of tracing M1 serno's for it's history?", 
        "intTime": 20090406, 
        "postID": 27, 
        "quote": "", 
        "reply": "Ira, Do you have a way of tracing M1 serno's for it's history?", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-06 10:30:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Ira, Do you have a way of tracing M1 serno's for it's history? only when it was made, not who got it, or what service it had, i have three M1's, dozen or so 03's, some carbines, and a usmc 1941 03 sniper original regards", 
        "intTime": 20090406, 
        "postID": 28, 
        "quote": "Originally posted by GunnyRet03: Ira, Do you have a way of tracing M1 serno's for it's history?", 
        "reply": " only when it was made, not who got it, or what service it had, i have three M1's, dozen or so 03's, some carbines, and a usmc 1941 03 sniper original regards", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-06 13:24:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "springfield target rifles from 30's long range springfields top one is used at 1000 yards, when i had eyeballs i could hold a 6' group at 1k, but now 15\" is about my best THE BOTTOM ONE IS A 22, BOTH FROM THIRTIES after WWII we loaned 03's to Greece here is one that has been returned and it is a remington 03 (1942) some 03' top one is a four digit serial number and is a wwi vet do you get to shoot your M1, if so need to come to camp butner for the spring creedmore games and eastern cmp games, there will be a mi match 2 may thru 11 may. i have entered and will compete, but all are welcome and it is a good time regards Ira", 
        "intTime": 20090406, 
        "postID": 29, 
        "quote": "", 
        "reply": "springfield target rifles from 30's long range springfields top one is used at 1000 yards, when i had eyeballs i could hold a 6' group at 1k, but now 15\" is about my best THE BOTTOM ONE IS A 22, BOTH FROM THIRTIES after WWII we loaned 03's to Greece here is one that has been returned and it is a remington 03 (1942) some 03' top one is a four digit serial number and is a wwi vet do you get to shoot your M1, if so need to come to camp butner for the spring creedmore games and eastern cmp games, there will be a mi match 2 may thru 11 may. i have entered and will compete, but all are welcome and it is a good time regards Ira", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-06 14:11:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Bump for the topic!", 
        "intTime": 20090406, 
        "postID": 30, 
        "quote": "", 
        "reply": "Bump for the topic!", 
        "threadID": "409192893_3770075912001", 
        "time": "2009-04-06 21:18:00", 
        "title": "an event and a organization that remembers wounded vets", 
        "userID": "TomGustafson"
    }
]