[
    {
        "content": "A Nice story and True Acts of honor are incredibly rare in wars - ruthlessness is the norm. That's why they kept silent for 64 years. Look carefully at the B-17 and note how shot up it is - one engine dead, tail, horizontal stabilizer and nose shot up.. It was ready to fall out of the sky. (This is a painting done by an artist from the description of both pilots many years later.) Then realize that there is a German ME-109 fighter flying next to it. Now read the story below. I think you'll be surprised ... Charlie Brown was a B-17 Flying Fortress pilot with the 379th Bomber Group at Kimbolton, England. His B-17 was called 'Ye Old Pub' and was in a terrible state, having been hit by flak and fighters. The compass was damaged and they were flying deeper over enemy territory instead of heading home to Kimbolton. After flying the B-17 over an enemy airfield, a German pilot named Franz Stigler was ordered to take off and shoot down the B-17. When he got near the B-17, he could not believe his eyes. In his words, he 'had never seen a plane in such a bad state'. The tail and rear section was severely damaged, and the tail gunner wounded. The top gunner was all over the top of the fuselage. The nose was smashed and there were holes everywhere. Despite having ammunition, Franz flew to the side of the B-17 and looked at Charlie Brown, the pilot. Brown was scared and struggling to control his damaged and blood-stained plane. BF-109 pilot Franz Stigler B-17 pilot Charlie Brown Aware that they had no idea where they were going, Franz waved at Charlie to turn 180 degrees. Franz escorted and guided the stricken plane to, and slightly over, the North Sea towards England. He then saluted Charlie Brown and turned away, back to Europe. When Franz landed he told the CO that the plane had been shot down over the sea, and never told the truth to anybody. Charlie Brown and the remains of his crew told all at their briefing, but were ordered never to talk about it. More than 40 years later, Charlie Brown wanted to find the Luftwaffe pilot who saved the crew. After years of research, Franz was found. He had never talked about the incident, not even at post-war reunions. They met in the USA at a 379th Bomber Group reunion, together with 25 people who are alive now - all because Franz never fired his guns that day. (L-R) German Ace Franz Stigler, artist Ernie Boyett, and B-17 pilot Charlie Brown. When asked why he didn't shoot them down, Stigler later said, “I didn't have the heart to finish those brave men. I flew beside them for a long time. They were trying desperately to get home and I was going to let them do that. I could not have shot at them. It would have been the same as shooting at a man in a parachute.” Both men died in 2008. This is a true story! \"www.snopes.com/military/charliebrown.asp\" THIS WAS BACK IN THE DAYS WHEN THERE WAS HONOR IN BEING A WARRIOR ... THEY PROUDLY WORE UNIFORMS, AND THEY DIDN'T HIDE IN AMBUSH INSIDE A MOSQUE, OR BEHIND WOMEN AND CHILDREN, NOR DID THEY USE MENTALLY RETARDED WOMEN AS SUICIDE BOMBERS TO TARGET AND KILL INNOCENT CIVILIANS ... HOW TIMES HAVE CHANGED ....", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "A Nice story and True Acts of honor are incredibly rare in wars - ruthlessness is the norm. That's why they kept silent for 64 years. Look carefully at the B-17 and note how shot up it is - one engine dead, tail, horizontal stabilizer and nose shot up.. It was ready to fall out of the sky. (This is a painting done by an artist from the description of both pilots many years later.) Then realize that there is a German ME-109 fighter flying next to it. Now read the story below. I think you'll be surprised ... Charlie Brown was a B-17 Flying Fortress pilot with the 379th Bomber Group at Kimbolton, England. His B-17 was called 'Ye Old Pub' and was in a terrible state, having been hit by flak and fighters. The compass was damaged and they were flying deeper over enemy territory instead of heading home to Kimbolton. After flying the B-17 over an enemy airfield, a German pilot named Franz Stigler was ordered to take off and shoot down the B-17. When he got near the B-17, he could not believe his eyes. In his words, he 'had never seen a plane in such a bad state'. The tail and rear section was severely damaged, and the tail gunner wounded. The top gunner was all over the top of the fuselage. The nose was smashed and there were holes everywhere. Despite having ammunition, Franz flew to the side of the B-17 and looked at Charlie Brown, the pilot. Brown was scared and struggling to control his damaged and blood-stained plane. BF-109 pilot Franz Stigler B-17 pilot Charlie Brown Aware that they had no idea where they were going, Franz waved at Charlie to turn 180 degrees. Franz escorted and guided the stricken plane to, and slightly over, the North Sea towards England. He then saluted Charlie Brown and turned away, back to Europe. When Franz landed he told the CO that the plane had been shot down over the sea, and never told the truth to anybody. Charlie Brown and the remains of his crew told all at their briefing, but were ordered never to talk about it. More than 40 years later, Charlie Brown wanted to find the Luftwaffe pilot who saved the crew. After years of research, Franz was found. He had never talked about the incident, not even at post-war reunions. They met in the USA at a 379th Bomber Group reunion, together with 25 people who are alive now - all because Franz never fired his guns that day. (L-R) German Ace Franz Stigler, artist Ernie Boyett, and B-17 pilot Charlie Brown. When asked why he didn't shoot them down, Stigler later said, “I didn't have the heart to finish those brave men. I flew beside them for a long time. They were trying desperately to get home and I was going to let them do that. I could not have shot at them. It would have been the same as shooting at a man in a parachute.” Both men died in 2008. This is a true story! \"www.snopes.com/military/charliebrown.asp\" THIS WAS BACK IN THE DAYS WHEN THERE WAS HONOR IN BEING A WARRIOR ... THEY PROUDLY WORE UNIFORMS, AND THEY DIDN'T HIDE IN AMBUSH INSIDE A MOSQUE, OR BEHIND WOMEN AND CHILDREN, NOR DID THEY USE MENTALLY RETARDED WOMEN AS SUICIDE BOMBERS TO TARGET AND KILL INNOCENT CIVILIANS ... HOW TIMES HAVE CHANGED ....", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-26 15:39:00", 
        "title": "True Warriors", 
        "userID": "john2x"
    }, 
    {
        "content": "Great story John!", 
        "intTime": 20090529, 
        "postID": 2, 
        "quote": "", 
        "reply": "Great story John!", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 11:49:00", 
        "title": "True Warriors", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Great story John! X2", 
        "intTime": 20090529, 
        "postID": 3, 
        "quote": "Originally posted by scooter_mech: Great story John!", 
        "reply": " X2", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 12:02:00", 
        "title": "True Warriors", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Franz Stigler \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090529, 
        "postID": 4, 
        "quote": "Franz Stigler", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 12:48:00", 
        "title": "True Warriors", 
        "userID": "NSNN"
    }, 
    {
        "content": "This is a touching story, that was the days of chivilary. (sp) Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090529, 
        "postID": 5, 
        "quote": "", 
        "reply": "This is a touching story, that was the days of chivilary. (sp) Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 13:03:00", 
        "title": "True Warriors", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: This is a touching story, that was the days of chivilary. (sp) It was much more prevalent in WWI! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090529, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: This is a touching story, that was the days of chivilary. (sp)", 
        "reply": " It was much more prevalent in WWI! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 13:31:00", 
        "title": "True Warriors", 
        "userID": "NSNN"
    }, 
    {
        "content": "Great war story...it is ashame we do not have more...", 
        "intTime": 20090529, 
        "postID": 7, 
        "quote": "", 
        "reply": "Great war story...it is ashame we do not have more...", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 22:29:00", 
        "title": "True Warriors", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "'Ye Old Pub' was saved/spared by Stigler. Wunderbar..Now they are both in Heaven together. How inspiring. Chivalry was for then...but now??? Not with, as is pointed out, Suicide Bombers. RIP Brown and Stigler. A good deed for sure.", 
        "intTime": 20090529, 
        "postID": 8, 
        "quote": "", 
        "reply": "'Ye Old Pub' was saved/spared by Stigler. Wunderbar..Now they are both in Heaven together. How inspiring. Chivalry was for then...but now??? Not with, as is pointed out, Suicide Bombers. RIP Brown and Stigler. A good deed for sure.", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 22:41:00", 
        "title": "True Warriors", 
        "userID": "Agent991"
    }, 
    {
        "content": "That is indeed a great story. On that note, here is another one: \"A crackle in the brush. That's the sound the Afghan herder recalls hearing as he walked alone through a pine forest last month. When he looked up, he saw an American commando, his legs and shoulder bloodied. The commando pointed his gun at the Afghan. \"Maybe he thought I was a Taliban,\" says the shepherd, Gulab. \"I remembered hearing that if an American sticks up his thumb, it is a friendly gesture. So that's what I did.\" To make sure the message was clear, Gulab lifted his tunic to show the American he wasn't hiding a weapon. He then propped up the wounded commando, and together the pair hobbled down the steep mountain trail to Sabari-Minah, a cluster of adobe-and-wood homes--crossing, for the time being, to safety. What Gulab did not know is that the commando he encountered was part of a team of Navy SEALs that had been missing for four days after being ambushed by Taliban insurgents during a reconnaissance mission in northeastern Afghanistan. An initial search mission to find the missing SEALs ended in disaster on June 28, when a Chinook helicopter carrying 16 service members was shot down over Kunar province, killing everyone aboard, in one of the deadliest attacks so far on U.S. forces in Afghanistan. Since then, the bodies of two of the missing SEALs have been recovered; another is still classified as missing, though the Taliban claims he was captured and beheaded. One member of the team did survive. Though the military has not released the name of the SEAL (the U.S. military seldom gives out the names of its special-operations personnel), TIME pieced together his story on the basis of briefings with U.S. military officials in Afghanistan plus an exclusive account of how Gulab, an Afghan herdsman, rescued the wounded commando. What emerges is the tale of a courageous U.S. fighter facing impossible odds in unfamiliar terrain, stalked by the enemy and stripped of everything but his gun and his will to survive. But it is also a story of mercy and fraternity, showing that even in the war-scorched landscape of the Afghan mountains, little shoots of humanity sometimes have a chance to grow. The clashes in Kunar province have highlighted a worrying surge in violence in Afghanistan, where 15,000 U.S. troops are based. Several months ago, U.S. and Afghan officials claimed the Taliban was a spent force. But the Islamist fighters and their al-Qaeda allies have sprung back with fresh recruits, new weaponry and advanced bombmaking skills passed on to them by terrorists in Iraq, officials in Kabul say. It was in response to signs of a mounting threat from Taliban fighters that the four-man commando team found itself in the Afghan forests of Kunar province on June 28, maneuvering under low clouds and a drenching rain. The mission, code-named Operation Redwing, was to find and engage the enemy. But in late afternoon, the commandos sent back a one-line message to the \"Ark,\" a coalition-forces operations room in Kabul. Accompanied by a warning chime, it read, \"Troops in contact.\" Translation: a fire fight was under way. That was the SEALs' last message. The tracking devices each carried went dead, possibly because the men ditched their heavy rucksacks so they could move unburdened, a U.S. official says. Within minutes of receiving the message, eight commandos and eight crewmen of the 160th Special Operations Aviation Regiment piled into an MH-47 Chinook helicopter and sped out to help the trapped men. According to accounts provided to U.S. commanders by the surviving Navy SEAL, the commando team had come under fierce attack from a large group of Taliban fighters, who pounded their location with rocket-propelled grenades, mortars and a steady hail of small-arms fire. The clatter of the approaching Chinook may or may not have been audible to the SEALs, but the Taliban surely heard it. A second band of fighters turned and took a bead on the chopper, probably with a rocket- propelled grenade, and in what a U.S. official calls \"a pretty lucky shot,\" knocked it out of the sky. Now the four SEALs were truly alone. With night falling and the fog settling, they managed to slip through the Taliban fighters. Crawling and scrambling, they headed toward the high ridges, and the Taliban--who had them outnumbered, probably 5 to 1--gave chase. U.S. officials say the commandos kept up a running fire fight with their pursuers for more than two miles. The known survivor recalls seeing two of his friends shot. At one point he blacked out, possibly from a mortar round landing close by. When he regained consciousness, two of his teammates--Petty Officer 2nd Class Danny Dietz, 25, and Lieutenant Michael Murphy, 29--were dead, and a third had vanished in the darkness and fog. The surviving SEAL dragged himself at least another mile up into the mountains. It was there he was found four days later by Gulab the shepherd. After taking the SEAL to Sabari-Minah, Gulab called a village council and explained that the American needed protection from Taliban hunters. It was the SEAL's good fortune that the villagers were Pashtun, who are honor-bound never to refuse sanctuary to a stranger. By then, said Gulab, \"the American understood that we were trying to save him, and he relaxed a bit.\" The Taliban was not so agreeable. That night the fighters sent a message to the villagers: \"We want this infidel.\" A firm reply from the village chief, Shinah, shot back. \"The American is our guest, and we won't give him up as long as there's a man or a woman left alive in our village.\" As a precaution, the villagers moved the injured commando out of Gulab's house and hid him in a stable overnight, until it was safe for Gulab to make the six-hour trek down to the U.S. base at Asadabad and report that the SEAL--by then the subject of an intense search--was alive. Sometime later, Gulab went back to his village and then returned to Asadabad with the commando, this time reuniting the wounded and weary SEAL with his jubilant comrades. The relief at recovering the missing commando has been tempered by the heavy loss of American life--and the knowledge that more fighting lies ahead. The Taliban's offensive shows no sign of waning and is apparently aimed at sabotaging September's parliamentary elections. U.S. Colonel Don McGraw, director of operations of the Combined Forces Command in Kabul, says that in the chaos of Afghanistan today, it is hard to distinguish among what is the work of the Taliban, drug traffickers and criminal gangs. Source: xx-http://www.time.com/time/magazine/article/0,9171,1081394-3,00.html-xx", 
        "intTime": 20090529, 
        "postID": 9, 
        "quote": "", 
        "reply": "That is indeed a great story. On that note, here is another one: \"A crackle in the brush. That's the sound the Afghan herder recalls hearing as he walked alone through a pine forest last month. When he looked up, he saw an American commando, his legs and shoulder bloodied. The commando pointed his gun at the Afghan. \"Maybe he thought I was a Taliban,\" says the shepherd, Gulab. \"I remembered hearing that if an American sticks up his thumb, it is a friendly gesture. So that's what I did.\" To make sure the message was clear, Gulab lifted his tunic to show the American he wasn't hiding a weapon. He then propped up the wounded commando, and together the pair hobbled down the steep mountain trail to Sabari-Minah, a cluster of adobe-and-wood homes--crossing, for the time being, to safety. What Gulab did not know is that the commando he encountered was part of a team of Navy SEALs that had been missing for four days after being ambushed by Taliban insurgents during a reconnaissance mission in northeastern Afghanistan. An initial search mission to find the missing SEALs ended in disaster on June 28, when a Chinook helicopter carrying 16 service members was shot down over Kunar province, killing everyone aboard, in one of the deadliest attacks so far on U.S. forces in Afghanistan. Since then, the bodies of two of the missing SEALs have been recovered; another is still classified as missing, though the Taliban claims he was captured and beheaded. One member of the team did survive. Though the military has not released the name of the SEAL (the U.S. military seldom gives out the names of its special-operations personnel), TIME pieced together his story on the basis of briefings with U.S. military officials in Afghanistan plus an exclusive account of how Gulab, an Afghan herdsman, rescued the wounded commando. What emerges is the tale of a courageous U.S. fighter facing impossible odds in unfamiliar terrain, stalked by the enemy and stripped of everything but his gun and his will to survive. But it is also a story of mercy and fraternity, showing that even in the war-scorched landscape of the Afghan mountains, little shoots of humanity sometimes have a chance to grow. The clashes in Kunar province have highlighted a worrying surge in violence in Afghanistan, where 15,000 U.S. troops are based. Several months ago, U.S. and Afghan officials claimed the Taliban was a spent force. But the Islamist fighters and their al-Qaeda allies have sprung back with fresh recruits, new weaponry and advanced bombmaking skills passed on to them by terrorists in Iraq, officials in Kabul say. It was in response to signs of a mounting threat from Taliban fighters that the four-man commando team found itself in the Afghan forests of Kunar province on June 28, maneuvering under low clouds and a drenching rain. The mission, code-named Operation Redwing, was to find and engage the enemy. But in late afternoon, the commandos sent back a one-line message to the \"Ark,\" a coalition-forces operations room in Kabul. Accompanied by a warning chime, it read, \"Troops in contact.\" Translation: a fire fight was under way. That was the SEALs' last message. The tracking devices each carried went dead, possibly because the men ditched their heavy rucksacks so they could move unburdened, a U.S. official says. Within minutes of receiving the message, eight commandos and eight crewmen of the 160th Special Operations Aviation Regiment piled into an MH-47 Chinook helicopter and sped out to help the trapped men. According to accounts provided to U.S. commanders by the surviving Navy SEAL, the commando team had come under fierce attack from a large group of Taliban fighters, who pounded their location with rocket-propelled grenades, mortars and a steady hail of small-arms fire. The clatter of the approaching Chinook may or may not have been audible to the SEALs, but the Taliban surely heard it. A second band of fighters turned and took a bead on the chopper, probably with a rocket- propelled grenade, and in what a U.S. official calls \"a pretty lucky shot,\" knocked it out of the sky. Now the four SEALs were truly alone. With night falling and the fog settling, they managed to slip through the Taliban fighters. Crawling and scrambling, they headed toward the high ridges, and the Taliban--who had them outnumbered, probably 5 to 1--gave chase. U.S. officials say the commandos kept up a running fire fight with their pursuers for more than two miles. The known survivor recalls seeing two of his friends shot. At one point he blacked out, possibly from a mortar round landing close by. When he regained consciousness, two of his teammates--Petty Officer 2nd Class Danny Dietz, 25, and Lieutenant Michael Murphy, 29--were dead, and a third had vanished in the darkness and fog. The surviving SEAL dragged himself at least another mile up into the mountains. It was there he was found four days later by Gulab the shepherd. After taking the SEAL to Sabari-Minah, Gulab called a village council and explained that the American needed protection from Taliban hunters. It was the SEAL's good fortune that the villagers were Pashtun, who are honor-bound never to refuse sanctuary to a stranger. By then, said Gulab, \"the American understood that we were trying to save him, and he relaxed a bit.\" The Taliban was not so agreeable. That night the fighters sent a message to the villagers: \"We want this infidel.\" A firm reply from the village chief, Shinah, shot back. \"The American is our guest, and we won't give him up as long as there's a man or a woman left alive in our village.\" As a precaution, the villagers moved the injured commando out of Gulab's house and hid him in a stable overnight, until it was safe for Gulab to make the six-hour trek down to the U.S. base at Asadabad and report that the SEAL--by then the subject of an intense search--was alive. Sometime later, Gulab went back to his village and then returned to Asadabad with the commando, this time reuniting the wounded and weary SEAL with his jubilant comrades. The relief at recovering the missing commando has been tempered by the heavy loss of American life--and the knowledge that more fighting lies ahead. The Taliban's offensive shows no sign of waning and is apparently aimed at sabotaging September's parliamentary elections. U.S. Colonel Don McGraw, director of operations of the Combined Forces Command in Kabul, says that in the chaos of Afghanistan today, it is hard to distinguish among what is the work of the Taliban, drug traffickers and criminal gangs. Source: xx-http://www.time.com/time/magazine/article/0,9171,1081394-3,00.html-xx", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-29 23:45:00", 
        "title": "True Warriors", 
        "userID": "Hultberg"
    }, 
    {
        "content": "[QUOTE] This is a touching story, that was the days of chivilary. (sp) [/QUOTE There were many dishonourable acts perpetrated during WW2, not only by the Germans or Japanese. Just as there were many incidents of the kind mentioned above.", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "", 
        "reply": "[QUOTE] This is a touching story, that was the days of chivilary. (sp) [/QUOTE There were many dishonourable acts perpetrated during WW2, not only by the Germans or Japanese. Just as there were many incidents of the kind mentioned above.", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-30 02:46:00", 
        "title": "True Warriors", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "During the War of Northern Agression; after the battle of Fredricksburg, there were alot of Federal wounded laying on the ground in front of the stone wall on Marye's Heights. They had been there for most of the day and their cries for water were too much for one Southern soldier to bear. He (I can't recall his name) gathered up some canteens and roamed between the lines giving water and what small aid and comfort he could to those wounded men. While doing so, the Federal troops held their fire. He was (and is today) known as \"The Angel of Marye's Heights\" There is a statue of him right next to the last remnant of that stone wall on Marye's Heights in Fredricksburg National Battlefield Park. That compassionate Confederate soldier was later KIA during the Battle of Chickamauga. (sp?) Duane A. Brinson \"Oscar Mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder, the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 11, 
        "quote": "", 
        "reply": "During the War of Northern Agression; after the battle of Fredricksburg, there were alot of Federal wounded laying on the ground in front of the stone wall on Marye's Heights. They had been there for most of the day and their cries for water were too much for one Southern soldier to bear. He (I can't recall his name) gathered up some canteens and roamed between the lines giving water and what small aid and comfort he could to those wounded men. While doing so, the Federal troops held their fire. He was (and is today) known as \"The Angel of Marye's Heights\" There is a statue of him right next to the last remnant of that stone wall on Marye's Heights in Fredricksburg National Battlefield Park. That compassionate Confederate soldier was later KIA during the Battle of Chickamauga. (sp?) Duane A. Brinson \"Oscar Mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder, the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-30 04:24:00", 
        "title": "True Warriors", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "My Uncle was a side gunner on a B-26 in WW11, he was shot down twice...He would always laugh about it and how long it took him to get back to friendly lines...Then he had to worry about if they were going to shoot him....", 
        "intTime": 20090531, 
        "postID": 12, 
        "quote": "", 
        "reply": "My Uncle was a side gunner on a B-26 in WW11, he was shot down twice...He would always laugh about it and how long it took him to get back to friendly lines...Then he had to worry about if they were going to shoot him....", 
        "threadID": "409192893_8050043422001", 
        "time": "2009-05-31 18:25:00", 
        "title": "True Warriors", 
        "userID": "dman1948"
    }
]