[
    {
        "content": "First, I am by no means an economist, but I have been doing research into our monetary system, and find that it is quite appalling. Perhaps I don't completely understand it, but I'd like to discuss it and see if I'm correct in my thinking. The first issue to tackle is that our money is debt. When the government asks the Federal Reserve to print money, they exchange promissary notes for the printed money. However, in most cases there is no money printed, and these transactions are electronic. Quite literally, money is created out of thin air. Second, when people get a loan from a bank, the bank does not have the money to lend, but they add the principal of the loan to their ledger. The concept is that the debtor will pay off the bank through real, physical assets, or labor (these things being real wealth, rather than money itself). Only a small percentage of the monetary \"wealth\" in the U.S. is supported by actual paper money. The banks create numbers out of think air, which people have to repay with real wealth (assets and labor). However, there are limits to how much a bank can lend, depending upon actual monetary assets. Remember, money is debt. If every citizen, and the government, were to be debt free, there would literally be no cash in circulation, since it would be returned to the Federal Reserve. However, due to interest on loans, it is literally impossible for everyone to be debt free. Basically, the money needed to pay off interest does not exist. The principal could theoretically be returned by every citizen and the government, but never the interest. It seems that we are playing a game of musical chairs, in which American's are guaranteed to fail. So long as the music is playing, things are fine, but once the music stops, we have a problem. I don't see this as an issue with capitalism or individual ability and responsibility. Our current monetary system guarantees failure, which I find to be appalling. It almost seems as though Americans are enslaved to the dollar. We need to abolish the Federal Reserve, and adjust our monetary system. I don't know if my understanding as stated above is completely correct, but does anyone have any input on this?", 
        "intTime": 20090326, 
        "postID": 1, 
        "quote": "", 
        "reply": "First, I am by no means an economist, but I have been doing research into our monetary system, and find that it is quite appalling. Perhaps I don't completely understand it, but I'd like to discuss it and see if I'm correct in my thinking. The first issue to tackle is that our money is debt. When the government asks the Federal Reserve to print money, they exchange promissary notes for the printed money. However, in most cases there is no money printed, and these transactions are electronic. Quite literally, money is created out of thin air. Second, when people get a loan from a bank, the bank does not have the money to lend, but they add the principal of the loan to their ledger. The concept is that the debtor will pay off the bank through real, physical assets, or labor (these things being real wealth, rather than money itself). Only a small percentage of the monetary \"wealth\" in the U.S. is supported by actual paper money. The banks create numbers out of think air, which people have to repay with real wealth (assets and labor). However, there are limits to how much a bank can lend, depending upon actual monetary assets. Remember, money is debt. If every citizen, and the government, were to be debt free, there would literally be no cash in circulation, since it would be returned to the Federal Reserve. However, due to interest on loans, it is literally impossible for everyone to be debt free. Basically, the money needed to pay off interest does not exist. The principal could theoretically be returned by every citizen and the government, but never the interest. It seems that we are playing a game of musical chairs, in which American's are guaranteed to fail. So long as the music is playing, things are fine, but once the music stops, we have a problem. I don't see this as an issue with capitalism or individual ability and responsibility. Our current monetary system guarantees failure, which I find to be appalling. It almost seems as though Americans are enslaved to the dollar. We need to abolish the Federal Reserve, and adjust our monetary system. I don't know if my understanding as stated above is completely correct, but does anyone have any input on this?", 
        "threadID": "409192893_3100010912001", 
        "time": "2009-03-26 14:13:00", 
        "title": "Federal Reserve: Money is Debt.  Is the system falling apart?", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Just to add something. Deposits made by bank customers are actually marked as liabilities on the banks ledger.", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "", 
        "reply": "Just to add something. Deposits made by bank customers are actually marked as liabilities on the banks ledger.", 
        "threadID": "409192893_3100010912001", 
        "time": "2009-03-26 14:19:00", 
        "title": "Federal Reserve: Money is Debt.  Is the system falling apart?", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: You are missing a couple of pieces of the puzzle but have a basic understanding. What you describe is called the Fractional Reserve Systems and could be used whether or not there was a federal reserve. Fiat currency: Fiat currency is currency that is not bound by any finite element. You often hear of the gold standard. The gold standard is the opposite of fiat currency in that the currency is pegged to a finite element. It prevents the money supply from growing exponentially. Interest = Growth: Interest can be repaid through growth. But as debt (aka money supply) grows exponentially so too does interest. It is impossible for growth to be infinite in a finite system (aka the earth and its resources are finite and thus growth can not exceed the ability of the earth to support it). Thus the reason why fiat currencies are a problem in the long run as they allow debt to get to unsustainable levels from which a crash ALWAYS follows. Inflation: Inflation is what occurs when debt gets out of control (aka they poof into existance too much money thus devaluing each unit of said money). Deflation: When debt is defaulted on or paid off the money supply contracts or deflates making each unit worth more.", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "Originally posted by Philhelm:", 
        "reply": " You are missing a couple of pieces of the puzzle but have a basic understanding. What you describe is called the Fractional Reserve Systems and could be used whether or not there was a federal reserve. Fiat currency: Fiat currency is currency that is not bound by any finite element. You often hear of the gold standard. The gold standard is the opposite of fiat currency in that the currency is pegged to a finite element. It prevents the money supply from growing exponentially. Interest = Growth: Interest can be repaid through growth. But as debt (aka money supply) grows exponentially so too does interest. It is impossible for growth to be infinite in a finite system (aka the earth and its resources are finite and thus growth can not exceed the ability of the earth to support it). Thus the reason why fiat currencies are a problem in the long run as they allow debt to get to unsustainable levels from which a crash ALWAYS follows. Inflation: Inflation is what occurs when debt gets out of control (aka they poof into existance too much money thus devaluing each unit of said money). Deflation: When debt is defaulted on or paid off the money supply contracts or deflates making each unit worth more.", 
        "threadID": "409192893_3100010912001", 
        "time": "2009-03-27 08:31:00", 
        "title": "Federal Reserve: Money is Debt.  Is the system falling apart?", 
        "userID": "floersh"
    }, 
    {
        "content": "The key positive effect of a fiat currency is that the amount of money in circulation (not cash) isn't limited by the amount of gold on reserve. Under a gold system, which we used to have, money was limited in supply which, in good times, led to higher interest rates due to demand exceeding the supply. Under a fiat system, the amount of money in circulation is theoretically unlimited, but that's not actually true, of course. As we're seeing now, there are limits. Also, money has literally no value unless it's loaned out. Every dollar you have in your pocket is a promissory note and it's promised to someone. In fact, it's promised to THOUSANDS of someones! When banks make loans, that money is electronically deposited into their accounts, or the borrowers bank, and it then becomes available to loan out again. A bank is limited in the amount of money it can loan to the amount it has on deposit, minus the discount rate (or a percentage deposited in the Federal Reserve). That means if the bank loans you a thousand dollars and you deposit it into an account at that bank, they can deducted the discount rate (say, 10%) and then loan $900 of that thousand they just loaned you to someone else. That's how banks create money. That can theoretically go on forever, but when economic activity shrinks or retreats, somebody, somewhere, defaults on their loan. That has a domino effect as other loans which were made with the same money also come into default. If it gets serious enough, or big enough, the whole scheme can collapse overnight. That's exactly what we were facing last September and are still facing now and why the Fed stepped in to guarantee banks and giant insurance company's debt.", 
        "intTime": 20090329, 
        "postID": 4, 
        "quote": "", 
        "reply": "The key positive effect of a fiat currency is that the amount of money in circulation (not cash) isn't limited by the amount of gold on reserve. Under a gold system, which we used to have, money was limited in supply which, in good times, led to higher interest rates due to demand exceeding the supply. Under a fiat system, the amount of money in circulation is theoretically unlimited, but that's not actually true, of course. As we're seeing now, there are limits. Also, money has literally no value unless it's loaned out. Every dollar you have in your pocket is a promissory note and it's promised to someone. In fact, it's promised to THOUSANDS of someones! When banks make loans, that money is electronically deposited into their accounts, or the borrowers bank, and it then becomes available to loan out again. A bank is limited in the amount of money it can loan to the amount it has on deposit, minus the discount rate (or a percentage deposited in the Federal Reserve). That means if the bank loans you a thousand dollars and you deposit it into an account at that bank, they can deducted the discount rate (say, 10%) and then loan $900 of that thousand they just loaned you to someone else. That's how banks create money. That can theoretically go on forever, but when economic activity shrinks or retreats, somebody, somewhere, defaults on their loan. That has a domino effect as other loans which were made with the same money also come into default. If it gets serious enough, or big enough, the whole scheme can collapse overnight. That's exactly what we were facing last September and are still facing now and why the Fed stepped in to guarantee banks and giant insurance company's debt.", 
        "threadID": "409192893_3100010912001", 
        "time": "2009-03-29 17:59:00", 
        "title": "Federal Reserve: Money is Debt.  Is the system falling apart?", 
        "userID": "stillkit"
    }
]