[
    {
        "content": "+++http://weeklystandard.com/Content/Public/Articles/000/000/016/249nhfrg.asp The Democratic plan that was signed into law was an incoherent wasteful mess, but it is likely to stimulate the economy some. It could be (as it often was) sold as something like the New Deal: an ambitious and ideologically laden response to a genuine economic crisis. But the Obama administration's proposed 2010 budget, unveiled just a week after the stimulus plan was signed into law, cannot be advanced on such grounds. It is certainly ambitious and certainly ideologically laden, but it is not a response to the economic crisis. Rather, it denies the crisis and complicates the effort to combat it. The budget offers an audacious array of technocratic initiatives aimed at transforming the relationship between Americans and their government and moving the country in the direction of European social democracy. It sets the stage for a vastly expanded federal role in the health insurance market--as one \"option\" among many to begin with, but with the help of price controls and the power to set rules of entry guaranteed to soon be the reigning, if not the only, option. It puts the federal government in command of a complex scheme of carbon-emission taxes and credits. It opens the way for a significantly increased federal role in education (including higher education).", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://weeklystandard.com/Content/Public/Articles/000/000/016/249nhfrg.asp The Democratic plan that was signed into law was an incoherent wasteful mess, but it is likely to stimulate the economy some. It could be (as it often was) sold as something like the New Deal: an ambitious and ideologically laden response to a genuine economic crisis. But the Obama administration's proposed 2010 budget, unveiled just a week after the stimulus plan was signed into law, cannot be advanced on such grounds. It is certainly ambitious and certainly ideologically laden, but it is not a response to the economic crisis. Rather, it denies the crisis and complicates the effort to combat it. The budget offers an audacious array of technocratic initiatives aimed at transforming the relationship between Americans and their government and moving the country in the direction of European social democracy. It sets the stage for a vastly expanded federal role in the health insurance market--as one \"option\" among many to begin with, but with the help of price controls and the power to set rules of entry guaranteed to soon be the reigning, if not the only, option. It puts the federal government in command of a complex scheme of carbon-emission taxes and credits. It opens the way for a significantly increased federal role in education (including higher education).", 
        "threadID": "409192893_3930023712001", 
        "time": "2009-03-09 06:00:00", 
        "title": "Obama's Anti-Stimulus Plan", 
        "userID": "threerings"
    }, 
    {
        "content": "Finaly, change you can count on. Yes we can! (Because you put the lib/socialists in charge of the country.)", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "", 
        "reply": "Finaly, change you can count on. Yes we can! (Because you put the lib/socialists in charge of the country.)", 
        "threadID": "409192893_3930023712001", 
        "time": "2009-03-09 06:06:00", 
        "title": "Obama's Anti-Stimulus Plan", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Finaly, change you can count on. Yes we can! (Because you put the lib/socialists in charge of the country.) You know, I'll be fine. I own land in the middle of nowhere, that can only be reached by some old overgrown logging roads. I can live off the land for years. The rest of you...well good luck.", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "Originally posted by bill_kananen: Finaly, change you can count on. Yes we can! (Because you put the lib/socialists in charge of the country.)", 
        "reply": " You know, I'll be fine. I own land in the middle of nowhere, that can only be reached by some old overgrown logging roads. I can live off the land for years. The rest of you...well good luck.", 
        "threadID": "409192893_3930023712001", 
        "time": "2009-03-09 06:17:00", 
        "title": "Obama's Anti-Stimulus Plan", 
        "userID": "threerings"
    }, 
    {
        "content": "Hope and change as promised. From Friday's Federalist Patriot... The collection of comments from credible economists can be found by going to the site and clicking on the link provided. With Barry's help, our economy is circling the drain... Liberty versus Tyranny The primacy of free enterprise By Mark Alexander Now that Barack Hussein Obama and his enablers have enacted the most massive redistribution of wealth in history -- more than four trillion dollars of it, with trillions more yet to come -- just ask yourself: \"Are you better off today than you were in the good old days under George W. Bush?\" Is your home, or your market investment, or your retirement account worth more today than it was last November, when the election of BHO ushered in the era of \"hope 'n' change\"? For some reason, both the housing and equity markets began declining after Democrats regained control of the Senate and House in 2006. Since Obama's election, the bottom has dropped out. We as Americans have not only lost income and jobs, but also some 35 percent of the value of our homes and market/retirement accounts. What happened? I thought the election of Obama and the rush to pass his so-called \"economic stimulus package\" was supposed to restore confidence in the economy and our national leadership? Could it be that some folks were duped into electing a Leftist \"community organizer\" to lead the world's most powerful nation out of its worst economic crisis of confidence in decades? Indeed, this reality is just now sinking into the spongy heads of a growing chorus of Democrats. Could it be, too, that Obama's policies actually have much less to do with economic recovery than with, to use his own words, \"the fundamental transformation of the United States of America\" into a socialist republic? Many distinguished economists have issued loud warnings about the consequences of Obama's socialist policies. They remind us that those policies didn't work for Roosevelt (Obama's model), and they won't restore our economy today -- assuming that economic recovery is actually Obama's objective. For the record, Obama and his Leftist cadres have used the current economic crisis (which they seeded) as cover to implement their socialist \"transformation of the USA\" in under 60 days. So, what will work? Economic liberty, which has always been self-regulating -- free enterprise coupled with limited taxation and regulation, as outlined below. President Ronald Reagan created the most recent template for economic and moral prosperity, outlined in \"A Time for Choosing\" and codified in the 1984 Republican Platform. Inheriting the last great economic crisis in 1981, President Reagan said, \"We who live in free market societies believe that growth, prosperity and ultimately human fulfillment are created from the bottom up, not the government down. Only when the human spirit is allowed to invent and create, only when individuals are given a personal stake in deciding economic policies and benefiting from their success -- only then can societies remain economically alive, dynamic, progressive, and free. ... Only private industry in the last analysis can provide jobs with a future. ... The fact is, we'll never build a lasting economic recovery by going deeper into debt at a faster rate than we ever have before. ... In this present crisis, government is not the solution to our problem; government is the problem.\" Of course, Reagan was quick to admit that his outline was based on the timeless wisdom of those from generations before his. The free-enterprise principles Ronald Reagan advanced are rooted in those espoused by 18th-century moral philosopher and political economist Adam Smith, who is most noted for authoring \"An Inquiry into the Nature and Causes of the Wealth of Nations.\" Smith wrote, \"In a market free from monopolies and self-serving public policies, competition among the self-interests of isolated consumers and producers produces a stable and expanding economy. The self-interested pursuit of wealth may not be individually satisfying but leads to an aggregate increase in wealth that is in the best interests of a nation. ... Great nations are never impoverished by private, though they sometimes are by public prodigality and misconduct.\" Our Founders understood these principles and advanced them into the 19th century. \"The natural progress of things is for liberty to yield and government to gain ground,\" wrote Thomas Jefferson. \"To take from one, because it is thought his own industry and that of his fathers has acquired too much, in order to spare to others, who, or whose fathers, have not exercised equal industry and skill, is to violate arbitrarily the first principle of association, the guarantee to everyone the free exercise of his industry and the fruits acquired by it. ... [A] wise and frugal government ... shall restrain men from injuring one another, shall leave them otherwise free to regulate their own pursuits of industry and improvement, and shall not take from the mouth of labor the bread it has earned. This is the sum of good government.\" \"The essence of Government is power,\" wrote James Madison, \"and power, lodged as it must be in human hands, will ever be liable to abuse. ... Government is instituted to protect property of every sort; as well that which lies in the various rights of individuals, as that which the term particularly expresses. This being the end of government, that alone is a just government, which impartially secures to every man whatever is his own.\" According to John Adams, \"The moment the idea is admitted into society that property is not as sacred as the laws of God, and that there is not a force of law and public justice to protect it, anarchy and tyranny commence. If 'Thou shalt not covet' and 'Thou shalt not steal' were not commandments of Heaven, they must be made inviolable precepts in every society before it can be civilized or made free. ... A Constitution of Government once changed from Freedom, can never be restored. Liberty, once lost, is lost forever.\" In the 20th century, there were three giants among free enterprise economists: Ludwig von Mises, Friedrich August von Hayek and Milton Friedman. Austrian economist and philosopher von Mises (1881-1973) argued, \"All that good government can do to improve the material well-being of the masses is to establish and to preserve an institutional setting in which there are no obstacles to the progressive accumulation of new capital and its utilization for the improvement of technical methods of production. ... The direction of all economic affairs is in the market society a task of the entrepreneurs. Theirs is the control of production. They are at the helm and steer the ship. A superficial observer would believe that they are supreme. But they are not. They are bound to obey unconditionally the captain's orders. The captain is the consumer. ...[Consumers] make poor people rich and rich people poor. They determine precisely what should be produced, in what quality, and in what quantities.\" Classical libertarian and free-market capitalist F.A. von Hayek (1899-1992) wrote, \"Capitalism is not only a better form of organizing human activity than any deliberate design, any attempt to organize it to satisfy particular preferences, to aim at what people regard as beautiful or pleasant order, but it is also the indispensable condition for just keeping that population alive which exists already in the world. I regard the preservation of what is known as the capitalist system, of the system of free markets and the private ownership of the means of production, as an essential condition of the very survival of mankind. ... Perhaps the fact that we have seen millions voting themselves into complete dependence on a tyrant has made our generation understand that to choose one's government is not necessarily to secure freedom. ... Emergencies' have always been the pretext on which the safeguards of individual liberty have been eroded.\" Perhaps the best known economist of the last century was Milton Friedman (1912-2006), who authored \"Free to Choose.\" Friedman, who in 1976 was awarded the Nobel Memorial Prize in Economic Sciences, wrote, \"The Great Depression, like most other periods of severe unemployment, was produced by government mismanagement rather than by any inherent instability of the private economy. ... Roosevelt's policies were very destructive. Roosevelt's policies made the depression longer and worse than it otherwise would have been.\" In regard to socialism, Friedman wrote, \"The society that puts equality before freedom will end up with neither. The society that puts freedom before equality will end up with a great measure of both. ... Underlying most arguments against the free market is a lack of belief in freedom itself. ... We have a system that increasingly taxes work and subsidizes nonwork.\" Of course, there are great free-market economists in our midst today -- notable among them are Thomas Sowell and Walter E. Williams. Of Obama's plans, Sowell writes, \"Socialism in general has a record of failure so blatant that only an intellectual could ignore or evade it. ... It is amazing that people who think we cannot afford to pay for doctors, hospitals, and medication somehow think that we can afford to pay for doctors, hospitals, medication and a government bureaucracy to administer it. ... The first lesson of economics is scarcity: there is never enough of anything to fully satisfy all of those who want it. The first lesson of politics is to disregard the first lesson of economics. ... The welfare state is not really about the welfare of the masses. It is about the egos of the elites.\" Characteristically, Walter Williams cuts to the core: \"Two-thirds of the federal budget consists of taking property from one American and giving it to another. Were a private person to do the same thing, we'd call it theft. When government does it, we euphemistically call it income redistribution, but that's exactly what thieves do -- redistribute income. Income redistribution not only betrays the founders' vision, it's a sin in the eyes of God. ... No human should be coerced by the state to bear the medical expense, or any other expense, for his fellow man. In other words, the forcible use of one person to serve the purposes of another is morally offensive. ... One of the wonderful things about free markets is that the path to greater wealth comes not from looting, plundering and enslaving one's fellow man, as it has throughout most of human history, but by serving and pleasing him.\" So, what is one to conclude about the policies of Obama versus Reagan, and all the Patriots who went before Reagan? Obama's policies have nothing to do with economic recovery, but with growing the size and influence of the central government -- the ultimate objective being to socialize the economy. The residual of free enterprise may well right our economy, in spite of Obama's antics, but the consequences of the current government folly will certainly leave future generations with a greater debt of servitude to our government masters -- short of real \"change.\" So, what constitutes \"real\" change? There is a growing enthusiasm for \"tea parties\" around the nation, and some Patriot readers have inquired as to whether it is time for a tea party on the Potomac. I am quite sure, however, that if Thomas Jefferson and our other Patriot Founders were with us today, there would not be the smell of tea in the Potomac, but the smell of burnt powder over the Potomac. As Jefferson asserted, \"The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants. It is its natural manure.\" Quote of the week \"Now it doesn't require expropriation or confiscation of private property or business to impose socialism on a people. What does it mean whether you hold the deed ... or the title to your business or property if the government holds the power of life and death over that business or property? And such machinery already exists. The government can find some charge to bring against any concern it chooses to prosecute. Every businessman has his own tale of harassment. Somewhere a perversion has taken place. Our natural, unalienable rights are now considered to be a dispensation of government, and freedom has never been so fragile, so close to slipping from our grasp as it is at this moment.\" --Ronald Reagan Open query \"Are you willing to spend time studying the issues, making yourself aware, and then conveying that information to family and friends? Will you resist the temptation to get a government handout for your community? Realize that the doctor's fight against socialized medicine is your fight. We can't socialize the doctors without socializing the patients. Recognize that government invasion of public power is eventually an assault upon your own business. If some among you fear taking a stand because you are afraid of reprisals from customers, clients, or even government, recognize that you are just feeding the crocodile hoping he'll eat you last.\" --Ronald Reagan This week's 'Alpha Jackass' award \"What I'm looking at is not the day-to-day gyrations of the stock market but the long-term, uh, ability for the United States and the entire world economy, uh, to regain its footing. Uh, and, y-y-you know, the stock market is sort of like a tracking poll in politics. It bobs up and down day to day, uh, and if you spend all your time worrying about that, you're probably going to get long-term strategy wrong. ... What you're now seeing is profit and -- and earning ratios are -- are starting to, to get to the point where buying stocks is a potentially good deal if you've got a long-term perspective on it. Uhhh, I think that consumer confidence, as they see the American, uh, Recovery and Reinvestment Act taking root, uh, businesses are starting to see opportunities for investment, uh, and potential hiring.\" --Barack Obama \"The comparison to daily tracking polls is ... inapt. Whereas those polls serve only a predictive function, stock values (and dividends, which are also plummeting) do measure real wealth. Further, if a candidate's performance in tracking polls had been declining steadily for three months, surely it would be time to change strategy or drop out of the race. A 30% decline is a heck of a fit, and Wall Street hasn't had anything that can be called a start since before Obama's election. ... As for the so-called stimulus as confidence booster, suffice it to note that the Industrial Average closed at 7933 on Feb. 12, the day before Congress passed the bill. [Thursday] it closed at [6594], a decline of [17%] in ... three weeks.\" --The Wall Street Journal's James Taranto", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "", 
        "reply": "Hope and change as promised. From Friday's Federalist Patriot... The collection of comments from credible economists can be found by going to the site and clicking on the link provided. With Barry's help, our economy is circling the drain... Liberty versus Tyranny The primacy of free enterprise By Mark Alexander Now that Barack Hussein Obama and his enablers have enacted the most massive redistribution of wealth in history -- more than four trillion dollars of it, with trillions more yet to come -- just ask yourself: \"Are you better off today than you were in the good old days under George W. Bush?\" Is your home, or your market investment, or your retirement account worth more today than it was last November, when the election of BHO ushered in the era of \"hope 'n' change\"? For some reason, both the housing and equity markets began declining after Democrats regained control of the Senate and House in 2006. Since Obama's election, the bottom has dropped out. We as Americans have not only lost income and jobs, but also some 35 percent of the value of our homes and market/retirement accounts. What happened? I thought the election of Obama and the rush to pass his so-called \"economic stimulus package\" was supposed to restore confidence in the economy and our national leadership? Could it be that some folks were duped into electing a Leftist \"community organizer\" to lead the world's most powerful nation out of its worst economic crisis of confidence in decades? Indeed, this reality is just now sinking into the spongy heads of a growing chorus of Democrats. Could it be, too, that Obama's policies actually have much less to do with economic recovery than with, to use his own words, \"the fundamental transformation of the United States of America\" into a socialist republic? Many distinguished economists have issued loud warnings about the consequences of Obama's socialist policies. They remind us that those policies didn't work for Roosevelt (Obama's model), and they won't restore our economy today -- assuming that economic recovery is actually Obama's objective. For the record, Obama and his Leftist cadres have used the current economic crisis (which they seeded) as cover to implement their socialist \"transformation of the USA\" in under 60 days. So, what will work? Economic liberty, which has always been self-regulating -- free enterprise coupled with limited taxation and regulation, as outlined below. President Ronald Reagan created the most recent template for economic and moral prosperity, outlined in \"A Time for Choosing\" and codified in the 1984 Republican Platform. Inheriting the last great economic crisis in 1981, President Reagan said, \"We who live in free market societies believe that growth, prosperity and ultimately human fulfillment are created from the bottom up, not the government down. Only when the human spirit is allowed to invent and create, only when individuals are given a personal stake in deciding economic policies and benefiting from their success -- only then can societies remain economically alive, dynamic, progressive, and free. ... Only private industry in the last analysis can provide jobs with a future. ... The fact is, we'll never build a lasting economic recovery by going deeper into debt at a faster rate than we ever have before. ... In this present crisis, government is not the solution to our problem; government is the problem.\" Of course, Reagan was quick to admit that his outline was based on the timeless wisdom of those from generations before his. The free-enterprise principles Ronald Reagan advanced are rooted in those espoused by 18th-century moral philosopher and political economist Adam Smith, who is most noted for authoring \"An Inquiry into the Nature and Causes of the Wealth of Nations.\" Smith wrote, \"In a market free from monopolies and self-serving public policies, competition among the self-interests of isolated consumers and producers produces a stable and expanding economy. The self-interested pursuit of wealth may not be individually satisfying but leads to an aggregate increase in wealth that is in the best interests of a nation. ... Great nations are never impoverished by private, though they sometimes are by public prodigality and misconduct.\" Our Founders understood these principles and advanced them into the 19th century. \"The natural progress of things is for liberty to yield and government to gain ground,\" wrote Thomas Jefferson. \"To take from one, because it is thought his own industry and that of his fathers has acquired too much, in order to spare to others, who, or whose fathers, have not exercised equal industry and skill, is to violate arbitrarily the first principle of association, the guarantee to everyone the free exercise of his industry and the fruits acquired by it. ... [A] wise and frugal government ... shall restrain men from injuring one another, shall leave them otherwise free to regulate their own pursuits of industry and improvement, and shall not take from the mouth of labor the bread it has earned. This is the sum of good government.\" \"The essence of Government is power,\" wrote James Madison, \"and power, lodged as it must be in human hands, will ever be liable to abuse. ... Government is instituted to protect property of every sort; as well that which lies in the various rights of individuals, as that which the term particularly expresses. This being the end of government, that alone is a just government, which impartially secures to every man whatever is his own.\" According to John Adams, \"The moment the idea is admitted into society that property is not as sacred as the laws of God, and that there is not a force of law and public justice to protect it, anarchy and tyranny commence. If 'Thou shalt not covet' and 'Thou shalt not steal' were not commandments of Heaven, they must be made inviolable precepts in every society before it can be civilized or made free. ... A Constitution of Government once changed from Freedom, can never be restored. Liberty, once lost, is lost forever.\" In the 20th century, there were three giants among free enterprise economists: Ludwig von Mises, Friedrich August von Hayek and Milton Friedman. Austrian economist and philosopher von Mises (1881-1973) argued, \"All that good government can do to improve the material well-being of the masses is to establish and to preserve an institutional setting in which there are no obstacles to the progressive accumulation of new capital and its utilization for the improvement of technical methods of production. ... The direction of all economic affairs is in the market society a task of the entrepreneurs. Theirs is the control of production. They are at the helm and steer the ship. A superficial observer would believe that they are supreme. But they are not. They are bound to obey unconditionally the captain's orders. The captain is the consumer. ...[Consumers] make poor people rich and rich people poor. They determine precisely what should be produced, in what quality, and in what quantities.\" Classical libertarian and free-market capitalist F.A. von Hayek (1899-1992) wrote, \"Capitalism is not only a better form of organizing human activity than any deliberate design, any attempt to organize it to satisfy particular preferences, to aim at what people regard as beautiful or pleasant order, but it is also the indispensable condition for just keeping that population alive which exists already in the world. I regard the preservation of what is known as the capitalist system, of the system of free markets and the private ownership of the means of production, as an essential condition of the very survival of mankind. ... Perhaps the fact that we have seen millions voting themselves into complete dependence on a tyrant has made our generation understand that to choose one's government is not necessarily to secure freedom. ... Emergencies' have always been the pretext on which the safeguards of individual liberty have been eroded.\" Perhaps the best known economist of the last century was Milton Friedman (1912-2006), who authored \"Free to Choose.\" Friedman, who in 1976 was awarded the Nobel Memorial Prize in Economic Sciences, wrote, \"The Great Depression, like most other periods of severe unemployment, was produced by government mismanagement rather than by any inherent instability of the private economy. ... Roosevelt's policies were very destructive. Roosevelt's policies made the depression longer and worse than it otherwise would have been.\" In regard to socialism, Friedman wrote, \"The society that puts equality before freedom will end up with neither. The society that puts freedom before equality will end up with a great measure of both. ... Underlying most arguments against the free market is a lack of belief in freedom itself. ... We have a system that increasingly taxes work and subsidizes nonwork.\" Of course, there are great free-market economists in our midst today -- notable among them are Thomas Sowell and Walter E. Williams. Of Obama's plans, Sowell writes, \"Socialism in general has a record of failure so blatant that only an intellectual could ignore or evade it. ... It is amazing that people who think we cannot afford to pay for doctors, hospitals, and medication somehow think that we can afford to pay for doctors, hospitals, medication and a government bureaucracy to administer it. ... The first lesson of economics is scarcity: there is never enough of anything to fully satisfy all of those who want it. The first lesson of politics is to disregard the first lesson of economics. ... The welfare state is not really about the welfare of the masses. It is about the egos of the elites.\" Characteristically, Walter Williams cuts to the core: \"Two-thirds of the federal budget consists of taking property from one American and giving it to another. Were a private person to do the same thing, we'd call it theft. When government does it, we euphemistically call it income redistribution, but that's exactly what thieves do -- redistribute income. Income redistribution not only betrays the founders' vision, it's a sin in the eyes of God. ... No human should be coerced by the state to bear the medical expense, or any other expense, for his fellow man. In other words, the forcible use of one person to serve the purposes of another is morally offensive. ... One of the wonderful things about free markets is that the path to greater wealth comes not from looting, plundering and enslaving one's fellow man, as it has throughout most of human history, but by serving and pleasing him.\" So, what is one to conclude about the policies of Obama versus Reagan, and all the Patriots who went before Reagan? Obama's policies have nothing to do with economic recovery, but with growing the size and influence of the central government -- the ultimate objective being to socialize the economy. The residual of free enterprise may well right our economy, in spite of Obama's antics, but the consequences of the current government folly will certainly leave future generations with a greater debt of servitude to our government masters -- short of real \"change.\" So, what constitutes \"real\" change? There is a growing enthusiasm for \"tea parties\" around the nation, and some Patriot readers have inquired as to whether it is time for a tea party on the Potomac. I am quite sure, however, that if Thomas Jefferson and our other Patriot Founders were with us today, there would not be the smell of tea in the Potomac, but the smell of burnt powder over the Potomac. As Jefferson asserted, \"The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants. It is its natural manure.\" Quote of the week \"Now it doesn't require expropriation or confiscation of private property or business to impose socialism on a people. What does it mean whether you hold the deed ... or the title to your business or property if the government holds the power of life and death over that business or property? And such machinery already exists. The government can find some charge to bring against any concern it chooses to prosecute. Every businessman has his own tale of harassment. Somewhere a perversion has taken place. Our natural, unalienable rights are now considered to be a dispensation of government, and freedom has never been so fragile, so close to slipping from our grasp as it is at this moment.\" --Ronald Reagan Open query \"Are you willing to spend time studying the issues, making yourself aware, and then conveying that information to family and friends? Will you resist the temptation to get a government handout for your community? Realize that the doctor's fight against socialized medicine is your fight. We can't socialize the doctors without socializing the patients. Recognize that government invasion of public power is eventually an assault upon your own business. If some among you fear taking a stand because you are afraid of reprisals from customers, clients, or even government, recognize that you are just feeding the crocodile hoping he'll eat you last.\" --Ronald Reagan This week's 'Alpha Jackass' award \"What I'm looking at is not the day-to-day gyrations of the stock market but the long-term, uh, ability for the United States and the entire world economy, uh, to regain its footing. Uh, and, y-y-you know, the stock market is sort of like a tracking poll in politics. It bobs up and down day to day, uh, and if you spend all your time worrying about that, you're probably going to get long-term strategy wrong. ... What you're now seeing is profit and -- and earning ratios are -- are starting to, to get to the point where buying stocks is a potentially good deal if you've got a long-term perspective on it. Uhhh, I think that consumer confidence, as they see the American, uh, Recovery and Reinvestment Act taking root, uh, businesses are starting to see opportunities for investment, uh, and potential hiring.\" --Barack Obama \"The comparison to daily tracking polls is ... inapt. Whereas those polls serve only a predictive function, stock values (and dividends, which are also plummeting) do measure real wealth. Further, if a candidate's performance in tracking polls had been declining steadily for three months, surely it would be time to change strategy or drop out of the race. A 30% decline is a heck of a fit, and Wall Street hasn't had anything that can be called a start since before Obama's election. ... As for the so-called stimulus as confidence booster, suffice it to note that the Industrial Average closed at 7933 on Feb. 12, the day before Congress passed the bill. [Thursday] it closed at [6594], a decline of [17%] in ... three weeks.\" --The Wall Street Journal's James Taranto", 
        "threadID": "409192893_3930023712001", 
        "time": "2009-03-09 06:23:00", 
        "title": "Obama's Anti-Stimulus Plan", 
        "userID": "Mom2APAJ"
    }
]