[
    {
        "content": "1. are they under the umbrella of the constitution? 2. if they are, can they be held without being charged?? 3. when and if they step foot on us soil what will change. will the aclu have orgasims? i can see \"let em go bunch\" warming up in the wings i dont think obama has a clue, so he builds a new prison and it is a supermax whats the difference. i knew a guy in marion and he only got one hour a day outside the rest of the time it was 23 hours in a locked cell. think these guys are unhappy now, with all the good chow, soccer, exercise yard, only have inmates of same belief... this will shock their patooties off.. so i have no idea to the answers what will happen??", 
        "intTime": 20090525, 
        "postID": 1, 
        "quote": "", 
        "reply": "1. are they under the umbrella of the constitution? 2. if they are, can they be held without being charged?? 3. when and if they step foot on us soil what will change. will the aclu have orgasims? i can see \"let em go bunch\" warming up in the wings i dont think obama has a clue, so he builds a new prison and it is a supermax whats the difference. i knew a guy in marion and he only got one hour a day outside the rest of the time it was 23 hours in a locked cell. think these guys are unhappy now, with all the good chow, soccer, exercise yard, only have inmates of same belief... this will shock their patooties off.. so i have no idea to the answers what will happen??", 
        "threadID": "409192893_9670042422001", 
        "time": "2009-05-25 15:40:00", 
        "title": "Gitmo bubbas, okay they come to the usa", 
        "userID": "Ira1945"
    }, 
    {
        "content": "The difference is that the very negative stigma of lawlessness and the ends justifies the means that was created by the last administration in demonstrating that they felt that America is above our own Constitution, laws, and treaties will be removed by the closing. If that were not the case, then it would be possible to just hold and try them where they are, but Dubya and the far-right have made that impossible. The only way the rest of the world, and that includes our staunchest allies, will accept that we are a just and law abiding nation is for Gitmo to close and those held there given an open and fair trial on US soil in accordance with the Constitution, our laws, and our treaties.", 
        "intTime": 20090525, 
        "postID": 2, 
        "quote": "", 
        "reply": "The difference is that the very negative stigma of lawlessness and the ends justifies the means that was created by the last administration in demonstrating that they felt that America is above our own Constitution, laws, and treaties will be removed by the closing. If that were not the case, then it would be possible to just hold and try them where they are, but Dubya and the far-right have made that impossible. The only way the rest of the world, and that includes our staunchest allies, will accept that we are a just and law abiding nation is for Gitmo to close and those held there given an open and fair trial on US soil in accordance with the Constitution, our laws, and our treaties.", 
        "threadID": "409192893_9670042422001", 
        "time": "2009-05-25 15:57:00", 
        "title": "Gitmo bubbas, okay they come to the usa", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: 2. if they are, can they be held without being charged?? what will happen?? President Obama has said he is unsure of the fate of some of the prisoners. He is trying to figure it out for the long term. \"Finally, there remains the question of detainees at Guantánamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantánamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture — like other prisoners of war — must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified. I know that creating such a system poses unique challenges. Other countries have grappled with this question, and so must we. But I want to be very clear that our goal is to construct a legitimate legal framework for Guantánamo detainees — not to avoid one. In our constitutional system, prolonged detention should not be the decision of any one man. If and when we determine that the United States must hold individuals to keep them from carrying out an act of war, we will do so within a system that involves judicial and congressional oversight. And so going forward, my Administration will work with Congress to develop an appropriate legal regime so that our efforts are consistent with our values and our Constitution.\"", 
        "intTime": 20090525, 
        "postID": 3, 
        "quote": "Originally posted by Ira1945: 2. if they are, can they be held without being charged?? what will happen??", 
        "reply": " President Obama has said he is unsure of the fate of some of the prisoners. He is trying to figure it out for the long term. \"Finally, there remains the question of detainees at Guantánamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantánamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture — like other prisoners of war — must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified. I know that creating such a system poses unique challenges. Other countries have grappled with this question, and so must we. But I want to be very clear that our goal is to construct a legitimate legal framework for Guantánamo detainees — not to avoid one. In our constitutional system, prolonged detention should not be the decision of any one man. If and when we determine that the United States must hold individuals to keep them from carrying out an act of war, we will do so within a system that involves judicial and congressional oversight. And so going forward, my Administration will work with Congress to develop an appropriate legal regime so that our efforts are consistent with our values and our Constitution.\"", 
        "threadID": "409192893_9670042422001", 
        "time": "2009-05-25 16:52:00", 
        "title": "Gitmo bubbas, okay they come to the usa", 
        "userID": "xerello"
    }, 
    {
        "content": "There certainly are some people in that group that need to go to trial and be sent away or executed. There are others that were in the wrong place at the wrong time, and others that are nothing more than dirt farmers that took up arms against what they saw as an invader. The last administration made a mistake but just not classifying them as POWs, and setting up tribunals to determine which of them are unlawful combatants and could face war crimes or terrorism charges. The others if classified as POWs could legally be held until the end of hostilities and that could be a very long time. They were not classified as anything, and very few every faced courts to determine what if any crime they are may have done. Some of the prisoners are not even remote threats, like the 17 Uyghers that have been held there. Terrorists should be punished, but holding people for over 7 years without trial is wrong.", 
        "intTime": 20090525, 
        "postID": 4, 
        "quote": "", 
        "reply": "There certainly are some people in that group that need to go to trial and be sent away or executed. There are others that were in the wrong place at the wrong time, and others that are nothing more than dirt farmers that took up arms against what they saw as an invader. The last administration made a mistake but just not classifying them as POWs, and setting up tribunals to determine which of them are unlawful combatants and could face war crimes or terrorism charges. The others if classified as POWs could legally be held until the end of hostilities and that could be a very long time. They were not classified as anything, and very few every faced courts to determine what if any crime they are may have done. Some of the prisoners are not even remote threats, like the 17 Uyghers that have been held there. Terrorists should be punished, but holding people for over 7 years without trial is wrong.", 
        "threadID": "409192893_9670042422001", 
        "time": "2009-05-25 17:43:00", 
        "title": "Gitmo bubbas, okay they come to the usa", 
        "userID": "nspreitler"
    }
]