[
    {
        "content": "quote: Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in. Fannie and Freddie own or insure 73% of mortgages in the US. If they need to pay bonuses to retain the best people they can to manage all of it then retention bonuses seems like a good idea.", 
        "intTime": 20090403, 
        "postID": 1, 
        "quote": "Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in.", 
        "reply": " Fannie and Freddie own or insure 73% of mortgages in the US. If they need to pay bonuses to retain the best people they can to manage all of it then retention bonuses seems like a good idea.", 
        "threadID": "409192893_5050077912001", 
        "time": "2009-04-03 17:36:00", 
        "title": "Fannie, Freddie worker bonuses total $210M", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in. Gotta agree with you 100% on this one. This is highly questionable. For those lower down the totem pole who depend on bonuses for a large part of their total compensation, if they in their restricted offices have objectively performed well, I can buy those restricted payouts. Further up the line, not a penny.", 
        "intTime": 20090403, 
        "postID": 2, 
        "quote": "Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in.", 
        "reply": " Gotta agree with you 100% on this one. This is highly questionable. For those lower down the totem pole who depend on bonuses for a large part of their total compensation, if they in their restricted offices have objectively performed well, I can buy those restricted payouts. Further up the line, not a penny.", 
        "threadID": "409192893_5050077912001", 
        "time": "2009-04-03 18:07:00", 
        "title": "Fannie, Freddie worker bonuses total $210M", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in. Fannie and Freddie own or insure 73% of mortgages in the US. If they need to pay bonuses to retain the best people they can to manage all of it then retention bonuses seems like a good idea. Your statement assumes that they hired the best people in the first place, a sentiment hardly supported by the facts.", 
        "intTime": 20090403, 
        "postID": 3, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in. Fannie and Freddie own or insure 73% of mortgages in the US. If they need to pay bonuses to retain the best people they can to manage all of it then retention bonuses seems like a good idea.", 
        "reply": " Your statement assumes that they hired the best people in the first place, a sentiment hardly supported by the facts.", 
        "threadID": "409192893_5050077912001", 
        "time": "2009-04-03 18:42:00", 
        "title": "Fannie, Freddie worker bonuses total $210M", 
        "userID": "adminnco1"
    }, 
    {
        "content": "This is one of those rare occasions I agree with ya Dave.", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "", 
        "reply": "This is one of those rare occasions I agree with ya Dave.", 
        "threadID": "409192893_5050077912001", 
        "time": "2009-04-04 05:23:00", 
        "title": "Fannie, Freddie worker bonuses total $210M", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in. Bonuses paid to motivate folks to stay on their six-figure jobs?? Ya would think that the unemployment figures would be motivation enough. We need to find a way to stop this feeling of entitlement from these folks...starting by telling them to forget any bonuses and encouraging them go ahead and drag-up and go find another job if they don't like it.", 
        "intTime": 20090404, 
        "postID": 5, 
        "quote": "Originally posted by dmuhler: Retention bonuses? WTF???? They collectively lost how much??? And where exactly are they going to go? To AIG? What a sick and troubled country we live in.", 
        "reply": " Bonuses paid to motivate folks to stay on their six-figure jobs?? Ya would think that the unemployment figures would be motivation enough. We need to find a way to stop this feeling of entitlement from these folks...starting by telling them to forget any bonuses and encouraging them go ahead and drag-up and go find another job if they don't like it.", 
        "threadID": "409192893_5050077912001", 
        "time": "2009-04-04 07:57:00", 
        "title": "Fannie, Freddie worker bonuses total $210M", 
        "userID": "skinman13"
    }, 
    {
        "content": "They earned every penny of it. It's hard work causing world economic collapse. If the stupid tax payers earned enough to pay taxes then they deserve to pay those bonuses.", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "", 
        "reply": "They earned every penny of it. It's hard work causing world economic collapse. If the stupid tax payers earned enough to pay taxes then they deserve to pay those bonuses.", 
        "threadID": "409192893_5050077912001", 
        "time": "2009-04-04 11:52:00", 
        "title": "Fannie, Freddie worker bonuses total $210M", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "No prob... just tax the bonuses at 90% federal and 10% state, threaten to turntheir private info over to the public if they don't giveit back voluntarily, and if that don't work, duct tape 'em to chairs in Greenwhich and make them watch Yentl until their brains melt.", 
        "intTime": 20090404, 
        "postID": 7, 
        "quote": "", 
        "reply": "No prob... just tax the bonuses at 90% federal and 10% state, threaten to turntheir private info over to the public if they don't giveit back voluntarily, and if that don't work, duct tape 'em to chairs in Greenwhich and make them watch Yentl until their brains melt.", 
        "threadID": "409192893_5050077912001", 
        "time": "2009-04-04 14:17:00", 
        "title": "Fannie, Freddie worker bonuses total $210M", 
        "userID": "godawgz"
    }
]