[
    {
        "content": "With the Leahy Truth Commission coming to life and other Bush-era accountability projects catching on, the future of Bush officials depends on the firewall built in the minds of the American public. Who cares what you do to a bunch of terrorists who slaughtered 3000 people in cold blood? Bring the ones that died during torture back to life and do it again. The problem is more people watch \"24\" than read the newspaper. Leave the implication intact that the prisoners in Gitmo and Baghram were the \"worst of the worst,\" and Bush officials will survive these inquiries. Start telling the ugly truth that a huge number of these men were completely innocent, caught in the wrong place at the wrong time, and it could be Houston, we've got a problem. So here is some stuff for Senator Leahy to read so he can bring it up in his \"truth\" commission. Leahy understands the firewall, so all eyes should be on how he handles the innocence factor. On TV, Jack Bauer was the Bush worldview incarnated into a handsome Hollywood actor. Will they show the Last Episode? The one with the room full of broken men and broken bodies who turned out to be, uh, the wrong guys? Consider the story of Mohammed Akhtiar, in McClatchy's \"America's prison for terrorists often held the wrong men\": quote: Akhtiar was among the more than 770 terrorism suspects imprisoned at the U.S. naval base at Guantanamo Bay, Cuba, after the Sept. 11, 2001, terrorist attacks. They are the men the Bush administration described as \"the worst of the worst.\"...The Islamic radicals in Guantanamo's Camp Four who hissed \"infidel\" and spat at Akhtiar, however, knew something his captors didn't: The U.S. government had the wrong guy. \"He was not an enemy of the government, he was a friend of the government,\" a senior Afghan intelligence officer told McClatchy. Akhtiar was imprisoned at Guantanamo on the basis of false information that local anti-government insurgents fed to U.S. troops, he said. It is vitally important to remember that isn't about individual soldiers. It's not about pinning anything on guys who think they are just doing their jobs. This is about widespread, systematic abuse, and who gave the license to allow it to happen: the Bush administration. Senator Leahy, please read this New York Times report about the taxi driver who did the dumb thing of driving past Baghram air base with two paying fares a few days after a rocket attack: quote: The prisoner, a slight, 22-year-old taxi driver known only as Dilawar, was hauled from his cell at the detention center in Bagram, Afghanistan, at around 2 a.m. to answer questions about a rocket attack on an American base. When he arrived in the interrogation room, an interpreter who was present said, his legs were bouncing uncontrollably in the plastic chair and his hands were numb. He had been chained by the wrists to the top of his cell for much of the previous four days. Mr. Dilawar asked for a drink of water, and one of the two interrogators, Specialist Joshua R. Claus, 21, picked up a large plastic bottle. But first he punched a hole in the bottom, the interpreter said, so as the prisoner fumbled weakly with the cap, the water poured out over his orange prison scrubs. The soldier then grabbed the bottle back and began squirting the water forcefully into Mr. Dilawar's face. \"Come on, drink!\" the interpreter said Specialist Claus had shouted, as the prisoner gagged on the spray. \"Drink!\" The National Journal has done an excellent report which lays bare the kind of evidential standards which would land you in Gitmo, Baghram, or Abu Grahib. Mohammed al-Tumani, a prisoner at Gitmo, had an American representative who began looking into his case: quote: Tumani's enterprising representative looked at the classified evidence against the [Tumani] and found that just one man -- the aforementioned accuser -- had placed Tumani at the terrorist training camp. And he had placed Tumani there three months before the teenager had even entered Afghanistan. The curious U.S. officer pulled the classified file of the accuser, saw that he had accused 60 men, and, suddenly skeptical, pulled the files of every detainee the accuser had placed at the one training camp. None of the men had been in Afghanistan at the time the accuser said he saw them at the camp. The tribunal declared Tumani an enemy combatant anyway. The McClatchy report affirms what most people already knew by 2002: quote: The majority of the detainees taken to Guantanamo came into U.S. custody indirectly, from Afghan troops, warlords, mercenaries and Pakistani police who often were paid cash by the number and alleged importance of the men they handed over. Last, Mr. Leahy, make sure you get out the full truth of what we, yes, we, you, me, the United States, was doing to these innocent men. The Justice Jackson Center is preparing a criminal complaint against Bush officials, which in a way competes with your Truth Commission, which alleges: quote: · Savage Beatings. Prisoners were severely and regularly beaten with clubs, rifles and fists. They were beaten to the point that bones were broken, ribs were fractured, and prisoners sometimes were killed. · Peroneal Strikes. Peroneal strikes are a specific form of savage beating, consisting of blows to the soft tissue and nerves just above the knee. The falsely accused prisoner beaten to death at Bagram had been given so many peroneal strikes that a coroner testified that his leg tissue had `\"basically been pulpified.'\" · Hanging By The Arms. A highly excruciating \"stress position\" torture used on many prisoners, sometimes every day for two to three months, is hanging them by their arms, often or usually on tiptoe. · Slamming A Prisoner's Head Into Concrete Walls. In this torture a towel is wrapped around a prisoner's neck and is then used to propel the prisoner head first into a concrete wall. This torture was so fraught with risk of serious injury to or death of a prisoner that the CIA kept a doctor on hand at all times to guard against death or crippling injury. · Additional \"Stress Positions\" And Electric Shocks. \"Palestinian hangings,\" they were hung by the arms with their feet on a drum through which electric shocks were applied to their feet; the shocks would cause the feet to \"dance.\" The world is watching, Mr. Leahy. Will you dare remind folks that men we did this to had done nothing to us? Or will you stay this side of the Jack Bauer political firewall? This is important. You see, because the dirty little secret of Bush's conduct of the War on Terror is that Jack had the wrong guys all along. McClatchy report \"\"http://www.mcclatchydc.com/detainees/story/38773.html FORWARD TO Senator Pat Leahy's email: senator_leahy@leahy.senate.gov", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "Akhtiar was among the more than 770 terrorism suspects imprisoned at the U.S. naval base at Guantanamo Bay, Cuba, after the Sept. 11, 2001, terrorist attacks. They are the men the Bush administration described as \"the worst of the worst.\"...The Islamic radicals in Guantanamo's Camp Four who hissed \"infidel\" and spat at Akhtiar, however, knew something his captors didn't: The U.S. government had the wrong guy. \"He was not an enemy of the government, he was a friend of the government,\" a senior Afghan intelligence officer told McClatchy. Akhtiar was imprisoned at Guantanamo on the basis of false information that local anti-government insurgents fed to U.S. troops, he said.", 
        "reply": "With the Leahy Truth Commission coming to life and other Bush-era accountability projects catching on, the future of Bush officials depends on the firewall built in the minds of the American public. Who cares what you do to a bunch of terrorists who slaughtered 3000 people in cold blood? Bring the ones that died during torture back to life and do it again. The problem is more people watch \"24\" than read the newspaper. Leave the implication intact that the prisoners in Gitmo and Baghram were the \"worst of the worst,\" and Bush officials will survive these inquiries. Start telling the ugly truth that a huge number of these men were completely innocent, caught in the wrong place at the wrong time, and it could be Houston, we've got a problem. So here is some stuff for Senator Leahy to read so he can bring it up in his \"truth\" commission. Leahy understands the firewall, so all eyes should be on how he handles the innocence factor. On TV, Jack Bauer was the Bush worldview incarnated into a handsome Hollywood actor. Will they show the Last Episode? The one with the room full of broken men and broken bodies who turned out to be, uh, the wrong guys? Consider the story of Mohammed Akhtiar, in McClatchy's \"America's prison for terrorists often held the wrong men\":  It is vitally important to remember that isn't about individual soldiers. It's not about pinning anything on guys who think they are just doing their jobs. This is about widespread, systematic abuse, and who gave the license to allow it to happen: the Bush administration. Senator Leahy, please read this New York Times report about the taxi driver who did the dumb thing of driving past Baghram air base with two paying fares a few days after a rocket attack: quote: The prisoner, a slight, 22-year-old taxi driver known only as Dilawar, was hauled from his cell at the detention center in Bagram, Afghanistan, at around 2 a.m. to answer questions about a rocket attack on an American base. When he arrived in the interrogation room, an interpreter who was present said, his legs were bouncing uncontrollably in the plastic chair and his hands were numb. He had been chained by the wrists to the top of his cell for much of the previous four days. Mr. Dilawar asked for a drink of water, and one of the two interrogators, Specialist Joshua R. Claus, 21, picked up a large plastic bottle. But first he punched a hole in the bottom, the interpreter said, so as the prisoner fumbled weakly with the cap, the water poured out over his orange prison scrubs. The soldier then grabbed the bottle back and began squirting the water forcefully into Mr. Dilawar's face. \"Come on, drink!\" the interpreter said Specialist Claus had shouted, as the prisoner gagged on the spray. \"Drink!\" The National Journal has done an excellent report which lays bare the kind of evidential standards which would land you in Gitmo, Baghram, or Abu Grahib. Mohammed al-Tumani, a prisoner at Gitmo, had an American representative who began looking into his case: quote: Tumani's enterprising representative looked at the classified evidence against the [Tumani] and found that just one man -- the aforementioned accuser -- had placed Tumani at the terrorist training camp. And he had placed Tumani there three months before the teenager had even entered Afghanistan. The curious U.S. officer pulled the classified file of the accuser, saw that he had accused 60 men, and, suddenly skeptical, pulled the files of every detainee the accuser had placed at the one training camp. None of the men had been in Afghanistan at the time the accuser said he saw them at the camp. The tribunal declared Tumani an enemy combatant anyway. The McClatchy report affirms what most people already knew by 2002: quote: The majority of the detainees taken to Guantanamo came into U.S. custody indirectly, from Afghan troops, warlords, mercenaries and Pakistani police who often were paid cash by the number and alleged importance of the men they handed over. Last, Mr. Leahy, make sure you get out the full truth of what we, yes, we, you, me, the United States, was doing to these innocent men. The Justice Jackson Center is preparing a criminal complaint against Bush officials, which in a way competes with your Truth Commission, which alleges: quote: · Savage Beatings. Prisoners were severely and regularly beaten with clubs, rifles and fists. They were beaten to the point that bones were broken, ribs were fractured, and prisoners sometimes were killed. · Peroneal Strikes. Peroneal strikes are a specific form of savage beating, consisting of blows to the soft tissue and nerves just above the knee. The falsely accused prisoner beaten to death at Bagram had been given so many peroneal strikes that a coroner testified that his leg tissue had `\"basically been pulpified.'\" · Hanging By The Arms. A highly excruciating \"stress position\" torture used on many prisoners, sometimes every day for two to three months, is hanging them by their arms, often or usually on tiptoe. · Slamming A Prisoner's Head Into Concrete Walls. In this torture a towel is wrapped around a prisoner's neck and is then used to propel the prisoner head first into a concrete wall. This torture was so fraught with risk of serious injury to or death of a prisoner that the CIA kept a doctor on hand at all times to guard against death or crippling injury. · Additional \"Stress Positions\" And Electric Shocks. \"Palestinian hangings,\" they were hung by the arms with their feet on a drum through which electric shocks were applied to their feet; the shocks would cause the feet to \"dance.\" The world is watching, Mr. Leahy. Will you dare remind folks that men we did this to had done nothing to us? Or will you stay this side of the Jack Bauer political firewall? This is important. You see, because the dirty little secret of Bush's conduct of the War on Terror is that Jack had the wrong guys all along. McClatchy report \"\"http://www.mcclatchydc.com/detainees/story/38773.html FORWARD TO Senator Pat Leahy's email: senator_leahy@leahy.senate.gov", 
        "threadID": "409192893_4960030712001", 
        "time": "2009-03-05 16:38:00", 
        "title": "Senator Leahy? Tell the \"Truth\", Jack Bauer Tortured the Wrong Guys", 
        "userID": "WitchitaKid"
    }
]