[
    {
        "content": "Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "", 
        "reply": "Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 06:50:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }, 
    {
        "content": "That was probably the only time I have ever watched anything from that show...and I am glad I did.", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "", 
        "reply": "That was probably the only time I have ever watched anything from that show...and I am glad I did.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 07:02:00", 
        "title": "Susan Boyle", 
        "userID": "ACR26"
    }, 
    {
        "content": "It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing.", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "", 
        "reply": "It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 11:56:00", 
        "title": "Susan Boyle", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing. Well Paratroopers don't cry. Something must have gotten in my eye. Yeah, that's it...", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "Originally posted by Whirled_Peas: It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing.", 
        "reply": " Well Paratroopers don't cry. Something must have gotten in my eye. Yeah, that's it...", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 13:24:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }, 
    {
        "content": "While two old sayings come to mind (Beauty is in the eye of the beholder and One should NEVER judge the contents of a book by its cover)... Ray Stephens' Song: \"Everything Is Beautiful\"...should be the theme of this topic.", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "", 
        "reply": "While two old sayings come to mind (Beauty is in the eye of the beholder and One should NEVER judge the contents of a book by its cover)... Ray Stephens' Song: \"Everything Is Beautiful\"...should be the theme of this topic.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 19:35:00", 
        "title": "Susan Boyle", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Shouldn't this be in \"In The News\". No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "Originally posted by klassylady25: Shouldn't this be in \"In The News\".", 
        "reply": " No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 19:59:00", 
        "title": "Susan Boyle", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY I just loved the look on everyones faces when she started singing. Priceless.", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "Originally posted by Thud357L: Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "reply": " I just loved the look on everyones faces when she started singing. Priceless.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 20:38:00", 
        "title": "Susan Boyle", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Damn...it made me cry!", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "", 
        "reply": "Damn...it made me cry!", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 06:08:00", 
        "title": "Susan Boyle", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I'm going to bump this thread ... \"stunning\", for want of a better word, works for me ...", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "I'm going to bump this thread ... \"stunning\", for want of a better word, works for me ...", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 09:14:00", 
        "title": "Susan Boyle", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "when its right its right.... all i can say is wow", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "", 
        "reply": "when its right its right.... all i can say is wow", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 11:15:00", 
        "title": "Susan Boyle", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Jaw-droppingly brilliant! Not unlike the postman from a year or two ago who stunned everybody (in the UK) with his operatic ability. Don't judge books ... indeed!", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "", 
        "reply": "Jaw-droppingly brilliant! Not unlike the postman from a year or two ago who stunned everybody (in the UK) with his operatic ability. Don't judge books ... indeed!", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 11:22:00", 
        "title": "Susan Boyle", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by klassylady25: Shouldn't this be in \"In The News\". No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look Not at all. By any standard this is a performance that we all can agree was inspirational. As she is a Scot, would it not be a Labor/Tory argument?", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "Originally posted by Boots_: quote: Originally posted by klassylady25: Shouldn't this be in \"In The News\". No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look", 
        "reply": " Not at all. By any standard this is a performance that we all can agree was inspirational. As she is a Scot, would it not be a Labor/Tory argument?", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 12:40:00", 
        "title": "Susan Boyle", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Someone said that she had a hard early life. She was abused as an infant, and learned to sing at Church. I don't know if anyone knows that for a fact.", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "", 
        "reply": "Someone said that she had a hard early life. She was abused as an infant, and learned to sing at Church. I don't know if anyone knows that for a fact.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 16:55:00", 
        "title": "Susan Boyle", 
        "userID": "Opalfire"
    }, 
    {
        "content": "Even though i posted this on In The News, this link is far better than the YouTube copies from ITV. This one covers her entire 7 minute performance... And Man is she terrific Entertainment magazine Online >>http://www.eonline.com/uberblog/marc_malkin/b119045_susan_boyle_simon_cowell-endorsed.html?utm_source=eonline&utm_medium=rssfeeds&utm_campaign=rss_topstories<<", 
        "intTime": 20090417, 
        "postID": 14, 
        "quote": "", 
        "reply": "Even though i posted this on In The News, this link is far better than the YouTube copies from ITV. This one covers her entire 7 minute performance... And Man is she terrific Entertainment magazine Online >>http://www.eonline.com/uberblog/marc_malkin/b119045_susan_boyle_simon_cowell-endorsed.html?utm_source=eonline&utm_medium=rssfeeds&utm_campaign=rss_topstories<<", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 14:28:00", 
        "title": "Susan Boyle", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=9lp0IWv8QZY Definitly qualifies as the one of the biggest FUs in history of TV. Now Simon, stick that in your pipe and smoke it...", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "reply": " Definitly qualifies as the one of the biggest FUs in history of TV. Now Simon, stick that in your pipe and smoke it...", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:11:00", 
        "title": "Susan Boyle", 
        "userID": "akaironhorse"
    }, 
    {
        "content": "She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "", 
        "reply": "She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:14:00", 
        "title": "Susan Boyle", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I.", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "reply": " Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:22:00", 
        "title": "Susan Boyle", 
        "userID": "akaironhorse"
    }, 
    {
        "content": "quote: Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I. Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption.", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I.", 
        "reply": " Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:30:00", 
        "title": "Susan Boyle", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot.", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "reply": " I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:04:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I. Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption. Well if yours is anything like mine, I can see the headlines now, Now showing, live on Broadway, \"Two Cranky ol'Cats on a Hot Tin Roof\" 2 showings daily, hearing protection supplied with paid addmission.", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "Originally posted by stillkit: quote: Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I. Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption.", 
        "reply": " Well if yours is anything like mine, I can see the headlines now, Now showing, live on Broadway, \"Two Cranky ol'Cats on a Hot Tin Roof\" 2 showings daily, hearing protection supplied with paid addmission.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:28:00", 
        "title": "Susan Boyle", 
        "userID": "akaironhorse"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot. The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal.", 
        "intTime": 20090417, 
        "postID": 21, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot.", 
        "reply": " The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:31:00", 
        "title": "Susan Boyle", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot. The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal. I think that her looks and attitude are part of her appeal. She's gonna make some money. But I gotta admit that although she does a beautiful rendition of \"Cry Me A River\", I'd rather close my eyes and pretend she looks like Julie London for that particular song. However, her choice of material for the audition was perfect.", 
        "intTime": 20090417, 
        "postID": 22, 
        "quote": "Originally posted by stillkit: quote: Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot. The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal.", 
        "reply": " I think that her looks and attitude are part of her appeal. She's gonna make some money. But I gotta admit that although she does a beautiful rendition of \"Cry Me A River\", I'd rather close my eyes and pretend she looks like Julie London for that particular song. However, her choice of material for the audition was perfect.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:48:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "intTime": 20090415, 
        "postID": 23, 
        "quote": "", 
        "reply": "Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 06:50:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }, 
    {
        "content": "That was probably the only time I have ever watched anything from that show...and I am glad I did.", 
        "intTime": 20090415, 
        "postID": 24, 
        "quote": "", 
        "reply": "That was probably the only time I have ever watched anything from that show...and I am glad I did.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 07:02:00", 
        "title": "Susan Boyle", 
        "userID": "ACR26"
    }, 
    {
        "content": "It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing.", 
        "intTime": 20090415, 
        "postID": 25, 
        "quote": "", 
        "reply": "It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 11:56:00", 
        "title": "Susan Boyle", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing. Well Paratroopers don't cry. Something must have gotten in my eye. Yeah, that's it...", 
        "intTime": 20090415, 
        "postID": 26, 
        "quote": "Originally posted by Whirled_Peas: It was an absolutely amazing performance. Such an amazing voice. Such an amazing story. I had tears in my eyes listening to her sing.", 
        "reply": " Well Paratroopers don't cry. Something must have gotten in my eye. Yeah, that's it...", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 13:24:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }, 
    {
        "content": "While two old sayings come to mind (Beauty is in the eye of the beholder and One should NEVER judge the contents of a book by its cover)... Ray Stephens' Song: \"Everything Is Beautiful\"...should be the theme of this topic.", 
        "intTime": 20090415, 
        "postID": 27, 
        "quote": "", 
        "reply": "While two old sayings come to mind (Beauty is in the eye of the beholder and One should NEVER judge the contents of a book by its cover)... Ray Stephens' Song: \"Everything Is Beautiful\"...should be the theme of this topic.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 19:35:00", 
        "title": "Susan Boyle", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Shouldn't this be in \"In The News\". No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look", 
        "intTime": 20090415, 
        "postID": 28, 
        "quote": "Originally posted by klassylady25: Shouldn't this be in \"In The News\".", 
        "reply": " No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 19:59:00", 
        "title": "Susan Boyle", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY I just loved the look on everyones faces when she started singing. Priceless.", 
        "intTime": 20090415, 
        "postID": 29, 
        "quote": "Originally posted by Thud357L: Ever heard of Susan Boyle? Me neither. How dangerous and wrong superficial judgment can be. If this doesn't make you want to stand up a cheer, you have a paper soul. >http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "reply": " I just loved the look on everyones faces when she started singing. Priceless.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-15 20:38:00", 
        "title": "Susan Boyle", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Damn...it made me cry!", 
        "intTime": 20090416, 
        "postID": 30, 
        "quote": "", 
        "reply": "Damn...it made me cry!", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 06:08:00", 
        "title": "Susan Boyle", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I'm going to bump this thread ... \"stunning\", for want of a better word, works for me ...", 
        "intTime": 20090416, 
        "postID": 31, 
        "quote": "", 
        "reply": "I'm going to bump this thread ... \"stunning\", for want of a better word, works for me ...", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 09:14:00", 
        "title": "Susan Boyle", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "when its right its right.... all i can say is wow", 
        "intTime": 20090416, 
        "postID": 32, 
        "quote": "", 
        "reply": "when its right its right.... all i can say is wow", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 11:15:00", 
        "title": "Susan Boyle", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Jaw-droppingly brilliant! Not unlike the postman from a year or two ago who stunned everybody (in the UK) with his operatic ability. Don't judge books ... indeed!", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "", 
        "reply": "Jaw-droppingly brilliant! Not unlike the postman from a year or two ago who stunned everybody (in the UK) with his operatic ability. Don't judge books ... indeed!", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 11:22:00", 
        "title": "Susan Boyle", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by klassylady25: Shouldn't this be in \"In The News\". No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look Not at all. By any standard this is a performance that we all can agree was inspirational. As she is a Scot, would it not be a Labor/Tory argument?", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "Originally posted by Boots_: quote: Originally posted by klassylady25: Shouldn't this be in \"In The News\". No. Somewhere in this, we'll find a liberal vs conservative / Democrat vs Republican / Obama vs Bush angle. We just have to look", 
        "reply": " Not at all. By any standard this is a performance that we all can agree was inspirational. As she is a Scot, would it not be a Labor/Tory argument?", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 12:40:00", 
        "title": "Susan Boyle", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Someone said that she had a hard early life. She was abused as an infant, and learned to sing at Church. I don't know if anyone knows that for a fact.", 
        "intTime": 20090416, 
        "postID": 35, 
        "quote": "", 
        "reply": "Someone said that she had a hard early life. She was abused as an infant, and learned to sing at Church. I don't know if anyone knows that for a fact.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-16 16:55:00", 
        "title": "Susan Boyle", 
        "userID": "Opalfire"
    }, 
    {
        "content": "Even though i posted this on In The News, this link is far better than the YouTube copies from ITV. This one covers her entire 7 minute performance... And Man is she terrific Entertainment magazine Online >>http://www.eonline.com/uberblog/marc_malkin/b119045_susan_boyle_simon_cowell-endorsed.html?utm_source=eonline&utm_medium=rssfeeds&utm_campaign=rss_topstories<<", 
        "intTime": 20090417, 
        "postID": 36, 
        "quote": "", 
        "reply": "Even though i posted this on In The News, this link is far better than the YouTube copies from ITV. This one covers her entire 7 minute performance... And Man is she terrific Entertainment magazine Online >>http://www.eonline.com/uberblog/marc_malkin/b119045_susan_boyle_simon_cowell-endorsed.html?utm_source=eonline&utm_medium=rssfeeds&utm_campaign=rss_topstories<<", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 14:28:00", 
        "title": "Susan Boyle", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=9lp0IWv8QZY Definitly qualifies as the one of the biggest FUs in history of TV. Now Simon, stick that in your pipe and smoke it...", 
        "intTime": 20090417, 
        "postID": 37, 
        "quote": "http://www.youtube.com/watch?v=9lp0IWv8QZY", 
        "reply": " Definitly qualifies as the one of the biggest FUs in history of TV. Now Simon, stick that in your pipe and smoke it...", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:11:00", 
        "title": "Susan Boyle", 
        "userID": "akaironhorse"
    }, 
    {
        "content": "She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "intTime": 20090417, 
        "postID": 38, 
        "quote": "", 
        "reply": "She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:14:00", 
        "title": "Susan Boyle", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I.", 
        "intTime": 20090417, 
        "postID": 39, 
        "quote": "Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "reply": " Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:22:00", 
        "title": "Susan Boyle", 
        "userID": "akaironhorse"
    }, 
    {
        "content": "quote: Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I. Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption.", 
        "intTime": 20090417, 
        "postID": 40, 
        "quote": "Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I.", 
        "reply": " Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 15:30:00", 
        "title": "Susan Boyle", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot.", 
        "intTime": 20090417, 
        "postID": 41, 
        "quote": "Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it.", 
        "reply": " I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:04:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I. Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption. Well if yours is anything like mine, I can see the headlines now, Now showing, live on Broadway, \"Two Cranky ol'Cats on a Hot Tin Roof\" 2 showings daily, hearing protection supplied with paid addmission.", 
        "intTime": 20090417, 
        "postID": 42, 
        "quote": "Originally posted by stillkit: quote: Originally posted by akaironhorse: Not so fast Still, it appears that Simon may be stepping up and offering her a recording contract wether she wins or loses. Granted she may not go far in the music business but she will go a lot further than u or I. Well! You may be right and I may be wrong! But, that's only because I never pursued a career in music and never offered up my melodious voice for public consumption.", 
        "reply": " Well if yours is anything like mine, I can see the headlines now, Now showing, live on Broadway, \"Two Cranky ol'Cats on a Hot Tin Roof\" 2 showings daily, hearing protection supplied with paid addmission.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:28:00", 
        "title": "Susan Boyle", 
        "userID": "akaironhorse"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot. The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal.", 
        "intTime": 20090417, 
        "postID": 43, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot.", 
        "reply": " The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:31:00", 
        "title": "Susan Boyle", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot. The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal. I think that her looks and attitude are part of her appeal. She's gonna make some money. But I gotta admit that although she does a beautiful rendition of \"Cry Me A River\", I'd rather close my eyes and pretend she looks like Julie London for that particular song. However, her choice of material for the audition was perfect.", 
        "intTime": 20090417, 
        "postID": 44, 
        "quote": "Originally posted by stillkit: quote: Originally posted by Thud357L: quote: Originally posted by stillkit: She has a beautiful voice and a face any grandchild can love, but she won't win the competition. Why? Because the pay-off is a recording contract and, sadly, someone such as her just isn't marketable. She's had her 15 minutes of fame and that's it. I dunno Kit. Somebody is gonna offer her a contract and she's already got an instant fan base of millions. They will buy her records. I think she's already won. Whether she wins the competition is moot. The primary market for recordings is pre-pubescent girls and young adults. She doesn't appeal to either for more than, maybe, a one-shot deal.", 
        "reply": " I think that her looks and attitude are part of her appeal. She's gonna make some money. But I gotta admit that although she does a beautiful rendition of \"Cry Me A River\", I'd rather close my eyes and pretend she looks like Julie London for that particular song. However, her choice of material for the audition was perfect.", 
        "threadID": "409192893_9450087022001", 
        "time": "2009-04-17 16:48:00", 
        "title": "Susan Boyle", 
        "userID": "Thud357L"
    }
]