[
    {
        "content": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:40:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "reply": " It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:45:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "", 
        "reply": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush. COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "reply": " COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 00:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:16:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "", 
        "reply": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:17:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch. COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "reply": " COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:38:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "", 
        "reply": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 02:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "", 
        "reply": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:31:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. here's a dollar. now make some sense.", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " here's a dollar. now make some sense.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:39:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "intTime": 20090303, 
        "postID": 11, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 12, 
        "quote": "", 
        "reply": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "intTime": 20090303, 
        "postID": 13, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "intTime": 20090303, 
        "postID": 14, 
        "quote": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America.", 
        "reply": " do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is. I know what it's not... \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 15, 
        "quote": "Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "reply": " I know what it's not... \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:05:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: I know what it's not... if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "intTime": 20090303, 
        "postID": 16, 
        "quote": "I know what it's not...", 
        "reply": " if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "intTime": 20090303, 
        "postID": 17, 
        "quote": "", 
        "reply": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Ira1945"
    }, 
    {
        "content": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "intTime": 20090303, 
        "postID": 18, 
        "quote": "", 
        "reply": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction. What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "intTime": 20090303, 
        "postID": 19, 
        "quote": "True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "reply": " What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:36:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "intTime": 20090303, 
        "postID": 20, 
        "quote": "What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "reply": " \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\" Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "intTime": 20090303, 
        "postID": 21, 
        "quote": "Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "reply": " Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:47:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "intTime": 20090303, 
        "postID": 22, 
        "quote": "Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "reply": " Can't. People like rush run them out of the party.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:51:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party. Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "intTime": 20090303, 
        "postID": 23, 
        "quote": "Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "reply": " Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "intTime": 20090303, 
        "postID": 24, 
        "quote": "", 
        "reply": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:12:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "intTime": 20090303, 
        "postID": 25, 
        "quote": "Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "reply": " You couldn't be more wrong.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "intTime": 20090303, 
        "postID": 26, 
        "quote": "Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition.", 
        "reply": " They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "intTime": 20090303, 
        "postID": 27, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "reply": " No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:19:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong. Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "intTime": 20090303, 
        "postID": 28, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "reply": " Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:22:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they? LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "intTime": 20090303, 
        "postID": 29, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "reply": " LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:23:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "intTime": 20090303, 
        "postID": 30, 
        "quote": "Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board.", 
        "reply": " 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:28:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "intTime": 20090302, 
        "postID": 31, 
        "quote": "", 
        "reply": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:40:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "intTime": 20090302, 
        "postID": 32, 
        "quote": "Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "reply": " It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:45:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "intTime": 20090302, 
        "postID": 33, 
        "quote": "", 
        "reply": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush. COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "intTime": 20090303, 
        "postID": 34, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "reply": " COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 00:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "intTime": 20090303, 
        "postID": 35, 
        "quote": "", 
        "reply": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:16:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "intTime": 20090303, 
        "postID": 36, 
        "quote": "", 
        "reply": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:17:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch. COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "intTime": 20090303, 
        "postID": 37, 
        "quote": "Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "reply": " COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:38:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "intTime": 20090303, 
        "postID": 38, 
        "quote": "", 
        "reply": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 02:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 39, 
        "quote": "", 
        "reply": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:31:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. here's a dollar. now make some sense.", 
        "intTime": 20090303, 
        "postID": 40, 
        "quote": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " here's a dollar. now make some sense.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:39:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "intTime": 20090303, 
        "postID": 41, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 42, 
        "quote": "", 
        "reply": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "intTime": 20090303, 
        "postID": 43, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "intTime": 20090303, 
        "postID": 44, 
        "quote": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America.", 
        "reply": " do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is. I know what it's not... \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 45, 
        "quote": "Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "reply": " I know what it's not... \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:05:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: I know what it's not... if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "intTime": 20090303, 
        "postID": 46, 
        "quote": "I know what it's not...", 
        "reply": " if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "intTime": 20090303, 
        "postID": 47, 
        "quote": "", 
        "reply": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Ira1945"
    }, 
    {
        "content": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "intTime": 20090303, 
        "postID": 48, 
        "quote": "", 
        "reply": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction. What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "intTime": 20090303, 
        "postID": 49, 
        "quote": "True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "reply": " What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:36:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "intTime": 20090303, 
        "postID": 50, 
        "quote": "What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "reply": " \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\" Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "intTime": 20090303, 
        "postID": 51, 
        "quote": "Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "reply": " Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:47:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "intTime": 20090303, 
        "postID": 52, 
        "quote": "Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "reply": " Can't. People like rush run them out of the party.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:51:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party. Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "intTime": 20090303, 
        "postID": 53, 
        "quote": "Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "reply": " Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "intTime": 20090303, 
        "postID": 54, 
        "quote": "", 
        "reply": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:12:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "intTime": 20090303, 
        "postID": 55, 
        "quote": "Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "reply": " You couldn't be more wrong.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "intTime": 20090303, 
        "postID": 56, 
        "quote": "Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition.", 
        "reply": " They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "intTime": 20090303, 
        "postID": 57, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "reply": " No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:19:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong. Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "intTime": 20090303, 
        "postID": 58, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "reply": " Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:22:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they? LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "intTime": 20090303, 
        "postID": 59, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "reply": " LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:23:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "intTime": 20090303, 
        "postID": 60, 
        "quote": "Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board.", 
        "reply": " 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:28:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "intTime": 20090302, 
        "postID": 61, 
        "quote": "", 
        "reply": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:40:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "intTime": 20090302, 
        "postID": 62, 
        "quote": "Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "reply": " It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:45:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "intTime": 20090302, 
        "postID": 63, 
        "quote": "", 
        "reply": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush. COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "intTime": 20090303, 
        "postID": 64, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "reply": " COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 00:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "intTime": 20090303, 
        "postID": 65, 
        "quote": "", 
        "reply": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:16:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "intTime": 20090303, 
        "postID": 66, 
        "quote": "", 
        "reply": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:17:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch. COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "intTime": 20090303, 
        "postID": 67, 
        "quote": "Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "reply": " COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:38:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "intTime": 20090303, 
        "postID": 68, 
        "quote": "", 
        "reply": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 02:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 69, 
        "quote": "", 
        "reply": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:31:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. here's a dollar. now make some sense.", 
        "intTime": 20090303, 
        "postID": 70, 
        "quote": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " here's a dollar. now make some sense.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:39:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "intTime": 20090303, 
        "postID": 71, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 72, 
        "quote": "", 
        "reply": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "intTime": 20090303, 
        "postID": 73, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "intTime": 20090303, 
        "postID": 74, 
        "quote": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America.", 
        "reply": " do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is. I know what it's not... \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 75, 
        "quote": "Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "reply": " I know what it's not... \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:05:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: I know what it's not... if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "intTime": 20090303, 
        "postID": 76, 
        "quote": "I know what it's not...", 
        "reply": " if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "intTime": 20090303, 
        "postID": 77, 
        "quote": "", 
        "reply": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Ira1945"
    }, 
    {
        "content": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "intTime": 20090303, 
        "postID": 78, 
        "quote": "", 
        "reply": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction. What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "intTime": 20090303, 
        "postID": 79, 
        "quote": "True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "reply": " What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:36:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "intTime": 20090303, 
        "postID": 80, 
        "quote": "What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "reply": " \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\" Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "intTime": 20090303, 
        "postID": 81, 
        "quote": "Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "reply": " Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:47:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "intTime": 20090303, 
        "postID": 82, 
        "quote": "Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "reply": " Can't. People like rush run them out of the party.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:51:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party. Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "intTime": 20090303, 
        "postID": 83, 
        "quote": "Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "reply": " Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "intTime": 20090303, 
        "postID": 84, 
        "quote": "", 
        "reply": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:12:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "intTime": 20090303, 
        "postID": 85, 
        "quote": "Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "reply": " You couldn't be more wrong.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "intTime": 20090303, 
        "postID": 86, 
        "quote": "Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition.", 
        "reply": " They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "intTime": 20090303, 
        "postID": 87, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "reply": " No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:19:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong. Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "intTime": 20090303, 
        "postID": 88, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "reply": " Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:22:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they? LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "intTime": 20090303, 
        "postID": 89, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "reply": " LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:23:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "intTime": 20090303, 
        "postID": 90, 
        "quote": "Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board.", 
        "reply": " 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:28:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "intTime": 20090302, 
        "postID": 91, 
        "quote": "", 
        "reply": "“My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:40:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "intTime": 20090302, 
        "postID": 92, 
        "quote": "Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\"", 
        "reply": " It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:45:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "intTime": 20090302, 
        "postID": 93, 
        "quote": "", 
        "reply": "I can't wait to use that quote the next time some says \"but! he's just an entertainer!\" well guess what pal....the head of the GOP says he's a party leader.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-02 21:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush. COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "intTime": 20090303, 
        "postID": 94, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by karlhungusjr: “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” \"http://www.politico.com/news/stories/0309/19517.html\" It's obvious if your a repub wanting to get ahead in the repub party you don't want to f/with the lush, sorry Rush.", 
        "reply": " COMMENT: Mr. Steele has apparently managed to emasculate both his personal and professional political reputation simultaneously in such short order that the upside of his ability to lead the Republicans back into national political viability sure seems to be limited now. Perhaps the RNC should start interviewing again now for a new chairman ... one who has \"better judgment\" in deferring the Republican political platform to a fat-mouthed radio entertainer who has hypocritically never lifted one finger in actual civic contribution in his life or conducted his personal life to the moral aspirations of the Republican base. It certainly seems that Mr. Steele has already compromised his political integrity and ability to forge a Republican agenda that really does respond to mainstream American sentiment. With that level of political deftness, the Republicans may well maintain that self-righteous niche as a \"party of of self-defined conservative conscience\" that attracts no meaningful national following. Well done, Mr. Steele!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 00:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "intTime": 20090303, 
        "postID": 95, 
        "quote": "", 
        "reply": "I'm sorry Massa I mean Mr.Rush. I thought he was the head of the RNC", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:16:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "intTime": 20090303, 
        "postID": 96, 
        "quote": "", 
        "reply": "The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:17:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch. COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "intTime": 20090303, 
        "postID": 97, 
        "quote": "Originally posted by Thud357L: The sad comedy that is now the Republican Party should be led by an overweight dopefiend. It is small but still as energetic as a toilet flush as they react to the machevellian rope-a-dope and proceed to chew on each other while projecting their nihilistic message to the ordinary Americans who want absolutely no part of it. But it's fun to watch.", 
        "reply": " COMMENT: Perhaps the RNC can re-write the lyrics to Barry Maguire's \"Eve of Destruction\" as their new anthem to fit the state of their new political reality under the inspirational and moral leadership of Mr. Limbaugh.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 01:38:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "intTime": 20090303, 
        "postID": 98, 
        "quote": "", 
        "reply": "I heard he was caught smuggling Viagra from the Dominican Republic!", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 02:46:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "samh32"
    }, 
    {
        "content": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 99, 
        "quote": "", 
        "reply": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:31:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. here's a dollar. now make some sense.", 
        "intTime": 20090303, 
        "postID": 100, 
        "quote": "It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " here's a dollar. now make some sense.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:39:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "intTime": 20090303, 
        "postID": 101, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " COMMENT: I'm a political, fiscal, and social conservative, and I see little identity with Limbaugh's self-promotion and personal hypocrisy that qualifies him to be more than he is ... a radio talk show host whose only intent is to enrich himself by denigrating others without personal risk of doing anything more than talking.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 102, 
        "quote": "", 
        "reply": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 03:56:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time. Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "intTime": 20090303, 
        "postID": 103, 
        "quote": "Originally posted by Kegler300: It fun watching liberals and moderates burn up so much energy trying to separate the conservative movement from Rush, only to wind up with egg on their faces every time.", 
        "reply": " Of course you don't get it. It's not possible for you to get it. The last thing progressives want to do is separate the so called \"conservative movement\" from Rush Limbaugh. We want to tie it to him with chains and duct tape. We want people like you to be forced to watch every bowel movement. And that's what you want too, isn't it? So be happy. It's win-win.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "intTime": 20090303, 
        "postID": 104, 
        "quote": "The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America.", 
        "reply": " do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:00:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is. I know what it's not... \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 105, 
        "quote": "Originally posted by karlhungusjr: quote: The only ones I hear him denigrating are those who espouse socialism and the economic destruction of America; those whose actions display a hatred for America and it's freedoms; those who hate conservativism; those who are embarassed by America's historic captitalist economic achievements; those who despise charity; and those who hate achievement and responsibility, and those responsible for success in America. do you REALLY believe all that? I ask because you seem completely clueless about what \"conservatism\" actually is.", 
        "reply": " I know what it's not... \"The World's Finest\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:05:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: I know what it's not... if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "intTime": 20090303, 
        "postID": 106, 
        "quote": "I know what it's not...", 
        "reply": " if all you know is \"it's not dem dirty hippies!\" then I'd have to say....you don't know. you're the political equivalent of a 5 year old throwing a tantrum and you don't even know what the tantrum is about. it's easy to be against made up strawmen. why not be a man and be FOR something.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "intTime": 20090303, 
        "postID": 107, 
        "quote": "", 
        "reply": "THESE PEOPLE HAVE SUCH A HXXXXN FOR RUSH??", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "Ira1945"
    }, 
    {
        "content": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "intTime": 20090303, 
        "postID": 108, 
        "quote": "", 
        "reply": "If the Republican Party doesn't divest itself of the faction represented by Limbaugh (and that's the Rove/Bush faction), they're doomed. All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have no new ideas, are not conservative, and offer nothing but opposition to the expressed will of The People. They are totally devoid of anything but so-called \"trickle down economics\" which has proven to be little more than a cover for selling America out to their corporate buddies. True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction. What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "intTime": 20090303, 
        "postID": 109, 
        "quote": "True Conservative Republican's! NOW is the time to take your party back from the swindlers and liars who have conned you for nearly 30 years and led not only your party, but this country to the brink of destruction.", 
        "reply": " What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:36:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "airwing1"
    }, 
    {
        "content": "quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "intTime": 20090303, 
        "postID": 110, 
        "quote": "What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please.", 
        "reply": " \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:41:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\" Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "intTime": 20090303, 
        "postID": 111, 
        "quote": "Originally posted by karlhungusjr: quote: What do you believe is the true conservative? And who do you think truly promotes conservative ideals? Name names please. \"http://en.wikipedia.org/wiki/Barry_Goldwater\"", 
        "reply": " Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:47:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "intTime": 20090303, 
        "postID": 112, 
        "quote": "Well, Barry's dead.. so how bout coming up with someone who's still breathing?", 
        "reply": " Can't. People like rush run them out of the party.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 04:51:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party. Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "intTime": 20090303, 
        "postID": 113, 
        "quote": "Originally posted by karlhungusjr: quote: Well, Barry's dead.. so how bout coming up with someone who's still breathing? Can't. People like rush run them out of the party.", 
        "reply": " Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. So, you'll have to forgive me if I refuse to play your little game and instead recognize that you don't know what the hell you're talking about when it comes to conservative leaders. Rush really pi$$es you off, apparently. Imo, that's a clear sign that he's doing something right.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:10:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "intTime": 20090303, 
        "postID": 114, 
        "quote": "", 
        "reply": "Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:12:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "intTime": 20090303, 
        "postID": 115, 
        "quote": "Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good.", 
        "reply": " You couldn't be more wrong.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "intTime": 20090303, 
        "postID": 116, 
        "quote": "Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition.", 
        "reply": " They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:14:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "intTime": 20090303, 
        "postID": 117, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path.", 
        "reply": " No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:19:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong. Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "intTime": 20090303, 
        "postID": 118, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by PhoenixDark: Let the conservatives hang onto Rush - it will just speed the death of the Republican Party for good. You couldn't be more wrong.", 
        "reply": " Willing to bet on the odds of the GOP losing even more congressional seats in 2010?", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:22:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they? LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "intTime": 20090303, 
        "postID": 119, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: All they have is negativity, hate-mongering, obstructionism and an obsession with Obama that borders on sedition. They have become the party of \"no\". They are like that friend you have that when you say \"lets go to a movie they say \"no\", but offer no other suggestions. You then say \"let's go to dinner\" and they say \"no\", but offer no suggestions. Every suggestion is met only with \"no\" and nothing else. Guess what GOP? The people are watching and listening. If you want to be engaged, be ENGAGED. Offer NEW solutions not obstruction and the same tired rhetoric. The entire CPAC conference wasn't about \"how can we help fix the country and bolster the economy\", but \"how do we regain power in 2012\". Well, I can assure you, you won't regain power if you continue down your current path. No suggestions? I guess actual tax cuts, (as opposed to B.O.'s bait-and-switch, temporary tax credits), and reduced gov't spending don't even rate as options in your special little mind, do they?", 
        "reply": " LOL Shades Do you need a history lesson on the national debt? I would guess no. No doubt you know the record of the last three republican presidents and the amount of debt they added. The republicans are in no position to lecture on debt.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:23:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board. 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "intTime": 20090303, 
        "postID": 120, 
        "quote": "Karl, you're not only not a GOP member, but a fairly rabid leftist, judging from what you've posted on this board.", 
        "reply": " 1. I'm not a \"rabid leftist\" 2. I'm not a GOP member because, as a they say...\"I didn't leave the GOP. The GOP left me\" When you no longer elect people who run up trillions in debt, increase the size of goverment and stick your nose in peoples personal lives in the name of \"family values\" and at the same time give lip service to \"smaller government\", I'll think about coming into the fold. but as long as you continue to be the party of \"Libs wanna destroy america!\" and \"surrender your freedoms or teh terrorists will getcha!\" and your party leadership bows to un unelected draft dodger, I'll stay well away thanks.", 
        "threadID": "409192893_2180047612001", 
        "time": "2009-03-03 05:28:00", 
        "title": "Day 1 head of the RNC says \"Rush is not the head of the GOP!\", Day 2 \"im sorry rush\"", 
        "userID": "karlhungusjr"
    }
]