[
    {
        "content": "Leave it to the people at the International Center for War and Peace Reporting to get the story straight from the horse's mouth, proof that a huge number of Talibaners in Afghanistan are fighting only for the wage it pays, and are practically begging for us to give them some other way to feed their chronically malnourished children. At the risk of life (you know what happens to journalists around here) reporters like Fetrat Zerak interview junior \"Taliban\" like Abdullah Jan, who fights for the $4 a day the Talib pay him to participate in attacks. Before you criticize, consider what you would do if your children were starving. The report tells us: quote: Jan is a Taliban for only a few hours per week. Other than that, he goes about his business like any other citizen. He has no gun or any other equipment that marks him as an insurgent, and he does not consider himself to be one. \"I am just fighting for the money,\" he said. \"If I find another job, I'll leave this one as soon as possible.\" What the congressmen and the media don't tell us as they bluster and pump us up for more war is that this is an easy one. Flood the country with cash-for-work job programs like they already have in some provinces like Jawzjan, Uruzgan, and Balkh, and you've got that many more young men who don't even like the Taliban quitting and not shooting at our guys. Our troops are being betrayed by their leaders' refusal to take a large number of Taliban fighters off the firing line the easy way. The report is devoted to the phenomenon of the \"part-time Taliban,\" youth who are often the only breadwinners in their families. Jan says: quote: \"I am the only breadwinner in our family of eight,\" said Abdullah Jan, a 22-year-old from a small village. \"I went to Iran three times to try to find work, but I was expelled. I was in debt, and my father told me to go to the city. I looked for a job for three weeks, but then my brother got sick and needed medical treatment. He later died. Jan says the young fighters are egged on by the guys with the money from behind: quote: \"My first assignment was to attack the police checkpoint in Guakhan district. We killed four policemen, and we lost two of our own. Another one was injured. The fight lasted for two hours, with the real Taliban encouraging us from behind the lines, saying `go on, further, move, move, move.' Agreement on the problem is becoming nearly universal, with Joe Biden admitting in Brussels last month that \"70 percent of [the Taliban] are there for the jobs, because they are getting paid,\" and General David Petraeus saying that those who are simply fighting to support their families should be given an economic alternative. So where is it? Russian generals, who know a bit about having their heads handed to them by these mountain fighters, have some advice for us. General Pavel Grachev, two tours in Afghanistan, says: quote: Post soldiers to guard road projects and irrigation systems. Pour billions of dollars into infrastructure, which would be more productive than firefights in far-flung villages. (\"Russian Generals: More Troops Won't Help in Afghanistan,\" McClatchy Reports.) Expert on post-conflict peace-building Beth Cole puts her finger on one problem to be solved, how to combine reconstruction work from the military mission, the former of which has so far depended on not being identified with the military for safety. Cole says: quote: \"any civilians that go out there are going to have either guns or be protected by guns. And that automatically separates them from the humanitarian community because the humanitarian community is unarmed. And it will make them a target.\" The answer is to completely separate reconstruction projects from the military or completely combine them, along General Grachev's lines. Military units should be charged with guarding military-sponsored work crews and handing out money, while staying far away from humanitarian organizations not wanting to be identified with the military. Obama's \"Af-Pak\" strategy is on the rocks. Recent events show that putting the focus on Pakistan as the precursor of stability in Afghanistan gets it backwards. Time Magazine's Aryn Baker notes that \"stabilizing Afghanistan might well become crucial to preventing the far more terrifying prospect of an Islamist takeover in Pakistan.\" The IWPR makes its point unequivocally: quote: Mohammad Omar Rassouli, chief of police of Pushtrod district, confirmed Abdullah Jan's story, pointing to unemployment as the main motivating factor in the surge of these Taliban day-laborers. \"Farah is now dominated by unemployment and poor living conditions,\" he said. \"This is what makes young men join the opposition. If we can put 24,000 more troops on the ground we can bring money and shovels with us. The politicians are acting deaf, dumb, and blind as a bloodbath approaches, blathering on about the \"Pakistani center\" and other armchair general ********. If I am a 20-year-old from Montana or wherever and I am in a military transport plane looking down at this parched country, I would be asking myself, Did my leaders do everything they could to make this as easy as they could for us? Did my people do everything they could to prevail on their leaders? Is this the only way? The Jobs for Afghans Peace Project has composed the following letter to congress members. Please forward it to yours. Jobs for Afghans Letter to Congress Members \"\"http://jobsforafghans.org/lettertocongress.html Your congressman's email form \"\"http://www.visi.com/juan/congress/]http://www.visi.com/juan/congress/ \"The Occasional Taliban\" \"\"http://www.isn.ethz.ch/isn/Current-Affairs/Security-Watch/Detail/?ots591=4888CAA0-B3DB-1461-98B9-E20E7B9C13D4&lng=en&id=99295", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "Jan is a Taliban for only a few hours per week. Other than that, he goes about his business like any other citizen. He has no gun or any other equipment that marks him as an insurgent, and he does not consider himself to be one. \"I am just fighting for the money,\" he said. \"If I find another job, I'll leave this one as soon as possible.\"", 
        "reply": "Leave it to the people at the International Center for War and Peace Reporting to get the story straight from the horse's mouth, proof that a huge number of Talibaners in Afghanistan are fighting only for the wage it pays, and are practically begging for us to give them some other way to feed their chronically malnourished children. At the risk of life (you know what happens to journalists around here) reporters like Fetrat Zerak interview junior \"Taliban\" like Abdullah Jan, who fights for the $4 a day the Talib pay him to participate in attacks. Before you criticize, consider what you would do if your children were starving. The report tells us:  What the congressmen and the media don't tell us as they bluster and pump us up for more war is that this is an easy one. Flood the country with cash-for-work job programs like they already have in some provinces like Jawzjan, Uruzgan, and Balkh, and you've got that many more young men who don't even like the Taliban quitting and not shooting at our guys. Our troops are being betrayed by their leaders' refusal to take a large number of Taliban fighters off the firing line the easy way. The report is devoted to the phenomenon of the \"part-time Taliban,\" youth who are often the only breadwinners in their families. Jan says: quote: \"I am the only breadwinner in our family of eight,\" said Abdullah Jan, a 22-year-old from a small village. \"I went to Iran three times to try to find work, but I was expelled. I was in debt, and my father told me to go to the city. I looked for a job for three weeks, but then my brother got sick and needed medical treatment. He later died. Jan says the young fighters are egged on by the guys with the money from behind: quote: \"My first assignment was to attack the police checkpoint in Guakhan district. We killed four policemen, and we lost two of our own. Another one was injured. The fight lasted for two hours, with the real Taliban encouraging us from behind the lines, saying `go on, further, move, move, move.' Agreement on the problem is becoming nearly universal, with Joe Biden admitting in Brussels last month that \"70 percent of [the Taliban] are there for the jobs, because they are getting paid,\" and General David Petraeus saying that those who are simply fighting to support their families should be given an economic alternative. So where is it? Russian generals, who know a bit about having their heads handed to them by these mountain fighters, have some advice for us. General Pavel Grachev, two tours in Afghanistan, says: quote: Post soldiers to guard road projects and irrigation systems. Pour billions of dollars into infrastructure, which would be more productive than firefights in far-flung villages. (\"Russian Generals: More Troops Won't Help in Afghanistan,\" McClatchy Reports.) Expert on post-conflict peace-building Beth Cole puts her finger on one problem to be solved, how to combine reconstruction work from the military mission, the former of which has so far depended on not being identified with the military for safety. Cole says: quote: \"any civilians that go out there are going to have either guns or be protected by guns. And that automatically separates them from the humanitarian community because the humanitarian community is unarmed. And it will make them a target.\" The answer is to completely separate reconstruction projects from the military or completely combine them, along General Grachev's lines. Military units should be charged with guarding military-sponsored work crews and handing out money, while staying far away from humanitarian organizations not wanting to be identified with the military. Obama's \"Af-Pak\" strategy is on the rocks. Recent events show that putting the focus on Pakistan as the precursor of stability in Afghanistan gets it backwards. Time Magazine's Aryn Baker notes that \"stabilizing Afghanistan might well become crucial to preventing the far more terrifying prospect of an Islamist takeover in Pakistan.\" The IWPR makes its point unequivocally: quote: Mohammad Omar Rassouli, chief of police of Pushtrod district, confirmed Abdullah Jan's story, pointing to unemployment as the main motivating factor in the surge of these Taliban day-laborers. \"Farah is now dominated by unemployment and poor living conditions,\" he said. \"This is what makes young men join the opposition. If we can put 24,000 more troops on the ground we can bring money and shovels with us. The politicians are acting deaf, dumb, and blind as a bloodbath approaches, blathering on about the \"Pakistani center\" and other armchair general ********. If I am a 20-year-old from Montana or wherever and I am in a military transport plane looking down at this parched country, I would be asking myself, Did my leaders do everything they could to make this as easy as they could for us? Did my people do everything they could to prevail on their leaders? Is this the only way? The Jobs for Afghans Peace Project has composed the following letter to congress members. Please forward it to yours. Jobs for Afghans Letter to Congress Members \"\"http://jobsforafghans.org/lettertocongress.html Your congressman's email form \"\"http://www.visi.com/juan/congress/]http://www.visi.com/juan/congress/ \"The Occasional Taliban\" \"\"http://www.isn.ethz.ch/isn/Current-Affairs/Security-Watch/Detail/?ots591=4888CAA0-B3DB-1461-98B9-E20E7B9C13D4&lng=en&id=99295", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:18:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:33:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq.", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "reply": " It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:43:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq. You mean an idiotic premise? Yes, it is. Regardless, my question stands.. where would the money come from for this worldwide \"bribe the jihadis\" scheme? Keep in mind that your Messiah has already ensured trillion dollar deficits as far as the eye can see with the grossly irresponsible socialist spending bills \"H\"e's demanded and signed in just \"H\"is first 100 days. Soon \"H\"e wants to waste many more billions on socialized medicine, so our medical care can sink to the level of Canada and the UK. So... where's this proposed payoff money gonna come from?!", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "Originally posted by Boots_: quote: Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq.", 
        "reply": " You mean an idiotic premise? Yes, it is. Regardless, my question stands.. where would the money come from for this worldwide \"bribe the jihadis\" scheme? Keep in mind that your Messiah has already ensured trillion dollar deficits as far as the eye can see with the grossly irresponsible socialist spending bills \"H\"e's demanded and signed in just \"H\"is first 100 days. Soon \"H\"e wants to waste many more billions on socialized medicine, so our medical care can sink to the level of Canada and the UK. So... where's this proposed payoff money gonna come from?!", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:56:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Bleah... We should have just blew kisses across the pond. Poor poor terrorists. So unkind of us to decide to defend ourselves. Next time a rabid dog is chewing on my childs throat I will reflect that the dog must be hungry and offer it a scuby snack", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "", 
        "reply": "Bleah... We should have just blew kisses across the pond. Poor poor terrorists. So unkind of us to decide to defend ourselves. Next time a rabid dog is chewing on my childs throat I will reflect that the dog must be hungry and offer it a scuby snack", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 18:53:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "ACR26"
    }, 
    {
        "content": "\"\"http://www.youtube.com/watch?v=y65U6i6XYqc Clearly a couple of bucks will cause the Moderate Taliban to stop doing things like this.....yes, they were moderate part timers.....why do any of you believe ANYTHING these creatures say?", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"\"http://www.youtube.com/watch?v=y65U6i6XYqc Clearly a couple of bucks will cause the Moderate Taliban to stop doing things like this.....yes, they were moderate part timers.....why do any of you believe ANYTHING these creatures say?", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 19:18:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "peter3_1"
    }, 
    {
        "content": "That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend.", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "", 
        "reply": "That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 20:00:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend.", 
        "reply": " Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 22:09:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "[QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 22:17:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs.", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "reply": " Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 22:23:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs. Yeah. I'm serious. The \"War on Drugs\" can never be won, nor should it be, necessarily. Prohibition was a failure for the same reasons.", 
        "intTime": 20090507, 
        "postID": 11, 
        "quote": "Originally posted by reducetension: quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs.", 
        "reply": " Yeah. I'm serious. The \"War on Drugs\" can never be won, nor should it be, necessarily. Prohibition was a failure for the same reasons.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 00:41:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Problem solved? Those who ignore history are doomed to repeat it. Sometimes with tragic consequences. \"http://wsu.edu/~dee/CHING/OPIUM.HTM?\"", 
        "intTime": 20090507, 
        "postID": 12, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "reply": " Problem solved? Those who ignore history are doomed to repeat it. Sometimes with tragic consequences. \"http://wsu.edu/~dee/CHING/OPIUM.HTM?\"", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 00:53:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. I realize you are being sarcastic, but I completely agree with that. Junkies will be junkies will be junkies anyways. They seem to have no problem getting there dope now. At the very least, legalization would allow us to set a 'standard potency' and we would see a major drop in death by OD's. Not to mention, eleminating a large criminal underclass(I've heard Al Quida, and others, get some of there money from this, not sure if that's accurate), and legally employing afgani's at the same time. You might think I'm 'soft on drugs' or whatever, I really don't care. Some people are going to hook themselves on that crap no matter what. Most people won't touch it, legal or not. At least by regulating it, we have some control over what kinds of extra poison they are slamming their veins full of.", 
        "intTime": 20090507, 
        "postID": 13, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "reply": " I realize you are being sarcastic, but I completely agree with that. Junkies will be junkies will be junkies anyways. They seem to have no problem getting there dope now. At the very least, legalization would allow us to set a 'standard potency' and we would see a major drop in death by OD's. Not to mention, eleminating a large criminal underclass(I've heard Al Quida, and others, get some of there money from this, not sure if that's accurate), and legally employing afgani's at the same time. You might think I'm 'soft on drugs' or whatever, I really don't care. Some people are going to hook themselves on that crap no matter what. Most people won't touch it, legal or not. At least by regulating it, we have some control over what kinds of extra poison they are slamming their veins full of.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 01:23:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "carl.spackler"
    }, 
    {
        "content": "If you're going to post an article written by someone else, please say so. Otherwise, it's just blatant plagerism. This exact article lives in several locations on the web, where it is attributed to Ralph Lopez, a liberal author. ---------------------------------------------- The problem is, if you read Lopez long enough, is that his 'solution' is to do a 'Marshall Plan' for Afghanistan. Sounds great. Sounds wonderful. But it's completely misguided. The post-WWII Marshall Plan was to re-establish and re-build a previous industrial society back to its former status as an industrial power. The infrastructure was damaged, but the core of the infrastructure was still there (roads, railnets, buildings, farms), relatively undamaged by the war. In Afghanistan, it isn't a matter of 'rebuilding' a damaged infrastructure, but of 'building' something that wasn't ever there to begin with. It's one thing to propose 'roadbuilding' as a plan to employ people, but when there are NO contracters with roadbuilding equipment bigger than a shovel, no means of creating gravel except by hammer, and no means of transporting that gravel other than a donkey, it becomes far greater task on the ground that it seems on paper. Same for 'bridges', 'schools', 'housing', etc. Having the US or NATO military forces do the work won't accomplish it either. The point is to hire and employ the locals. But they don't have the education, ability, nor the equipment to DO the tasks that Mr. Lopez so flippantly assures his readers is possible. This process will take MUCH longer than Mr. Lopez can even imagine. In the meantime, the Taliban will still need to be contained and fought. The issue isn't one of either/or. It is one of continuing security for a very primative society to allow them to build themselves a country. Sullivan013", 
        "intTime": 20090507, 
        "postID": 14, 
        "quote": "", 
        "reply": "If you're going to post an article written by someone else, please say so. Otherwise, it's just blatant plagerism. This exact article lives in several locations on the web, where it is attributed to Ralph Lopez, a liberal author. ---------------------------------------------- The problem is, if you read Lopez long enough, is that his 'solution' is to do a 'Marshall Plan' for Afghanistan. Sounds great. Sounds wonderful. But it's completely misguided. The post-WWII Marshall Plan was to re-establish and re-build a previous industrial society back to its former status as an industrial power. The infrastructure was damaged, but the core of the infrastructure was still there (roads, railnets, buildings, farms), relatively undamaged by the war. In Afghanistan, it isn't a matter of 'rebuilding' a damaged infrastructure, but of 'building' something that wasn't ever there to begin with. It's one thing to propose 'roadbuilding' as a plan to employ people, but when there are NO contracters with roadbuilding equipment bigger than a shovel, no means of creating gravel except by hammer, and no means of transporting that gravel other than a donkey, it becomes far greater task on the ground that it seems on paper. Same for 'bridges', 'schools', 'housing', etc. Having the US or NATO military forces do the work won't accomplish it either. The point is to hire and employ the locals. But they don't have the education, ability, nor the equipment to DO the tasks that Mr. Lopez so flippantly assures his readers is possible. This process will take MUCH longer than Mr. Lopez can even imagine. In the meantime, the Taliban will still need to be contained and fought. The issue isn't one of either/or. It is one of continuing security for a very primative society to allow them to build themselves a country. Sullivan013", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 05:15:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Let's take this brilliant plan a bit further; pay off thieves so they won't steal pay off prostitutes so they won't...well, you know pay off arsonists or better yet, build homes so they can burn them down and no one will be endangered pay off Bernie Madoff so he can be even more filthy rich and no one gets their life savings lost pay off ACORN voters so they'll only vote once pay off the poor hungry pirates in Somolia so they'll stop attacking the shipping off their cost Pay every freakin Mexican family so they can live comfortably and not sneak into the U.S. What a great idea, except for the fact that we'll have nothing left to pay for anything we taxpayers will need. Don", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked.", 
        "reply": " Let's take this brilliant plan a bit further; pay off thieves so they won't steal pay off prostitutes so they won't...well, you know pay off arsonists or better yet, build homes so they can burn them down and no one will be endangered pay off Bernie Madoff so he can be even more filthy rich and no one gets their life savings lost pay off ACORN voters so they'll only vote once pay off the poor hungry pirates in Somolia so they'll stop attacking the shipping off their cost Pay every freakin Mexican family so they can live comfortably and not sneak into the U.S. What a great idea, except for the fact that we'll have nothing left to pay for anything we taxpayers will need. Don", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 05:48:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Only in this Liberials minni mind. JMHO.", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "", 
        "reply": "Only in this Liberials minni mind. JMHO.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 05:58:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method.", 
        "intTime": 20090507, 
        "postID": 17, 
        "quote": "Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "reply": " Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 07:10:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "thorin001"
    }, 
    {
        "content": "As Clint Eastwood said in 'Outlaw josey Wales'; \"dying ain't much of a living\" Yes, part of improving Afghanistan is helping set up work for the people and improving infrastructure. But these folks have to understand that when they pick up a weapon, they are now a target. What happens to their families after they get blown to bits? They also have to think about waht happens to their country when the political entity they support allows factions to operate from their land, attacks others, and brings the hammer down.", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "", 
        "reply": "As Clint Eastwood said in 'Outlaw josey Wales'; \"dying ain't much of a living\" Yes, part of improving Afghanistan is helping set up work for the people and improving infrastructure. But these folks have to understand that when they pick up a weapon, they are now a target. What happens to their families after they get blown to bits? They also have to think about waht happens to their country when the political entity they support allows factions to operate from their land, attacks others, and brings the hammer down.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 07:58:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it. Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did.", 
        "intTime": 20090507, 
        "postID": 19, 
        "quote": "Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it.", 
        "reply": " Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 08:42:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it. Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did. It's a libertarian idea. Both conservatives, (like me), and liberals, (like you), can share libertarian ideals. The authoritarians among us, (on both the left and the right), are the ones who believe in an ever expanding DEA and the idiotic absolute that \"drugs are bad, mmmmkay.\"", 
        "intTime": 20090507, 
        "postID": 20, 
        "quote": "Originally posted by reducetension: quote: Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it. Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did.", 
        "reply": " It's a libertarian idea. Both conservatives, (like me), and liberals, (like you), can share libertarian ideals. The authoritarians among us, (on both the left and the right), are the ones who believe in an ever expanding DEA and the idiotic absolute that \"drugs are bad, mmmmkay.\"", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 09:06:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons...", 
        "intTime": 20090507, 
        "postID": 21, 
        "quote": "", 
        "reply": "My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons...", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 09:14:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN.", 
        "intTime": 20090507, 
        "postID": 22, 
        "quote": "Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons...", 
        "reply": " History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 09:47:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN. No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no...", 
        "intTime": 20090507, 
        "postID": 23, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN.", 
        "reply": " No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no...", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 10:20:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN. No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no... Nation building isn't done by making the population slaves, that woud defeat the whole purpose. Nation building in Afghanistan is a virtually impossible task due to the identiy as tribes instead of Afghans. The people in Afghanistan have no real interest in fighting us outside Afghanistan. How many terrorist attacks around the world hav ever been carried out by actual Afghans? The current fight in Afghanistan is with a reemerging Taliban, it is war against insurgents not really terrorists anyway. There is a big difference between going after terrorists that would seek to attack us and insurgents that are only interested in their own parcel of land. Iraq is the same thing now, the fighting is against an insurgency. Very few of the groups in Afghanistan or Iraq have any interest in pursuing a war on foreign soil.", 
        "intTime": 20090507, 
        "postID": 24, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN. No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no...", 
        "reply": " Nation building isn't done by making the population slaves, that woud defeat the whole purpose. Nation building in Afghanistan is a virtually impossible task due to the identiy as tribes instead of Afghans. The people in Afghanistan have no real interest in fighting us outside Afghanistan. How many terrorist attacks around the world hav ever been carried out by actual Afghans? The current fight in Afghanistan is with a reemerging Taliban, it is war against insurgents not really terrorists anyway. There is a big difference between going after terrorists that would seek to attack us and insurgents that are only interested in their own parcel of land. Iraq is the same thing now, the fighting is against an insurgency. Very few of the groups in Afghanistan or Iraq have any interest in pursuing a war on foreign soil.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 10:36:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked.", 
        "intTime": 20090507, 
        "postID": 25, 
        "quote": "Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method.", 
        "reply": " Ya. Thats what worked.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 10:53:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked. Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs.", 
        "intTime": 20090507, 
        "postID": 26, 
        "quote": "Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked.", 
        "reply": " Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 11:19:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked. Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs. Sure, it was A part. One part of 100's. You cant just throw money at any problem and expect to sustain a long term anwser. The CA, HUMINT, MP, and other efforts are also a massive part of what has been and is going on... That said, despite have a vested intrest, I think the long term outlook is grim. But to say we just threw money at the problem belittles the massive effort that is taking place.", 
        "intTime": 20090507, 
        "postID": 27, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked. Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs.", 
        "reply": " Sure, it was A part. One part of 100's. You cant just throw money at any problem and expect to sustain a long term anwser. The CA, HUMINT, MP, and other efforts are also a massive part of what has been and is going on... That said, despite have a vested intrest, I think the long term outlook is grim. But to say we just threw money at the problem belittles the massive effort that is taking place.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 11:25:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "threerings"
    }, 
    {
        "content": "There is more than money problems with this. There is a fundamentalist mind set in so very many of those uneducated people that to suggest they can or will or could live in peace with people who are not exactly like them is crazy. Fighting over politics is their resisting what they believe is an attempt to pollute their view of their God. Who speaks for God is a huge issue for them. Secularized democratic government we want to thrust upon them is a threat to their world view. Try it on the Saudi's sometime and see what happens. No amount of money is going to buy off their God idea. Yet, secular government is the only kind that can referee the mess, like it did in this founding. Get religious out of the political picture. But I doubt it can happen there. Eventually, I am afraid, the religious fundamentalist will win out and the wars will continue in 'God's name'.", 
        "intTime": 20090507, 
        "postID": 28, 
        "quote": "", 
        "reply": "There is more than money problems with this. There is a fundamentalist mind set in so very many of those uneducated people that to suggest they can or will or could live in peace with people who are not exactly like them is crazy. Fighting over politics is their resisting what they believe is an attempt to pollute their view of their God. Who speaks for God is a huge issue for them. Secularized democratic government we want to thrust upon them is a threat to their world view. Try it on the Saudi's sometime and see what happens. No amount of money is going to buy off their God idea. Yet, secular government is the only kind that can referee the mess, like it did in this founding. Get religious out of the political picture. But I doubt it can happen there. Eventually, I am afraid, the religious fundamentalist will win out and the wars will continue in 'God's name'.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 16:07:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "reducetension"
    }, 
    {
        "content": "...My hands are tied... ...For all I`ve seen has changed my mind... ...But still the wars go on as the years go by.. ...With no love of God or human rights... ...`cause all these dreams are swept aside... ...By bloody hands of the hynotized... ...Who carry the cross of homicide... ...And history hides the crimes of their Civil Waaaaaaaars !! G-n-R.....1991", 
        "intTime": 20090507, 
        "postID": 29, 
        "quote": "", 
        "reply": "...My hands are tied... ...For all I`ve seen has changed my mind... ...But still the wars go on as the years go by.. ...With no love of God or human rights... ...`cause all these dreams are swept aside... ...By bloody hands of the hynotized... ...Who carry the cross of homicide... ...And history hides the crimes of their Civil Waaaaaaaars !! G-n-R.....1991", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 17:58:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "So the question is if we pay them off now, what do we do when they demand even more money? History is rife with failed nations that thought they could simply \"buy off\" their conquerors be it with gold, silver, silk, jewels, agriculture or even their women. Only problem was most of the \"conquerors\" figured out fairly quickly why settle for \"some\" of the riches when you can have it all?", 
        "intTime": 20090508, 
        "postID": 30, 
        "quote": "", 
        "reply": "So the question is if we pay them off now, what do we do when they demand even more money? History is rife with failed nations that thought they could simply \"buy off\" their conquerors be it with gold, silver, silk, jewels, agriculture or even their women. Only problem was most of the \"conquerors\" figured out fairly quickly why settle for \"some\" of the riches when you can have it all?", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-08 05:07:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "ronald45"
    }, 
    {
        "content": "Leave it to the people at the International Center for War and Peace Reporting to get the story straight from the horse's mouth, proof that a huge number of Talibaners in Afghanistan are fighting only for the wage it pays, and are practically begging for us to give them some other way to feed their chronically malnourished children. At the risk of life (you know what happens to journalists around here) reporters like Fetrat Zerak interview junior \"Taliban\" like Abdullah Jan, who fights for the $4 a day the Talib pay him to participate in attacks. Before you criticize, consider what you would do if your children were starving. The report tells us: quote: Jan is a Taliban for only a few hours per week. Other than that, he goes about his business like any other citizen. He has no gun or any other equipment that marks him as an insurgent, and he does not consider himself to be one. \"I am just fighting for the money,\" he said. \"If I find another job, I'll leave this one as soon as possible.\" What the congressmen and the media don't tell us as they bluster and pump us up for more war is that this is an easy one. Flood the country with cash-for-work job programs like they already have in some provinces like Jawzjan, Uruzgan, and Balkh, and you've got that many more young men who don't even like the Taliban quitting and not shooting at our guys. Our troops are being betrayed by their leaders' refusal to take a large number of Taliban fighters off the firing line the easy way. The report is devoted to the phenomenon of the \"part-time Taliban,\" youth who are often the only breadwinners in their families. Jan says: quote: \"I am the only breadwinner in our family of eight,\" said Abdullah Jan, a 22-year-old from a small village. \"I went to Iran three times to try to find work, but I was expelled. I was in debt, and my father told me to go to the city. I looked for a job for three weeks, but then my brother got sick and needed medical treatment. He later died. Jan says the young fighters are egged on by the guys with the money from behind: quote: \"My first assignment was to attack the police checkpoint in Guakhan district. We killed four policemen, and we lost two of our own. Another one was injured. The fight lasted for two hours, with the real Taliban encouraging us from behind the lines, saying `go on, further, move, move, move.' Agreement on the problem is becoming nearly universal, with Joe Biden admitting in Brussels last month that \"70 percent of [the Taliban] are there for the jobs, because they are getting paid,\" and General David Petraeus saying that those who are simply fighting to support their families should be given an economic alternative. So where is it? Russian generals, who know a bit about having their heads handed to them by these mountain fighters, have some advice for us. General Pavel Grachev, two tours in Afghanistan, says: quote: Post soldiers to guard road projects and irrigation systems. Pour billions of dollars into infrastructure, which would be more productive than firefights in far-flung villages. (\"Russian Generals: More Troops Won't Help in Afghanistan,\" McClatchy Reports.) Expert on post-conflict peace-building Beth Cole puts her finger on one problem to be solved, how to combine reconstruction work from the military mission, the former of which has so far depended on not being identified with the military for safety. Cole says: quote: \"any civilians that go out there are going to have either guns or be protected by guns. And that automatically separates them from the humanitarian community because the humanitarian community is unarmed. And it will make them a target.\" The answer is to completely separate reconstruction projects from the military or completely combine them, along General Grachev's lines. Military units should be charged with guarding military-sponsored work crews and handing out money, while staying far away from humanitarian organizations not wanting to be identified with the military. Obama's \"Af-Pak\" strategy is on the rocks. Recent events show that putting the focus on Pakistan as the precursor of stability in Afghanistan gets it backwards. Time Magazine's Aryn Baker notes that \"stabilizing Afghanistan might well become crucial to preventing the far more terrifying prospect of an Islamist takeover in Pakistan.\" The IWPR makes its point unequivocally: quote: Mohammad Omar Rassouli, chief of police of Pushtrod district, confirmed Abdullah Jan's story, pointing to unemployment as the main motivating factor in the surge of these Taliban day-laborers. \"Farah is now dominated by unemployment and poor living conditions,\" he said. \"This is what makes young men join the opposition. If we can put 24,000 more troops on the ground we can bring money and shovels with us. The politicians are acting deaf, dumb, and blind as a bloodbath approaches, blathering on about the \"Pakistani center\" and other armchair general ********. If I am a 20-year-old from Montana or wherever and I am in a military transport plane looking down at this parched country, I would be asking myself, Did my leaders do everything they could to make this as easy as they could for us? Did my people do everything they could to prevail on their leaders? Is this the only way? The Jobs for Afghans Peace Project has composed the following letter to congress members. Please forward it to yours. Jobs for Afghans Letter to Congress Members \"\"http://jobsforafghans.org/lettertocongress.html Your congressman's email form \"\"http://www.visi.com/juan/congress/]http://www.visi.com/juan/congress/ \"The Occasional Taliban\" \"\"http://www.isn.ethz.ch/isn/Current-Affairs/Security-Watch/Detail/?ots591=4888CAA0-B3DB-1461-98B9-E20E7B9C13D4&lng=en&id=99295", 
        "intTime": 20090506, 
        "postID": 31, 
        "quote": "Jan is a Taliban for only a few hours per week. Other than that, he goes about his business like any other citizen. He has no gun or any other equipment that marks him as an insurgent, and he does not consider himself to be one. \"I am just fighting for the money,\" he said. \"If I find another job, I'll leave this one as soon as possible.\"", 
        "reply": "Leave it to the people at the International Center for War and Peace Reporting to get the story straight from the horse's mouth, proof that a huge number of Talibaners in Afghanistan are fighting only for the wage it pays, and are practically begging for us to give them some other way to feed their chronically malnourished children. At the risk of life (you know what happens to journalists around here) reporters like Fetrat Zerak interview junior \"Taliban\" like Abdullah Jan, who fights for the $4 a day the Talib pay him to participate in attacks. Before you criticize, consider what you would do if your children were starving. The report tells us:  What the congressmen and the media don't tell us as they bluster and pump us up for more war is that this is an easy one. Flood the country with cash-for-work job programs like they already have in some provinces like Jawzjan, Uruzgan, and Balkh, and you've got that many more young men who don't even like the Taliban quitting and not shooting at our guys. Our troops are being betrayed by their leaders' refusal to take a large number of Taliban fighters off the firing line the easy way. The report is devoted to the phenomenon of the \"part-time Taliban,\" youth who are often the only breadwinners in their families. Jan says: quote: \"I am the only breadwinner in our family of eight,\" said Abdullah Jan, a 22-year-old from a small village. \"I went to Iran three times to try to find work, but I was expelled. I was in debt, and my father told me to go to the city. I looked for a job for three weeks, but then my brother got sick and needed medical treatment. He later died. Jan says the young fighters are egged on by the guys with the money from behind: quote: \"My first assignment was to attack the police checkpoint in Guakhan district. We killed four policemen, and we lost two of our own. Another one was injured. The fight lasted for two hours, with the real Taliban encouraging us from behind the lines, saying `go on, further, move, move, move.' Agreement on the problem is becoming nearly universal, with Joe Biden admitting in Brussels last month that \"70 percent of [the Taliban] are there for the jobs, because they are getting paid,\" and General David Petraeus saying that those who are simply fighting to support their families should be given an economic alternative. So where is it? Russian generals, who know a bit about having their heads handed to them by these mountain fighters, have some advice for us. General Pavel Grachev, two tours in Afghanistan, says: quote: Post soldiers to guard road projects and irrigation systems. Pour billions of dollars into infrastructure, which would be more productive than firefights in far-flung villages. (\"Russian Generals: More Troops Won't Help in Afghanistan,\" McClatchy Reports.) Expert on post-conflict peace-building Beth Cole puts her finger on one problem to be solved, how to combine reconstruction work from the military mission, the former of which has so far depended on not being identified with the military for safety. Cole says: quote: \"any civilians that go out there are going to have either guns or be protected by guns. And that automatically separates them from the humanitarian community because the humanitarian community is unarmed. And it will make them a target.\" The answer is to completely separate reconstruction projects from the military or completely combine them, along General Grachev's lines. Military units should be charged with guarding military-sponsored work crews and handing out money, while staying far away from humanitarian organizations not wanting to be identified with the military. Obama's \"Af-Pak\" strategy is on the rocks. Recent events show that putting the focus on Pakistan as the precursor of stability in Afghanistan gets it backwards. Time Magazine's Aryn Baker notes that \"stabilizing Afghanistan might well become crucial to preventing the far more terrifying prospect of an Islamist takeover in Pakistan.\" The IWPR makes its point unequivocally: quote: Mohammad Omar Rassouli, chief of police of Pushtrod district, confirmed Abdullah Jan's story, pointing to unemployment as the main motivating factor in the surge of these Taliban day-laborers. \"Farah is now dominated by unemployment and poor living conditions,\" he said. \"This is what makes young men join the opposition. If we can put 24,000 more troops on the ground we can bring money and shovels with us. The politicians are acting deaf, dumb, and blind as a bloodbath approaches, blathering on about the \"Pakistani center\" and other armchair general ********. If I am a 20-year-old from Montana or wherever and I am in a military transport plane looking down at this parched country, I would be asking myself, Did my leaders do everything they could to make this as easy as they could for us? Did my people do everything they could to prevail on their leaders? Is this the only way? The Jobs for Afghans Peace Project has composed the following letter to congress members. Please forward it to yours. Jobs for Afghans Letter to Congress Members \"\"http://jobsforafghans.org/lettertocongress.html Your congressman's email form \"\"http://www.visi.com/juan/congress/]http://www.visi.com/juan/congress/ \"The Occasional Taliban\" \"\"http://www.isn.ethz.ch/isn/Current-Affairs/Security-Watch/Detail/?ots591=4888CAA0-B3DB-1461-98B9-E20E7B9C13D4&lng=en&id=99295", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:18:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "intTime": 20090506, 
        "postID": 32, 
        "quote": "", 
        "reply": "So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:33:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq.", 
        "intTime": 20090506, 
        "postID": 33, 
        "quote": "Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "reply": " It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:43:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq. You mean an idiotic premise? Yes, it is. Regardless, my question stands.. where would the money come from for this worldwide \"bribe the jihadis\" scheme? Keep in mind that your Messiah has already ensured trillion dollar deficits as far as the eye can see with the grossly irresponsible socialist spending bills \"H\"e's demanded and signed in just \"H\"is first 100 days. Soon \"H\"e wants to waste many more billions on socialized medicine, so our medical care can sink to the level of Canada and the UK. So... where's this proposed payoff money gonna come from?!", 
        "intTime": 20090506, 
        "postID": 34, 
        "quote": "Originally posted by Boots_: quote: Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? It's not a premise for idiocy. We did the same thing to support the Awakening Council in Iraq.", 
        "reply": " You mean an idiotic premise? Yes, it is. Regardless, my question stands.. where would the money come from for this worldwide \"bribe the jihadis\" scheme? Keep in mind that your Messiah has already ensured trillion dollar deficits as far as the eye can see with the grossly irresponsible socialist spending bills \"H\"e's demanded and signed in just \"H\"is first 100 days. Soon \"H\"e wants to waste many more billions on socialized medicine, so our medical care can sink to the level of Canada and the UK. So... where's this proposed payoff money gonna come from?!", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 17:56:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Bleah... We should have just blew kisses across the pond. Poor poor terrorists. So unkind of us to decide to defend ourselves. Next time a rabid dog is chewing on my childs throat I will reflect that the dog must be hungry and offer it a scuby snack", 
        "intTime": 20090506, 
        "postID": 35, 
        "quote": "", 
        "reply": "Bleah... We should have just blew kisses across the pond. Poor poor terrorists. So unkind of us to decide to defend ourselves. Next time a rabid dog is chewing on my childs throat I will reflect that the dog must be hungry and offer it a scuby snack", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 18:53:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "ACR26"
    }, 
    {
        "content": "\"\"http://www.youtube.com/watch?v=y65U6i6XYqc Clearly a couple of bucks will cause the Moderate Taliban to stop doing things like this.....yes, they were moderate part timers.....why do any of you believe ANYTHING these creatures say?", 
        "intTime": 20090506, 
        "postID": 36, 
        "quote": "", 
        "reply": "\"\"http://www.youtube.com/watch?v=y65U6i6XYqc Clearly a couple of bucks will cause the Moderate Taliban to stop doing things like this.....yes, they were moderate part timers.....why do any of you believe ANYTHING these creatures say?", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 19:18:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "peter3_1"
    }, 
    {
        "content": "That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend.", 
        "intTime": 20090506, 
        "postID": 37, 
        "quote": "", 
        "reply": "That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 20:00:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "intTime": 20090506, 
        "postID": 38, 
        "quote": "Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend.", 
        "reply": " Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 22:09:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "[QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it.", 
        "intTime": 20090506, 
        "postID": 39, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 22:17:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs.", 
        "intTime": 20090506, 
        "postID": 40, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "reply": " Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-06 22:23:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs. Yeah. I'm serious. The \"War on Drugs\" can never be won, nor should it be, necessarily. Prohibition was a failure for the same reasons.", 
        "intTime": 20090507, 
        "postID": 41, 
        "quote": "Originally posted by reducetension: quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Not a bad idea actually. Junkies will be junkies no matter how much the government makes it against the law. There will be no big rush of people to be come junkies, unless you know people who intend to. Might as well let the Afghanistan farmers make some legit living and tax the stuff over here. It will end the violent crime caused by drug laws making criminals richer. Let Pepsi and Coke duke it out in the free market. It's being discussed, actually, as a means to increased tax revenue. Farmers won't have time to fight for a few dollars, they'll be busy cultivating their crops and buying American CDs.", 
        "reply": " Yeah. I'm serious. The \"War on Drugs\" can never be won, nor should it be, necessarily. Prohibition was a failure for the same reasons.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 00:41:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. Problem solved? Those who ignore history are doomed to repeat it. Sometimes with tragic consequences. \"http://wsu.edu/~dee/CHING/OPIUM.HTM?\"", 
        "intTime": 20090507, 
        "postID": 42, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "reply": " Problem solved? Those who ignore history are doomed to repeat it. Sometimes with tragic consequences. \"http://wsu.edu/~dee/CHING/OPIUM.HTM?\"", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 00:53:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved. I realize you are being sarcastic, but I completely agree with that. Junkies will be junkies will be junkies anyways. They seem to have no problem getting there dope now. At the very least, legalization would allow us to set a 'standard potency' and we would see a major drop in death by OD's. Not to mention, eleminating a large criminal underclass(I've heard Al Quida, and others, get some of there money from this, not sure if that's accurate), and legally employing afgani's at the same time. You might think I'm 'soft on drugs' or whatever, I really don't care. Some people are going to hook themselves on that crap no matter what. Most people won't touch it, legal or not. At least by regulating it, we have some control over what kinds of extra poison they are slamming their veins full of.", 
        "intTime": 20090507, 
        "postID": 43, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by nspreitler: That is a major part of COIN. There is no doubt we need to work on lasting employment programs, but it also has to be sustainable. That is a major difference in Iraq and Afghanistan. Iraq has the ability to build its own infrastructure through oil revenue, and also has the farmland to have a strong agriculture industry. The population in Iraq is also better educated. Afghanistan is rugged terrain, and has maintained subsistence farming. It has been in a near constant state of war for 30 years. Most Afghans aren't terrorists, just like most Iraqis aren't. They will do what they have to do to support their families. The money isn't really an issue, it would be a very small fraction of what we already spend. Well I think we should legalize drugs, (including opiates), and then everyone in Afghanistan could make a profitable living. Happy junkies over here, prosperous opium poppy farmers over there. Problem solved.", 
        "reply": " I realize you are being sarcastic, but I completely agree with that. Junkies will be junkies will be junkies anyways. They seem to have no problem getting there dope now. At the very least, legalization would allow us to set a 'standard potency' and we would see a major drop in death by OD's. Not to mention, eleminating a large criminal underclass(I've heard Al Quida, and others, get some of there money from this, not sure if that's accurate), and legally employing afgani's at the same time. You might think I'm 'soft on drugs' or whatever, I really don't care. Some people are going to hook themselves on that crap no matter what. Most people won't touch it, legal or not. At least by regulating it, we have some control over what kinds of extra poison they are slamming their veins full of.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 01:23:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "carl.spackler"
    }, 
    {
        "content": "If you're going to post an article written by someone else, please say so. Otherwise, it's just blatant plagerism. This exact article lives in several locations on the web, where it is attributed to Ralph Lopez, a liberal author. ---------------------------------------------- The problem is, if you read Lopez long enough, is that his 'solution' is to do a 'Marshall Plan' for Afghanistan. Sounds great. Sounds wonderful. But it's completely misguided. The post-WWII Marshall Plan was to re-establish and re-build a previous industrial society back to its former status as an industrial power. The infrastructure was damaged, but the core of the infrastructure was still there (roads, railnets, buildings, farms), relatively undamaged by the war. In Afghanistan, it isn't a matter of 'rebuilding' a damaged infrastructure, but of 'building' something that wasn't ever there to begin with. It's one thing to propose 'roadbuilding' as a plan to employ people, but when there are NO contracters with roadbuilding equipment bigger than a shovel, no means of creating gravel except by hammer, and no means of transporting that gravel other than a donkey, it becomes far greater task on the ground that it seems on paper. Same for 'bridges', 'schools', 'housing', etc. Having the US or NATO military forces do the work won't accomplish it either. The point is to hire and employ the locals. But they don't have the education, ability, nor the equipment to DO the tasks that Mr. Lopez so flippantly assures his readers is possible. This process will take MUCH longer than Mr. Lopez can even imagine. In the meantime, the Taliban will still need to be contained and fought. The issue isn't one of either/or. It is one of continuing security for a very primative society to allow them to build themselves a country. Sullivan013", 
        "intTime": 20090507, 
        "postID": 44, 
        "quote": "", 
        "reply": "If you're going to post an article written by someone else, please say so. Otherwise, it's just blatant plagerism. This exact article lives in several locations on the web, where it is attributed to Ralph Lopez, a liberal author. ---------------------------------------------- The problem is, if you read Lopez long enough, is that his 'solution' is to do a 'Marshall Plan' for Afghanistan. Sounds great. Sounds wonderful. But it's completely misguided. The post-WWII Marshall Plan was to re-establish and re-build a previous industrial society back to its former status as an industrial power. The infrastructure was damaged, but the core of the infrastructure was still there (roads, railnets, buildings, farms), relatively undamaged by the war. In Afghanistan, it isn't a matter of 'rebuilding' a damaged infrastructure, but of 'building' something that wasn't ever there to begin with. It's one thing to propose 'roadbuilding' as a plan to employ people, but when there are NO contracters with roadbuilding equipment bigger than a shovel, no means of creating gravel except by hammer, and no means of transporting that gravel other than a donkey, it becomes far greater task on the ground that it seems on paper. Same for 'bridges', 'schools', 'housing', etc. Having the US or NATO military forces do the work won't accomplish it either. The point is to hire and employ the locals. But they don't have the education, ability, nor the equipment to DO the tasks that Mr. Lopez so flippantly assures his readers is possible. This process will take MUCH longer than Mr. Lopez can even imagine. In the meantime, the Taliban will still need to be contained and fought. The issue isn't one of either/or. It is one of continuing security for a very primative society to allow them to build themselves a country. Sullivan013", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 05:15:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Let's take this brilliant plan a bit further; pay off thieves so they won't steal pay off prostitutes so they won't...well, you know pay off arsonists or better yet, build homes so they can burn them down and no one will be endangered pay off Bernie Madoff so he can be even more filthy rich and no one gets their life savings lost pay off ACORN voters so they'll only vote once pay off the poor hungry pirates in Somolia so they'll stop attacking the shipping off their cost Pay every freakin Mexican family so they can live comfortably and not sneak into the U.S. What a great idea, except for the fact that we'll have nothing left to pay for anything we taxpayers will need. Don", 
        "intTime": 20090507, 
        "postID": 45, 
        "quote": "Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked.", 
        "reply": " Let's take this brilliant plan a bit further; pay off thieves so they won't steal pay off prostitutes so they won't...well, you know pay off arsonists or better yet, build homes so they can burn them down and no one will be endangered pay off Bernie Madoff so he can be even more filthy rich and no one gets their life savings lost pay off ACORN voters so they'll only vote once pay off the poor hungry pirates in Somolia so they'll stop attacking the shipping off their cost Pay every freakin Mexican family so they can live comfortably and not sneak into the U.S. What a great idea, except for the fact that we'll have nothing left to pay for anything we taxpayers will need. Don", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 05:48:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Only in this Liberials minni mind. JMHO.", 
        "intTime": 20090507, 
        "postID": 46, 
        "quote": "", 
        "reply": "Only in this Liberials minni mind. JMHO.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 05:58:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method.", 
        "intTime": 20090507, 
        "postID": 47, 
        "quote": "Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support?", 
        "reply": " Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 07:10:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "thorin001"
    }, 
    {
        "content": "As Clint Eastwood said in 'Outlaw josey Wales'; \"dying ain't much of a living\" Yes, part of improving Afghanistan is helping set up work for the people and improving infrastructure. But these folks have to understand that when they pick up a weapon, they are now a target. What happens to their families after they get blown to bits? They also have to think about waht happens to their country when the political entity they support allows factions to operate from their land, attacks others, and brings the hammer down.", 
        "intTime": 20090507, 
        "postID": 48, 
        "quote": "", 
        "reply": "As Clint Eastwood said in 'Outlaw josey Wales'; \"dying ain't much of a living\" Yes, part of improving Afghanistan is helping set up work for the people and improving infrastructure. But these folks have to understand that when they pick up a weapon, they are now a target. What happens to their families after they get blown to bits? They also have to think about waht happens to their country when the political entity they support allows factions to operate from their land, attacks others, and brings the hammer down.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 07:58:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it. Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did.", 
        "intTime": 20090507, 
        "postID": 49, 
        "quote": "Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it.", 
        "reply": " Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 08:42:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it. Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did. It's a libertarian idea. Both conservatives, (like me), and liberals, (like you), can share libertarian ideals. The authoritarians among us, (on both the left and the right), are the ones who believe in an ever expanding DEA and the idiotic absolute that \"drugs are bad, mmmmkay.\"", 
        "intTime": 20090507, 
        "postID": 50, 
        "quote": "Originally posted by reducetension: quote: Originally posted by ronald45: [QUOTE]Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? QUOTE] The solution for EVERY PROBLEM confronted by LIBERALS is to throw money at it. Oh no, that's wrong. We want them (drug users) to buy drugs legally and \"throw\" money into the government coffers as taxes. Revenue collecting. What a better way to deal with it... sounds more conservative than liberal. Go after the 'underground economy' like Reagan did.", 
        "reply": " It's a libertarian idea. Both conservatives, (like me), and liberals, (like you), can share libertarian ideals. The authoritarians among us, (on both the left and the right), are the ones who believe in an ever expanding DEA and the idiotic absolute that \"drugs are bad, mmmmkay.\"", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 09:06:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons...", 
        "intTime": 20090507, 
        "postID": 51, 
        "quote": "", 
        "reply": "My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons...", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 09:14:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN.", 
        "intTime": 20090507, 
        "postID": 52, 
        "quote": "Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons...", 
        "reply": " History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 09:47:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN. No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no...", 
        "intTime": 20090507, 
        "postID": 53, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN.", 
        "reply": " No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no...", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 10:20:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN. No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no... Nation building isn't done by making the population slaves, that woud defeat the whole purpose. Nation building in Afghanistan is a virtually impossible task due to the identiy as tribes instead of Afghans. The people in Afghanistan have no real interest in fighting us outside Afghanistan. How many terrorist attacks around the world hav ever been carried out by actual Afghans? The current fight in Afghanistan is with a reemerging Taliban, it is war against insurgents not really terrorists anyway. There is a big difference between going after terrorists that would seek to attack us and insurgents that are only interested in their own parcel of land. Iraq is the same thing now, the fighting is against an insurgency. Very few of the groups in Afghanistan or Iraq have any interest in pursuing a war on foreign soil.", 
        "intTime": 20090507, 
        "postID": 54, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: My idea: Pull all troops out of Afghanistan, with the exception of a Marine combat regiment, Army Air Assault Brigade, and one Air Station... Very light foot print... If even the most vague intelligence suggest any kind of terrorist acvity in the area, then an immediate air strike will be carried out, killing any all hostiles and or civilians providing them aid and comfort. Thats all it would take, Pakistan? I'm willing to take John Bolton's advice,(although he is a self-admitted chickenhawk) we should allow a Military coup of that country. Those people are too stupid and primitive to be entrusted with democracy and nuclear weapons... History shows that doesn't work. You can't fight this kind of war as a war of attrition. It didn't work in Vietnam, it didn't work for the Soviets in Afghanistan, and it wont work now. FM 3-24 is the counterinsurgency manual. Appendix E covers the use of airpower in COIN. No matter what we do it is: Going too cost to much Take to long Not work Before 9/11 they had free reign of these foreign nations, by simply keeping some force there we can solve the problem. We do not need to do nation build, if we could use the population as virtual slaves to do it then fine, but otherwise no...", 
        "reply": " Nation building isn't done by making the population slaves, that woud defeat the whole purpose. Nation building in Afghanistan is a virtually impossible task due to the identiy as tribes instead of Afghans. The people in Afghanistan have no real interest in fighting us outside Afghanistan. How many terrorist attacks around the world hav ever been carried out by actual Afghans? The current fight in Afghanistan is with a reemerging Taliban, it is war against insurgents not really terrorists anyway. There is a big difference between going after terrorists that would seek to attack us and insurgents that are only interested in their own parcel of land. Iraq is the same thing now, the fighting is against an insurgency. Very few of the groups in Afghanistan or Iraq have any interest in pursuing a war on foreign soil.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 10:36:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked.", 
        "intTime": 20090507, 
        "postID": 55, 
        "quote": "Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method.", 
        "reply": " Ya. Thats what worked.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 10:53:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked. Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs.", 
        "intTime": 20090507, 
        "postID": 56, 
        "quote": "Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked.", 
        "reply": " Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 11:19:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked. Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs. Sure, it was A part. One part of 100's. You cant just throw money at any problem and expect to sustain a long term anwser. The CA, HUMINT, MP, and other efforts are also a massive part of what has been and is going on... That said, despite have a vested intrest, I think the long term outlook is grim. But to say we just threw money at the problem belittles the massive effort that is taking place.", 
        "intTime": 20090507, 
        "postID": 57, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by thorin001: quote: Originally posted by shades_of_grey: So your \"solution\" to the problem of Islamic terrorist groups is to throw money at them? Maybe we shouldn't have fought the Nazis and Empire of Japan back in the '40's and just bought em off instead? I'm sure that would've worked. Putting aside the idiocy of the premise for a moment, where in the hell would we get the money for this payoff plan you seem to support? Worked in Iraq. Almost all of the sucesses you tout in Iraq were achieved using this method. Ya. Thats what worked. Actually that was a huge part of it. Between employing over half a million men between the IA and IP, and the Iraq First contracts that rebuilt much of the infrastructure we took a lot of the possible insurgents off the street and into jobs.", 
        "reply": " Sure, it was A part. One part of 100's. You cant just throw money at any problem and expect to sustain a long term anwser. The CA, HUMINT, MP, and other efforts are also a massive part of what has been and is going on... That said, despite have a vested intrest, I think the long term outlook is grim. But to say we just threw money at the problem belittles the massive effort that is taking place.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 11:25:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "threerings"
    }, 
    {
        "content": "There is more than money problems with this. There is a fundamentalist mind set in so very many of those uneducated people that to suggest they can or will or could live in peace with people who are not exactly like them is crazy. Fighting over politics is their resisting what they believe is an attempt to pollute their view of their God. Who speaks for God is a huge issue for them. Secularized democratic government we want to thrust upon them is a threat to their world view. Try it on the Saudi's sometime and see what happens. No amount of money is going to buy off their God idea. Yet, secular government is the only kind that can referee the mess, like it did in this founding. Get religious out of the political picture. But I doubt it can happen there. Eventually, I am afraid, the religious fundamentalist will win out and the wars will continue in 'God's name'.", 
        "intTime": 20090507, 
        "postID": 58, 
        "quote": "", 
        "reply": "There is more than money problems with this. There is a fundamentalist mind set in so very many of those uneducated people that to suggest they can or will or could live in peace with people who are not exactly like them is crazy. Fighting over politics is their resisting what they believe is an attempt to pollute their view of their God. Who speaks for God is a huge issue for them. Secularized democratic government we want to thrust upon them is a threat to their world view. Try it on the Saudi's sometime and see what happens. No amount of money is going to buy off their God idea. Yet, secular government is the only kind that can referee the mess, like it did in this founding. Get religious out of the political picture. But I doubt it can happen there. Eventually, I am afraid, the religious fundamentalist will win out and the wars will continue in 'God's name'.", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 16:07:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "reducetension"
    }, 
    {
        "content": "...My hands are tied... ...For all I`ve seen has changed my mind... ...But still the wars go on as the years go by.. ...With no love of God or human rights... ...`cause all these dreams are swept aside... ...By bloody hands of the hynotized... ...Who carry the cross of homicide... ...And history hides the crimes of their Civil Waaaaaaaars !! G-n-R.....1991", 
        "intTime": 20090507, 
        "postID": 59, 
        "quote": "", 
        "reply": "...My hands are tied... ...For all I`ve seen has changed my mind... ...But still the wars go on as the years go by.. ...With no love of God or human rights... ...`cause all these dreams are swept aside... ...By bloody hands of the hynotized... ...Who carry the cross of homicide... ...And history hides the crimes of their Civil Waaaaaaaars !! G-n-R.....1991", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-07 17:58:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "So the question is if we pay them off now, what do we do when they demand even more money? History is rife with failed nations that thought they could simply \"buy off\" their conquerors be it with gold, silver, silk, jewels, agriculture or even their women. Only problem was most of the \"conquerors\" figured out fairly quickly why settle for \"some\" of the riches when you can have it all?", 
        "intTime": 20090508, 
        "postID": 60, 
        "quote": "", 
        "reply": "So the question is if we pay them off now, what do we do when they demand even more money? History is rife with failed nations that thought they could simply \"buy off\" their conquerors be it with gold, silver, silk, jewels, agriculture or even their women. Only problem was most of the \"conquerors\" figured out fairly quickly why settle for \"some\" of the riches when you can have it all?", 
        "threadID": "409192893_5390076222001", 
        "time": "2009-05-08 05:07:00", 
        "title": "A Really Stupid, Unnecessary War", 
        "userID": "ronald45"
    }
]