[
    {
        "content": "So. TEA party supproter.", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "", 
        "reply": "So. TEA party supproter.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 06:30:00", 
        "title": "Waterboarding", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "No wonder his hair looks so clean!", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "No wonder his hair looks so clean!", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 06:40:00", 
        "title": "Waterboarding", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "intTime": 20090420, 
        "postID": 3, 
        "quote": "", 
        "reply": "According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:15:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "well first i would of broken his knuckles with pliers... i seen something on the Tudors last night that i would like to do to him too... hot red poker and well use your imagination... basically he would not survive if i would be allowed to do what i would want to.....", 
        "intTime": 20090420, 
        "postID": 4, 
        "quote": "", 
        "reply": "well first i would of broken his knuckles with pliers... i seen something on the Tudors last night that i would like to do to him too... hot red poker and well use your imagination... basically he would not survive if i would be allowed to do what i would want to.....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:30:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think? oh bull crap his family was never threaten or put in any harm... if there is a report like that it is lies....", 
        "intTime": 20090420, 
        "postID": 5, 
        "quote": "Originally posted by mcgreer: According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "reply": " oh bull crap his family was never threaten or put in any harm... if there is a report like that it is lies....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:31:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: What reports? Here are two 2007 articles which speak of KSM's two children, then 7 and 9 years old, who were detained and questioned in September 2002, after his capture: \"http://uk.reuters.com/article/worldNews/idUKN0644490320070607?pageNumber=2&virtualBrandChannel=0\" \"http://www.smh.com.au/articles/2003/03/09/1047144871940.html\" The Human Rights Watch report, from which some of the information in the Reuters article was taken, goes on to say how they were questioned. Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. Here's a transcript from the DoD's Defenselink: \"http://www.defenselink.mil/news/transcript_ISN10020.pdf\" Also, the book The One Percent Doctrine,, written by Ron Suskind, speaks of the threats to his children's lives. His reported response to the threat was that they'll \"be in a better place\" following their deaths. That book was written a year before the Reuters article was published. The German paper (somewhat tabloid-like) Der Spiegel interviewed Suskind, and he repeats his assertion. \"http://www.spiegel.de/international/0,1518,445117,00.html\" Again, I can't personally verify this information, it's why I'm saying that there are \"reports\" that such activity took place. But you asked, so there it is...", 
        "intTime": 20090420, 
        "postID": 6, 
        "quote": "Originally posted by klassylady25: What reports?", 
        "reply": " Here are two 2007 articles which speak of KSM's two children, then 7 and 9 years old, who were detained and questioned in September 2002, after his capture: \"http://uk.reuters.com/article/worldNews/idUKN0644490320070607?pageNumber=2&virtualBrandChannel=0\" \"http://www.smh.com.au/articles/2003/03/09/1047144871940.html\" The Human Rights Watch report, from which some of the information in the Reuters article was taken, goes on to say how they were questioned. Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. Here's a transcript from the DoD's Defenselink: \"http://www.defenselink.mil/news/transcript_ISN10020.pdf\" Also, the book The One Percent Doctrine,, written by Ron Suskind, speaks of the threats to his children's lives. His reported response to the threat was that they'll \"be in a better place\" following their deaths. That book was written a year before the Reuters article was published. The German paper (somewhat tabloid-like) Der Spiegel interviewed Suskind, and he repeats his assertion. \"http://www.spiegel.de/international/0,1518,445117,00.html\" Again, I can't personally verify this information, it's why I'm saying that there are \"reports\" that such activity took place. But you asked, so there it is...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:50:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: were detained and questioned in ooooh thats really harming them.... hell thats sop for any police force... you made it out like the children and wife was put in harms way and used as bargining chips.. but the facts are 180degrees from that... hahahahaha too funny...", 
        "intTime": 20090420, 
        "postID": 7, 
        "quote": "were detained and questioned in", 
        "reply": " ooooh thats really harming them.... hell thats sop for any police force... you made it out like the children and wife was put in harms way and used as bargining chips.. but the facts are 180degrees from that... hahahahaha too funny...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:56:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? It was necessary. A 9 and 7 year-old? Can I come and take your 9 and 7 year-old children for a few months and interrogate them? I'm pretty sure you've been breaking the law, but I need to find out what they know about you. They have the same ideology as you do, I suspect... As long as you don't think you'll ever be subjected to such an action, it's easy to say \"It was necessary.\" What a perfect little world you live in...LOL", 
        "intTime": 20090420, 
        "postID": 8, 
        "quote": "Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? It was necessary.", 
        "reply": " A 9 and 7 year-old? Can I come and take your 9 and 7 year-old children for a few months and interrogate them? I'm pretty sure you've been breaking the law, but I need to find out what they know about you. They have the same ideology as you do, I suspect... As long as you don't think you'll ever be subjected to such an action, it's easy to say \"It was necessary.\" What a perfect little world you live in...LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:00:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? \"They were found cowering behind a wardrobe with a senior al-Qaeda member.\" A nine and seven year-old...", 
        "intTime": 20090420, 
        "postID": 9, 
        "quote": "Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? \"They were found cowering behind a wardrobe with a senior al-Qaeda member.\"", 
        "reply": " A nine and seven year-old...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:02:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: \"We are handling them with kid gloves. After all, they are only little children,\" an official told the Telegraph, ''but we need to know as much about their father's recent activities as possible. We have child psychologists on hand at all times and they are given the best of care.'' World Net Daily 2003 Guess it comes down to what you choose to believe, doesn't it? Did you read the other stuff? I suspect that, if you did, you picked that which was closer to your personal beliefs, a typical exercise.", 
        "intTime": 20090420, 
        "postID": 10, 
        "quote": "Originally posted by klassylady25: \"We are handling them with kid gloves. After all, they are only little children,\" an official told the Telegraph, ''but we need to know as much about their father's recent activities as possible. We have child psychologists on hand at all times and they are given the best of care.'' World Net Daily 2003", 
        "reply": " Guess it comes down to what you choose to believe, doesn't it? Did you read the other stuff? I suspect that, if you did, you picked that which was closer to your personal beliefs, a typical exercise.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:05:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: In another country boys are looked on much differently than our pampers boys in America. Here they are immature at that age. There they are close to being young men. Why do you think Hitler wanted the youth? Because they're easy to manipulate. Seven and nine is seven and nine. They are children. Most Americans understand that. You're going in circles here, quoting one thing, then the next, then coming up with some justification for the action. What are you doing? LOL", 
        "intTime": 20090420, 
        "postID": 11, 
        "quote": "Originally posted by klassylady25: In another country boys are looked on much differently than our pampers boys in America. Here they are immature at that age. There they are close to being young men. Why do you think Hitler wanted the youth?", 
        "reply": " Because they're easy to manipulate. Seven and nine is seven and nine. They are children. Most Americans understand that. You're going in circles here, quoting one thing, then the next, then coming up with some justification for the action. What are you doing? LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:08:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "intTime": 20090420, 
        "postID": 12, 
        "quote": "Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them.", 
        "reply": " With rock solid references like these it must be true.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:11:00", 
        "title": "Waterboarding", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: And they are easy to get information from. I'm not going in circles, you're the one that is asking all the questions... keep going, maybe you'll find the answer. Back to the topic. Waterboarding and other forms of interrogation methods are needed to get intel. On what are you basing your assertion? Give me a tangible example.", 
        "intTime": 20090420, 
        "postID": 13, 
        "quote": "Originally posted by klassylady25: And they are easy to get information from. I'm not going in circles, you're the one that is asking all the questions... keep going, maybe you'll find the answer. Back to the topic. Waterboarding and other forms of interrogation methods are needed to get intel.", 
        "reply": " On what are you basing your assertion? Give me a tangible example.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:14:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. yea it also says in alquedas manual to claim stuff like that....", 
        "intTime": 20090420, 
        "postID": 14, 
        "quote": "Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "reply": " yea it also says in alquedas manual to claim stuff like that....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:15:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "intTime": 20090420, 
        "postID": 15, 
        "quote": "Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "reply": " Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:15:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "intTime": 20090420, 
        "postID": 16, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "reply": " its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:21:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL", 
        "intTime": 20090420, 
        "postID": 17, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "reply": " Are you serious?? LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:23:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "intTime": 20090420, 
        "postID": 18, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL", 
        "reply": " no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:29:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did... LOL So I guess you're gonna tell me how it really happened...", 
        "intTime": 20090420, 
        "postID": 19, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "reply": " LOL So I guess you're gonna tell me how it really happened...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:31:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "no i wasnt there but i do know it didnt happen the way the terrorist said it did... and yes kids are terrorist too especially when they tote the alqueda line....", 
        "intTime": 20090420, 
        "postID": 20, 
        "quote": "", 
        "reply": "no i wasnt there but i do know it didnt happen the way the terrorist said it did... and yes kids are terrorist too especially when they tote the alqueda line....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:43:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "kid can kill just as any other person who is older... my cousin larry had many of stories about vietnam and kids strapped with explosives walking into camp and blowing themselves up along with GIs\\Marines...", 
        "intTime": 20090420, 
        "postID": 21, 
        "quote": "", 
        "reply": "kid can kill just as any other person who is older... my cousin larry had many of stories about vietnam and kids strapped with explosives walking into camp and blowing themselves up along with GIs\\Marines...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:44:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "So. TEA party supproter.", 
        "intTime": 20090420, 
        "postID": 22, 
        "quote": "", 
        "reply": "So. TEA party supproter.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 06:30:00", 
        "title": "Waterboarding", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "No wonder his hair looks so clean!", 
        "intTime": 20090420, 
        "postID": 23, 
        "quote": "", 
        "reply": "No wonder his hair looks so clean!", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 06:40:00", 
        "title": "Waterboarding", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "intTime": 20090420, 
        "postID": 24, 
        "quote": "", 
        "reply": "According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:15:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "well first i would of broken his knuckles with pliers... i seen something on the Tudors last night that i would like to do to him too... hot red poker and well use your imagination... basically he would not survive if i would be allowed to do what i would want to.....", 
        "intTime": 20090420, 
        "postID": 25, 
        "quote": "", 
        "reply": "well first i would of broken his knuckles with pliers... i seen something on the Tudors last night that i would like to do to him too... hot red poker and well use your imagination... basically he would not survive if i would be allowed to do what i would want to.....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:30:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think? oh bull crap his family was never threaten or put in any harm... if there is a report like that it is lies....", 
        "intTime": 20090420, 
        "postID": 26, 
        "quote": "Originally posted by mcgreer: According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "reply": " oh bull crap his family was never threaten or put in any harm... if there is a report like that it is lies....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:31:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: What reports? Here are two 2007 articles which speak of KSM's two children, then 7 and 9 years old, who were detained and questioned in September 2002, after his capture: \"http://uk.reuters.com/article/worldNews/idUKN0644490320070607?pageNumber=2&virtualBrandChannel=0\" \"http://www.smh.com.au/articles/2003/03/09/1047144871940.html\" The Human Rights Watch report, from which some of the information in the Reuters article was taken, goes on to say how they were questioned. Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. Here's a transcript from the DoD's Defenselink: \"http://www.defenselink.mil/news/transcript_ISN10020.pdf\" Also, the book The One Percent Doctrine,, written by Ron Suskind, speaks of the threats to his children's lives. His reported response to the threat was that they'll \"be in a better place\" following their deaths. That book was written a year before the Reuters article was published. The German paper (somewhat tabloid-like) Der Spiegel interviewed Suskind, and he repeats his assertion. \"http://www.spiegel.de/international/0,1518,445117,00.html\" Again, I can't personally verify this information, it's why I'm saying that there are \"reports\" that such activity took place. But you asked, so there it is...", 
        "intTime": 20090420, 
        "postID": 27, 
        "quote": "Originally posted by klassylady25: What reports?", 
        "reply": " Here are two 2007 articles which speak of KSM's two children, then 7 and 9 years old, who were detained and questioned in September 2002, after his capture: \"http://uk.reuters.com/article/worldNews/idUKN0644490320070607?pageNumber=2&virtualBrandChannel=0\" \"http://www.smh.com.au/articles/2003/03/09/1047144871940.html\" The Human Rights Watch report, from which some of the information in the Reuters article was taken, goes on to say how they were questioned. Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. Here's a transcript from the DoD's Defenselink: \"http://www.defenselink.mil/news/transcript_ISN10020.pdf\" Also, the book The One Percent Doctrine,, written by Ron Suskind, speaks of the threats to his children's lives. His reported response to the threat was that they'll \"be in a better place\" following their deaths. That book was written a year before the Reuters article was published. The German paper (somewhat tabloid-like) Der Spiegel interviewed Suskind, and he repeats his assertion. \"http://www.spiegel.de/international/0,1518,445117,00.html\" Again, I can't personally verify this information, it's why I'm saying that there are \"reports\" that such activity took place. But you asked, so there it is...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:50:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: were detained and questioned in ooooh thats really harming them.... hell thats sop for any police force... you made it out like the children and wife was put in harms way and used as bargining chips.. but the facts are 180degrees from that... hahahahaha too funny...", 
        "intTime": 20090420, 
        "postID": 28, 
        "quote": "were detained and questioned in", 
        "reply": " ooooh thats really harming them.... hell thats sop for any police force... you made it out like the children and wife was put in harms way and used as bargining chips.. but the facts are 180degrees from that... hahahahaha too funny...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:56:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? It was necessary. A 9 and 7 year-old? Can I come and take your 9 and 7 year-old children for a few months and interrogate them? I'm pretty sure you've been breaking the law, but I need to find out what they know about you. They have the same ideology as you do, I suspect... As long as you don't think you'll ever be subjected to such an action, it's easy to say \"It was necessary.\" What a perfect little world you live in...LOL", 
        "intTime": 20090420, 
        "postID": 29, 
        "quote": "Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? It was necessary.", 
        "reply": " A 9 and 7 year-old? Can I come and take your 9 and 7 year-old children for a few months and interrogate them? I'm pretty sure you've been breaking the law, but I need to find out what they know about you. They have the same ideology as you do, I suspect... As long as you don't think you'll ever be subjected to such an action, it's easy to say \"It was necessary.\" What a perfect little world you live in...LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:00:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? \"They were found cowering behind a wardrobe with a senior al-Qaeda member.\" A nine and seven year-old...", 
        "intTime": 20090420, 
        "postID": 30, 
        "quote": "Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? \"They were found cowering behind a wardrobe with a senior al-Qaeda member.\"", 
        "reply": " A nine and seven year-old...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:02:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: \"We are handling them with kid gloves. After all, they are only little children,\" an official told the Telegraph, ''but we need to know as much about their father's recent activities as possible. We have child psychologists on hand at all times and they are given the best of care.'' World Net Daily 2003 Guess it comes down to what you choose to believe, doesn't it? Did you read the other stuff? I suspect that, if you did, you picked that which was closer to your personal beliefs, a typical exercise.", 
        "intTime": 20090420, 
        "postID": 31, 
        "quote": "Originally posted by klassylady25: \"We are handling them with kid gloves. After all, they are only little children,\" an official told the Telegraph, ''but we need to know as much about their father's recent activities as possible. We have child psychologists on hand at all times and they are given the best of care.'' World Net Daily 2003", 
        "reply": " Guess it comes down to what you choose to believe, doesn't it? Did you read the other stuff? I suspect that, if you did, you picked that which was closer to your personal beliefs, a typical exercise.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:05:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: In another country boys are looked on much differently than our pampers boys in America. Here they are immature at that age. There they are close to being young men. Why do you think Hitler wanted the youth? Because they're easy to manipulate. Seven and nine is seven and nine. They are children. Most Americans understand that. You're going in circles here, quoting one thing, then the next, then coming up with some justification for the action. What are you doing? LOL", 
        "intTime": 20090420, 
        "postID": 32, 
        "quote": "Originally posted by klassylady25: In another country boys are looked on much differently than our pampers boys in America. Here they are immature at that age. There they are close to being young men. Why do you think Hitler wanted the youth?", 
        "reply": " Because they're easy to manipulate. Seven and nine is seven and nine. They are children. Most Americans understand that. You're going in circles here, quoting one thing, then the next, then coming up with some justification for the action. What are you doing? LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:08:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "intTime": 20090420, 
        "postID": 33, 
        "quote": "Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them.", 
        "reply": " With rock solid references like these it must be true.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:11:00", 
        "title": "Waterboarding", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: And they are easy to get information from. I'm not going in circles, you're the one that is asking all the questions... keep going, maybe you'll find the answer. Back to the topic. Waterboarding and other forms of interrogation methods are needed to get intel. On what are you basing your assertion? Give me a tangible example.", 
        "intTime": 20090420, 
        "postID": 34, 
        "quote": "Originally posted by klassylady25: And they are easy to get information from. I'm not going in circles, you're the one that is asking all the questions... keep going, maybe you'll find the answer. Back to the topic. Waterboarding and other forms of interrogation methods are needed to get intel.", 
        "reply": " On what are you basing your assertion? Give me a tangible example.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:14:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. yea it also says in alquedas manual to claim stuff like that....", 
        "intTime": 20090420, 
        "postID": 35, 
        "quote": "Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "reply": " yea it also says in alquedas manual to claim stuff like that....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:15:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "intTime": 20090420, 
        "postID": 36, 
        "quote": "Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "reply": " Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:15:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "intTime": 20090420, 
        "postID": 37, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "reply": " its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:21:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL", 
        "intTime": 20090420, 
        "postID": 38, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "reply": " Are you serious?? LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:23:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "intTime": 20090420, 
        "postID": 39, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL", 
        "reply": " no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:29:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did... LOL So I guess you're gonna tell me how it really happened...", 
        "intTime": 20090420, 
        "postID": 40, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "reply": " LOL So I guess you're gonna tell me how it really happened...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:31:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "no i wasnt there but i do know it didnt happen the way the terrorist said it did... and yes kids are terrorist too especially when they tote the alqueda line....", 
        "intTime": 20090420, 
        "postID": 41, 
        "quote": "", 
        "reply": "no i wasnt there but i do know it didnt happen the way the terrorist said it did... and yes kids are terrorist too especially when they tote the alqueda line....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:43:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "kid can kill just as any other person who is older... my cousin larry had many of stories about vietnam and kids strapped with explosives walking into camp and blowing themselves up along with GIs\\Marines...", 
        "intTime": 20090420, 
        "postID": 42, 
        "quote": "", 
        "reply": "kid can kill just as any other person who is older... my cousin larry had many of stories about vietnam and kids strapped with explosives walking into camp and blowing themselves up along with GIs\\Marines...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:44:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "So. TEA party supproter.", 
        "intTime": 20090420, 
        "postID": 43, 
        "quote": "", 
        "reply": "So. TEA party supproter.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 06:30:00", 
        "title": "Waterboarding", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "No wonder his hair looks so clean!", 
        "intTime": 20090420, 
        "postID": 44, 
        "quote": "", 
        "reply": "No wonder his hair looks so clean!", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 06:40:00", 
        "title": "Waterboarding", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "intTime": 20090420, 
        "postID": 45, 
        "quote": "", 
        "reply": "According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:15:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "well first i would of broken his knuckles with pliers... i seen something on the Tudors last night that i would like to do to him too... hot red poker and well use your imagination... basically he would not survive if i would be allowed to do what i would want to.....", 
        "intTime": 20090420, 
        "postID": 46, 
        "quote": "", 
        "reply": "well first i would of broken his knuckles with pliers... i seen something on the Tudors last night that i would like to do to him too... hot red poker and well use your imagination... basically he would not survive if i would be allowed to do what i would want to.....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:30:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think? oh bull crap his family was never threaten or put in any harm... if there is a report like that it is lies....", 
        "intTime": 20090420, 
        "postID": 47, 
        "quote": "Originally posted by mcgreer: According to reports, in addition to the waterboarding, the lives of his two children were threatened. I'd guess that the waterboarding didn't work if it came down to holding the lives of his children in front of him. What do you think?", 
        "reply": " oh bull crap his family was never threaten or put in any harm... if there is a report like that it is lies....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:31:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: What reports? Here are two 2007 articles which speak of KSM's two children, then 7 and 9 years old, who were detained and questioned in September 2002, after his capture: \"http://uk.reuters.com/article/worldNews/idUKN0644490320070607?pageNumber=2&virtualBrandChannel=0\" \"http://www.smh.com.au/articles/2003/03/09/1047144871940.html\" The Human Rights Watch report, from which some of the information in the Reuters article was taken, goes on to say how they were questioned. Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. Here's a transcript from the DoD's Defenselink: \"http://www.defenselink.mil/news/transcript_ISN10020.pdf\" Also, the book The One Percent Doctrine,, written by Ron Suskind, speaks of the threats to his children's lives. His reported response to the threat was that they'll \"be in a better place\" following their deaths. That book was written a year before the Reuters article was published. The German paper (somewhat tabloid-like) Der Spiegel interviewed Suskind, and he repeats his assertion. \"http://www.spiegel.de/international/0,1518,445117,00.html\" Again, I can't personally verify this information, it's why I'm saying that there are \"reports\" that such activity took place. But you asked, so there it is...", 
        "intTime": 20090420, 
        "postID": 48, 
        "quote": "Originally posted by klassylady25: What reports?", 
        "reply": " Here are two 2007 articles which speak of KSM's two children, then 7 and 9 years old, who were detained and questioned in September 2002, after his capture: \"http://uk.reuters.com/article/worldNews/idUKN0644490320070607?pageNumber=2&virtualBrandChannel=0\" \"http://www.smh.com.au/articles/2003/03/09/1047144871940.html\" The Human Rights Watch report, from which some of the information in the Reuters article was taken, goes on to say how they were questioned. Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. Here's a transcript from the DoD's Defenselink: \"http://www.defenselink.mil/news/transcript_ISN10020.pdf\" Also, the book The One Percent Doctrine,, written by Ron Suskind, speaks of the threats to his children's lives. His reported response to the threat was that they'll \"be in a better place\" following their deaths. That book was written a year before the Reuters article was published. The German paper (somewhat tabloid-like) Der Spiegel interviewed Suskind, and he repeats his assertion. \"http://www.spiegel.de/international/0,1518,445117,00.html\" Again, I can't personally verify this information, it's why I'm saying that there are \"reports\" that such activity took place. But you asked, so there it is...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:50:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: were detained and questioned in ooooh thats really harming them.... hell thats sop for any police force... you made it out like the children and wife was put in harms way and used as bargining chips.. but the facts are 180degrees from that... hahahahaha too funny...", 
        "intTime": 20090420, 
        "postID": 49, 
        "quote": "were detained and questioned in", 
        "reply": " ooooh thats really harming them.... hell thats sop for any police force... you made it out like the children and wife was put in harms way and used as bargining chips.. but the facts are 180degrees from that... hahahahaha too funny...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 07:56:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? It was necessary. A 9 and 7 year-old? Can I come and take your 9 and 7 year-old children for a few months and interrogate them? I'm pretty sure you've been breaking the law, but I need to find out what they know about you. They have the same ideology as you do, I suspect... As long as you don't think you'll ever be subjected to such an action, it's easy to say \"It was necessary.\" What a perfect little world you live in...LOL", 
        "intTime": 20090420, 
        "postID": 50, 
        "quote": "Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? It was necessary.", 
        "reply": " A 9 and 7 year-old? Can I come and take your 9 and 7 year-old children for a few months and interrogate them? I'm pretty sure you've been breaking the law, but I need to find out what they know about you. They have the same ideology as you do, I suspect... As long as you don't think you'll ever be subjected to such an action, it's easy to say \"It was necessary.\" What a perfect little world you live in...LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:00:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? \"They were found cowering behind a wardrobe with a senior al-Qaeda member.\" A nine and seven year-old...", 
        "intTime": 20090420, 
        "postID": 51, 
        "quote": "Originally posted by klassylady25: So you don't agree with detaining and questioning the children? Children who have been raised and were being taught the same ideology? \"They were found cowering behind a wardrobe with a senior al-Qaeda member.\"", 
        "reply": " A nine and seven year-old...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:02:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: \"We are handling them with kid gloves. After all, they are only little children,\" an official told the Telegraph, ''but we need to know as much about their father's recent activities as possible. We have child psychologists on hand at all times and they are given the best of care.'' World Net Daily 2003 Guess it comes down to what you choose to believe, doesn't it? Did you read the other stuff? I suspect that, if you did, you picked that which was closer to your personal beliefs, a typical exercise.", 
        "intTime": 20090420, 
        "postID": 52, 
        "quote": "Originally posted by klassylady25: \"We are handling them with kid gloves. After all, they are only little children,\" an official told the Telegraph, ''but we need to know as much about their father's recent activities as possible. We have child psychologists on hand at all times and they are given the best of care.'' World Net Daily 2003", 
        "reply": " Guess it comes down to what you choose to believe, doesn't it? Did you read the other stuff? I suspect that, if you did, you picked that which was closer to your personal beliefs, a typical exercise.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:05:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: In another country boys are looked on much differently than our pampers boys in America. Here they are immature at that age. There they are close to being young men. Why do you think Hitler wanted the youth? Because they're easy to manipulate. Seven and nine is seven and nine. They are children. Most Americans understand that. You're going in circles here, quoting one thing, then the next, then coming up with some justification for the action. What are you doing? LOL", 
        "intTime": 20090420, 
        "postID": 53, 
        "quote": "Originally posted by klassylady25: In another country boys are looked on much differently than our pampers boys in America. Here they are immature at that age. There they are close to being young men. Why do you think Hitler wanted the youth?", 
        "reply": " Because they're easy to manipulate. Seven and nine is seven and nine. They are children. Most Americans understand that. You're going in circles here, quoting one thing, then the next, then coming up with some justification for the action. What are you doing? LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:08:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "intTime": 20090420, 
        "postID": 54, 
        "quote": "Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them.", 
        "reply": " With rock solid references like these it must be true.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:11:00", 
        "title": "Waterboarding", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: And they are easy to get information from. I'm not going in circles, you're the one that is asking all the questions... keep going, maybe you'll find the answer. Back to the topic. Waterboarding and other forms of interrogation methods are needed to get intel. On what are you basing your assertion? Give me a tangible example.", 
        "intTime": 20090420, 
        "postID": 55, 
        "quote": "Originally posted by klassylady25: And they are easy to get information from. I'm not going in circles, you're the one that is asking all the questions... keep going, maybe you'll find the answer. Back to the topic. Waterboarding and other forms of interrogation methods are needed to get intel.", 
        "reply": " On what are you basing your assertion? Give me a tangible example.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:14:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. yea it also says in alquedas manual to claim stuff like that....", 
        "intTime": 20090420, 
        "postID": 56, 
        "quote": "Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "reply": " yea it also says in alquedas manual to claim stuff like that....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:15:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "intTime": 20090420, 
        "postID": 57, 
        "quote": "Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true.", 
        "reply": " Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:15:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "intTime": 20090420, 
        "postID": 58, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context.", 
        "reply": " its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:21:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL", 
        "intTime": 20090420, 
        "postID": 59, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda...", 
        "reply": " Are you serious?? LOL", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:23:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "intTime": 20090420, 
        "postID": 60, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL", 
        "reply": " no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:29:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did... LOL So I guess you're gonna tell me how it really happened...", 
        "intTime": 20090420, 
        "postID": 61, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: quote: Originally posted by mcgreer: quote: Originally posted by athos20: quote: Second-hand reports from family members of other captured Pakistanis, say that KSM's children were coerced by placing ants on them. With rock solid references like these it must be true. Might not be, either. Did you read the Defenselink transcript I attached? Not helpful to snatch something out of context. its crap dude... did you read the alquedas manual to where it says to make them claims??? no i didnt think so... its fake lies propaganda ... dont be a sucker and believe alquedas propaganda... Are you serious?? LOL no are you serious....yes i am dead serious... its fake lies propaganda... didnt really happen as they said it did...", 
        "reply": " LOL So I guess you're gonna tell me how it really happened...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:31:00", 
        "title": "Waterboarding", 
        "userID": "mcgreer"
    }, 
    {
        "content": "no i wasnt there but i do know it didnt happen the way the terrorist said it did... and yes kids are terrorist too especially when they tote the alqueda line....", 
        "intTime": 20090420, 
        "postID": 62, 
        "quote": "", 
        "reply": "no i wasnt there but i do know it didnt happen the way the terrorist said it did... and yes kids are terrorist too especially when they tote the alqueda line....", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:43:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }, 
    {
        "content": "kid can kill just as any other person who is older... my cousin larry had many of stories about vietnam and kids strapped with explosives walking into camp and blowing themselves up along with GIs\\Marines...", 
        "intTime": 20090420, 
        "postID": 63, 
        "quote": "", 
        "reply": "kid can kill just as any other person who is older... my cousin larry had many of stories about vietnam and kids strapped with explosives walking into camp and blowing themselves up along with GIs\\Marines...", 
        "threadID": "409192893_4700062122001", 
        "time": "2009-04-20 08:44:00", 
        "title": "Waterboarding", 
        "userID": "outlaws93"
    }
]