[
    {
        "content": "\"Married gays in Mass. sue US for federal benefits\" \"http://apnews.myway.com/article/20090303/D96MBMHG0.html\" \"BOSTON (AP) - Mary Ritchie, a Massachusetts State Police trooper, has been married for almost five years and has two children. But when she files her federal income tax return, she's not allowed to check the \"married filing jointly\" box.\" Not about the money, huh? Sure seems that way.", 
        "intTime": 20090303, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"Married gays in Mass. sue US for federal benefits\" \"http://apnews.myway.com/article/20090303/D96MBMHG0.html\" \"BOSTON (AP) - Mary Ritchie, a Massachusetts State Police trooper, has been married for almost five years and has two children. But when she files her federal income tax return, she's not allowed to check the \"married filing jointly\" box.\" Not about the money, huh? Sure seems that way.", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 07:01:00", 
        "title": "Gays all about the money", 
        "userID": "transport1"
    }, 
    {
        "content": "I assume that since marriage is in no way about money that you do not file jointly.", 
        "intTime": 20090303, 
        "postID": 2, 
        "quote": "", 
        "reply": "I assume that since marriage is in no way about money that you do not file jointly.", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 07:52:00", 
        "title": "Gays all about the money", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: I assume that since marriage is in no way about money that you do not file jointly. Well, you know what they say about the word ASSUME, and you fit the bill.", 
        "intTime": 20090303, 
        "postID": 3, 
        "quote": "Originally posted by thorin001: I assume that since marriage is in no way about money that you do not file jointly.", 
        "reply": " Well, you know what they say about the word ASSUME, and you fit the bill.", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 08:58:00", 
        "title": "Gays all about the money", 
        "userID": "transport1"
    }, 
    {
        "content": "The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they?", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "", 
        "reply": "The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they?", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 09:45:00", 
        "title": "Gays all about the money", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they? No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they?", 
        "reply": " No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 10:05:00", 
        "title": "Gays all about the money", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Perhaps, but having children is not a condition or requirement of a legal marriage contract. People who are beyond child-bearing years marry or re-marry. People who have been medically sterilized marry. People get married, have kids, and then get divorced (50% divorce rate - oh, the sanctity of marriage!), leaving the children in limbo between two halves of a broken home. And then there are gay couples who do have children who would love to get married in order to provide that stable and secure environment, yet they are not allowed the legal protections of marriage. Often, when they already have children, ever legal blockage possible is put in their paths, making it even harder for them to provide a stable household for their children. LEGAL marriage is about LEGAL rights, privileges, and protections. FAMILY is whatever you want to make of it. \"Man + Woman + Children\" does not necessarily equal a \"stable and secure environment\" for children or society. When it has better than a 50% success rate, then you might have a shred of an argument.", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "Originally posted by EngrOpsNCO: No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory...", 
        "reply": " Perhaps, but having children is not a condition or requirement of a legal marriage contract. People who are beyond child-bearing years marry or re-marry. People who have been medically sterilized marry. People get married, have kids, and then get divorced (50% divorce rate - oh, the sanctity of marriage!), leaving the children in limbo between two halves of a broken home. And then there are gay couples who do have children who would love to get married in order to provide that stable and secure environment, yet they are not allowed the legal protections of marriage. Often, when they already have children, ever legal blockage possible is put in their paths, making it even harder for them to provide a stable household for their children. LEGAL marriage is about LEGAL rights, privileges, and protections. FAMILY is whatever you want to make of it. \"Man + Woman + Children\" does not necessarily equal a \"stable and secure environment\" for children or society. When it has better than a 50% success rate, then you might have a shred of an argument.", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 10:14:00", 
        "title": "Gays all about the money", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by EngrOpsNCO: No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Perhaps, but having children is not a condition or requirement of a legal marriage contract. People who are beyond child-bearing years marry or re-marry. People who have been medically sterilized marry. People get married, have kids, and then get divorced (50% divorce rate - oh, the sanctity of marriage!), leaving the children in limbo between two halves of a broken home. And then there are gay couples who do have children who would love to get married in order to provide that stable and secure environment, yet they are not allowed the legal protections of marriage. Often, when they already have children, ever legal blockage possible is put in their paths, making it even harder for them to provide a stable household for their children. LEGAL marriage is about LEGAL rights, privileges, and protections. FAMILY is whatever you want to make of it. \"Man + Woman + Children\" does not necessarily equal a \"stable and secure environment\" for children or society. When it has better than a 50% success rate, then you might have a shred of an argument. “What marriage was about…monetary, society? It was about society, were talking original intent. Lots of things society has let change since then, you mentioned a few...then there are more... like, oh, gays being allowed anything, even life. Many wrongs have changed since then; I don’t think society is ready to say the definition of marriage is going to be one of those. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by EngrOpsNCO: No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Perhaps, but having children is not a condition or requirement of a legal marriage contract. People who are beyond child-bearing years marry or re-marry. People who have been medically sterilized marry. People get married, have kids, and then get divorced (50% divorce rate - oh, the sanctity of marriage!), leaving the children in limbo between two halves of a broken home. And then there are gay couples who do have children who would love to get married in order to provide that stable and secure environment, yet they are not allowed the legal protections of marriage. Often, when they already have children, ever legal blockage possible is put in their paths, making it even harder for them to provide a stable household for their children. LEGAL marriage is about LEGAL rights, privileges, and protections. FAMILY is whatever you want to make of it. \"Man + Woman + Children\" does not necessarily equal a \"stable and secure environment\" for children or society. When it has better than a 50% success rate, then you might have a shred of an argument.", 
        "reply": " “What marriage was about…monetary, society? It was about society, were talking original intent. Lots of things society has let change since then, you mentioned a few...then there are more... like, oh, gays being allowed anything, even life. Many wrongs have changed since then; I don’t think society is ready to say the definition of marriage is going to be one of those. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 10:55:00", 
        "title": "Gays all about the money", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "This simple answer to this is to give committed gay couples the same legal rights as committed straight couples. Allow them the tax breaks, ability to make medical decisions, etc. Keep marriage as a religious ceremony; then individual churches can decide who they allow to marry. The problem here is that \"marriage\" is both a religious and legal issue. Thus, if a religion does not allow two people to marry, those people cannot enjoy the legal benefits that come with the marriage certificate because many believe homosexuality is a sin. Maybe it is, I don't really care as this issue doesn't affect me. In the interest of fairness and democracy, all people should have the same legal rights. Churches should be able to make their own ethical decisions.", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "", 
        "reply": "This simple answer to this is to give committed gay couples the same legal rights as committed straight couples. Allow them the tax breaks, ability to make medical decisions, etc. Keep marriage as a religious ceremony; then individual churches can decide who they allow to marry. The problem here is that \"marriage\" is both a religious and legal issue. Thus, if a religion does not allow two people to marry, those people cannot enjoy the legal benefits that come with the marriage certificate because many believe homosexuality is a sin. Maybe it is, I don't really care as this issue doesn't affect me. In the interest of fairness and democracy, all people should have the same legal rights. Churches should be able to make their own ethical decisions.", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 13:21:00", 
        "title": "Gays all about the money", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: This simple answer to this is to give committed gay couples the same legal rights as committed straight couples. Allow them the tax breaks, ability to make medical decisions, etc. Keep marriage as a religious ceremony; then individual churches can decide who they allow to marry. The problem here is that \"marriage\" is both a religious and legal issue. Thus, if a religion does not allow two people to marry, those people cannot enjoy the legal benefits that come with the marriage certificate because many believe homosexuality is a sin. Maybe it is, I don't really care as this issue doesn't affect me. In the interest of fairness and democracy, all people should have the same legal rights. Churches should be able to make their own ethical decisions. I'm perfectly fine with that solution. I'm perfectly fine with the legal aspects being completely separate from the religious aspects. You want the legal benefits? Get a civil union, and make civil unions available to any committed adult couple. You want a religious marriage? Go to your church, temple, synagogue, mosque, or whatever else you've got. My church allows gay marriage. I was married by an ordained minister. Marriage is religious? Oh good, I guess I'm married!", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "Originally posted by foxred03: This simple answer to this is to give committed gay couples the same legal rights as committed straight couples. Allow them the tax breaks, ability to make medical decisions, etc. Keep marriage as a religious ceremony; then individual churches can decide who they allow to marry. The problem here is that \"marriage\" is both a religious and legal issue. Thus, if a religion does not allow two people to marry, those people cannot enjoy the legal benefits that come with the marriage certificate because many believe homosexuality is a sin. Maybe it is, I don't really care as this issue doesn't affect me. In the interest of fairness and democracy, all people should have the same legal rights. Churches should be able to make their own ethical decisions.", 
        "reply": " I'm perfectly fine with that solution. I'm perfectly fine with the legal aspects being completely separate from the religious aspects. You want the legal benefits? Get a civil union, and make civil unions available to any committed adult couple. You want a religious marriage? Go to your church, temple, synagogue, mosque, or whatever else you've got. My church allows gay marriage. I was married by an ordained minister. Marriage is religious? Oh good, I guess I'm married!", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 13:32:00", 
        "title": "Gays all about the money", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they? Another good reason for a flat tax rate with zero deductions, Everyone pays an individual tax on what they earn no deductions then it end this gay problem, the corp. rip offs, the Pac money, Etc.........", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they?", 
        "reply": " Another good reason for a flat tax rate with zero deductions, Everyone pays an individual tax on what they earn no deductions then it end this gay problem, the corp. rip offs, the Pac money, Etc.........", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 15:02:00", 
        "title": "Gays all about the money", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: quote: Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they? No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Was is correct. In order to have that working mothers have to stay home raise thoes kids and monitor their activities. Latch key kids aint a good Idea.", 
        "intTime": 20090303, 
        "postID": 11, 
        "quote": "Originally posted by EngrOpsNCO: quote: Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they? No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory...", 
        "reply": " Was is correct. In order to have that working mothers have to stay home raise thoes kids and monitor their activities. Latch key kids aint a good Idea.", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 15:08:00", 
        "title": "Gays all about the money", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Well then how does divorce fit into that theory? Don't hear the churches whining about that too much.", 
        "intTime": 20090303, 
        "postID": 12, 
        "quote": "No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory...", 
        "reply": " Well then how does divorce fit into that theory? Don't hear the churches whining about that too much.", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-03 15:18:00", 
        "title": "Gays all about the money", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Well then how does divorce fit into that theory? Don't hear the churches whining about that too much. You have to go to church to hear preaching against divorce. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "Originally posted by FrJohn1123: quote: No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Well then how does divorce fit into that theory? Don't hear the churches whining about that too much.", 
        "reply": " You have to go to church to hear preaching against divorce. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-04 09:59:00", 
        "title": "Gays all about the money", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by EngrOpsNCO: quote: Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they? No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Was is correct. In order to have that working mothers have to stay home raise thoes kids and monitor their activities. Latch key kids aint a good Idea. It seems to me that same thought process led to the proposition that having fathers at home wasn't all that important either. FAIL \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090304, 
        "postID": 14, 
        "quote": "Originally posted by john2x: quote: Originally posted by EngrOpsNCO: quote: Originally posted by Whirled_Peas: The tax laws are only one example of inequality in the laws. If marriage isn't about money, then put your money where your mouth is and file your taxes individually. If marriage isn't about legal rights and protections, then you should only get married in your church and not file any legal papers (you're allowed to do that) and reject any legal privileges granted to married couples. Be married \"religiously\" but ignore the paperwork and legal aspects, which are not required for a religious marriage. Couples help to take care of each other, pay for things together, and have joint ownership of many assets. It's perfectly reasonable to want the same rights in regards to taxation as every other married couple. Why, as a married person, should I be forced to pay the higher \"single\" tax rate because of the gender of my spouse? That's not religious stuff - that's legal stuff. Tax codes. But then, what about the other benefits? Why can't my spouse receive social security benefits if I die? Why can't she get my belongings without paying inheritance taxes, whereas if she was my federally-recognized legal spouse, there would be no inheritance taxes? Marriage isn't about monetary benefits, but they sure are nice, aren't they? No, marriage is about procreating and raising those offspring in a stable and secure environment in order to have a stable society. Least that was the theory... Was is correct. In order to have that working mothers have to stay home raise thoes kids and monitor their activities. Latch key kids aint a good Idea.", 
        "reply": " It seems to me that same thought process led to the proposition that having fathers at home wasn't all that important either. FAIL \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8240077612001", 
        "time": "2009-03-04 10:07:00", 
        "title": "Gays all about the money", 
        "userID": "EngrOpsNCO"
    }
]