[
    {
        "content": "he has been asked twice now, on two different testimonies in front of Congress HOW MUCH MONEY LEFT IN TARP?? simple question asked twice on two different days ANSWER: HE NEVER GAVE ONE This man is the secretary of the treasury and he wants to be king??? when will someone say something about this", 
        "intTime": 20090327, 
        "postID": 1, 
        "quote": "", 
        "reply": "he has been asked twice now, on two different testimonies in front of Congress HOW MUCH MONEY LEFT IN TARP?? simple question asked twice on two different days ANSWER: HE NEVER GAVE ONE This man is the secretary of the treasury and he wants to be king??? when will someone say something about this", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 08:12:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Tim Geithner is a member of Obama's boy club. He got a pay check from AIG just like Obama's Chief of Staff did. They didn't get these jobs based on their smarts alone. They are all part of the master plan. America wanted hope and change, well they got it. John Edwards would have been on this list too if he could have kept his additional woman out of the lime light. When this is all over in the next 8 years don't be surprised if there is another flag flying above the stars and stripes on our nations flag poles.", 
        "intTime": 20090327, 
        "postID": 2, 
        "quote": "", 
        "reply": "Tim Geithner is a member of Obama's boy club. He got a pay check from AIG just like Obama's Chief of Staff did. They didn't get these jobs based on their smarts alone. They are all part of the master plan. America wanted hope and change, well they got it. John Edwards would have been on this list too if he could have kept his additional woman out of the lime light. When this is all over in the next 8 years don't be surprised if there is another flag flying above the stars and stripes on our nations flag poles.", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 08:42:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Tim Geithner is a member of Obama's boy club. He got a pay check from AIG just like Obama's Chief of Staff did. They didn't get these jobs based on their smarts alone. They are all part of the master plan. America wanted hope and change, well they got it. John Edwards would have been on this list too if he could have kept his additional woman out of the lime light. When this is all over in the next 8 years don't be surprised if there is another flag flying above the stars and stripes on our nations flag poles. What makes you think he'll be re-elected? 44% were right and already the 56% are changing their minds. He's shown his true colors already. I just hope that different flag is not flying at the end of his first term. If it is, there won't be another free election.", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "Originally posted by Duster6: Tim Geithner is a member of Obama's boy club. He got a pay check from AIG just like Obama's Chief of Staff did. They didn't get these jobs based on their smarts alone. They are all part of the master plan. America wanted hope and change, well they got it. John Edwards would have been on this list too if he could have kept his additional woman out of the lime light. When this is all over in the next 8 years don't be surprised if there is another flag flying above the stars and stripes on our nations flag poles.", 
        "reply": " What makes you think he'll be re-elected? 44% were right and already the 56% are changing their minds. He's shown his true colors already. I just hope that different flag is not flying at the end of his first term. If it is, there won't be another free election.", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 08:50:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Sec Treas debacle, when will it end In 4 years!", 
        "intTime": 20090327, 
        "postID": 4, 
        "quote": "Sec Treas debacle, when will it end", 
        "reply": " In 4 years!", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 08:52:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "The reason I think he will serve a second term is based on the simple fact that the republicans will sling their mud as usual and just keep bringing up the past. So far I haven't seen or heard anybody that can BS better than Obama. Like Willie, he knows how to talk. The winning ticket will be for someone to stay on track and give example after example on how they will fix America. We all know how we got here now we want to know how to get out.", 
        "intTime": 20090327, 
        "postID": 5, 
        "quote": "", 
        "reply": "The reason I think he will serve a second term is based on the simple fact that the republicans will sling their mud as usual and just keep bringing up the past. So far I haven't seen or heard anybody that can BS better than Obama. Like Willie, he knows how to talk. The winning ticket will be for someone to stay on track and give example after example on how they will fix America. We all know how we got here now we want to know how to get out.", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 08:56:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: The reason I think he will serve a second term is based on the simple fact that the republicans will sling their mud as usual and just keep bringing up the past. So far I haven't seen or heard anybody that can BS better than Obama. Like Willie, he knows how to talk. The winning ticket will be for someone to stay on track and give example after example on how they will fix America. We all know how we got here now we want to know how to get out. ....but!!! in less than four years, Obama will have a past. BS, now he does have it down pact. I've been watching him go to the airwaves alot as to BS the people because he knows the power is in the people and to BS the people successfully means, power over the party and Congress.", 
        "intTime": 20090327, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: The reason I think he will serve a second term is based on the simple fact that the republicans will sling their mud as usual and just keep bringing up the past. So far I haven't seen or heard anybody that can BS better than Obama. Like Willie, he knows how to talk. The winning ticket will be for someone to stay on track and give example after example on how they will fix America. We all know how we got here now we want to know how to get out.", 
        "reply": " ....but!!! in less than four years, Obama will have a past. BS, now he does have it down pact. I've been watching him go to the airwaves alot as to BS the people because he knows the power is in the people and to BS the people successfully means, power over the party and Congress.", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 09:08:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "the more truth spread about PBHO inability to lead, his lies, the flip flop he creates will add to his down fall, and i believe that the numbers are being kept in a log of failures.... Now he wants to be the hero of Afgahnistan the only difference between a dead taliban/alqueda in afghan should be the headstamp on the cartridge LC09 or LC08.. but it seems to be dead iraqi terrorist oh bush bad, dead afghan terrorist obama good what another crock", 
        "intTime": 20090327, 
        "postID": 7, 
        "quote": "", 
        "reply": "the more truth spread about PBHO inability to lead, his lies, the flip flop he creates will add to his down fall, and i believe that the numbers are being kept in a log of failures.... Now he wants to be the hero of Afgahnistan the only difference between a dead taliban/alqueda in afghan should be the headstamp on the cartridge LC09 or LC08.. but it seems to be dead iraqi terrorist oh bush bad, dead afghan terrorist obama good what another crock", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 09:29:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by EspritDeCorps: quote: Sec Treas debacle, when will it end In 4 years! 8. At least your ADMITTING it's a debacle!", 
        "intTime": 20090327, 
        "postID": 8, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by EspritDeCorps: quote: Sec Treas debacle, when will it end In 4 years! 8.", 
        "reply": " At least your ADMITTING it's a debacle!", 
        "threadID": "409192893_5920080912001", 
        "time": "2009-03-27 13:15:00", 
        "title": "Sec Treas debacle, when will it end", 
        "userID": "navy8086"
    }
]