[
    {
        "content": "A Dunlap editorial: >>>>http://www.youtube.com/watch?v=gJFY9N9SOWc&feature=sdig&et=1238227075.15", 
        "intTime": 20090328, 
        "postID": 1, 
        "quote": "", 
        "reply": "A Dunlap editorial: >>>>http://www.youtube.com/watch?v=gJFY9N9SOWc&feature=sdig&et=1238227075.15", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-28 01:56:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Not according to the President of Brazil...", 
        "intTime": 20090328, 
        "postID": 2, 
        "quote": "", 
        "reply": "Not according to the President of Brazil...", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-28 03:07:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "boazjones"
    }, 
    {
        "content": "The title should have been... Republicans Awesome, Dems Suck, Glenn Beck SUPERSTAR as in, Obama's been in power three months and Republicans already made Glenn Beck a superstar. GLENN BECK!!!", 
        "intTime": 20090330, 
        "postID": 3, 
        "quote": "", 
        "reply": "The title should have been... Republicans Awesome, Dems Suck, Glenn Beck SUPERSTAR as in, Obama's been in power three months and Republicans already made Glenn Beck a superstar. GLENN BECK!!!", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 02:30:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President.", 
        "intTime": 20090330, 
        "postID": 4, 
        "quote": "", 
        "reply": "There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 03:52:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President. I agree 100%. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090330, 
        "postID": 5, 
        "quote": "Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President.", 
        "reply": " I agree 100%. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 06:09:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "i do like glenn beck but he scares me sometimes... but politics is scary at times...", 
        "intTime": 20090330, 
        "postID": 6, 
        "quote": "", 
        "reply": "i do like glenn beck but he scares me sometimes... but politics is scary at times...", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 07:16:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by 15933079: While the status quo leaves a lot to be desired and seems to be pretty much on the wrong page.....Glen Beck wouldn't be a good politician (Too truthful). He understands the real situation and speaks out about it. A guiding light in a dark tunnel! So true...so true", 
        "intTime": 20090330, 
        "postID": 7, 
        "quote": "Originally posted by 15933079: While the status quo leaves a lot to be desired and seems to be pretty much on the wrong page.....Glen Beck wouldn't be a good politician (Too truthful). He understands the real situation and speaks out about it. A guiding light in a dark tunnel!", 
        "reply": " So true...so true", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 07:27:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by 15933079: While the status quo leaves a lot to be desired and seems to be pretty much on the wrong page.....Glen Beck wouldn't be a good politician (Too truthful). He understands the real situation and speaks out about it. A guiding light in a dark tunnel! So true...so true Concur", 
        "intTime": 20090330, 
        "postID": 8, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by 15933079: While the status quo leaves a lot to be desired and seems to be pretty much on the wrong page.....Glen Beck wouldn't be a good politician (Too truthful). He understands the real situation and speaks out about it. A guiding light in a dark tunnel! So true...so true", 
        "reply": " Concur", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 12:44:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "Yep... I like Beck. He has no problem calling the kettle black. He'd never make in Washington...", 
        "intTime": 20090330, 
        "postID": 9, 
        "quote": "", 
        "reply": "Yep... I like Beck. He has no problem calling the kettle black. He'd never make in Washington...", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 14:45:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "OldUSAFSniper"
    }, 
    {
        "content": "quote: Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President. I think you should run Glenn Beck and Sarah Palin for president. It would be a guarantee that the idiotic Republican Party would finally die the natural death it has refused to do in spite of it's arrogant ignorance these last decades. What ever happened to the semi-sane GOP of fifty years ago? It's gone... turned into this group-think bunch of uneducated morons who are ready to grab a gun and answer any problem in the world with it. Moral Majority, my a s s. And don't get me started on the Dems.... I haven't seen this much polarity since the day I accidentally hooked a twelve volt coil to 240. What is it going to take to get a good moderate party started?", 
        "intTime": 20090330, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President.", 
        "reply": " I think you should run Glenn Beck and Sarah Palin for president. It would be a guarantee that the idiotic Republican Party would finally die the natural death it has refused to do in spite of it's arrogant ignorance these last decades. What ever happened to the semi-sane GOP of fifty years ago? It's gone... turned into this group-think bunch of uneducated morons who are ready to grab a gun and answer any problem in the world with it. Moral Majority, my a s s. And don't get me started on the Dems.... I haven't seen this much polarity since the day I accidentally hooked a twelve volt coil to 240. What is it going to take to get a good moderate party started?", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 14:53:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "billbright"
    }, 
    {
        "content": "Ahhhh the moderates. Definition of a moderate = Someone who believes in something so little that they change their stance based upon the direction of the wind... or the polls.", 
        "intTime": 20090330, 
        "postID": 11, 
        "quote": "", 
        "reply": "Ahhhh the moderates. Definition of a moderate = Someone who believes in something so little that they change their stance based upon the direction of the wind... or the polls.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 14:54:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "OldUSAFSniper"
    }, 
    {
        "content": "quote: Originally posted by OldUSAFSniper: Ahhhh the moderates. Definition of a moderate = Someone who believes in something so little that they change their stance based upon the direction of the wind... or the polls. Oklahoma... figures.", 
        "intTime": 20090330, 
        "postID": 12, 
        "quote": "Originally posted by OldUSAFSniper: Ahhhh the moderates. Definition of a moderate = Someone who believes in something so little that they change their stance based upon the direction of the wind... or the polls.", 
        "reply": " Oklahoma... figures.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 15:03:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by OldUSAFSniper: Ahhhh the moderates. Definition of a moderate = Someone who believes in something so little that they change their stance based upon the direction of the wind... or the polls. Oklahoma... figures. Yep... no TARP money for the banks, they all turned it down in Oklahoma. Employment is up again this month. Car sales are up again. Legislature went Republican for the first time in 105 years. They're thinking of turning down the Stimulus money. And we just passed a law saying that unfunded mandates from the feds will not be adhered to. We have a constitutional amendment prohibiting same sex marriage; doesn't recognize any from any other state; we have concealed carry and make my day laws; we passed a law making employment of illegals a felony (60,000 left the state within a month); AND we're looking at a huge tax cut this year for corporations moving in from other states (we're ranked #2 in the US for business friendly places); AND we have more miles of lake shoreline than Minnesota. Makes for great bass fishing. And the best part? No freakin yankees...", 
        "intTime": 20090330, 
        "postID": 13, 
        "quote": "Originally posted by billbright: quote: Originally posted by OldUSAFSniper: Ahhhh the moderates. Definition of a moderate = Someone who believes in something so little that they change their stance based upon the direction of the wind... or the polls. Oklahoma... figures.", 
        "reply": " Yep... no TARP money for the banks, they all turned it down in Oklahoma. Employment is up again this month. Car sales are up again. Legislature went Republican for the first time in 105 years. They're thinking of turning down the Stimulus money. And we just passed a law saying that unfunded mandates from the feds will not be adhered to. We have a constitutional amendment prohibiting same sex marriage; doesn't recognize any from any other state; we have concealed carry and make my day laws; we passed a law making employment of illegals a felony (60,000 left the state within a month); AND we're looking at a huge tax cut this year for corporations moving in from other states (we're ranked #2 in the US for business friendly places); AND we have more miles of lake shoreline than Minnesota. Makes for great bass fishing. And the best part? No freakin yankees...", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 15:18:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "OldUSAFSniper"
    }, 
    {
        "content": "", 
        "intTime": 20090330, 
        "postID": 14, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 15:36:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "skinman13"
    }, 
    {
        "content": "Heads I win - Tails you lose REPUBLICANS:Advocate tax benefits loose regulations on commerce. = Keep the rich rich by allowing them to hold onto their money. DEMOCRATS:Advocate social services = Incentives for the poor to stay poor. It is human nature for people to take the path of least resistance especially when you grow up with welfare and food stamps as an example. Both parties create a division in economic classes. So while we fight each other over asinine differences, the people at the top of both parties laugh their way to the Swiss Bank UBS.", 
        "intTime": 20090330, 
        "postID": 15, 
        "quote": "", 
        "reply": "Heads I win - Tails you lose REPUBLICANS:Advocate tax benefits loose regulations on commerce. = Keep the rich rich by allowing them to hold onto their money. DEMOCRATS:Advocate social services = Incentives for the poor to stay poor. It is human nature for people to take the path of least resistance especially when you grow up with welfare and food stamps as an example. Both parties create a division in economic classes. So while we fight each other over asinine differences, the people at the top of both parties laugh their way to the Swiss Bank UBS.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 15:44:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: We have a constitutional amendment prohibiting same sex marriage I'm sure THAT'LL stop 'em.", 
        "intTime": 20090330, 
        "postID": 16, 
        "quote": "We have a constitutional amendment prohibiting same sex marriage", 
        "reply": " I'm sure THAT'LL stop 'em.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-30 15:51:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: We have a constitutional amendment prohibiting same sex marriage I'm sure THAT'LL stop 'em. I don't care if that stops them or not. The state just doesn't recognize a marriage or 'civil union.'", 
        "intTime": 20090331, 
        "postID": 17, 
        "quote": "Originally posted by billbright: quote: We have a constitutional amendment prohibiting same sex marriage I'm sure THAT'LL stop 'em.", 
        "reply": " I don't care if that stops them or not. The state just doesn't recognize a marriage or 'civil union.'", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-31 11:15:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "OldUSAFSniper"
    }, 
    {
        "content": "quote: Yep... no TARP money for the banks, they all turned it down in Oklahoma. Employment is up again this month. Car sales are up again. Legislature went Republican for the first time in 105 years. They're thinking of turning down the Stimulus money. And we just passed a law saying that unfunded mandates from the feds will not be adhered to. We have a constitutional amendment prohibiting same sex marriage; doesn't recognize any from any other state; we have concealed carry and make my day laws; we passed a law making employment of illegals a felony (60,000 left the state within a month); AND we're looking at a huge tax cut this year for corporations moving in from other states (we're ranked #2 in the US for business friendly places); AND we have more miles of lake shoreline than Minnesota. Makes for great bass fishing. And the best part? No freakin yankees... Sounds like a little piece of Heaven. What's the housing market like?", 
        "intTime": 20090331, 
        "postID": 18, 
        "quote": "Yep... no TARP money for the banks, they all turned it down in Oklahoma. Employment is up again this month. Car sales are up again. Legislature went Republican for the first time in 105 years. They're thinking of turning down the Stimulus money. And we just passed a law saying that unfunded mandates from the feds will not be adhered to. We have a constitutional amendment prohibiting same sex marriage; doesn't recognize any from any other state; we have concealed carry and make my day laws; we passed a law making employment of illegals a felony (60,000 left the state within a month); AND we're looking at a huge tax cut this year for corporations moving in from other states (we're ranked #2 in the US for business friendly places); AND we have more miles of lake shoreline than Minnesota. Makes for great bass fishing. And the best part? No freakin yankees...", 
        "reply": " Sounds like a little piece of Heaven. What's the housing market like?", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-31 11:26:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Keep the rich rich by allowing them to hold onto their money. What in the hell is wrong with trying to hold on to our money?? You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090331, 
        "postID": 19, 
        "quote": "Keep the rich rich by allowing them to hold onto their money.", 
        "reply": " What in the hell is wrong with trying to hold on to our money?? You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-31 11:32:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Keep the rich rich by allowing them to hold onto their money. What in the hell is wrong with trying to hold on to our money?? You can keep your change, I'll continue to hug my guns and religion. Good question. Follow up: what should they do with their money?", 
        "intTime": 20090331, 
        "postID": 20, 
        "quote": "Originally posted by mnoble1066: quote: Keep the rich rich by allowing them to hold onto their money. What in the hell is wrong with trying to hold on to our money?? You can keep your change, I'll continue to hug my guns and religion.", 
        "reply": " Good question. Follow up: what should they do with their money?", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-31 12:08:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "BayStateGal"
    }, 
    {
        "content": "When did it become a crime to be successful in this Country? I worked hard all my life. I Enlisted, used my money to go to college, and got a Commission. First Commissioned Officer on either side of my family. Worked some good jobs, worked some bad ones too and now I have a decent career with decent pay on top of my Military service. So why should I have to give more of my hard earned treasure to the Government? I want my SUV, I like my SUV. I want my big apartment, I pay for it all too. I'm tired of paying for lazy bums to get hand outs. How about the dead @zzes get up off the block and work to better themselves and do like I did. If, I, the son of two school teachers from Indiana, can do it, anyone can. I'm with Beck, lets take a pitchfork to Washington.", 
        "intTime": 20090331, 
        "postID": 21, 
        "quote": "", 
        "reply": "When did it become a crime to be successful in this Country? I worked hard all my life. I Enlisted, used my money to go to college, and got a Commission. First Commissioned Officer on either side of my family. Worked some good jobs, worked some bad ones too and now I have a decent career with decent pay on top of my Military service. So why should I have to give more of my hard earned treasure to the Government? I want my SUV, I like my SUV. I want my big apartment, I pay for it all too. I'm tired of paying for lazy bums to get hand outs. How about the dead @zzes get up off the block and work to better themselves and do like I did. If, I, the son of two school teachers from Indiana, can do it, anyone can. I'm with Beck, lets take a pitchfork to Washington.", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-03-31 19:53:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President.", 
        "intTime": 20090407, 
        "postID": 22, 
        "quote": "Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President.", 
        "reply": "", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-04-07 00:31:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President. Beck is cool!", 
        "intTime": 20090407, 
        "postID": 23, 
        "quote": "Originally posted by Duster6: There are no Super Stars. Obama was voted in by young Americans who like Sex and Drugs and have no street smarts. IMO people living with their parents should not be allowed to vote. Next you had all the Blacks voting for him simply because they wanted a brother in the Oval Office. OK they won now show me the change! Oh I have to wait 900 more days since the first 100 days are just too soon to see a difference. BS on that. All it takes for a person to be a good President is to just do one simple thing. What they promised to do when they were running for the office. How hard is that? Doesn't matter if your a democrat or Republican or even a Glenn Beck. All that said I do think Glenn Beck would make a great President.", 
        "reply": " Beck is cool!", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-04-07 07:16:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "", 
        "intTime": 20090407, 
        "postID": 24, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-04-07 07:21:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by BayStateGal: quote: Originally posted by mnoble1066: quote: Keep the rich rich by allowing them to hold onto their money. What in the hell is wrong with trying to hold on to our money?? You can keep your change, I'll continue to hug my guns and religion. Good question. Follow up: what should they do with their money? It's really none of our business. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090407, 
        "postID": 25, 
        "quote": "Originally posted by BayStateGal: quote: Originally posted by mnoble1066: quote: Keep the rich rich by allowing them to hold onto their money. What in the hell is wrong with trying to hold on to our money?? You can keep your change, I'll continue to hug my guns and religion. Good question. Follow up: what should they do with their money?", 
        "reply": " It's really none of our business. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7790041912001", 
        "time": "2009-04-07 07:24:00", 
        "title": "Republicans Awesome, Dems Suck, Glenn Beck", 
        "userID": "L0A1"
    }
]