[
    {
        "content": "ABC News' Martha Raddatz reports: Defense Secretary Robert Gates plans to make an announcement this afternoon that Gen. David McKiernan, commander of NATO forces in Afghanistan, will be replaced by Lt. Gen. Stanley McChrystal, a former special operations commander. McChrystal, the director of the Joint Staff, is a three star but will soon be awarded a fourth star. McKiernan has been in place only 11 months and will not move to another assignment. This change in command during a time of war is a large statement about Gate's faith in McKiernan's leadership. While Gen. George Casey was replaced in Iraq by Gen. David Petraeus in 2007, it was after two and a half years and Casey was then made chief of staff of the Army. More to come after the secretary's press conference. I knew it was going to happen!!!", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "ABC News' Martha Raddatz reports: Defense Secretary Robert Gates plans to make an announcement this afternoon that Gen. David McKiernan, commander of NATO forces in Afghanistan, will be replaced by Lt. Gen. Stanley McChrystal, a former special operations commander. McChrystal, the director of the Joint Staff, is a three star but will soon be awarded a fourth star. McKiernan has been in place only 11 months and will not move to another assignment. This change in command during a time of war is a large statement about Gate's faith in McKiernan's leadership. While Gen. George Casey was replaced in Iraq by Gen. David Petraeus in 2007, it was after two and a half years and Casey was then made chief of staff of the Army. More to come after the secretary's press conference. I knew it was going to happen!!!", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-11 09:54:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "samh32"
    }, 
    {
        "content": "It makes sense. Ole Stan McCrystal is a special operations general, and afghanistan is a totally unconventional fight....", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "", 
        "reply": "It makes sense. Ole Stan McCrystal is a special operations general, and afghanistan is a totally unconventional fight....", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-11 12:44:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "WHOA!!! Did they say he's definitely NOT being re-assigned?? Or did they just not announce what it might be??", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "", 
        "reply": "WHOA!!! Did they say he's definitely NOT being re-assigned?? Or did they just not announce what it might be??", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-11 14:27:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "tawodi"
    }, 
    {
        "content": "I'm confused! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "", 
        "reply": "I'm confused! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-11 14:43:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "KJ1110"
    }, 
    {
        "content": "General McKiernan will retire soon. Gates said that he will not get another assignment. In other words, HE WAS FIRED.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "", 
        "reply": "General McKiernan will retire soon. Gates said that he will not get another assignment. In other words, HE WAS FIRED.", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-11 15:40:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "When you're the Commanding General, and have 11 months into a deployment, retirement is the last thing on your mind.", 
        "intTime": 20090512, 
        "postID": 6, 
        "quote": "", 
        "reply": "When you're the Commanding General, and have 11 months into a deployment, retirement is the last thing on your mind.", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 03:48:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "samh32"
    }, 
    {
        "content": "I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain.", 
        "intTime": 20090512, 
        "postID": 7, 
        "quote": "", 
        "reply": "I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain.", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 04:06:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain. Neither one of those really matters in Afghanistan. We can't control the terrain because we don't have enough men in our entire Army to control the terrain, and we aren't going to beat them by attrition so how many we kill doesn't matter either.", 
        "intTime": 20090512, 
        "postID": 8, 
        "quote": "Originally posted by Duster6: I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain.", 
        "reply": " Neither one of those really matters in Afghanistan. We can't control the terrain because we don't have enough men in our entire Army to control the terrain, and we aren't going to beat them by attrition so how many we kill doesn't matter either.", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 06:27:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Duster6: I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain. Neither one of those really matters in Afghanistan. We can't control the terrain because we don't have enough men in our entire Army to control the terrain, and we aren't going to beat them by attrition so how many we kill doesn't matter either. So let me get this straight. I believe we are wasting our time in Afghanistan. And you agree with me. Correct?", 
        "intTime": 20090512, 
        "postID": 9, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Duster6: I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain. Neither one of those really matters in Afghanistan. We can't control the terrain because we don't have enough men in our entire Army to control the terrain, and we aren't going to beat them by attrition so how many we kill doesn't matter either.", 
        "reply": " So let me get this straight. I believe we are wasting our time in Afghanistan. And you agree with me. Correct?", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 07:39:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by nspreitler: quote: Originally posted by Duster6: I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain. Neither one of those really matters in Afghanistan. We can't control the terrain because we don't have enough men in our entire Army to control the terrain, and we aren't going to beat them by attrition so how many we kill doesn't matter either. So let me get this straight. I believe we are wasting our time in Afghanistan. And you agree with me. Correct? Not entirely, trying to fight Afghanistan as a conventional fight is a waste of time. That lesson should have been learned in Vietnam. we have to decide what our objective is in Afghanistan. If it is creating a unified nation that won't allow a resurgence of terrorism on its soil, well I don't see that being possible with the current situation, especially not with an Afghan government that undercuts every move we make.", 
        "intTime": 20090512, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: quote: Originally posted by nspreitler: quote: Originally posted by Duster6: I CONCUR. In time of war there are only two things that count. Bodies and terrain. In other words, who kills the most enemy and controls the most terrain. Neither one of those really matters in Afghanistan. We can't control the terrain because we don't have enough men in our entire Army to control the terrain, and we aren't going to beat them by attrition so how many we kill doesn't matter either. So let me get this straight. I believe we are wasting our time in Afghanistan. And you agree with me. Correct?", 
        "reply": " Not entirely, trying to fight Afghanistan as a conventional fight is a waste of time. That lesson should have been learned in Vietnam. we have to decide what our objective is in Afghanistan. If it is creating a unified nation that won't allow a resurgence of terrorism on its soil, well I don't see that being possible with the current situation, especially not with an Afghan government that undercuts every move we make.", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 07:51:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Understand. Hopefully this new General soon to take over with his Special Operations background can get the ball rolling in the right direction.", 
        "intTime": 20090512, 
        "postID": 11, 
        "quote": "", 
        "reply": "Understand. Hopefully this new General soon to take over with his Special Operations background can get the ball rolling in the right direction.", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 14:25:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "For every one soldier who's leave the FOBs in a combat role in Afghanistan, there are 10 soldier/contractor/DA Civilian who will never see the outside of the wire. This place is already a logistics nightmare and having so may people their who are not really contributing to the fight is something that needs to be address. Due to cultural and religious beliefs, nation building(by western standards)in Afghanistan is dam near impossible.", 
        "intTime": 20090512, 
        "postID": 12, 
        "quote": "", 
        "reply": "For every one soldier who's leave the FOBs in a combat role in Afghanistan, there are 10 soldier/contractor/DA Civilian who will never see the outside of the wire. This place is already a logistics nightmare and having so may people their who are not really contributing to the fight is something that needs to be address. Due to cultural and religious beliefs, nation building(by western standards)in Afghanistan is dam near impossible.", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 19:23:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "samh32"
    }, 
    {
        "content": "God help the newbys...", 
        "intTime": 20090512, 
        "postID": 13, 
        "quote": "", 
        "reply": "God help the newbys...", 
        "threadID": "409192893_5840030322001", 
        "time": "2009-05-12 22:20:00", 
        "title": "Gen. David McKiernan to be replaced in Afganistan!!!", 
        "userID": "dragonflyer04"
    }
]