[
    {
        "content": "quote: Call it a condom conundrum. At a time when the federal government is spending billions of stimulus dollars to stem the tide of U.S. layoffs, should that same government put even more Americans out of work by buying cheaper foreign products? In this case, Chinese condoms. That's the dilemma for the folks at jobs, the government is switching to cheaper off-shore condoms, including some made in China. In a move expected to cost 300 American the U.S. Agency for International Development, which has distributed an estimated 10 billion U.S.-made AIDS-preventing condoms in poor countries around the world. But not anymore. The switch comes despite assurances over the years that the agency would continue to buy American whenever possible. \"Of course, we considered how many U.S. jobs would be affected by this move,” said a USAID official who spoke on the condition that he would not be named. But he said the reasons for the change included lower prices (2 cents versus more than 5 cents for U.S.-made condoms) and the fact that Congress dropped “buy American language” in a recent appropriations bill. . . But that's cold comfort to Fannie Thomas, who has been making AIDS-preventing condoms in southeastern Alabama for nearly 40 years in the small town of Eufaula. “We pay taxes down here, too, and with all this stimulus money going to save jobs, it seems to me like they (the U.S. government) should share this contract so they can save jobs here in America,” Thomas said. Thomas and others at the Alatech plant said there aren’t many alternatives for them if it closes down, which is a likely result of the contracting switch. <more> \"http://www.mcclatchydc.com/251/story/64577.html\" Getting pretty bad when our own government is off-shoring jobs at the same time they b*tch and moan about U.S. corporations doing likewise. Makes me want to join Geithner and cheat on my taxes.", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "Call it a condom conundrum. At a time when the federal government is spending billions of stimulus dollars to stem the tide of U.S. layoffs, should that same government put even more Americans out of work by buying cheaper foreign products? In this case, Chinese condoms. That's the dilemma for the folks at jobs, the government is switching to cheaper off-shore condoms, including some made in China. In a move expected to cost 300 American the U.S. Agency for International Development, which has distributed an estimated 10 billion U.S.-made AIDS-preventing condoms in poor countries around the world. But not anymore. The switch comes despite assurances over the years that the agency would continue to buy American whenever possible. \"Of course, we considered how many U.S. jobs would be affected by this move,” said a USAID official who spoke on the condition that he would not be named. But he said the reasons for the change included lower prices (2 cents versus more than 5 cents for U.S.-made condoms) and the fact that Congress dropped “buy American language” in a recent appropriations bill. . . But that's cold comfort to Fannie Thomas, who has been making AIDS-preventing condoms in southeastern Alabama for nearly 40 years in the small town of Eufaula. “We pay taxes down here, too, and with all this stimulus money going to save jobs, it seems to me like they (the U.S. government) should share this contract so they can save jobs here in America,” Thomas said. Thomas and others at the Alatech plant said there aren’t many alternatives for them if it closes down, which is a likely result of the contracting switch. <more> \"http://www.mcclatchydc.com/251/story/64577.html\"", 
        "reply": " Getting pretty bad when our own government is off-shoring jobs at the same time they b*tch and moan about U.S. corporations doing likewise. Makes me want to join Geithner and cheat on my taxes.", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 07:36:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: dmuhler: You want the government to \"prop up\" less efficient enterprises? LOL... No you wouldn't want something like a huge bailout of the financial industry or a hugh porkulus spending bill. Wouldn't want that. The party of \"Yes we can\" screwing Americans every day in every way.", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "dmuhler: You want the government to \"prop up\" less efficient enterprises?", 
        "reply": " LOL... No you wouldn't want something like a huge bailout of the financial industry or a hugh porkulus spending bill. Wouldn't want that. The party of \"Yes we can\" screwing Americans every day in every way.", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 08:00:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: Oh and I did not vote on the bail out. Did you? My congressman didn't. Did yours?", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "dmuhler: Oh and I did not vote on the bail out. Did you?", 
        "reply": " My congressman didn't. Did yours?", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 09:17:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: dmuhler: Oh and I did not vote on the bail out. Did you? My congressman didn't. Did yours? I nailed the trifecta on the stimulus bill ... my two Republican senators voted against it ... as did my Democratic Congressman. The latter has a pair ... voted against SCHIP too.", 
        "intTime": 20090323, 
        "postID": 4, 
        "quote": "Originally posted by bill_kananen: quote: dmuhler: Oh and I did not vote on the bail out. Did you? My congressman didn't. Did yours?", 
        "reply": " I nailed the trifecta on the stimulus bill ... my two Republican senators voted against it ... as did my Democratic Congressman. The latter has a pair ... voted against SCHIP too.", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 09:39:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Chinese condoms? I suppose I could use them to do rectal exams on feral cats, but since we usually don't do that they're pretty much useless.... This message has been edited. Last edited by: ipw533, Mon 23 March 2009 10:23 AM", 
        "intTime": 20090323, 
        "postID": 5, 
        "quote": "", 
        "reply": "Chinese condoms? I suppose I could use them to do rectal exams on feral cats, but since we usually don't do that they're pretty much useless.... This message has been edited. Last edited by: ipw533, Mon 23 March 2009 10:23 AM", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 09:46:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Mine (McCain and Kyl) were both for it before they were against it. I voted for neither. My Representative Ed Pastor voted for it, and he was offered advise on how I would have voted and chose to ignore my wishes. The nerve of that man! How dare he!", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "Originally posted by dmuhler: Mine (McCain and Kyl) were both for it before they were against it. I voted for neither. My Representative Ed Pastor voted for it, and he was offered advise on how I would have voted and chose to ignore my wishes.", 
        "reply": " The nerve of that man! How dare he!", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 10:05:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: I_M_Qwerty: I nailed the trifecta on the stimulus bill ... my two Republican senators voted against it Damn... my senators are Schumer and that new girl Gillibrand... (Hillary light)", 
        "intTime": 20090323, 
        "postID": 7, 
        "quote": "I_M_Qwerty: I nailed the trifecta on the stimulus bill ... my two Republican senators voted against it", 
        "reply": " Damn... my senators are Schumer and that new girl Gillibrand... (Hillary light)", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 10:14:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by bill_kananen: quote: dmuhler: Oh and I did not vote on the bail out. Did you? My congressman didn't. Did yours? I nailed the trifecta on the stimulus bill ... my two Republican senators voted against it ... as did my Democratic Congressman. The latter has a pair ... voted against SCHIP too. My Representative is LaTourette and my Senators are Voinovich and Brown. Brown is the only a55hat.", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by bill_kananen: quote: dmuhler: Oh and I did not vote on the bail out. Did you? My congressman didn't. Did yours? I nailed the trifecta on the stimulus bill ... my two Republican senators voted against it ... as did my Democratic Congressman. The latter has a pair ... voted against SCHIP too.", 
        "reply": " My Representative is LaTourette and my Senators are Voinovich and Brown. Brown is the only a55hat.", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 12:22:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "10Tenths"
    }, 
    {
        "content": "If the chinese can send over tainted pet food, they can do the same with condoms. Just another way for the commies to get rid of us, feck till death..........", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "", 
        "reply": "If the chinese can send over tainted pet food, they can do the same with condoms. Just another way for the commies to get rid of us, feck till death..........", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 12:28:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Wouldn't they be too small?", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "", 
        "reply": "Wouldn't they be too small?", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 13:08:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "Stancer"
    }, 
    {
        "content": "quote: Originally posted by Stancer: Wouldn't they be too small? I read about a spray on condom that fits everyone. Maybe that would be the solution. \"http://inventorspot.com/articles/sprayon_snug_fit_condom_all_size_8577\" Somehow I can't imagine myself whipping out a spray can at \"That intimate moment.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "Originally posted by Stancer: Wouldn't they be too small?", 
        "reply": " I read about a spray on condom that fits everyone. Maybe that would be the solution. \"http://inventorspot.com/articles/sprayon_snug_fit_condom_all_size_8577\" Somehow I can't imagine myself whipping out a spray can at \"That intimate moment.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 20:03:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Oh sure, just what we need...more inferior crap from China. That's why China is over populated, their condums have a high failure rate. They realize they can sell them to the Americans, because the Americans want to have good trade relations with them. Problem solved, dump a defective product and get paid for it...the gullible Americans will buy it! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "", 
        "reply": "Oh sure, just what we need...more inferior crap from China. That's why China is over populated, their condums have a high failure rate. They realize they can sell them to the Americans, because the Americans want to have good trade relations with them. Problem solved, dump a defective product and get paid for it...the gullible Americans will buy it! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 20:20:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Oh sure, just what we need...more inferior crap from China. That's why China is over populated, their condums have a high failure rate. They realize they can sell them to the Americans, because the Americans want to have good trade relations with them. Problem solved, dump a defective product and get paid for it...the gullible Americans will buy it! Uh, I donno if your comments were directed at me or not but the spray condom is from Germany, not China. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "Originally posted by Bergy46: Oh sure, just what we need...more inferior crap from China. That's why China is over populated, their condums have a high failure rate. They realize they can sell them to the Americans, because the Americans want to have good trade relations with them. Problem solved, dump a defective product and get paid for it...the gullible Americans will buy it!", 
        "reply": " Uh, I donno if your comments were directed at me or not but the spray condom is from Germany, not China. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-23 20:49:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Single world currency? One World Government? No cheerleader for propping up greenback at G20 summit. By Judi McLeod Tuesday, March 24, 2009 Is the table being set for One World Government rather than speeding the recovery of the worldwide recession at next week’s G20 London summit? China has now joined Russia in pressing G20 members for a single world currency. The deadly duo, which has blocked all things America at the United Nations, is calling for the same thing: Dumping the US greenback as the international reserve currency for a new global system controlled by the International Monetary Fund (IMF). So far no calls to protect the greenback by the new occupant of the Oval Office. Days ahead of the summit, both China and Russia posted their priorities for the new global system on their official websites. “In an essay posted on the People’s Bank of China’s website, Zhou Xiaochuan, the central bank’s governor, said the goal would be to create a reserve currency “that is disconnected from individual nations and is able to remain stable in the long run, thus removing the inherent deficiencies caused by using credit-based national currencies.” (http://www.FT.com, March 23, 2009). China, of course, can always justify its priority with its recently stated anxiety about U.S. loans now that the US economy seems to have reached its tipping point. The Kremlin published its priorities Monday for an upcoming meeting of the G20, “calling for the creation of a supranational reserve currency to be issued by international institutions as part of a reform of the global financial system,” (The MoscowTimes.com, March 17, 2009). The Kremlin has persistently criticized the dollar’s status as the dominant global reserve currency and has lowered its own dollar holdings in the last few years. Both President Dmitry Medvedev and Prime Minister Vladimir Putin have repeatedly called for the ruble to be used as a regional reserve currency, although the idea has received little support outside of Russia. Both are getting a lot of help from Kazakh President Nursultan Nazarbayev, who is calling for the “acmetal” world currency and who now has the backing of the architect of the euro currency, Canadian Nobel-prize winner Professor Robert Mundell. The easy to forget “acmetal” combines the Greek word “acme”, meaning peak or best and “capital”. “Call it acmetal in Kazakh. Call it amero in the headed-for-economic-meltdown United States of America,” Canada Free Press wrote on March 13. The United States is headed to the Summit without a cheerleader, evidenced by the deafening silence of President Barack Obama. It gets worse. In the run-up to to the “press the reset button” on U.S. rekindling ties with Russia, it is now known that Obama met secretly with Mikhail Gorbachev last week. White House spokesman Robert Gibbs would not categorize the meeting as secret. According to him, “The president tends to roam around the larger (White) House and sometimes walks into meetings that weren’t previously on his schedule”. That means the president just happened to walk in on Gorbachev! Guess he learned nothing from the random late-night jaunt he made into the White House press corps when he just wanted to say “Good Evening” and went away mad because some reporters asked real questions. According to Gibbs, Vice President Joe Biden and Gorbachev had been discussing ways of reducing their countries’ respective nuclear arsenals, an issue Obama and Medvedev would talk about when they met in London on April 2. But Medvedev remained mum about Kremlin plans to publish its priorities calling for the creation of a supranational reserve currency as part of a radical reform of the global financial system? The Moscow Times states that the Kremlin document also calls for national banks and international financial institutions to diversify their foreign currency reserves. It said the global financial system should be restructured to prevent future crisis and proposed holding an international conference after the G20 summit to adopt conventions on a new global financial structure. Sounds like it came right out of the United Nations resolutions book as written by UN Poster Boy Maurice Strong with cohorts George Soros and Gorbachev to some. Meanwhile, Canada, which hopes Obama will live up to his promise to keep trade alive with its biggest trading partner, is one of the Group of 20 industrialized and developing countries, meeting in London on April 2. As the Hon. Perrin Beatty, President and CEO of the Canadian Chamber of Commerce said at an address at the University of Western Ontario yesterday, ...”there has been a complete failure of political will to overcome protectionist pressures and dismantle impediments to world trade. Noting the need to remember the lessons of history, Beatty recalled how the value of global trade fell by two-thirds between 1929 and 1934. “Memories fade, and seventy-nine years later Congress incorporated Buy America provisions in its stimulus package to target the benefits to American companies. It once again ignored warnings about the dangers, including the blunt assessment by Dallas Federal Reserve President Richard Fisher, who warned, `Protectionism is the crack cocaine of economics. It may provide a high. It’s addictive and it leads to economic death.’”", 
        "intTime": 20090324, 
        "postID": 14, 
        "quote": "", 
        "reply": "Single world currency? One World Government? No cheerleader for propping up greenback at G20 summit. By Judi McLeod Tuesday, March 24, 2009 Is the table being set for One World Government rather than speeding the recovery of the worldwide recession at next week’s G20 London summit? China has now joined Russia in pressing G20 members for a single world currency. The deadly duo, which has blocked all things America at the United Nations, is calling for the same thing: Dumping the US greenback as the international reserve currency for a new global system controlled by the International Monetary Fund (IMF). So far no calls to protect the greenback by the new occupant of the Oval Office. Days ahead of the summit, both China and Russia posted their priorities for the new global system on their official websites. “In an essay posted on the People’s Bank of China’s website, Zhou Xiaochuan, the central bank’s governor, said the goal would be to create a reserve currency “that is disconnected from individual nations and is able to remain stable in the long run, thus removing the inherent deficiencies caused by using credit-based national currencies.” (http://www.FT.com, March 23, 2009). China, of course, can always justify its priority with its recently stated anxiety about U.S. loans now that the US economy seems to have reached its tipping point. The Kremlin published its priorities Monday for an upcoming meeting of the G20, “calling for the creation of a supranational reserve currency to be issued by international institutions as part of a reform of the global financial system,” (The MoscowTimes.com, March 17, 2009). The Kremlin has persistently criticized the dollar’s status as the dominant global reserve currency and has lowered its own dollar holdings in the last few years. Both President Dmitry Medvedev and Prime Minister Vladimir Putin have repeatedly called for the ruble to be used as a regional reserve currency, although the idea has received little support outside of Russia. Both are getting a lot of help from Kazakh President Nursultan Nazarbayev, who is calling for the “acmetal” world currency and who now has the backing of the architect of the euro currency, Canadian Nobel-prize winner Professor Robert Mundell. The easy to forget “acmetal” combines the Greek word “acme”, meaning peak or best and “capital”. “Call it acmetal in Kazakh. Call it amero in the headed-for-economic-meltdown United States of America,” Canada Free Press wrote on March 13. The United States is headed to the Summit without a cheerleader, evidenced by the deafening silence of President Barack Obama. It gets worse. In the run-up to to the “press the reset button” on U.S. rekindling ties with Russia, it is now known that Obama met secretly with Mikhail Gorbachev last week. White House spokesman Robert Gibbs would not categorize the meeting as secret. According to him, “The president tends to roam around the larger (White) House and sometimes walks into meetings that weren’t previously on his schedule”. That means the president just happened to walk in on Gorbachev! Guess he learned nothing from the random late-night jaunt he made into the White House press corps when he just wanted to say “Good Evening” and went away mad because some reporters asked real questions. According to Gibbs, Vice President Joe Biden and Gorbachev had been discussing ways of reducing their countries’ respective nuclear arsenals, an issue Obama and Medvedev would talk about when they met in London on April 2. But Medvedev remained mum about Kremlin plans to publish its priorities calling for the creation of a supranational reserve currency as part of a radical reform of the global financial system? The Moscow Times states that the Kremlin document also calls for national banks and international financial institutions to diversify their foreign currency reserves. It said the global financial system should be restructured to prevent future crisis and proposed holding an international conference after the G20 summit to adopt conventions on a new global financial structure. Sounds like it came right out of the United Nations resolutions book as written by UN Poster Boy Maurice Strong with cohorts George Soros and Gorbachev to some. Meanwhile, Canada, which hopes Obama will live up to his promise to keep trade alive with its biggest trading partner, is one of the Group of 20 industrialized and developing countries, meeting in London on April 2. As the Hon. Perrin Beatty, President and CEO of the Canadian Chamber of Commerce said at an address at the University of Western Ontario yesterday, ...”there has been a complete failure of political will to overcome protectionist pressures and dismantle impediments to world trade. Noting the need to remember the lessons of history, Beatty recalled how the value of global trade fell by two-thirds between 1929 and 1934. “Memories fade, and seventy-nine years later Congress incorporated Buy America provisions in its stimulus package to target the benefits to American companies. It once again ignored warnings about the dangers, including the blunt assessment by Dallas Federal Reserve President Richard Fisher, who warned, `Protectionism is the crack cocaine of economics. It may provide a high. It’s addictive and it leads to economic death.’”", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-24 06:12:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Single world currency? I think the Wall Street execs have done more damage then first thought. Give them bigger bonuses. We need those condoms from China considering the screwing we are getting.", 
        "intTime": 20090324, 
        "postID": 15, 
        "quote": "", 
        "reply": "Single world currency? I think the Wall Street execs have done more damage then first thought. Give them bigger bonuses. We need those condoms from China considering the screwing we are getting.", 
        "threadID": "409192893_2290036812001", 
        "time": "2009-03-24 06:27:00", 
        "title": "US Government Turns to China for \"Protection\"", 
        "userID": "bill_kananen"
    }
]