[
    {
        "content": "Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 00:50:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "you're peeing up a rope man. doublethink is the word of the day to those guys.", 
        "intTime": 20090414, 
        "postID": 2, 
        "quote": "", 
        "reply": "you're peeing up a rope man. doublethink is the word of the day to those guys.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 01:01:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "what success in the me???", 
        "intTime": 20090414, 
        "postID": 3, 
        "quote": "", 
        "reply": "what success in the me???", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 05:41:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The C-in-C is Responsible for strategic level decisions, i.e. the Surge. Commanders on the battlefield are responsible for tactical level decisions, i.e. shot the pirates in the head, now. The bottom line as far as the situation with the Somalia pirates is Obama issued an order that could never come back to haunt him and required no leadership. He authorized: approitate level of force. That means if the OP had gone bad, the Commander on the ground would have had his butt swinging in the breeze. Obama COULD have shown leadership and authorized lethal force to end this drama four days prior to the actual ending. Instead he acted like a typical politician.", 
        "intTime": 20090414, 
        "postID": 4, 
        "quote": "", 
        "reply": "The C-in-C is Responsible for strategic level decisions, i.e. the Surge. Commanders on the battlefield are responsible for tactical level decisions, i.e. shot the pirates in the head, now. The bottom line as far as the situation with the Somalia pirates is Obama issued an order that could never come back to haunt him and required no leadership. He authorized: approitate level of force. That means if the OP had gone bad, the Commander on the ground would have had his butt swinging in the breeze. Obama COULD have shown leadership and authorized lethal force to end this drama four days prior to the actual ending. Instead he acted like a typical politician.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 06:18:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "threerings"
    }, 
    {
        "content": "Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "intTime": 20090414, 
        "postID": 5, 
        "quote": "", 
        "reply": "Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 08:09:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs...", 
        "intTime": 20090414, 
        "postID": 6, 
        "quote": "Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "reply": " anywhere in the world with in 24hrs...", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 08:16:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he is a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the proud noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrific and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a secret muslim, an enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt and destroy our country! GW Bush had good/sound economic policies and left our country in the black. His record is stellar and honorable! nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnapping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy Skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturd-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!! To deny they are to be the winning team would be traitorous!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... This message has been edited. Last edited by: ProgMod, Tue 14 April 2009 03:38 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 7, 
        "quote": "Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?...", 
        "reply": " Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he is a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the proud noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrific and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a secret muslim, an enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt and destroy our country! GW Bush had good/sound economic policies and left our country in the black. His record is stellar and honorable! nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnapping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy Skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturd-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!! To deny they are to be the winning team would be traitorous!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... This message has been edited. Last edited by: ProgMod, Tue 14 April 2009 03:38 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:01:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I do believe that is called a \"Strawman\" argument. And a poorly done one at that!", 
        "intTime": 20090414, 
        "postID": 8, 
        "quote": "", 
        "reply": "I do believe that is called a \"Strawman\" argument. And a poorly done one at that!", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:40:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Yes. Of course you would.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "Originally posted by klassylady25: quote: You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Yes.", 
        "reply": " Of course you would.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:52:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"...", 
        "reply": " Do you feel better now... Please don't ever do that again... And he's no friend of mine... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:57:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by 2494906: I do believe that is called a \"Strawman\" argument. And a poorly done one at that! Of course you would say that. You're pro-Dubya. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "Originally posted by 2494906: I do believe that is called a \"Strawman\" argument. And a poorly done one at that!", 
        "reply": " Of course you would say that. You're pro-Dubya. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:57:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine...", 
        "reply": " Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:01:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs... So sayeth the Dittohead with as much military experience as his hero, Rush.", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs...", 
        "reply": " So sayeth the Dittohead with as much military experience as his hero, Rush.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:03:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!...... Good enough. I will admit to espousing certain Republican ideaologies. They aren't totally worthless... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 14, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!......", 
        "reply": " Good enough. I will admit to espousing certain Republican ideaologies. They aren't totally worthless... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:06:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: quote: Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs... So sayeth the Dittohead with as much military experience as his hero, Rush. Careful there Cider, that \"dittohead\" doesn't like being exposed for the fraud he is and will YT you if you don't stop. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 15, 
        "quote": "Originally posted by Cider33_Alpha: quote: Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs... So sayeth the Dittohead with as much military experience as his hero, Rush.", 
        "reply": " Careful there Cider, that \"dittohead\" doesn't like being exposed for the fraud he is and will YT you if you don't stop. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:07:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "So be it! I've been hit with much worse than whatever said dittohead thinks he can do with a YT.", 
        "intTime": 20090414, 
        "postID": 16, 
        "quote": "", 
        "reply": "So be it! I've been hit with much worse than whatever said dittohead thinks he can do with a YT.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:11:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Cider, Please be nice.", 
        "intTime": 20090414, 
        "postID": 17, 
        "quote": "", 
        "reply": "Cider, Please be nice.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:41:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Be nice? That's no fun. (see...I told you Cider ) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 18, 
        "quote": "", 
        "reply": "Be nice? That's no fun. (see...I told you Cider ) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:48:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late...", 
        "intTime": 20090414, 
        "postID": 19, 
        "quote": "", 
        "reply": "Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late...", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:50:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late... Ahh, come on now Killswitch, you know this will upset the Pubs. They're always right! Aren't They?........... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 20, 
        "quote": "Originally posted by Killswitch_Engage: Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late...", 
        "reply": " Ahh, come on now Killswitch, you know this will upset the Pubs. They're always right! Aren't They?........... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:55:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good.", 
        "intTime": 20090414, 
        "postID": 21, 
        "quote": "", 
        "reply": "I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:06:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "intTime": 20090414, 
        "postID": 22, 
        "quote": "Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good.", 
        "reply": " yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:13:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Too bad you people didn't feel that way about the last president. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 23, 
        "quote": "Originally posted by outlaws93: To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "reply": " Too bad you people didn't feel that way about the last president. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:20:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 24, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "reply": " Did someone say triangle?................. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:23:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "who people?? i never had any problems with criticizing bush... you are confusing me with someone else...", 
        "intTime": 20090414, 
        "postID": 25, 
        "quote": "", 
        "reply": "who people?? i never had any problems with criticizing bush... you are confusing me with someone else...", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:23:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf", 
        "intTime": 20090414, 
        "postID": 26, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?.................", 
        "reply": " read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:24:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "OMG, did outlaw just mention the FEMA Concentration Camps? LMFAO!!", 
        "intTime": 20090414, 
        "postID": 27, 
        "quote": "", 
        "reply": "OMG, did outlaw just mention the FEMA Concentration Camps? LMFAO!!", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:27:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. This could not have been stated better. The problem is that Republicans have screwed up so badly during their years in power that all they can do now is hope for some great screwup or failure on the part of President Obama so they can use it to win the next election. The Somalia pirate situation was the moment of failure they thought they would get but instead, President Obama proved his abilities and had a successful mission. Now all the sour puss Republicans and Obama bashers here on this site can do is try to find fault in how the mission was conducted. Don't forget that former President Bush had the public's support when he went into Iraq. He certainly had my support. It was good that he took out Saddam and his genocidal hacks. But Bush cowboyed the attack. He did not send in enough troops, failed to have an after victory plan for stabilization and failed to find weapons of mass destruction he claimed Saddam had in his possession. And he also acted like an arrogant with statements such as, \"Bring it on.\" Then, he tried to cover up his bungling by calling his correction a surge. President Obama's handling of this pirate situation was the moment of failure the Limbaugh hacks and Obama bashers were hoping to get so they could verify what they were claiming about President Obama's lack of experience. The ditto heads did not get that and so now they are sore and whining. And there are plenty of whiners and sour grapes losers here on this site who continue to look for ways to bash the President and will never give him credit for successes because they are sore losers and will continue to whine no matter how successful President Obama is with his policies. The policy he executed in the pirate situation was successful and the Republicans and their Limbaugh hacks just hate that.", 
        "intTime": 20090414, 
        "postID": 28, 
        "quote": "Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "reply": " This could not have been stated better. The problem is that Republicans have screwed up so badly during their years in power that all they can do now is hope for some great screwup or failure on the part of President Obama so they can use it to win the next election. The Somalia pirate situation was the moment of failure they thought they would get but instead, President Obama proved his abilities and had a successful mission. Now all the sour puss Republicans and Obama bashers here on this site can do is try to find fault in how the mission was conducted. Don't forget that former President Bush had the public's support when he went into Iraq. He certainly had my support. It was good that he took out Saddam and his genocidal hacks. But Bush cowboyed the attack. He did not send in enough troops, failed to have an after victory plan for stabilization and failed to find weapons of mass destruction he claimed Saddam had in his possession. And he also acted like an arrogant with statements such as, \"Bring it on.\" Then, he tried to cover up his bungling by calling his correction a surge. President Obama's handling of this pirate situation was the moment of failure the Limbaugh hacks and Obama bashers were hoping to get so they could verify what they were claiming about President Obama's lack of experience. The ditto heads did not get that and so now they are sore and whining. And there are plenty of whiners and sour grapes losers here on this site who continue to look for ways to bash the President and will never give him credit for successes because they are sore losers and will continue to whine no matter how successful President Obama is with his policies. The policy he executed in the pirate situation was successful and the Republicans and their Limbaugh hacks just hate that.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:27:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf Sorry outlaws, it had a spoiler alert!......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 29, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf", 
        "reply": " Sorry outlaws, it had a spoiler alert!......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:34:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 30, 
        "quote": "", 
        "reply": "Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 00:50:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "you're peeing up a rope man. doublethink is the word of the day to those guys.", 
        "intTime": 20090414, 
        "postID": 31, 
        "quote": "", 
        "reply": "you're peeing up a rope man. doublethink is the word of the day to those guys.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 01:01:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "what success in the me???", 
        "intTime": 20090414, 
        "postID": 32, 
        "quote": "", 
        "reply": "what success in the me???", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 05:41:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The C-in-C is Responsible for strategic level decisions, i.e. the Surge. Commanders on the battlefield are responsible for tactical level decisions, i.e. shot the pirates in the head, now. The bottom line as far as the situation with the Somalia pirates is Obama issued an order that could never come back to haunt him and required no leadership. He authorized: approitate level of force. That means if the OP had gone bad, the Commander on the ground would have had his butt swinging in the breeze. Obama COULD have shown leadership and authorized lethal force to end this drama four days prior to the actual ending. Instead he acted like a typical politician.", 
        "intTime": 20090414, 
        "postID": 33, 
        "quote": "", 
        "reply": "The C-in-C is Responsible for strategic level decisions, i.e. the Surge. Commanders on the battlefield are responsible for tactical level decisions, i.e. shot the pirates in the head, now. The bottom line as far as the situation with the Somalia pirates is Obama issued an order that could never come back to haunt him and required no leadership. He authorized: approitate level of force. That means if the OP had gone bad, the Commander on the ground would have had his butt swinging in the breeze. Obama COULD have shown leadership and authorized lethal force to end this drama four days prior to the actual ending. Instead he acted like a typical politician.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 06:18:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "threerings"
    }, 
    {
        "content": "Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "intTime": 20090414, 
        "postID": 34, 
        "quote": "", 
        "reply": "Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 08:09:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs...", 
        "intTime": 20090414, 
        "postID": 35, 
        "quote": "Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "reply": " anywhere in the world with in 24hrs...", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 08:16:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he is a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the proud noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrific and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a secret muslim, an enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt and destroy our country! GW Bush had good/sound economic policies and left our country in the black. His record is stellar and honorable! nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnapping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy Skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturd-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!! To deny they are to be the winning team would be traitorous!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... This message has been edited. Last edited by: ProgMod, Tue 14 April 2009 03:38 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 36, 
        "quote": "Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?...", 
        "reply": " Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he is a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the proud noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrific and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a secret muslim, an enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt and destroy our country! GW Bush had good/sound economic policies and left our country in the black. His record is stellar and honorable! nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnapping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy Skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturd-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!! To deny they are to be the winning team would be traitorous!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... This message has been edited. Last edited by: ProgMod, Tue 14 April 2009 03:38 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:01:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I do believe that is called a \"Strawman\" argument. And a poorly done one at that!", 
        "intTime": 20090414, 
        "postID": 37, 
        "quote": "", 
        "reply": "I do believe that is called a \"Strawman\" argument. And a poorly done one at that!", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:40:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Yes. Of course you would.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 38, 
        "quote": "Originally posted by klassylady25: quote: You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Yes.", 
        "reply": " Of course you would.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:52:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 39, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"...", 
        "reply": " Do you feel better now... Please don't ever do that again... And he's no friend of mine... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:57:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by 2494906: I do believe that is called a \"Strawman\" argument. And a poorly done one at that! Of course you would say that. You're pro-Dubya. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 40, 
        "quote": "Originally posted by 2494906: I do believe that is called a \"Strawman\" argument. And a poorly done one at that!", 
        "reply": " Of course you would say that. You're pro-Dubya. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 09:57:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 41, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine...", 
        "reply": " Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:01:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs... So sayeth the Dittohead with as much military experience as his hero, Rush.", 
        "intTime": 20090414, 
        "postID": 42, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs...", 
        "reply": " So sayeth the Dittohead with as much military experience as his hero, Rush.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:03:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!...... Good enough. I will admit to espousing certain Republican ideaologies. They aren't totally worthless... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 43, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by mmulder67: quote: Originally posted by ProgMod: quote: Originally posted by mmulder67: Based on the comments made by a very vocal group on these boards, it has now been determined that Bush is not responsible for any of the successes in the Middle East as he didn't give any actual orders to act, on scene. All the credit for the progress is now going to go to the military commanders who authorized the servicemembers to utilize whatever action necessary to achieve the goal. Just because he \"sent\" them there doesn't qualify as doing whatever was necessary to get the mission done. Bush was just a figurehead with no actual \"power\". Just like Obama. You wouldn't want to be two faced hypocrites and disagree with that assessment, would you?... Mike, if I may also play devils advocate for a moment. I'm a Bushie Republican and a Neocon, and damn proud of it! President Bush did absolutely nothing to warrant any criticism or any bashing as POTUS and CIC of the US armed forces. Regardless of what he authorized the US armed forces to do, in individual incidents, and in major operations, ie Iraq, he was always right! Because he was a devout Christian, he was never wrong. We all know that devout believers in Christianity are never wrong anyway! I voted McCain/Palin because I knew they would continue in the noble traditions of George W. Bush! Had they been voted into office, we would not be in this horrible and tragic mess today. GW Bush did not create this mess! This nobody nobama which people incorrectly call the president of the USA is a muslim, and enemy to America and its Christain values. He was not even born here, that has been proven! He is purposely trying to bankrupt our country! GW Bush had good/sound economic policies and left out country in the black. nobama has put it in the red! This upstart is another Hitler, and trying to turn our country into another communist dictatorship, just like the Soviet Union! He does not deserve credit in the high seas kidnaping of the US Captain! Just because he's the so called POTUS, dont mean didley! \"Even though it is well documented that he gave the skipper of the Bainbridge the discretion to use hostile force when appropriate against the hijackers dont mean squat!\" The chain of command dont mean squat! All praise goes only to the Navy skipper and to the Seals! They are the only ones to be commended! Everyone else be damned! You see, I know about these things, I'm a Pub! And besides, as a Born Again Repub-Neocon, I'm always right! BTW, anyone who supports nobama is either a nazi or a marxist-leninist sympathizer. That includes anyone on this site who is not a repub-conservative; they are disgusting limp wristed parasite libturds-dimlibs who bring shame and dishonor to a site devoted to the proud (conservative) US military! Go Palin/Limbaugh 2012!!!!! Whew! Any of this sound familiar Mike?......... Oh, and if I may quote a friend of ours who is no longer a member of this site for obvious reasons. \"You are not the better man!\"... Do you feel better now... Please don't ever do that again... And he's no friend of mine... Roger that Mike......I just had to get that off my chest to see what it felt like to be a devout repub neocon. Believe me, the taste was disgusting at best!......", 
        "reply": " Good enough. I will admit to espousing certain Republican ideaologies. They aren't totally worthless... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:06:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: quote: Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs... So sayeth the Dittohead with as much military experience as his hero, Rush. Careful there Cider, that \"dittohead\" doesn't like being exposed for the fraud he is and will YT you if you don't stop. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 44, 
        "quote": "Originally posted by Cider33_Alpha: quote: Originally posted by outlaws93: quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. anywhere in the world with in 24hrs... So sayeth the Dittohead with as much military experience as his hero, Rush.", 
        "reply": " Careful there Cider, that \"dittohead\" doesn't like being exposed for the fraud he is and will YT you if you don't stop. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:07:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "So be it! I've been hit with much worse than whatever said dittohead thinks he can do with a YT.", 
        "intTime": 20090414, 
        "postID": 45, 
        "quote": "", 
        "reply": "So be it! I've been hit with much worse than whatever said dittohead thinks he can do with a YT.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:11:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Cider, Please be nice.", 
        "intTime": 20090414, 
        "postID": 46, 
        "quote": "", 
        "reply": "Cider, Please be nice.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:41:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Be nice? That's no fun. (see...I told you Cider ) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 47, 
        "quote": "", 
        "reply": "Be nice? That's no fun. (see...I told you Cider ) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:48:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late...", 
        "intTime": 20090414, 
        "postID": 48, 
        "quote": "", 
        "reply": "Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late...", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:50:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late... Ahh, come on now Killswitch, you know this will upset the Pubs. They're always right! Aren't They?........... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 49, 
        "quote": "Originally posted by Killswitch_Engage: Bush deserves no credit whatsoever because his Presidency was an unmitigated disaster, from start to finish. It's never too late...", 
        "reply": " Ahh, come on now Killswitch, you know this will upset the Pubs. They're always right! Aren't They?........... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 10:55:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good.", 
        "intTime": 20090414, 
        "postID": 50, 
        "quote": "", 
        "reply": "I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:06:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "intTime": 20090414, 
        "postID": 51, 
        "quote": "Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good.", 
        "reply": " yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:13:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Too bad you people didn't feel that way about the last president. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090414, 
        "postID": 52, 
        "quote": "Originally posted by outlaws93: To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "reply": " Too bad you people didn't feel that way about the last president. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:20:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 53, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt", 
        "reply": " Did someone say triangle?................. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:23:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "who people?? i never had any problems with criticizing bush... you are confusing me with someone else...", 
        "intTime": 20090414, 
        "postID": 54, 
        "quote": "", 
        "reply": "who people?? i never had any problems with criticizing bush... you are confusing me with someone else...", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:23:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf", 
        "intTime": 20090414, 
        "postID": 55, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?.................", 
        "reply": " read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:24:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "OMG, did outlaw just mention the FEMA Concentration Camps? LMFAO!!", 
        "intTime": 20090414, 
        "postID": 56, 
        "quote": "", 
        "reply": "OMG, did outlaw just mention the FEMA Concentration Camps? LMFAO!!", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:27:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better. This could not have been stated better. The problem is that Republicans have screwed up so badly during their years in power that all they can do now is hope for some great screwup or failure on the part of President Obama so they can use it to win the next election. The Somalia pirate situation was the moment of failure they thought they would get but instead, President Obama proved his abilities and had a successful mission. Now all the sour puss Republicans and Obama bashers here on this site can do is try to find fault in how the mission was conducted. Don't forget that former President Bush had the public's support when he went into Iraq. He certainly had my support. It was good that he took out Saddam and his genocidal hacks. But Bush cowboyed the attack. He did not send in enough troops, failed to have an after victory plan for stabilization and failed to find weapons of mass destruction he claimed Saddam had in his possession. And he also acted like an arrogant with statements such as, \"Bring it on.\" Then, he tried to cover up his bungling by calling his correction a surge. President Obama's handling of this pirate situation was the moment of failure the Limbaugh hacks and Obama bashers were hoping to get so they could verify what they were claiming about President Obama's lack of experience. The ditto heads did not get that and so now they are sore and whining. And there are plenty of whiners and sour grapes losers here on this site who continue to look for ways to bash the President and will never give him credit for successes because they are sore losers and will continue to whine no matter how successful President Obama is with his policies. The policy he executed in the pirate situation was successful and the Republicans and their Limbaugh hacks just hate that.", 
        "intTime": 20090414, 
        "postID": 57, 
        "quote": "Originally posted by xerello: Obviously there are those on this site who think that they could have done a better job in less time in taking out the pirates – even without knowing all the behind the scene details of all that was involved in this operation. Rush Limbaugh is one who cannot understand why it took so long for President Obama to authorize the use of lethal force. It is understandable that Rush does not realize that SEAL snipers are not stationed aboard a frigate like the USS Bainbridge and that it would take time to get these professionals in place and that setting up the shot would also take time – because he has no idea about military operations other than watching movies. Those who have served in the military should know better.", 
        "reply": " This could not have been stated better. The problem is that Republicans have screwed up so badly during their years in power that all they can do now is hope for some great screwup or failure on the part of President Obama so they can use it to win the next election. The Somalia pirate situation was the moment of failure they thought they would get but instead, President Obama proved his abilities and had a successful mission. Now all the sour puss Republicans and Obama bashers here on this site can do is try to find fault in how the mission was conducted. Don't forget that former President Bush had the public's support when he went into Iraq. He certainly had my support. It was good that he took out Saddam and his genocidal hacks. But Bush cowboyed the attack. He did not send in enough troops, failed to have an after victory plan for stabilization and failed to find weapons of mass destruction he claimed Saddam had in his possession. And he also acted like an arrogant with statements such as, \"Bring it on.\" Then, he tried to cover up his bungling by calling his correction a surge. President Obama's handling of this pirate situation was the moment of failure the Limbaugh hacks and Obama bashers were hoping to get so they could verify what they were claiming about President Obama's lack of experience. The ditto heads did not get that and so now they are sore and whining. And there are plenty of whiners and sour grapes losers here on this site who continue to look for ways to bash the President and will never give him credit for successes because they are sore losers and will continue to whine no matter how successful President Obama is with his policies. The policy he executed in the pirate situation was successful and the Republicans and their Limbaugh hacks just hate that.", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:27:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf Sorry outlaws, it had a spoiler alert!......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090414, 
        "postID": 58, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by ProgMod: quote: Originally posted by outlaws93: quote: Originally posted by Killswitch_Engage: I woke up today, the sun was shining, the birds were chirping, my dog was sleeping at my feet, my wife was happily sleeping beside me, and George Bush is NOT the President anymore. Life is good. yea hell in 100 days obama has spent more then Bush Regan carter Clinton did in their entire terms and many vets and others who question the one is now concedered terrorist or people of interest to the gov ... yea good day huh... totalitarianism is spreading like wildfire and the dems are happy??? i am worried... worried that the obama admin has just labeled half of America as possible threats to the nation... all based on political believes... well folks grab your triangle and lets get on going to the camps... To announce that there must be no criticism of the president... is morally treasonable to the American public. Theodore Roosevelt Did someone say triangle?................. read and weep.. ---http://images.logicsix.com/DHS_RWE.pdf", 
        "reply": " Sorry outlaws, it had a spoiler alert!......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6780056022001", 
        "time": "2009-04-14 11:34:00", 
        "title": "Bush to not get credit for military success...", 
        "userID": "ProgMod"
    }
]