[
    {
        "content": "+++http://www.factcheck.org/politics/fact-checking_obamas_speech.html President Obama's first speech to a joint session of Congress was stuffed with signals about the new direction his budget will take and meant-to-be reassuring words about the economy. But it was also peppered with exaggerations and factual misstatements. He said \"we import more oil today than ever before.\" That's untrue. Imports peaked in 2005 and are substantially lower today. He claimed his mortgage aid plan would help \"responsible\" buyers but not those who borrowed beyond their means. But even prominent defenders of the program including Fed Chairman Bernanke and FDIC chief Bair concede foolish borrowers will be aided, too. He said the high cost of health care \"causes a bankruptcy in America every 30 seconds.\" That's at least double the true figure. He flubbed two facts about American history. The U.S. did not invent the automobile, and the transcontinental railroad was not completed until years after the Civil War, not during it. He claimed that his stimulus plan \"prevented the layoffs\" of 57 police officers in Minneapolis. In fact, it's far more complicated than that, and other factors are also helping to save police jobs. The president also repeated some strained claims we've critiqued before. Analysis In what had the look and feel of a State of the Union address, President Barack Obama spoke before Congress Feb. 24. Making the case for why the stimulus plan he recently signed would help the economy, Obama also laid the groundwork for the budget he'll submit to Congress Thursday and foreshadowed major action in the areas of energy, education and health reform. We're not passing judgment one way or the other on his ideas. But he made several factual errors along the way. Less Foreign Oil, Not More One line in Obama’s speech certainly sounded plausible – given the widespread concern about foreign oil – but he got it wrong: Obama: We have known for decades that our survival depends on finding new sources of energy, yet we import more oil today than ever before. Not true. We’re importing less than we were just a few years ago. This chart from the U.S. Energy Information Administration shows that weekly imports of crude oil and petroleum products (in thousands of barrels per day) have been dropping. Imports reached a high point of 15,217,000 barrels per day the week of Nov. 4, 2005. Most recently, they totaled 11,577,000 the week of Feb. 20, 2009. EIA charts on monthly and annual imports (see below) show the same trend. Only Help for Good-Intentioned Homeowners? Obama said his plan to help struggling homeowners would aid \"responsible\" borrowers but not someone \"who bought a house he could never hope to afford.\" Obama: [W]e have launched a housing plan that will help responsible families facing the threat of foreclosure lower their monthly payments and refinance their mortgages. It's a plan that won't help speculators or that neighbor down the street who bought a house he could never hope to afford. … But even the program's defenders concede that it can’t possibly distinguish between \"responsible\" borrowers and those who foolishly (or fraudulently) signed up for mortgages beyond their means. The Associated Press said Obama's words \"ring hollow.\" And the news agency quoted the Federal Reserve chairman as saying even the foolish borrowers would be aided: AP, Feb. 25: Defending the program Tuesday at a Senate hearing, Federal Reserve Chairman Ben Bernanke said it's important to save those who made bad calls, for the greater good. He likened it to calling the fire department to put out a blaze caused by someone smoking in bed. \"I think the smart way to deal with a situation like that is to put out the fire, save him from his own consequences of his own action but then, going forward, enact penalties and set tougher rules about smoking in bed.\" Sheila Bair, chair of the FDIC, also said there was no easy way to vet homeowners. \"I think it's just simply impractical to try to do a forensic analysis of each and every one of these delinquent loans,\" she told NPR. And, Bair added, it’s in the \"collective economic interest\" to not have more foreclosed homes on the market. \"To try to punish all of those parties now by foreclosing on more homes, putting more families on the street, putting more houses onto the inventory, creating more downward pressure on home prices when you have so much inventory on the market right now. Is that in our collective economic interest to do that? I just don't think that it is.\" Wrong on Bankruptcies Obama said that health care costs cause a bankruptcy every 30 seconds in the U.S. Obama: And for that same reason, we must also address the crushing cost of health care. This is a cost that now causes a bankruptcy in America every 30 seconds. Data from the U.S. Courts show about 934,000 personal bankruptcies in the 12-month period ending June 2008. There are about 32 million seconds in a year. So someone filed for bankruptcy roughly every 30 seconds last year. But even a very high estimate, like the Harvard study we looked at last year, would only attribute half of those personal bankruptcies to medical expenses. So that's one health-related bankruptcy every minute at most. American History Lessons Obama got two historical facts wrong last night, saying the automobile was a U.S. invention and that the transcontinental railroad was completed during the Civil War. Neither historical claim is true. First, the automobile: Obama: I believe the nation that invented the automobile cannot walk away from it. There is some debate about exactly who invented the automobile, but the inventor's nationality was French, German or Scottish, depending on whether one considers steam or electric vehicles to qualify as an \"automobile,\" or only those powered by gasoline. The Library of Congress’ “Everyday Mysteries” site gives the honor to Karl Benz from Germany, who invented a three-wheeled, gasoline automobile with an internal combustion engine in 1885-1886. Before that, France’s Nicolas-Joseph Cugnot invented a steam-powered vehicle for the French army in 1769, and Robert Anderson of Scotland built an electric carriage around 1832-1839. Germans Gottlieb Wilhelm Daimler and Wilhelm Maybach developed a four-wheeled gas-powered vehicle in 1886. Obama would have been correct had he said the U.S. is the nation that invented mass production of the automobile. It was the 1901 Curved Dash Oldsmobile that was first produced in quantity, and, of course, Henry Ford made the car affordable for the masses with the first moving assembly line in 1913. As for the railroad, Obama said: Obama: In the midst of civil war, we laid railroad tracks from one coast to another that spurred commerce and industry. \"Golden Spike\" ceremony completing the transcontinental railroad, May 10, 1869. Obama would have been justified in saying that a transcontinental railroad system was \"planned and begun\" in the midst of the Civil War, which started in 1861. The Pacific Railway Act provided for the transcontinental railroad and was signed in 1862. Workers on the Western end, the Central Pacific line, spiked the first rails in 1863. But construction on the Union Pacific line, which would start in Nebraska and connect to the Central Pacific in Utah, didn't begin until after the war, at which point the Central Pacific was still working in California and had made it roughly to the Sierra Nevadas. The two lines were not to meet until the famous \"golden spike\" ceremony of May 10, 1869, four years after the war had ended. 57 Cops Obama said that \"there are 57 police officers who are still on the streets of Minneapolis tonight because this plan prevented the layoffs their department was about to make.\" But that's a dubious claim. It's true that Mayor R.T. Rybak (an early Obama supporter) said Feb. 23 that cuts in state aid \"would have led to the elimination of 57 sworn police officer positions and 19 non sworn employees\" and that the stimulus bill \"will keep 57 police officers working on the streets of Minneapolis.\" But there's more to it than that. For one thing, the mayor's 57-cop figure is hypothetical. No layoffs were actually proposed. The mayor said that number would have to go \"IF you allocated the Governor's proposed cuts equally across the city\" and \"IF the Governor’s cuts were passed on directly to the Police Department.\" We emphasize the word \"if.\" Cities seldom spread such cuts equally across all city departments and services. The usual practice is to minimize impact on public safety and make larger cuts in less essential services. More important, the mayor himself cites four other factors besides the stimulus money that allow him to avert these hypothetical layoffs. Elsewhere in the same budget speech, he puts stimulus funds last, behind four other factors: lowering debt service payments, focusing cuts on \"more expensive management positions,\" eliminating services and \"developing new revenue options.\" Specifically, Rybak said: \"We are proposing elimination of $1.5 million in non-personnel costs, including overtime.\" So the truth is the stimulus money will help and may avert some future layoffs, but not all 57 cited by the mayor. Bravado Reprise Obama continued his recent habit of asserting projections as fact: Obama: This plan will save or create 3.5 million jobs. More than 90 percent of these jobs will be in the private sector, jobs rebuilding our roads and bridges, constructing wind turbines and solar panels, laying broadband and expanding mass transit. As we pointed out in our Feb. 13 article, \"Stimulus Bill Bravado,\" Obama’s numbers are not certain. The estimate of 3.5 million jobs is backed up by projections from different economists, including independent experts as well as the nonpartisan Congressional Budget Office. However, one economist, Mark Zandi, downgraded his job estimate to 2.2 million once the stimulus legislation was finalized. It's worth noting that even Nobel-winning economists disagree sharply about macroeconomic projections. That’s because macroeconomics is still a relatively new discipline. There is limited data, and even less agreement about what the available data actually mean. Tax Cuts for 95%? Obama said his stimulus program provides a tax cut for \"95 percent of working households\" and later said that a cut would go to 95 percent of \"working families.\" That calls for some explanation. The key words are \"working\" and \"cut.\" He's referring to the \"making work pay\" refundable tax credit, which is only available to workers. As we pointed out previously on The FactCheck Wire, there would be no credit for retirees or those who are unemployed. A Tax Policy Center analysis found that a more modest 75.5 percent of all households would benefit, whether their members are working or not. It is also questionable whether all of the tax refunds can properly be called \"tax cuts.\" The credit is refundable and, therefore, is going to many who earn so little that they pay no federal income taxes in the first place. The White House calls them tax cuts, but the nonpartisan Congressional Budget Office officially scores the bill’s refundable credits under \"direct spending.\" Korean Batteries for American Cars? Obama gave a few examples of how the U.S. isn't leading when it comes to \"clean, renewable energy,\" saying at one point that \"new plug-in hybrids roll off our assembly lines, but they will run on batteries made in Korea.\" He's partly right. The Chevy Volt, if it comes to market as scheduled in 2010, would be the first American-made, plug-in hybrid car, and General Motors recently announced that the Volt will use battery systems from South Korea's LG Chem Ltd. But the U.S. isn't a complete laggard in this department. Ford said earlier this month that batteries for its hybrid, due to be available in 2012, will be supplied by a joint venture between a U.S. company, Johnson Controls Inc., and France's Saft. At least initially, though, the battery cells will be made in France; they will be assembled into power packs in the U.S. Things He Got Right Some other claims that made our ears perk up actually checked out OK. T.R. and health insurance: Speaking of health coverage, Obama said \"Teddy Roosevelt first called for reform.\" Actually, Harry Truman was the first sitting president to call for national health insurance, in 1948. But Theodore Roosevelt, as a Progressive party candidate in 1912, did run (and lose) on a platform that included \"a system of social insurance.\" Cold War Weapons: Obama also criticized \"Cold War weapons we don’t use.\" That’s a reference to the F-22 Raptor, a high-tech fighter plane that has been operational since 2005. It costs about $140 million per plane and has never been used in combat. (For more on the F-22, see our FactCheck Wire post, published Feb. 26.) Update, Feb. 25: After we posted this article, we nailed down another item: Obama exaggerated a bit in describing the Children’s Health Insurance Program that was recently reauthorized by Congress: Obama: When it was days old, this Congress passed a law to provide and protect health insurance for 11 million American children whose parents work full time. The 11 million figure is correct; it’s the “work full time” phrase that caught our attention. It’s true that CHIP (formerly known as SCHIP) is designed for children in families that earn too much to qualify for health care under Medicaid but not enough to buy insurance on their own. But there is no stipulation that parents must work “full time.” Mary Kahn, spokeswoman at the Centers for Medicaid & Medicare Services, told us: “The CHIP program is targeted primarily to children of low-income working families. But there is no requirement that the families be working full time or part time, simply that their income meet that particular state’s requirement.” State eligibility rules differ, but generally they target families making under about 200 percent of the federal poverty level, which is $44,100 this year for a family of four. – by Brooks Jackson, Viveca Novak, Lori Robertson, Justin Bank, Jess Henig and Joe Miller Sources U.S. Energy Information Administration. Weekly U.S. Total Crude Oil and Petroleum Products Imports, accessed 25 Feb. 2009. U.S. Energy Information Administration. Annual U.S. Crude Oil and Petroleum Products Imports from All Countries, accessed 25 Feb. 2009. Woodward, Calvin and Jim Kuhnhenn. “Fact Check: Obama’s words on home aid ring hollow.” Associated Press, 25 Feb. 2009. “FDIC Head Sees Wide Benefit From Foreclosure Plan.” National Public Radio, 19 Feb. 2009. “Everyday Mysteries.” The Library of Congress, accessed 25 Feb. 2009. Kaplan, Fred. \"The Air Force Tries to Save a Fighter Plan that's Never Seen Combat.\" 24 Feb. 2009. Slate. 25 February 2009. DiMascio, Jen. \"Gates: F-22 Production Increase Could Hurt More Affordable JSF.\" 7 Feb. 2008. Defense Daily. 25 February 2009. U.S. Courts. \"Bankruptcy Filings Near Million Mark for 12-Month Period Ending June 30, 2008,\" 27 Aug. 2008. Naughton, Keith. \"Ford Chooses Johnson Controls-Saft for Plug-in Hybrid Battery.\" Bloomberg News, 3 Feb. 2009. Krishner, Tom. \"GM picks S. Korea's LG Chem to make Volt batteries.\" The Associated Press, 12 Jan. 2009.", 
        "intTime": 20090308, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.factcheck.org/politics/fact-checking_obamas_speech.html President Obama's first speech to a joint session of Congress was stuffed with signals about the new direction his budget will take and meant-to-be reassuring words about the economy. But it was also peppered with exaggerations and factual misstatements. He said \"we import more oil today than ever before.\" That's untrue. Imports peaked in 2005 and are substantially lower today. He claimed his mortgage aid plan would help \"responsible\" buyers but not those who borrowed beyond their means. But even prominent defenders of the program including Fed Chairman Bernanke and FDIC chief Bair concede foolish borrowers will be aided, too. He said the high cost of health care \"causes a bankruptcy in America every 30 seconds.\" That's at least double the true figure. He flubbed two facts about American history. The U.S. did not invent the automobile, and the transcontinental railroad was not completed until years after the Civil War, not during it. He claimed that his stimulus plan \"prevented the layoffs\" of 57 police officers in Minneapolis. In fact, it's far more complicated than that, and other factors are also helping to save police jobs. The president also repeated some strained claims we've critiqued before. Analysis In what had the look and feel of a State of the Union address, President Barack Obama spoke before Congress Feb. 24. Making the case for why the stimulus plan he recently signed would help the economy, Obama also laid the groundwork for the budget he'll submit to Congress Thursday and foreshadowed major action in the areas of energy, education and health reform. We're not passing judgment one way or the other on his ideas. But he made several factual errors along the way. Less Foreign Oil, Not More One line in Obama’s speech certainly sounded plausible – given the widespread concern about foreign oil – but he got it wrong: Obama: We have known for decades that our survival depends on finding new sources of energy, yet we import more oil today than ever before. Not true. We’re importing less than we were just a few years ago. This chart from the U.S. Energy Information Administration shows that weekly imports of crude oil and petroleum products (in thousands of barrels per day) have been dropping. Imports reached a high point of 15,217,000 barrels per day the week of Nov. 4, 2005. Most recently, they totaled 11,577,000 the week of Feb. 20, 2009. EIA charts on monthly and annual imports (see below) show the same trend. Only Help for Good-Intentioned Homeowners? Obama said his plan to help struggling homeowners would aid \"responsible\" borrowers but not someone \"who bought a house he could never hope to afford.\" Obama: [W]e have launched a housing plan that will help responsible families facing the threat of foreclosure lower their monthly payments and refinance their mortgages. It's a plan that won't help speculators or that neighbor down the street who bought a house he could never hope to afford. … But even the program's defenders concede that it can’t possibly distinguish between \"responsible\" borrowers and those who foolishly (or fraudulently) signed up for mortgages beyond their means. The Associated Press said Obama's words \"ring hollow.\" And the news agency quoted the Federal Reserve chairman as saying even the foolish borrowers would be aided: AP, Feb. 25: Defending the program Tuesday at a Senate hearing, Federal Reserve Chairman Ben Bernanke said it's important to save those who made bad calls, for the greater good. He likened it to calling the fire department to put out a blaze caused by someone smoking in bed. \"I think the smart way to deal with a situation like that is to put out the fire, save him from his own consequences of his own action but then, going forward, enact penalties and set tougher rules about smoking in bed.\" Sheila Bair, chair of the FDIC, also said there was no easy way to vet homeowners. \"I think it's just simply impractical to try to do a forensic analysis of each and every one of these delinquent loans,\" she told NPR. And, Bair added, it’s in the \"collective economic interest\" to not have more foreclosed homes on the market. \"To try to punish all of those parties now by foreclosing on more homes, putting more families on the street, putting more houses onto the inventory, creating more downward pressure on home prices when you have so much inventory on the market right now. Is that in our collective economic interest to do that? I just don't think that it is.\" Wrong on Bankruptcies Obama said that health care costs cause a bankruptcy every 30 seconds in the U.S. Obama: And for that same reason, we must also address the crushing cost of health care. This is a cost that now causes a bankruptcy in America every 30 seconds. Data from the U.S. Courts show about 934,000 personal bankruptcies in the 12-month period ending June 2008. There are about 32 million seconds in a year. So someone filed for bankruptcy roughly every 30 seconds last year. But even a very high estimate, like the Harvard study we looked at last year, would only attribute half of those personal bankruptcies to medical expenses. So that's one health-related bankruptcy every minute at most. American History Lessons Obama got two historical facts wrong last night, saying the automobile was a U.S. invention and that the transcontinental railroad was completed during the Civil War. Neither historical claim is true. First, the automobile: Obama: I believe the nation that invented the automobile cannot walk away from it. There is some debate about exactly who invented the automobile, but the inventor's nationality was French, German or Scottish, depending on whether one considers steam or electric vehicles to qualify as an \"automobile,\" or only those powered by gasoline. The Library of Congress’ “Everyday Mysteries” site gives the honor to Karl Benz from Germany, who invented a three-wheeled, gasoline automobile with an internal combustion engine in 1885-1886. Before that, France’s Nicolas-Joseph Cugnot invented a steam-powered vehicle for the French army in 1769, and Robert Anderson of Scotland built an electric carriage around 1832-1839. Germans Gottlieb Wilhelm Daimler and Wilhelm Maybach developed a four-wheeled gas-powered vehicle in 1886. Obama would have been correct had he said the U.S. is the nation that invented mass production of the automobile. It was the 1901 Curved Dash Oldsmobile that was first produced in quantity, and, of course, Henry Ford made the car affordable for the masses with the first moving assembly line in 1913. As for the railroad, Obama said: Obama: In the midst of civil war, we laid railroad tracks from one coast to another that spurred commerce and industry. \"Golden Spike\" ceremony completing the transcontinental railroad, May 10, 1869. Obama would have been justified in saying that a transcontinental railroad system was \"planned and begun\" in the midst of the Civil War, which started in 1861. The Pacific Railway Act provided for the transcontinental railroad and was signed in 1862. Workers on the Western end, the Central Pacific line, spiked the first rails in 1863. But construction on the Union Pacific line, which would start in Nebraska and connect to the Central Pacific in Utah, didn't begin until after the war, at which point the Central Pacific was still working in California and had made it roughly to the Sierra Nevadas. The two lines were not to meet until the famous \"golden spike\" ceremony of May 10, 1869, four years after the war had ended. 57 Cops Obama said that \"there are 57 police officers who are still on the streets of Minneapolis tonight because this plan prevented the layoffs their department was about to make.\" But that's a dubious claim. It's true that Mayor R.T. Rybak (an early Obama supporter) said Feb. 23 that cuts in state aid \"would have led to the elimination of 57 sworn police officer positions and 19 non sworn employees\" and that the stimulus bill \"will keep 57 police officers working on the streets of Minneapolis.\" But there's more to it than that. For one thing, the mayor's 57-cop figure is hypothetical. No layoffs were actually proposed. The mayor said that number would have to go \"IF you allocated the Governor's proposed cuts equally across the city\" and \"IF the Governor’s cuts were passed on directly to the Police Department.\" We emphasize the word \"if.\" Cities seldom spread such cuts equally across all city departments and services. The usual practice is to minimize impact on public safety and make larger cuts in less essential services. More important, the mayor himself cites four other factors besides the stimulus money that allow him to avert these hypothetical layoffs. Elsewhere in the same budget speech, he puts stimulus funds last, behind four other factors: lowering debt service payments, focusing cuts on \"more expensive management positions,\" eliminating services and \"developing new revenue options.\" Specifically, Rybak said: \"We are proposing elimination of $1.5 million in non-personnel costs, including overtime.\" So the truth is the stimulus money will help and may avert some future layoffs, but not all 57 cited by the mayor. Bravado Reprise Obama continued his recent habit of asserting projections as fact: Obama: This plan will save or create 3.5 million jobs. More than 90 percent of these jobs will be in the private sector, jobs rebuilding our roads and bridges, constructing wind turbines and solar panels, laying broadband and expanding mass transit. As we pointed out in our Feb. 13 article, \"Stimulus Bill Bravado,\" Obama’s numbers are not certain. The estimate of 3.5 million jobs is backed up by projections from different economists, including independent experts as well as the nonpartisan Congressional Budget Office. However, one economist, Mark Zandi, downgraded his job estimate to 2.2 million once the stimulus legislation was finalized. It's worth noting that even Nobel-winning economists disagree sharply about macroeconomic projections. That’s because macroeconomics is still a relatively new discipline. There is limited data, and even less agreement about what the available data actually mean. Tax Cuts for 95%? Obama said his stimulus program provides a tax cut for \"95 percent of working households\" and later said that a cut would go to 95 percent of \"working families.\" That calls for some explanation. The key words are \"working\" and \"cut.\" He's referring to the \"making work pay\" refundable tax credit, which is only available to workers. As we pointed out previously on The FactCheck Wire, there would be no credit for retirees or those who are unemployed. A Tax Policy Center analysis found that a more modest 75.5 percent of all households would benefit, whether their members are working or not. It is also questionable whether all of the tax refunds can properly be called \"tax cuts.\" The credit is refundable and, therefore, is going to many who earn so little that they pay no federal income taxes in the first place. The White House calls them tax cuts, but the nonpartisan Congressional Budget Office officially scores the bill’s refundable credits under \"direct spending.\" Korean Batteries for American Cars? Obama gave a few examples of how the U.S. isn't leading when it comes to \"clean, renewable energy,\" saying at one point that \"new plug-in hybrids roll off our assembly lines, but they will run on batteries made in Korea.\" He's partly right. The Chevy Volt, if it comes to market as scheduled in 2010, would be the first American-made, plug-in hybrid car, and General Motors recently announced that the Volt will use battery systems from South Korea's LG Chem Ltd. But the U.S. isn't a complete laggard in this department. Ford said earlier this month that batteries for its hybrid, due to be available in 2012, will be supplied by a joint venture between a U.S. company, Johnson Controls Inc., and France's Saft. At least initially, though, the battery cells will be made in France; they will be assembled into power packs in the U.S. Things He Got Right Some other claims that made our ears perk up actually checked out OK. T.R. and health insurance: Speaking of health coverage, Obama said \"Teddy Roosevelt first called for reform.\" Actually, Harry Truman was the first sitting president to call for national health insurance, in 1948. But Theodore Roosevelt, as a Progressive party candidate in 1912, did run (and lose) on a platform that included \"a system of social insurance.\" Cold War Weapons: Obama also criticized \"Cold War weapons we don’t use.\" That’s a reference to the F-22 Raptor, a high-tech fighter plane that has been operational since 2005. It costs about $140 million per plane and has never been used in combat. (For more on the F-22, see our FactCheck Wire post, published Feb. 26.) Update, Feb. 25: After we posted this article, we nailed down another item: Obama exaggerated a bit in describing the Children’s Health Insurance Program that was recently reauthorized by Congress: Obama: When it was days old, this Congress passed a law to provide and protect health insurance for 11 million American children whose parents work full time. The 11 million figure is correct; it’s the “work full time” phrase that caught our attention. It’s true that CHIP (formerly known as SCHIP) is designed for children in families that earn too much to qualify for health care under Medicaid but not enough to buy insurance on their own. But there is no stipulation that parents must work “full time.” Mary Kahn, spokeswoman at the Centers for Medicaid & Medicare Services, told us: “The CHIP program is targeted primarily to children of low-income working families. But there is no requirement that the families be working full time or part time, simply that their income meet that particular state’s requirement.” State eligibility rules differ, but generally they target families making under about 200 percent of the federal poverty level, which is $44,100 this year for a family of four. – by Brooks Jackson, Viveca Novak, Lori Robertson, Justin Bank, Jess Henig and Joe Miller Sources U.S. Energy Information Administration. Weekly U.S. Total Crude Oil and Petroleum Products Imports, accessed 25 Feb. 2009. U.S. Energy Information Administration. Annual U.S. Crude Oil and Petroleum Products Imports from All Countries, accessed 25 Feb. 2009. Woodward, Calvin and Jim Kuhnhenn. “Fact Check: Obama’s words on home aid ring hollow.” Associated Press, 25 Feb. 2009. “FDIC Head Sees Wide Benefit From Foreclosure Plan.” National Public Radio, 19 Feb. 2009. “Everyday Mysteries.” The Library of Congress, accessed 25 Feb. 2009. Kaplan, Fred. \"The Air Force Tries to Save a Fighter Plan that's Never Seen Combat.\" 24 Feb. 2009. Slate. 25 February 2009. DiMascio, Jen. \"Gates: F-22 Production Increase Could Hurt More Affordable JSF.\" 7 Feb. 2008. Defense Daily. 25 February 2009. U.S. Courts. \"Bankruptcy Filings Near Million Mark for 12-Month Period Ending June 30, 2008,\" 27 Aug. 2008. Naughton, Keith. \"Ford Chooses Johnson Controls-Saft for Plug-in Hybrid Battery.\" Bloomberg News, 3 Feb. 2009. Krishner, Tom. \"GM picks S. Korea's LG Chem to make Volt batteries.\" The Associated Press, 12 Jan. 2009.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-08 16:03:00", 
        "title": "More Lies...", 
        "userID": "threerings"
    }, 
    {
        "content": "Was he right about those 57 states, with two more to visit, but not Hawaii?", 
        "intTime": 20090308, 
        "postID": 2, 
        "quote": "", 
        "reply": "Was he right about those 57 states, with two more to visit, but not Hawaii?", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-08 16:55:00", 
        "title": "More Lies...", 
        "userID": "peter3_1"
    }, 
    {
        "content": "It's just like that movie... We've been fed the lies, we're already receiving the sex [courtesy of the present 'voted' politicians, all inclusive) - does anyone have videotape [film at 11?]?", 
        "intTime": 20090308, 
        "postID": 3, 
        "quote": "", 
        "reply": "It's just like that movie... We've been fed the lies, we're already receiving the sex [courtesy of the present 'voted' politicians, all inclusive) - does anyone have videotape [film at 11?]?", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-08 17:04:00", 
        "title": "More Lies...", 
        "userID": "Smitty"
    }, 
    {
        "content": "Why should anyone be surprised? This is right out of the hard-core collectivist (dis)organizing play book. Sucker the ignorant to convince them of the appropriateness of increasing control-freak activity. Can't let a good crisis go to waste; and if you can generate a bigger crisis than it really is, then so much the better.", 
        "intTime": 20090308, 
        "postID": 4, 
        "quote": "", 
        "reply": "Why should anyone be surprised? This is right out of the hard-core collectivist (dis)organizing play book. Sucker the ignorant to convince them of the appropriateness of increasing control-freak activity. Can't let a good crisis go to waste; and if you can generate a bigger crisis than it really is, then so much the better.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-08 18:57:00", 
        "title": "More Lies...", 
        "userID": "RRR52"
    }, 
    {
        "content": "Obama failed to save 651,000 jobs in February, hampering his efforts to \"save or create\" 3.5 million jobs. The monthly loss was the worst since 1949. The economy has now lost 2.5 million jobs since Obama's election and 4.4 million since December 2007. The unemployment rate is 8.1 percent. So this is hope and change? The sheople of America should take another look at theh disaster they have elected.", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "", 
        "reply": "Obama failed to save 651,000 jobs in February, hampering his efforts to \"save or create\" 3.5 million jobs. The monthly loss was the worst since 1949. The economy has now lost 2.5 million jobs since Obama's election and 4.4 million since December 2007. The unemployment rate is 8.1 percent. So this is hope and change? The sheople of America should take another look at theh disaster they have elected.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 07:50:00", 
        "title": "More Lies...", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "On the morning TV news there was a story of the new Obamavilles springing up all over the country. The newely unemployed and homeless living in tents on any open land they can find. Change you can count on.... Yes we can (be homeless too)", 
        "intTime": 20090309, 
        "postID": 6, 
        "quote": "", 
        "reply": "On the morning TV news there was a story of the new Obamavilles springing up all over the country. The newely unemployed and homeless living in tents on any open land they can find. Change you can count on.... Yes we can (be homeless too)", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:00:00", 
        "title": "More Lies...", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "LEAVE OBAMA ALONE!", 
        "intTime": 20090309, 
        "postID": 7, 
        "quote": "", 
        "reply": "LEAVE OBAMA ALONE!", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:02:00", 
        "title": "More Lies...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Obama is the Great Pretender who says he's doing things he isn't, and whose activity doesn't match the rhetoric. It is apparent he isn't the one making policy and running America. \"The World's Finest\"", 
        "intTime": 20090309, 
        "postID": 8, 
        "quote": "", 
        "reply": "Obama is the Great Pretender who says he's doing things he isn't, and whose activity doesn't match the rhetoric. It is apparent he isn't the one making policy and running America. \"The World's Finest\"", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:02:00", 
        "title": "More Lies...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I consider a \"Lie\" to be an intentional misrepresentation of a fact, when that fact is known to be otherwise, with the absolute attempt to deceive. I don't think much of the misspeaking you have described is that blatant... An example might be the importing of oil. Oil imports may be down right now because everyone is broke (not everyone, obviously, but no attempt to \"lie\" here, just to create emotional emphasis ), but that doesn't mean that if we had a good economy and the money, everyone wouldn't be buying 3 MPG Humvees and guzzling as much gas as possible. People are not consuming less gas because they have suddenly all become \"greenies\", that's for sure!! So, your lead-in is more of a \"Lie\" than the President's blunders, because you are intentionally trying to create an emotional backlash by shading the realities even more, and more negatively in purpose and in a mean-spirited way than he did - - By the way, I'm against much of what Obama is doing, but I hate the mean-spirited knit-picking . . . Wandering and Wondering", 
        "intTime": 20090309, 
        "postID": 9, 
        "quote": "", 
        "reply": "I consider a \"Lie\" to be an intentional misrepresentation of a fact, when that fact is known to be otherwise, with the absolute attempt to deceive. I don't think much of the misspeaking you have described is that blatant... An example might be the importing of oil. Oil imports may be down right now because everyone is broke (not everyone, obviously, but no attempt to \"lie\" here, just to create emotional emphasis ), but that doesn't mean that if we had a good economy and the money, everyone wouldn't be buying 3 MPG Humvees and guzzling as much gas as possible. People are not consuming less gas because they have suddenly all become \"greenies\", that's for sure!! So, your lead-in is more of a \"Lie\" than the President's blunders, because you are intentionally trying to create an emotional backlash by shading the realities even more, and more negatively in purpose and in a mean-spirited way than he did - - By the way, I'm against much of what Obama is doing, but I hate the mean-spirited knit-picking . . . Wandering and Wondering", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:06:00", 
        "title": "More Lies...", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Are you trying to say there isn't an entire contingent of the Whitehouse staff devoted to propagating the \"Rush is the leader of the GOP\" and \"the party of no\" tactics? Nope, the Obama spin doctors are lieing so Obama doesn't once again go on TV and say \"I screwed up.\" Obama's handlers won't let that happen again.", 
        "intTime": 20090309, 
        "postID": 10, 
        "quote": "", 
        "reply": "Are you trying to say there isn't an entire contingent of the Whitehouse staff devoted to propagating the \"Rush is the leader of the GOP\" and \"the party of no\" tactics? Nope, the Obama spin doctors are lieing so Obama doesn't once again go on TV and say \"I screwed up.\" Obama's handlers won't let that happen again.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:13:00", 
        "title": "More Lies...", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "He has been in office for 6 weeks. I don't agree with some of what he has done, but this economy isn't going to turn around over night. This is an economic disaster unlike anything since 1929, and it is going to take a lot more than 6 weeks to patch it up.", 
        "intTime": 20090309, 
        "postID": 11, 
        "quote": "", 
        "reply": "He has been in office for 6 weeks. I don't agree with some of what he has done, but this economy isn't going to turn around over night. This is an economic disaster unlike anything since 1929, and it is going to take a lot more than 6 weeks to patch it up.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:14:00", 
        "title": "More Lies...", 
        "userID": "nspreitler"
    }, 
    {
        "content": "So we only had six weeks of lies. How many weeks will it take before they become true lies?", 
        "intTime": 20090309, 
        "postID": 12, 
        "quote": "", 
        "reply": "So we only had six weeks of lies. How many weeks will it take before they become true lies?", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:18:00", 
        "title": "More Lies...", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: He has been in office for 6 weeks. I don't agree with some of what he has done, but this economy isn't going to turn around over night. This is an economic disaster unlike anything since 1929, and it is going to take a lot more than 6 weeks to patch it up. I am also willing to give him a chance as I pray for the state of our nation. But he has yet to do anything right, and it HAS been 6 weeks. I've been lied to, I've been cheated, and I have been stolen from. Every minute I spend working is another dime he sees as his own to do with as he pleases. Where was my five days to review the stimulus bill? Lie. Where was the reaching across party lines when not one single Republican approved the bill and he passed it anyway? Lie. Where is the gun advocate now agreeing to the AWB being put back into place? Lie. Just typical politics. Lie after lie after lie after lie. He's no better than Bush, and the cronies of either party will continue to defend the injustice we suffer because they just have to be right and are afraid to put a boot in Washington's azz. Count me in with GreyWolf on this one. Anyone supporting either political party blindly is too stupid to vote. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090309, 
        "postID": 13, 
        "quote": "Originally posted by nspreitler: He has been in office for 6 weeks. I don't agree with some of what he has done, but this economy isn't going to turn around over night. This is an economic disaster unlike anything since 1929, and it is going to take a lot more than 6 weeks to patch it up.", 
        "reply": " I am also willing to give him a chance as I pray for the state of our nation. But he has yet to do anything right, and it HAS been 6 weeks. I've been lied to, I've been cheated, and I have been stolen from. Every minute I spend working is another dime he sees as his own to do with as he pleases. Where was my five days to review the stimulus bill? Lie. Where was the reaching across party lines when not one single Republican approved the bill and he passed it anyway? Lie. Where is the gun advocate now agreeing to the AWB being put back into place? Lie. Just typical politics. Lie after lie after lie after lie. He's no better than Bush, and the cronies of either party will continue to defend the injustice we suffer because they just have to be right and are afraid to put a boot in Washington's azz. Count me in with GreyWolf on this one. Anyone supporting either political party blindly is too stupid to vote. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 08:28:00", 
        "title": "More Lies...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "CNN Sat March 7, 2009 Obama: Don't fear the future \"I don't think that people should be fearful about our future,\" he told the newspaper. \"I don't think that people should suddenly mistrust all of our financial institutions.\" Somehow I think the people now living in Obamavilles are fearful of the future.", 
        "intTime": 20090309, 
        "postID": 14, 
        "quote": "", 
        "reply": "CNN Sat March 7, 2009 Obama: Don't fear the future \"I don't think that people should be fearful about our future,\" he told the newspaper. \"I don't think that people should suddenly mistrust all of our financial institutions.\" Somehow I think the people now living in Obamavilles are fearful of the future.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 09:26:00", 
        "title": "More Lies...", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Anyone supporting either political party blindly is too stupid to vote. Amen to that. Obama was never my first choice, and all I can say is that until Americans realize that the two-party system has become nothing more than an organized system of binary bullshizz, we're just going to keep falling for the same old tired arguments from both sides. R: Tax cuts for the wealthy!!!! D: Spend, spend, spend!!! R: WAAAARRRRRRR!!! D: PEEEEEEEEZ! (Sometimes.) R: MOAR BABIEZ! D: MOAR PROGRAMZ! R: MOAR GUNZ! D: MOAR LAWZ! Really, we've all heard the talking points before, but when was the last time we heard any real ideas from EITHER side? Platforms are opinions, not plans. A platform has never solved a crisis, fixed a problem, negotiated an agreement, prevented a catastrophe, provided relief, supported freedoms, or improved the quality of life for anyone. The only thing that can do any of those is a PLAN. And a plan starts with an idea. A good plan is based in functional reality, not partisan talking points. A working plan puts ideas into action. GWG is right - the nit-picking is ridiculous. Name one politician who has never made a blunder, has never over-simplified an explanation, or who has never broken a promise. Certainly not our previous CinC. They're politicians, they all suck on some level, but with the WORLD economy the way it is, I think we have bigger things to nit-pick about.", 
        "intTime": 20090309, 
        "postID": 15, 
        "quote": "Originally posted by FollowMeInfantry: Anyone supporting either political party blindly is too stupid to vote.", 
        "reply": " Amen to that. Obama was never my first choice, and all I can say is that until Americans realize that the two-party system has become nothing more than an organized system of binary bullshizz, we're just going to keep falling for the same old tired arguments from both sides. R: Tax cuts for the wealthy!!!! D: Spend, spend, spend!!! R: WAAAARRRRRRR!!! D: PEEEEEEEEZ! (Sometimes.) R: MOAR BABIEZ! D: MOAR PROGRAMZ! R: MOAR GUNZ! D: MOAR LAWZ! Really, we've all heard the talking points before, but when was the last time we heard any real ideas from EITHER side? Platforms are opinions, not plans. A platform has never solved a crisis, fixed a problem, negotiated an agreement, prevented a catastrophe, provided relief, supported freedoms, or improved the quality of life for anyone. The only thing that can do any of those is a PLAN. And a plan starts with an idea. A good plan is based in functional reality, not partisan talking points. A working plan puts ideas into action. GWG is right - the nit-picking is ridiculous. Name one politician who has never made a blunder, has never over-simplified an explanation, or who has never broken a promise. Certainly not our previous CinC. They're politicians, they all suck on some level, but with the WORLD economy the way it is, I think we have bigger things to nit-pick about.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 10:00:00", 
        "title": "More Lies...", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Mr. Obama has since taking office, done the POLAR OPPOSITE of those things he and the DEMS ran on. Fiscal Responsibility gave him the 2% that otherwise would have gone Rep.., Hmmmm, deduct 2% from Mr. Obama, add it to McCain, and McCain wins at least the popular vote by the same margin as Mr. Obama. If he had done things 90% as he stated, you'd hear little complaint, but that is not what is happening. Remember please that a single R \"lie\" Cost Mr. Bush 41 the election \"Read my lips, no new taxes!\" In Mr. Obama's case, already, in less than a full 60 days in office, we're looking at major tax increases for EVERYONE, and I mean EVERYONE in America.", 
        "intTime": 20090309, 
        "postID": 16, 
        "quote": "", 
        "reply": "Mr. Obama has since taking office, done the POLAR OPPOSITE of those things he and the DEMS ran on. Fiscal Responsibility gave him the 2% that otherwise would have gone Rep.., Hmmmm, deduct 2% from Mr. Obama, add it to McCain, and McCain wins at least the popular vote by the same margin as Mr. Obama. If he had done things 90% as he stated, you'd hear little complaint, but that is not what is happening. Remember please that a single R \"lie\" Cost Mr. Bush 41 the election \"Read my lips, no new taxes!\" In Mr. Obama's case, already, in less than a full 60 days in office, we're looking at major tax increases for EVERYONE, and I mean EVERYONE in America.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 10:23:00", 
        "title": "More Lies...", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Whirled_Peas: GWG is right - the nit-picking is ridiculous. Name one politician who has never made a blunder, has never over-simplified an explanation, or who has never broken a promise. Obama, prior to 1/20/09. If one has never done anything it is impossible to blunder. Obama no longer has control of his destiny. Due to lack of \"school of hard knocks\" experience he is floundering and lieing to cover it up. He is gaining his experience at our expense.", 
        "intTime": 20090309, 
        "postID": 17, 
        "quote": "Whirled_Peas: GWG is right - the nit-picking is ridiculous. Name one politician who has never made a blunder, has never over-simplified an explanation, or who has never broken a promise.", 
        "reply": " Obama, prior to 1/20/09. If one has never done anything it is impossible to blunder. Obama no longer has control of his destiny. Due to lack of \"school of hard knocks\" experience he is floundering and lieing to cover it up. He is gaining his experience at our expense.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 10:25:00", 
        "title": "More Lies...", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Bill, you are correct. Mr. Obama is proving himself to be an empty suit to a degree I never thought possible. NEVER bought into the \"he's SO smart...\" crap, but did assume, wrongly, that he had a little pragmatist that would overcome his obvious narcissism. I was wrong yet again.", 
        "intTime": 20090309, 
        "postID": 18, 
        "quote": "", 
        "reply": "Bill, you are correct. Mr. Obama is proving himself to be an empty suit to a degree I never thought possible. NEVER bought into the \"he's SO smart...\" crap, but did assume, wrongly, that he had a little pragmatist that would overcome his obvious narcissism. I was wrong yet again.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 10:32:00", 
        "title": "More Lies...", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Obama is the Great Pretender who says he's doing things he isn't, and whose activity doesn't match the rhetoric. It is apparent he isn't the one making policy and running America. Let me fix this for you... George Bush was the Great Pretender who said he was doing things he wasn't, and whose activity didn't match the rhetoric. It was apparent he wasn't the one making policy and running America. Obama is going just fine.", 
        "intTime": 20090309, 
        "postID": 19, 
        "quote": "Originally posted by Kegler300: Obama is the Great Pretender who says he's doing things he isn't, and whose activity doesn't match the rhetoric. It is apparent he isn't the one making policy and running America.", 
        "reply": " Let me fix this for you... George Bush was the Great Pretender who said he was doing things he wasn't, and whose activity didn't match the rhetoric. It was apparent he wasn't the one making policy and running America. Obama is going just fine.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 10:36:00", 
        "title": "More Lies...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by Kegler300: Obama is the Great Pretender who says he's doing things he isn't, and whose activity doesn't match the rhetoric. It is apparent he isn't the one making policy and running America. Let me fix this for you... George Bush was the Great Pretender who said he was doing things he wasn't, and whose activity didn't match the rhetoric. It was apparent he wasn't the one making policy and running America. Obama is going just fine. And has pledged to support yet another Marxist institution, Cuba. We're not talking about W anymore. We're discussing YOUR solution.", 
        "intTime": 20090309, 
        "postID": 20, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by Kegler300: Obama is the Great Pretender who says he's doing things he isn't, and whose activity doesn't match the rhetoric. It is apparent he isn't the one making policy and running America. Let me fix this for you... George Bush was the Great Pretender who said he was doing things he wasn't, and whose activity didn't match the rhetoric. It was apparent he wasn't the one making policy and running America. Obama is going just fine.", 
        "reply": " And has pledged to support yet another Marxist institution, Cuba. We're not talking about W anymore. We're discussing YOUR solution.", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 10:45:00", 
        "title": "More Lies...", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Killswitch_Engage: George Bush was the Great Pretender who said he was doing things he wasn't, and whose activity didn't match the rhetoric. So what does that have to do with America 2009? Obama is the President, the economy is in the toilet, and the debt is astronomical. Don't GAS what Bush did or didn't do. What is Obama doing? Why is Pelosi worried about a marsh mouse on not the ever expanding Obamavilles?", 
        "intTime": 20090309, 
        "postID": 21, 
        "quote": "Killswitch_Engage: George Bush was the Great Pretender who said he was doing things he wasn't, and whose activity didn't match the rhetoric.", 
        "reply": " So what does that have to do with America 2009? Obama is the President, the economy is in the toilet, and the debt is astronomical. Don't GAS what Bush did or didn't do. What is Obama doing? Why is Pelosi worried about a marsh mouse on not the ever expanding Obamavilles?", 
        "threadID": "409192893_7110092712001", 
        "time": "2009-03-09 12:08:00", 
        "title": "More Lies...", 
        "userID": "bill_kananen"
    }
]