[
    {
        "content": "See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!!", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "", 
        "reply": "See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!!", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 10:45:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Let me add that they all have SMUGNESS in common.", 
        "intTime": 20090529, 
        "postID": 2, 
        "quote": "", 
        "reply": "Let me add that they all have SMUGNESS in common.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 10:51:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas.", 
        "intTime": 20090529, 
        "postID": 3, 
        "quote": "", 
        "reply": "It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 10:59:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "intTime": 20090529, 
        "postID": 4, 
        "quote": "Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!!", 
        "reply": " So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:07:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 1WW: It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas. Smoke and Mirrors.....", 
        "intTime": 20090529, 
        "postID": 5, 
        "quote": "Originally posted by 1WW: It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas.", 
        "reply": " Smoke and Mirrors.....", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:07:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Transcript from Alito's confirmation hearing: quote: COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you. The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table.", 
        "intTime": 20090529, 
        "postID": 6, 
        "quote": "COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you.", 
        "reply": "Transcript from Alito's confirmation hearing:  The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:20:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? It won't matter whether they drag her through the mud or not. With the Dems in control of Both Houses, Judge Sotomayer will be confirmed as the next Supreme Court Justice. This time, the numbers are there. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090529, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "reply": " It won't matter whether they drag her through the mud or not. With the Dems in control of Both Houses, Judge Sotomayer will be confirmed as the next Supreme Court Justice. This time, the numbers are there. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:23:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. \"The World's Finest\"", 
        "intTime": 20090529, 
        "postID": 8, 
        "quote": "Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind.", 
        "reply": "One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito...  \"The World's Finest\"", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:27:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback?????", 
        "intTime": 20090529, 
        "postID": 9, 
        "quote": "Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind.", 
        "reply": " And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback?????", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:34:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Transcript from Alito's confirmation hearing: quote: COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you. The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table. Personally I dont care about diversity if you're qualified thats it, I dont care if you're pink purple and polka dotted. They're to interpret the constitution not to bring their childhood or ancesters into the equation. Btw, she would not be the first Hispanic, that was done already with Cardozo nominated by a Repb. Strange but it seems that repubs nominate more non-white guys than dems. Since diversity was brought up. The difference is Alito said: \"And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result.\" this was in reference to his background. And my smoke and mirrors comment was directed at the pro-choice thang. We will wait and see what stuff is hurled and when a very minor thing is said by a repub it will be blown out of proportion and all has already been forgotten about Thomas, Alito, Brown, Estrada and so on that the left threw that was real vitriol.", 
        "intTime": 20090529, 
        "postID": 10, 
        "quote": "Originally posted by 1WW: Transcript from Alito's confirmation hearing: quote: COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you. The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table. Personally I dont care about diversity if you're qualified thats it, I dont care if you're pink purple and polka dotted. They're to interpret the constitution not to bring their childhood or ancesters into the equation. Btw, she would not be the first Hispanic, that was done already with Cardozo nominated by a Repb. Strange but it seems that repubs nominate more non-white guys than dems. Since diversity was brought up.", 
        "reply": " The difference is Alito said: \"And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result.\" this was in reference to his background. And my smoke and mirrors comment was directed at the pro-choice thang. We will wait and see what stuff is hurled and when a very minor thing is said by a repub it will be blown out of proportion and all has already been forgotten about Thomas, Alito, Brown, Estrada and so on that the left threw that was real vitriol.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:34:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE)", 
        "intTime": 20090529, 
        "postID": 11, 
        "quote": "Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang.", 
        "reply": " Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE)", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:39:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press.", 
        "intTime": 20090529, 
        "postID": 12, 
        "quote": "Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE)", 
        "reply": " I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:46:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback????? Obama must hate Italian Americans right.", 
        "intTime": 20090529, 
        "postID": 13, 
        "quote": "Originally posted by sw614: quote: Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback?????", 
        "reply": " Obama must hate Italian Americans right.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:46:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue?", 
        "intTime": 20090529, 
        "postID": 14, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press.", 
        "reply": " Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:53:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "intTime": 20090529, 
        "postID": 15, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "reply": " The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:57:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. I hope the republicans use the democrat template from the Alito and Thomas hearings. \"The World's Finest\"", 
        "intTime": 20090529, 
        "postID": 16, 
        "quote": "Originally posted by WepsFP: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "reply": " I hope the republicans use the democrat template from the Alito and Thomas hearings. \"The World's Finest\"", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:00:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Didnt say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner, she was born here right so she has an accent? So if it was a german last name would Obama break out the gutteral pronunciations? Pet peeve of mine. I'll wager the unbringing part was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "intTime": 20090529, 
        "postID": 17, 
        "quote": "Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue?", 
        "reply": " Didnt say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner, she was born here right so she has an accent? So if it was a german last name would Obama break out the gutteral pronunciations? Pet peeve of mine. I'll wager the unbringing part was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:01:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!!", 
        "intTime": 20090529, 
        "postID": 18, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "reply": " Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!!", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:03:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. Yeh, repubs cant act like Dems and drag minorities thru the mud like dems can. Thank for reminding us of the dbl standard. But Obama knew that hence this nomination.", 
        "intTime": 20090529, 
        "postID": 19, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "reply": " Yeh, repubs cant act like Dems and drag minorities thru the mud like dems can. Thank for reminding us of the dbl standard. But Obama knew that hence this nomination.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:05:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!! You have the market on the tinfoil. quote: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. That alone proves much of what I said. your bubble awaits...buh bye", 
        "intTime": 20090529, 
        "postID": 20, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!!", 
        "reply": " You have the market on the tinfoil. quote: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. That alone proves much of what I said. your bubble awaits...buh bye", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:06:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ?", 
        "intTime": 20090529, 
        "postID": 21, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "reply": " More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:08:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? I hate dog and pony shows and patronizing speeches by politicos and I oppose her because she is a lib. And I dont take kindly toward anyone associated with hate groups, la raza or any other. I feel that in the last yr the bar keeps getting lower. Especially with the tax cheats, questionable backgrounds and lobbyist this Prez keeps running up the flagpole, she is just another one of the bunch. 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ? Yes, I am seen as a racist because I opposed obama. And it was predicted prior to the election and with this nom it has already been set in motion. The WH already threw that out there. If one can be a racist against (libs) then I am one.", 
        "intTime": 20090529, 
        "postID": 22, 
        "quote": "Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? I hate dog and pony shows and patronizing speeches by politicos and I oppose her because she is a lib. And I dont take kindly toward anyone associated with hate groups, la raza or any other. I feel that in the last yr the bar keeps getting lower. Especially with the tax cheats, questionable backgrounds and lobbyist this Prez keeps running up the flagpole, she is just another one of the bunch. 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ? Yes, I am seen as a racist because I opposed obama. And it was predicted prior to the election and with this nom it has already been set in motion. The WH already threw that out there. If one can be a racist against (libs) then I am one.", 
        "reply": "", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:14:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label.", 
        "intTime": 20090529, 
        "postID": 23, 
        "quote": "", 
        "reply": "I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:16:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Doesn't matter what they have in common. The only true law is Muslim Law.", 
        "intTime": 20090529, 
        "postID": 24, 
        "quote": "", 
        "reply": "Doesn't matter what they have in common. The only true law is Muslim Law.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:17:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. It is 'Hey she is a Latina you oppose her and you're a racist!' But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you", 
        "intTime": 20090529, 
        "postID": 25, 
        "quote": "Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label.", 
        "reply": " Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. It is 'Hey she is a Latina you oppose her and you're a racist!' But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:22:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b] Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical?", 
        "intTime": 20090529, 
        "postID": 26, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b]", 
        "reply": " Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:34:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b] Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical? It is on the left, they are just fargin amazed that she made it out of her borough in 1 piece", 
        "intTime": 20090529, 
        "postID": 27, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b] Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical? It is on the left, they are just fargin amazed that she made it out of her borough in 1 piece", 
        "reply": "", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:37:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!!", 
        "intTime": 20090529, 
        "postID": 28, 
        "quote": "", 
        "reply": "See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!!", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 10:45:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Let me add that they all have SMUGNESS in common.", 
        "intTime": 20090529, 
        "postID": 29, 
        "quote": "", 
        "reply": "Let me add that they all have SMUGNESS in common.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 10:51:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas.", 
        "intTime": 20090529, 
        "postID": 30, 
        "quote": "", 
        "reply": "It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 10:59:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "intTime": 20090529, 
        "postID": 31, 
        "quote": "Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!!", 
        "reply": " So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:07:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 1WW: It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas. Smoke and Mirrors.....", 
        "intTime": 20090529, 
        "postID": 32, 
        "quote": "Originally posted by 1WW: It is believed that Sotomayor is pro-life -- thereby having even more in common with Alito, Scalia, and Thomas.", 
        "reply": " Smoke and Mirrors.....", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:07:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Transcript from Alito's confirmation hearing: quote: COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you. The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table.", 
        "intTime": 20090529, 
        "postID": 33, 
        "quote": "COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you.", 
        "reply": "Transcript from Alito's confirmation hearing:  The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:20:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? It won't matter whether they drag her through the mud or not. With the Dems in control of Both Houses, Judge Sotomayer will be confirmed as the next Supreme Court Justice. This time, the numbers are there. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090529, 
        "postID": 34, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "reply": " It won't matter whether they drag her through the mud or not. With the Dems in control of Both Houses, Judge Sotomayer will be confirmed as the next Supreme Court Justice. This time, the numbers are there. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:23:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. \"The World's Finest\"", 
        "intTime": 20090529, 
        "postID": 35, 
        "quote": "Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind.", 
        "reply": "One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito...  \"The World's Finest\"", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:27:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback?????", 
        "intTime": 20090529, 
        "postID": 36, 
        "quote": "Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind.", 
        "reply": " And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback?????", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:34:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Transcript from Alito's confirmation hearing: quote: COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you. The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table. Personally I dont care about diversity if you're qualified thats it, I dont care if you're pink purple and polka dotted. They're to interpret the constitution not to bring their childhood or ancesters into the equation. Btw, she would not be the first Hispanic, that was done already with Cardozo nominated by a Repb. Strange but it seems that repubs nominate more non-white guys than dems. Since diversity was brought up. The difference is Alito said: \"And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result.\" this was in reference to his background. And my smoke and mirrors comment was directed at the pro-choice thang. We will wait and see what stuff is hurled and when a very minor thing is said by a repub it will be blown out of proportion and all has already been forgotten about Thomas, Alito, Brown, Estrada and so on that the left threw that was real vitriol.", 
        "intTime": 20090529, 
        "postID": 37, 
        "quote": "Originally posted by 1WW: Transcript from Alito's confirmation hearing: quote: COBURN: You know, I think at times during these hearings you have been unfairly criticized or characterized as that you don't care about the less fortunate, you don't care about the little guy, you don't care about the weak or the innocent. Can you comment just about Sam Alito, and what he cares about, and let us see a little bit of your heart and what's important to you in life? ALITO: Senator, I tried to in my opening statement, I tried to provide a little picture of who I am as a human being and how my background and my experiences have shaped me and brought me to this point. ALITO: I don't come from an affluent background or a privileged background. My parents were both quite poor when they were growing up. And I know about their experiences and I didn't experience those things. I don't take credit for anything that they did or anything that they overcame. But I think that children learn a lot from their parents and they learn from what the parents say. But I think they learn a lot more from what the parents do and from what they take from the stories of their parents lives. And that's why I went into that in my opening statement. Because when a case comes before me involving, let's say, someone who is an immigrant -- and we get an awful lot of immigration cases and naturalization cases -- I can't help but think of my own ancestors, because it wasn't that long ago when they were in that position. And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result. But when I look at those cases, I have to say to myself, and I do say to myself, \"You know, this could be your grandfather, this could be your grandmother. They were not citizens at one time, and they were people who came to this country.\" When I have cases involving children, I can't help but think of my own children and think about my children being treated in the way that children may be treated in the case that's before me. And that goes down the line. When I get a case about discrimination, I have to think about people in my own family who suffered discrimination because of their ethnic background or because of religion or because of gender. And I do take that into account. When I have a case involving someone who's been subjected to discrimination because of disability, I have to think of people who I've known and admire very greatly who've had disabilities, and I've watched them struggle to overcome the barriers that society puts up often just because it doesn't think of what it's doing -- the barriers that it puts up to them. So those are some of the experiences that have shaped me as a person. COBURN: Thank you. The \"smoke and mirrors\" is your misleading cartoon, Gunny. Yes, Sotomayor made a smug observation -- yet it is valid, indeed. As Alito brings HIS \"immigrant experience\" to the table, so does Sotomayor bring her similar experience. Are we not all shaped by our personal history and life's journey, and thus use that to make judgments in our own daily lives? (And judgments upon each other here? - ) What, I ask, is the validity of ONE set of IDENTICAL experiences amongst the esteemed panel making up our Supreme Court Justices? Personally, I would SEEK as diverse and experienced a set of judges to set down the laws of our nation. And I believe that Sotomayor can only be an asset to her prospective colleagues by bringing a new angle and fresh perspective to the table. Personally I dont care about diversity if you're qualified thats it, I dont care if you're pink purple and polka dotted. They're to interpret the constitution not to bring their childhood or ancesters into the equation. Btw, she would not be the first Hispanic, that was done already with Cardozo nominated by a Repb. Strange but it seems that repubs nominate more non-white guys than dems. Since diversity was brought up.", 
        "reply": " The difference is Alito said: \"And so it's my job to apply the law. It's not my job to change the law or to bend the law to achieve any result.\" this was in reference to his background. And my smoke and mirrors comment was directed at the pro-choice thang. We will wait and see what stuff is hurled and when a very minor thing is said by a repub it will be blown out of proportion and all has already been forgotten about Thomas, Alito, Brown, Estrada and so on that the left threw that was real vitriol.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:34:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE)", 
        "intTime": 20090529, 
        "postID": 38, 
        "quote": "Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang.", 
        "reply": " Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE)", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:39:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press.", 
        "intTime": 20090529, 
        "postID": 39, 
        "quote": "Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE)", 
        "reply": " I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:46:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback????? Obama must hate Italian Americans right.", 
        "intTime": 20090529, 
        "postID": 40, 
        "quote": "Originally posted by sw614: quote: Originally posted by Kegler300: One thing that is almost certain, the dems won't drag Sotomayor through the mud like they did Alito... quote: Throughout the hearings, we have seen Democrat Senators from Ted Kennedy to Chuck Schumer to Patrick Leahy question Judge Alito's integrity, suggest that he would undermine this nation's commitment to one-man, one-vote, allow machine guns on the street, and make it easier for employers to discriminate. These baseless attacks are a disgrace to the process. The most egregious attack is the allegation that Alito is a closet racist because of his membership in the Concerned Alumni of Princeton. The conservative group opposed affirmative-action and lower admission standards in 1984. The organization's newsletter carried articles by contributors, none of whom was Alito. Yet, the Kennedy-Schumer-Durbin-Biden-Leahy cabal is trying to tattoo objectionable articles from that newsletter on Alito's chest. So fierce were the accusations that Mrs. Alito left the hearings with tears streaming down her face after she endured watching the man she knew and loved smeared by a bunch of less-than-honorable men. Republican Senator Lindsey Graham apologized for the conduct of the senators, which brought tears to Mrs. Alito's eyes. According to the GOP, this is all part of a coordinated assault led by far-left attack groups like MoveOn.org and People for the American Way. The facts are these: Judge Alito is the most experienced nominee to the Court in three generations. He has received the American Bar Association's highest rating, and is supported by a solid 2-to-1 majority of Americans. Alito hails from New Jersey where I now live. Having served in law enforcement in New Jersey after leaving the job in New York City, I've spoken to many within the Jersey police and criminal justice community who only had good things to say about Judge Alito. These are Democrats and Republicans who know Alito professionally and admire the man. If these Democrat senators wish to find a racist they need only look at their comrade Senator Robert Byrd, a former member and Kleagel for the Ku Klux Klan and a man who opposed the Civil Rights Acts of 1964 and 1965. Senator Ted Kennedy demanded a subpoena for documents regarding CAP regardless of the fact his own comrades at the New York Times examined those documents and found no links to Alito. Yet, Kennedy insists on obtaining such documents. Fair enough. Would Senator Kennedy release all the documents regarding Chappaquiddick? All records concerning how a young woman lay dying in a submerged car for 10 hours while Kennedy fled the scene and called his flunkies to help him out of a jam. I'd love to see the documents that mysteriously disappeared when hordes of Kennedy supporters swarmed all over Chappaquiddick. Will Senator Patrick Leahy release all documents regarding the investigation into the 1987 case wherein he leaked top-secret information to a news reporter? Or how about releasing sealed documents regarding subsequent investigations into his leaking classified information? Will Senator Joe Biden release all documents relating to his several excursions into plagiarism? Will Senator Diane Feinstein release all financial documents regarding her husbands dealings with the Red Chinese? Senator Durbin, you question Judge Alito's position on abortion. Would you be willing to release written speeches in which you called abortion an abomination? Will you explain what you meant when you once said there should be a constitutional amendment to ban all abortions? Meanwhile the likes of the New York Times, Washington Post and CNN are distorting facts by telling Americans that the Democrats are being too easy on Judge Alito. I imagine if one of the Democrat senators actually physically attacked him, then the Times and Post would consider it tough questioning. One only hope that when a Democrat president sends a Supreme Court nominee to the US Senate for confirmation, the Republicans -- instead of rolling over and voting for him or her as they did with Associate Justice Ruth Bader Ginsburg, an ACLU hack -- will treat the nominee in kind. And another senator that opposed Justice Alito, the junior senator from Illinois, Senator Obama. Wonder if anyone is considering some payback?????", 
        "reply": " Obama must hate Italian Americans right.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:46:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue?", 
        "intTime": 20090529, 
        "postID": 41, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press.", 
        "reply": " Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:53:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "intTime": 20090529, 
        "postID": 42, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others?", 
        "reply": " The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 11:57:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. I hope the republicans use the democrat template from the Alito and Thomas hearings. \"The World's Finest\"", 
        "intTime": 20090529, 
        "postID": 43, 
        "quote": "Originally posted by WepsFP: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "reply": " I hope the republicans use the democrat template from the Alito and Thomas hearings. \"The World's Finest\"", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:00:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Didnt say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner, she was born here right so she has an accent? So if it was a german last name would Obama break out the gutteral pronunciations? Pet peeve of mine. I'll wager the unbringing part was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "intTime": 20090529, 
        "postID": 44, 
        "quote": "Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue?", 
        "reply": " Didnt say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner, she was born here right so she has an accent? So if it was a german last name would Obama break out the gutteral pronunciations? Pet peeve of mine. I'll wager the unbringing part was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:01:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!!", 
        "intTime": 20090529, 
        "postID": 45, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "reply": " Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!!", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:03:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. Yeh, repubs cant act like Dems and drag minorities thru the mud like dems can. Thank for reminding us of the dbl standard. But Obama knew that hence this nomination.", 
        "intTime": 20090529, 
        "postID": 46, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by WepsFP: See for yourself. <<<<http://www.msnbc.msn.com/id/26315908/#30991079>>>> I guess Scalia, Thomas and Alito are unfit to serve based on the criteria the nutbags have set forth. Desparation is an ugly thing conservatives!!!!! So, can the repubs drag sotomayor thru the mud like dems did Thomas and Alito and Estrada and others? The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs.", 
        "reply": " Yeh, repubs cant act like Dems and drag minorities thru the mud like dems can. Thank for reminding us of the dbl standard. But Obama knew that hence this nomination.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:05:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!! You have the market on the tinfoil. quote: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. That alone proves much of what I said. your bubble awaits...buh bye", 
        "intTime": 20090529, 
        "postID": 47, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: And my smoke and mirrors comment was directed at the pro-choice thang. Gunny -- respectfully request that you explain the correlation between your cartoon and Sotomayor's pro-life stance. NOTE: Pro-LIFE (not pro-CHOICE) I meant pro choice, freudian slip. I believe she most likely isnt pro-life hence the smoke and mirrors. The WH when asked wasnt even sure. I think its a ploy to throw off so called rabid conservatives. The cartoon is just making fun of her comments on her rich background. And that for some reason that is some kind of qualifier as stated in Obamas introduction of her to the press. Thanks for your prompt response. Indeed, it is only BELIEVED that she is \"pro-LIFE.\" That there is question on both sides is, IMO, a prime reason to confirm her! Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. Another conspiracy. Take off the tinfoil hat Gunny. Let the top of your head breath for awhile. CRIPES!!!!!!", 
        "reply": " You have the market on the tinfoil. quote: The repubs will do whatever they want and suffer the consequences. Drag this lady through the mud at your own peril Repubs. That alone proves much of what I said. your bubble awaits...buh bye", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:06:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ?", 
        "intTime": 20090529, 
        "postID": 48, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO.", 
        "reply": " More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:08:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? I hate dog and pony shows and patronizing speeches by politicos and I oppose her because she is a lib. And I dont take kindly toward anyone associated with hate groups, la raza or any other. I feel that in the last yr the bar keeps getting lower. Especially with the tax cheats, questionable backgrounds and lobbyist this Prez keeps running up the flagpole, she is just another one of the bunch. 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ? Yes, I am seen as a racist because I opposed obama. And it was predicted prior to the election and with this nom it has already been set in motion. The WH already threw that out there. If one can be a racist against (libs) then I am one.", 
        "intTime": 20090529, 
        "postID": 49, 
        "quote": "Originally posted by 1WW: quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Next question: Why is her \"rich background\" considered a \"smoke and mirror\" issue? Did say it was that was in ref to the former. But it would have been refreshing to here about her experience and not have to listen to Obama roll his R's in a patronizing manner. I'll wager it was done to bring pity on her in some sectors for her poor background. And to also show that she worked for it, kind defeats Obamas whole America bad schtick though. How did she accomplish all this while America oppresses people like her? It was also done to tell anyone that opposed her must be a racist and hater. IMO. More questions, Gunny! 1. So who/what are criticizing -- Sotomayor's background, or Obama's presentation of it? I hate dog and pony shows and patronizing speeches by politicos and I oppose her because she is a lib. And I dont take kindly toward anyone associated with hate groups, la raza or any other. I feel that in the last yr the bar keeps getting lower. Especially with the tax cheats, questionable backgrounds and lobbyist this Prez keeps running up the flagpole, she is just another one of the bunch. 2. And since clearly you oppose her nomination, do you think others see you as a \"racist\" and \"hater\" ? Yes, I am seen as a racist because I opposed obama. And it was predicted prior to the election and with this nom it has already been set in motion. The WH already threw that out there. If one can be a racist against (libs) then I am one.", 
        "reply": "", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:14:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label.", 
        "intTime": 20090529, 
        "postID": 50, 
        "quote": "", 
        "reply": "I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:16:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Doesn't matter what they have in common. The only true law is Muslim Law.", 
        "intTime": 20090529, 
        "postID": 51, 
        "quote": "", 
        "reply": "Doesn't matter what they have in common. The only true law is Muslim Law.", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:17:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. It is 'Hey she is a Latina you oppose her and you're a racist!' But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you", 
        "intTime": 20090529, 
        "postID": 52, 
        "quote": "Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label.", 
        "reply": " Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. It is 'Hey she is a Latina you oppose her and you're a racist!' But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:22:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b] Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical?", 
        "intTime": 20090529, 
        "postID": 53, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b]", 
        "reply": " Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical?", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:34:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b] Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical? It is on the left, they are just fargin amazed that she made it out of her borough in 1 piece", 
        "intTime": 20090529, 
        "postID": 54, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: I'll keep saying: I'm Hispanic myself and i'm insulted that people keep bringing up this nomination as if though it means a damn thing to me.. She is an activist judge, Period. Its a shame how liberals, in their rage and hatred of Repubicans, have done everything possible to faciliate reverse-racism. This is a real phenomenon occuring in our society today. White people flat out cannot say what they want to say, no matter how reasonable, because some idiot will be there to call them a racist, a xenophobe or some other ridiculous label. Yes, and I find it patronizing to hispanics that the media and dems keep saying 'but if repubs oppose this nom they will jeopardize the hispanic vote'. You know what none of the hispanics I know are thinned skinned little weinies like the dems portray them as. 'repubs oppose her at their own peril' proof right there. That statement isnt 'She has such a stellar judicial record they shouldnt oppose her'. [B]It is 'Hey she is a Latina you oppose her and you're a racist!' Ain't that the truth But dont worry IRS the dems speak for you, and most of them are white that are doing the talking for you[/b] Agreed... The thing that really annoys me is the notion that, \"Hey, look, she made it, so can you\" Wow...My self-esteem is that bad is it? My faith in this nation is that cynical? It is on the left, they are just fargin amazed that she made it out of her borough in 1 piece", 
        "reply": "", 
        "threadID": "409192893_8170095422001", 
        "time": "2009-05-29 12:37:00", 
        "title": "What do Sotomayor, Alito, Scalia and Thomas have in Common??.", 
        "userID": "GunnyRet03"
    }
]