[
    {
        "content": "+++http://www.msnbc.msn.com/id/29689284 In his inaugural address, President Obama proclaimed \"an end to the petty grievances and false promises, the recriminations and worn-out dogmas that for far too long have strangled our politics.\" It hasn't taken long for the recriminations to return — or for the Obama administration to begin talking about the unwelcome \"inheritance\" of its predecessor. Over the past month, Obama has reminded the public at every turn that he is facing problems \"inherited\" from the Bush administration, using increasingly bracing language to describe the challenges his administration is up against. The \"deepening economic crisis\" that the president described six days after taking office became \"a big mess\" in remarks this month to graduating police cadets in Columbus, Ohio. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- \"By any measure,\" he said during a March 4 event calling for government-contracting reform, \"my administration has inherited a fiscal disaster.\" Obama's more frequent and acid reminders that former president George W. Bush left behind a trillion-dollar budget deficit, a 14-month recession and a broken financial system have come at the same time Republicans have ramped up criticism that the current president's policies are compounding the nation's economic problems. Obama had initially been content to leave partisan defense strategy to his proxies, but as the fiscal picture has continued to darken, he has appeared more willing to risk his image as a politician who is above petty partisanship to personally remind the public of Bush's legacy. His approval ratings remain strong — above 60 percent, according to the most recent Gallup poll — but have dropped from their highs almost entirely because of falling support among Republicans since he took office. Special risks Upon entering the White House in 2001, Bush pinned the lackluster economy on his predecessor, using the \"Clinton recession\" to successfully argue in favor of tax cuts that won some Democratic support. But for Obama, who built his candidacy on a promise to rise above Washington's divisive partisan traditions — winning over many independent voters and moderate Republicans in the process — blaming his predecessor holds special risks. He will need support beyond his Democratic base as he begins lobbying for his $3.6 trillion budget, which proposes sweeping changes in health care, the energy sector and the public education system. The president did not receive a single House Republican vote for his stimulus plan, prompting some in his administration to view his bipartisan outreach efforts as having little hope of success. And Republicans have seemed only more emboldened in their rhetoric. Sen. John McCain (Ariz.), for example, recently called the borrowing needed to fund the president's economic recovery plans \"generational theft.\" \"What the administration is involved in now is the politics of attribution,\" said Lawrence R. Jacobs, a political scientist at the University of Minnesota. \"Each week that goes by with falling job numbers and Republican criticism of the administration's flaws means falling approval ratings. What's the antidote? That the guilty party is George Bush.\" \"The trick,\" Jacobs said, \"is how do you shift blame to George Bush and retain any credibility on the idea that you are looking past partisan warfare? This looks like a doubling down on a very partisan approach.\" Click for related content 'Excess of fear' must be stopped, Summers says Rahm Emanuel, Obama's chief of staff, denied that the president has changed his tone toward the previous administration. He said Obama is \"not trying to place blame, but he is trying to say clearly: Here's what we've got and here's our way out of it. He's offered a positive alternative to their criticism.\" \"The truth is that 98 percent of his speeches are about the future, and 2 percent are about inheritance,\" Emanuel said. \"Whereas I think for Republicans it's 2 percent about the future, and 98 percent hope that the people have amnesia.\" Until recently, the job of reminding the country of the Bush-era legacy had been left mostly to senior administration officials, and it sometimes ranged beyond economic matters. Referring to the military prison at Guantanamo Bay, Cuba, Vice President Biden said soon after the inauguration that \"we're trying to figure out exactly what we've inherited here.\" In early February, Secretary of State Hillary Rodham Clinton said that \"after I accepted the position, I began looking at the broad array of problems that we were going to inherit,\" citing the Middle East, Pakistan and Afghanistan in particular. 'Sharpened language' But most of the Bush-era blame has focused on the economy and the dismal state of the government's finances. Bush's spokesman, Rob Saliterman, declined to comment for this article. Obama has strengthened his rhetoric gradually. Thomas E. Mann, a senior fellow at the liberal-leaning Brookings Institution, said the administration's \"sharpened language is a response to the Republican argument against Obama based on huge deficits and big spending.\" Six days after taking office, Obama kicked off an event on jobs, energy reform and climate change with \"a few words about the deepening economic crisis that we've inherited.\" He lamented announced job cuts at such economic mainstays as Microsoft, Intel, Home Depot and Caterpillar, among others. Just over a week later, Obama, arguing for his stimulus plan, said that \"we've inherited a terrible mess,\" and a few days after that, in the economically depressed city of Elkhart, Ind., he told the audience, \"We've inherited an economic crisis as deep and dire as any since the Great Depression.\" During a prime-time news conference later that day, he used \"inherited\" twice in the same sentence to describe the deficit and \"the most profound economic emergency since the Great Depression.\" This month, Obama has described inheriting \"a fiscal disaster\" and \"a real mess,\" as administration officials emphasized that the effects of the stimulus package have yet to be seen in paychecks and job-creating public-works projects. Vanishing jobs \"There's a fascinating behind-the-scenes trend taking place for someone who remains a very popular president,\" said Ari Fleischer, a former Bush press secretary, describing the decline in Obama's approval ratings and an increase in disapproval numbers. \"His response to that trend is to turn up the blame on George Bush and everything that came before him. And he was the one who talked about getting past partisanship.\" The economy continues to shed jobs — 651,000 in February alone — and the Dow Jones index is roughly 12 percent lower than when the market opened on the day of Obama's inauguration. Perhaps most damaging has been the uncertainty surrounding Obama's strategy to rescue the banking sector, a plan that has been criticized for lacking detail. Host Chris Wallace asked on \"Fox News Sunday\" this month, \"Can this now fairly be called the Obama bear market?\" House Republican Whip Eric Cantor (Va.) said, \"I want to take the president at his word that he wants to work on these problems plaguing American families,\" adding that \"people are looking for leadership.\" \"It is the Obama economy and the Obama stock market,\" Cantor said. \"This is about today, and he's assumed his post.\" Researcher Alice Crites contributed to this report.", 
        "intTime": 20090314, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.msnbc.msn.com/id/29689284 In his inaugural address, President Obama proclaimed \"an end to the petty grievances and false promises, the recriminations and worn-out dogmas that for far too long have strangled our politics.\" It hasn't taken long for the recriminations to return — or for the Obama administration to begin talking about the unwelcome \"inheritance\" of its predecessor. Over the past month, Obama has reminded the public at every turn that he is facing problems \"inherited\" from the Bush administration, using increasingly bracing language to describe the challenges his administration is up against. The \"deepening economic crisis\" that the president described six days after taking office became \"a big mess\" in remarks this month to graduating police cadets in Columbus, Ohio. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- \"By any measure,\" he said during a March 4 event calling for government-contracting reform, \"my administration has inherited a fiscal disaster.\" Obama's more frequent and acid reminders that former president George W. Bush left behind a trillion-dollar budget deficit, a 14-month recession and a broken financial system have come at the same time Republicans have ramped up criticism that the current president's policies are compounding the nation's economic problems. Obama had initially been content to leave partisan defense strategy to his proxies, but as the fiscal picture has continued to darken, he has appeared more willing to risk his image as a politician who is above petty partisanship to personally remind the public of Bush's legacy. His approval ratings remain strong — above 60 percent, according to the most recent Gallup poll — but have dropped from their highs almost entirely because of falling support among Republicans since he took office. Special risks Upon entering the White House in 2001, Bush pinned the lackluster economy on his predecessor, using the \"Clinton recession\" to successfully argue in favor of tax cuts that won some Democratic support. But for Obama, who built his candidacy on a promise to rise above Washington's divisive partisan traditions — winning over many independent voters and moderate Republicans in the process — blaming his predecessor holds special risks. He will need support beyond his Democratic base as he begins lobbying for his $3.6 trillion budget, which proposes sweeping changes in health care, the energy sector and the public education system. The president did not receive a single House Republican vote for his stimulus plan, prompting some in his administration to view his bipartisan outreach efforts as having little hope of success. And Republicans have seemed only more emboldened in their rhetoric. Sen. John McCain (Ariz.), for example, recently called the borrowing needed to fund the president's economic recovery plans \"generational theft.\" \"What the administration is involved in now is the politics of attribution,\" said Lawrence R. Jacobs, a political scientist at the University of Minnesota. \"Each week that goes by with falling job numbers and Republican criticism of the administration's flaws means falling approval ratings. What's the antidote? That the guilty party is George Bush.\" \"The trick,\" Jacobs said, \"is how do you shift blame to George Bush and retain any credibility on the idea that you are looking past partisan warfare? This looks like a doubling down on a very partisan approach.\" Click for related content 'Excess of fear' must be stopped, Summers says Rahm Emanuel, Obama's chief of staff, denied that the president has changed his tone toward the previous administration. He said Obama is \"not trying to place blame, but he is trying to say clearly: Here's what we've got and here's our way out of it. He's offered a positive alternative to their criticism.\" \"The truth is that 98 percent of his speeches are about the future, and 2 percent are about inheritance,\" Emanuel said. \"Whereas I think for Republicans it's 2 percent about the future, and 98 percent hope that the people have amnesia.\" Until recently, the job of reminding the country of the Bush-era legacy had been left mostly to senior administration officials, and it sometimes ranged beyond economic matters. Referring to the military prison at Guantanamo Bay, Cuba, Vice President Biden said soon after the inauguration that \"we're trying to figure out exactly what we've inherited here.\" In early February, Secretary of State Hillary Rodham Clinton said that \"after I accepted the position, I began looking at the broad array of problems that we were going to inherit,\" citing the Middle East, Pakistan and Afghanistan in particular. 'Sharpened language' But most of the Bush-era blame has focused on the economy and the dismal state of the government's finances. Bush's spokesman, Rob Saliterman, declined to comment for this article. Obama has strengthened his rhetoric gradually. Thomas E. Mann, a senior fellow at the liberal-leaning Brookings Institution, said the administration's \"sharpened language is a response to the Republican argument against Obama based on huge deficits and big spending.\" Six days after taking office, Obama kicked off an event on jobs, energy reform and climate change with \"a few words about the deepening economic crisis that we've inherited.\" He lamented announced job cuts at such economic mainstays as Microsoft, Intel, Home Depot and Caterpillar, among others. Just over a week later, Obama, arguing for his stimulus plan, said that \"we've inherited a terrible mess,\" and a few days after that, in the economically depressed city of Elkhart, Ind., he told the audience, \"We've inherited an economic crisis as deep and dire as any since the Great Depression.\" During a prime-time news conference later that day, he used \"inherited\" twice in the same sentence to describe the deficit and \"the most profound economic emergency since the Great Depression.\" This month, Obama has described inheriting \"a fiscal disaster\" and \"a real mess,\" as administration officials emphasized that the effects of the stimulus package have yet to be seen in paychecks and job-creating public-works projects. Vanishing jobs \"There's a fascinating behind-the-scenes trend taking place for someone who remains a very popular president,\" said Ari Fleischer, a former Bush press secretary, describing the decline in Obama's approval ratings and an increase in disapproval numbers. \"His response to that trend is to turn up the blame on George Bush and everything that came before him. And he was the one who talked about getting past partisanship.\" The economy continues to shed jobs — 651,000 in February alone — and the Dow Jones index is roughly 12 percent lower than when the market opened on the day of Obama's inauguration. Perhaps most damaging has been the uncertainty surrounding Obama's strategy to rescue the banking sector, a plan that has been criticized for lacking detail. Host Chris Wallace asked on \"Fox News Sunday\" this month, \"Can this now fairly be called the Obama bear market?\" House Republican Whip Eric Cantor (Va.) said, \"I want to take the president at his word that he wants to work on these problems plaguing American families,\" adding that \"people are looking for leadership.\" \"It is the Obama economy and the Obama stock market,\" Cantor said. \"This is about today, and he's assumed his post.\" Researcher Alice Crites contributed to this report.", 
        "threadID": "409192893_3120038712001", 
        "time": "2009-03-14 04:06:00", 
        "title": "Obama: Back to the future I", 
        "userID": "threerings"
    }, 
    {
        "content": "Dear Republican Supporter, After last week's successful GOP-led efforts to temporarily stall its passage, the United States Senate has passed the bloated omnibus spending bill with its massive pricetag of $410 billion. The passage of the omnibus marks the first time in history that discretionary spending surpasses the ONE TRILLION MARK, a full $21 billion over budget. The legislation includes 122 duplicate programs that are also funded by the $787 billion \"stimulus\" package recently signed into law. Furthermore, despite last year's campaign rhetoric pledging to eliminate wasteful earmarks, the omnibus contains more than 8,500 pet projects, totaling more than $7.7 billion. Even the liberal editorial board of The Washington Post criticized Obama's lack of leadership on earmarks, saying he has \"abdicated the bully pulpit when it comes to this measure.\" Republicans agree with candidate Barack Obama that Washington, D.C. needs to end its out-of-control spending habits. All across the country, hurting families are tightening their belts, and Congress should only be spending money wisely and prudently. Last year, candidate Barack Obama - running on a platform of fiscal responsibility - promised to go even further than his opponent John McCain, claiming that he would take a \"scalpel\" to the federal budget. Republicans stand ready and willing to work with President Obama to help fulfill this campaign pledge of eliminating wasteful government spending and bringing transparency and accountability to the process. Unfortunately for the American taxpayer, President Obama's recent actions suggest that he has acquiesced to Nancy Pelosi and Harry Reid's spending agenda. With just slightly more than 40 Republican votes in the Senate, it will be a fight these next two years to curb the reckless tax-and-spending championed by Harry Reid and his liberal allies. You can be sure that Senate Republicans will do everything in their power to ensure that the government spends your tax dollars responsibly. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee", 
        "intTime": 20090314, 
        "postID": 2, 
        "quote": "", 
        "reply": "Dear Republican Supporter, After last week's successful GOP-led efforts to temporarily stall its passage, the United States Senate has passed the bloated omnibus spending bill with its massive pricetag of $410 billion. The passage of the omnibus marks the first time in history that discretionary spending surpasses the ONE TRILLION MARK, a full $21 billion over budget. The legislation includes 122 duplicate programs that are also funded by the $787 billion \"stimulus\" package recently signed into law. Furthermore, despite last year's campaign rhetoric pledging to eliminate wasteful earmarks, the omnibus contains more than 8,500 pet projects, totaling more than $7.7 billion. Even the liberal editorial board of The Washington Post criticized Obama's lack of leadership on earmarks, saying he has \"abdicated the bully pulpit when it comes to this measure.\" Republicans agree with candidate Barack Obama that Washington, D.C. needs to end its out-of-control spending habits. All across the country, hurting families are tightening their belts, and Congress should only be spending money wisely and prudently. Last year, candidate Barack Obama - running on a platform of fiscal responsibility - promised to go even further than his opponent John McCain, claiming that he would take a \"scalpel\" to the federal budget. Republicans stand ready and willing to work with President Obama to help fulfill this campaign pledge of eliminating wasteful government spending and bringing transparency and accountability to the process. Unfortunately for the American taxpayer, President Obama's recent actions suggest that he has acquiesced to Nancy Pelosi and Harry Reid's spending agenda. With just slightly more than 40 Republican votes in the Senate, it will be a fight these next two years to curb the reckless tax-and-spending championed by Harry Reid and his liberal allies. You can be sure that Senate Republicans will do everything in their power to ensure that the government spends your tax dollars responsibly. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee", 
        "threadID": "409192893_3120038712001", 
        "time": "2009-03-14 05:18:00", 
        "title": "Obama: Back to the future I", 
        "userID": "bill_kananen"
    }
]