[
    {
        "content": "quote: Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it? Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "intTime": 20090301, 
        "postID": 19, 
        "quote": "Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it?", 
        "reply": " Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:26:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. Best post yet.", 
        "intTime": 20090301, 
        "postID": 20, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " Best post yet.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:50:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "intTime": 20090301, 
        "postID": 21, 
        "quote": "", 
        "reply": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:53:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts. Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "intTime": 20090301, 
        "postID": 22, 
        "quote": "Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts.", 
        "reply": " Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:31:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "intTime": 20090301, 
        "postID": 23, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:36:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "intTime": 20090301, 
        "postID": 24, 
        "quote": "", 
        "reply": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:17:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor. Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "intTime": 20090301, 
        "postID": 25, 
        "quote": "Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "reply": " Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:35:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "intTime": 20090301, 
        "postID": 26, 
        "quote": "", 
        "reply": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:04:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "intTime": 20090301, 
        "postID": 27, 
        "quote": "", 
        "reply": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:23:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards. That's it in a nut shell.", 
        "intTime": 20090301, 
        "postID": 28, 
        "quote": "Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "reply": " That's it in a nut shell.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:24:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work.. Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "intTime": 20090301, 
        "postID": 29, 
        "quote": "Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "reply": " Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:20:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "intTime": 20090301, 
        "postID": 30, 
        "quote": "", 
        "reply": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:27:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it? Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "intTime": 20090301, 
        "postID": 49, 
        "quote": "Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it?", 
        "reply": " Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:26:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. Best post yet.", 
        "intTime": 20090301, 
        "postID": 50, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " Best post yet.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:50:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "intTime": 20090301, 
        "postID": 51, 
        "quote": "", 
        "reply": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:53:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts. Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "intTime": 20090301, 
        "postID": 52, 
        "quote": "Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts.", 
        "reply": " Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:31:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "intTime": 20090301, 
        "postID": 53, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:36:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "intTime": 20090301, 
        "postID": 54, 
        "quote": "", 
        "reply": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:17:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor. Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "intTime": 20090301, 
        "postID": 55, 
        "quote": "Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "reply": " Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:35:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "intTime": 20090301, 
        "postID": 56, 
        "quote": "", 
        "reply": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:04:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "intTime": 20090301, 
        "postID": 57, 
        "quote": "", 
        "reply": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:23:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards. That's it in a nut shell.", 
        "intTime": 20090301, 
        "postID": 58, 
        "quote": "Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "reply": " That's it in a nut shell.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:24:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work.. Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "intTime": 20090301, 
        "postID": 59, 
        "quote": "Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "reply": " Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:20:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "intTime": 20090301, 
        "postID": 60, 
        "quote": "", 
        "reply": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:27:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it? Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "intTime": 20090301, 
        "postID": 79, 
        "quote": "Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it?", 
        "reply": " Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:26:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. Best post yet.", 
        "intTime": 20090301, 
        "postID": 80, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " Best post yet.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:50:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "intTime": 20090301, 
        "postID": 81, 
        "quote": "", 
        "reply": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:53:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts. Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "intTime": 20090301, 
        "postID": 82, 
        "quote": "Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts.", 
        "reply": " Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:31:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "intTime": 20090301, 
        "postID": 83, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:36:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "intTime": 20090301, 
        "postID": 84, 
        "quote": "", 
        "reply": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:17:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor. Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "intTime": 20090301, 
        "postID": 85, 
        "quote": "Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "reply": " Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:35:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "intTime": 20090301, 
        "postID": 86, 
        "quote": "", 
        "reply": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:04:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "intTime": 20090301, 
        "postID": 87, 
        "quote": "", 
        "reply": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:23:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards. That's it in a nut shell.", 
        "intTime": 20090301, 
        "postID": 88, 
        "quote": "Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "reply": " That's it in a nut shell.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:24:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work.. Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "intTime": 20090301, 
        "postID": 89, 
        "quote": "Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "reply": " Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:20:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "intTime": 20090301, 
        "postID": 90, 
        "quote": "", 
        "reply": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:27:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it? Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "intTime": 20090301, 
        "postID": 109, 
        "quote": "Originally posted by Woody_in_La: Kit, I am sure that you were expected to reach a certain level of understanding before passing, as I was. Now days, the expectations have been lowered to the (excuse the wording) dumbest person in the class. I think that is what he is saying, and I agree with it. Not too very long ago I saw in the news where quite a few Alcorn nursing students failed the exit exams. Not a good thing to think about when one depends on a nurse, is it?", 
        "reply": " Well...the answer to whether or not we had to reach a certain level before being promoted is yes and no. Theoretically, that was true, but they also practiced social advancement back then too. A kid who did not pass his work might very well be passed on to the next grade just to keep him with his peers. For instance, there were 15 of us in my senior class, but only 14 graduated because one didn't have enough credits to even be a sophomore. And, there was a reverse case in a class before me. One kid had the credits to graduate, but failed the 12th grade 3 times. Why? Because Oklahoma rules said that a high school kid could play basketball up to the age of 21, so they just kept failing this kid to keep him on the team as long as possible. It was OK with him. It was never as cut and dried as everyone thinks and it was even true in college. I graduated in 1974 with several classmates who couldn't write a coherent sentence, yet they passed and got the same sheepskin as me.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:26:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. Best post yet.", 
        "intTime": 20090301, 
        "postID": 110, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " Best post yet.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:50:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "intTime": 20090301, 
        "postID": 111, 
        "quote": "", 
        "reply": "I would love to see everyone go to college and get a four year degree. Then they could all join the military and become Officers. Just think, no enlisted men or women in our military! Wow talk about Leadership and the best Military in the world.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 04:53:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts. Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "intTime": 20090301, 
        "postID": 112, 
        "quote": "Originally posted by RRR52: First, not everybody is cut out for it by intellect, demeanor, or desire. Second, when you hand things to people, they flat out seldom value it the same as the person who earns the means by which it is given. Provide earned scholarships and guaranteed loans to ensure gifted minds can earn a degree if economic challenges, but no handouts.", 
        "reply": " Let us have a national test only the top 10% go on to college regardless of family position or wealth. Ever one would get a part time job and work there way through college. No off shore degree would be recognized unless the student past our national test before going to college. This would prevent the power elite from circumventing the law and sticking us with another dullard from Harvard as a president of the US. This would insure that non college material jerks would not go to college. Only academic ability would determine one getting into college. We could close 85% of universities in the US and save a lot of money. Unless that is you would like to restrict education from the working class so that they would always remain working class. It is kind of uppity of them to think that they should be given an opportunity to work their way up in America. Why don’t we just put a blue collar tattoo in their forehead at berth. That way they could be put into separate but equal schools. The power elite would not have to worry about intermarriage between the good people and the low class people that worked with their hands. What a bunch of smug jerks you all are Thank God we have a president that has the best interest of all Americans not just the few smug azz holes.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:31:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "intTime": 20090301, 
        "postID": 113, 
        "quote": "Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it.", 
        "reply": " \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 05:36:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "6837602"
    }, 
    {
        "content": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "intTime": 20090301, 
        "postID": 114, 
        "quote": "", 
        "reply": "This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:17:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor. Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "intTime": 20090301, 
        "postID": 115, 
        "quote": "Originally posted by 6837602: quote: Originally posted by JustanotherGI: Wanna send everyone to college, ok. Then what? Let's not get education and intelligence confused here. People running the country and Wall street are highly educated people with Masters and PHD's. Were Trillions in debt, and no end in sight. Don't ooh and awe me with your diploma, ooh and awe me with what you've done with it. \"Let's not get education and intelligence confused here.\" I agree look at how we got the 8 years of shame, disgrace, and extreme dishonor.", 
        "reply": " Which 8 years are we talking about? Clinton's, Bush's, Grant's, how far ya wanna go?", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 06:35:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "intTime": 20090301, 
        "postID": 116, 
        "quote": "", 
        "reply": "There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:04:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "intTime": 20090301, 
        "postID": 117, 
        "quote": "", 
        "reply": "There were many of us that could not afford to go to college from my class. If the money was there I would not have had to work on it for 8 years to a degree. Just think of all the smart, semi-smart kids without the funds to go on. Germany will send you to college if you have the grades, why don't wee? It seperates the rich and poor. I didn't have a 4.0 in highschool, not even close. That was due to no parent to keep me on track. When I got out of hightschool I found out you needed a degree do just about anything that earned good money. Most poor kids don't see the dream of college when they know the money is not there. I only got a 124 for the SQT \" I think that's the name of the score\" in the army, but that set me up for good schools in ther and to goe to college after.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:23:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards. That's it in a nut shell.", 
        "intTime": 20090301, 
        "postID": 118, 
        "quote": "Originally posted by Thud357L: There is a huge difference between making higher education possible for those who are deserving and capable but haven't the means, and handing out a rubber stamp degree. Creating access does not necessarily mean lowering standards.", 
        "reply": " That's it in a nut shell.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 07:24:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work.. Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "intTime": 20090301, 
        "postID": 119, 
        "quote": "Originally posted by floersh: This is the sort of thing I would be totally on board with if done right. So what is right? Well right does not effect standards ina nyway other than making them tougher. Give them all a chance but don't nurse them along. If they can't hack it then they get expelled. As for curriculum. I think that to qualify for public funds the course of study must be something that isn't being met through normal means. Aka lets not waste tax payer dollars on liberal arts. Math, science, engineering! Can't make it that hard but those seeking those fields should absolutely be given all the assisatance they need so long as they can keep up with the work..", 
        "reply": " Now that I can go along with! I also agree with Thud on this issue. If someone has the grades and can pass the entrance exam without having to dumb it down, by all means help them go to collage. But, like you, I would not want it waisted in general studies or some liberal arts. This country is lacking in the basics and that should be the focus.", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:20:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "intTime": 20090301, 
        "postID": 120, 
        "quote": "", 
        "reply": "good then he will have no problems paying my student loan.... now its up to 70k... 35k of that is interest...", 
        "threadID": "409192893_6080005612001", 
        "time": "2009-03-01 08:27:00", 
        "title": "Obama's call for college for all --- is it possible?", 
        "userID": "outlaws93"
    }
]