[
    {
        "content": "\"http://gawker.com/5244126/obama-orders-burger-with-elitist-european-condiment?skyline=true&s=i\" has the video too.", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://gawker.com/5244126/obama-orders-burger-with-elitist-european-condiment?skyline=true&s=i\" has the video too.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 00:18:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "intTime": 20090508, 
        "postID": 2, 
        "quote": "", 
        "reply": "Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:16:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: A real American won't put anything fancier on their burger than French's mustard! I agree; just put some on my sandwich for today's lunch. \"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 3, 
        "quote": "Originally posted by scooter_mech: A real American won't put anything fancier on their burger than French's mustard!", 
        "reply": " I agree; just put some on my sandwich for today's lunch. \"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:47:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: A real American won't put anything fancier on their burger than French's mustard! Wink I see what you did there....", 
        "intTime": 20090508, 
        "postID": 4, 
        "quote": "A real American won't put anything fancier on their burger than French's mustard! Wink", 
        "reply": " I see what you did there....", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:49:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard! The count is now 44,300. Considering the popularity of the topic your mustard reference is far too subtle.", 
        "intTime": 20090508, 
        "postID": 5, 
        "quote": "Originally posted by scooter_mech: Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "reply": " The count is now 44,300. Considering the popularity of the topic your mustard reference is far too subtle.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 03:22:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It seems a bit of a cognitive disconnect, considering the number of times Hannity has accused Obama of class warfare. Is this not reference to class?", 
        "intTime": 20090508, 
        "postID": 6, 
        "quote": "", 
        "reply": "It seems a bit of a cognitive disconnect, considering the number of times Hannity has accused Obama of class warfare. Is this not reference to class?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 05:07:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 7, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 05:37:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "And the point of the post is?", 
        "intTime": 20090508, 
        "postID": 8, 
        "quote": "", 
        "reply": "And the point of the post is?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: And the point of the post is? To imply that Obama have extensive experience in gobbling sausage. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090508, 
        "postID": 9, 
        "quote": "Originally posted by Migbuster: And the point of the post is?", 
        "reply": " To imply that Obama have extensive experience in gobbling sausage. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:17:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 10, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:19:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Hey, hey, hey, watch the teeth!", 
        "intTime": 20090508, 
        "postID": 11, 
        "quote": "Originally posted by Kegler300:", 
        "reply": " Hey, hey, hey, watch the teeth!", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 13:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "67NOV"
    }, 
    {
        "content": "Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "", 
        "reply": "Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 13:07:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "intTime": 20090508, 
        "postID": 13, 
        "quote": "Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "reply": " Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 15:27:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "Really, the point is that if you're going to do something to make you look like you're not an elitist, don't screw it up by showing that you are, in fact, an elitist. He went to a greasy burger joint to show that he was like everyone else, and he wound up showing that he's not like everyone else. Like Sen. Kerry wanting swiss cheese on his philly cheese-steak sandwich when he ran for President. Why pretend to be something you're not...wait a minute...oh yeah...who are we talking about...", 
        "intTime": 20090512, 
        "postID": 14, 
        "quote": "", 
        "reply": "Really, the point is that if you're going to do something to make you look like you're not an elitist, don't screw it up by showing that you are, in fact, an elitist. He went to a greasy burger joint to show that he was like everyone else, and he wound up showing that he's not like everyone else. Like Sen. Kerry wanting swiss cheese on his philly cheese-steak sandwich when he ran for President. Why pretend to be something you're not...wait a minute...oh yeah...who are we talking about...", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 08:51:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 15, 
        "quote": "Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "reply": " LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 09:33:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "L0A1"
    }, 
    {
        "content": "So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "intTime": 20090512, 
        "postID": 16, 
        "quote": "", 
        "reply": "So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 12:21:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "DocTrowerFMF"
    }, 
    {
        "content": "quote: Originally posted by DocTrowerFMF: So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day? I think it has more to do with ordering \"spicy brown mustard\" at a place that obviously wouldn't have it on hand. It was a greasy spoon burger joint where regular people order burgers the way regular people do.", 
        "intTime": 20090512, 
        "postID": 17, 
        "quote": "Originally posted by DocTrowerFMF: So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "reply": " I think it has more to do with ordering \"spicy brown mustard\" at a place that obviously wouldn't have it on hand. It was a greasy spoon burger joint where regular people order burgers the way regular people do.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 13:56:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. I find Rush entertaining. I just don't take him seriously. I'm not sure his audience is MEANT to take him seriously. Hannity is annoying as hell. Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "intTime": 20090512, 
        "postID": 18, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him.", 
        "reply": " I find Rush entertaining. I just don't take him seriously. I'm not sure his audience is MEANT to take him seriously. Hannity is annoying as hell. Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 14:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion. I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "intTime": 20090512, 
        "postID": 19, 
        "quote": "Originally posted by Bleah: Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "reply": " I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 15:21:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: SeaWitch1220: I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs... Yes he use to be cool. Too cool.", 
        "intTime": 20090512, 
        "postID": 20, 
        "quote": "SeaWitch1220: I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "reply": " Yes he use to be cool. Too cool.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 16:13:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "Remember, you are what you eat.", 
        "intTime": 20090512, 
        "postID": 21, 
        "quote": "", 
        "reply": "Remember, you are what you eat.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 16:35:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: The right is certainly more attractive, though I'm smitten with the newer, scrawnier, *****ier version. Irony dictates that she choose the gun. If she looked like that, I would convert faster than Zell Miller.", 
        "intTime": 20090512, 
        "postID": 22, 
        "quote": "Originally posted by Yooper_tj: The right is certainly more attractive, though I'm smitten with the newer, scrawnier, *****ier version. Irony dictates that she choose the gun.", 
        "reply": " If she looked like that, I would convert faster than Zell Miller.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 18:10:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "intTime": 20090512, 
        "postID": 23, 
        "quote": "Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans.", 
        "reply": " Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 18:59:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Pardon me, do you have any Grey Poupon? Give me a break, what a phony. Yep...I keep forgetting the code. Don't order cheddar or dijon because you like the taste; order cheddar and dijon because you're better than regular folk and real Americans...whatever was I thinking? Depends on where you're ordering. Sure, those upscale Chicago eateries, they probably have dijon. Small burger place by the side of the road....probably not. It's not just what he ordered, it's also how he ordered. It was obvious that he hasn't ordered many burgers for himself, but he has had a pizza chef flown in from St. Louis to DC and frequently eats $100.00 wagyu steaks at his Wednesday night cocktail parties...I'm sorry, I should back off and let him finish his waffle. By the way, how often do you eat wagyu steaks in these down economic times? These are the worst economic conditions since the Great Depression, ya know.", 
        "intTime": 20090512, 
        "postID": 24, 
        "quote": "Originally posted by Yooper_tj: quote: Pardon me, do you have any Grey Poupon? Give me a break, what a phony. Yep...I keep forgetting the code. Don't order cheddar or dijon because you like the taste; order cheddar and dijon because you're better than regular folk and real Americans...whatever was I thinking?", 
        "reply": " Depends on where you're ordering. Sure, those upscale Chicago eateries, they probably have dijon. Small burger place by the side of the road....probably not. It's not just what he ordered, it's also how he ordered. It was obvious that he hasn't ordered many burgers for himself, but he has had a pizza chef flown in from St. Louis to DC and frequently eats $100.00 wagyu steaks at his Wednesday night cocktail parties...I'm sorry, I should back off and let him finish his waffle. By the way, how often do you eat wagyu steaks in these down economic times? These are the worst economic conditions since the Great Depression, ya know.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 20:08:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony. I know you're not referering to the President of the United States as a \"phony\" But then again your screen name says it all.", 
        "intTime": 20090512, 
        "postID": 25, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "reply": " I know you're not referering to the President of the United States as a \"phony\" But then again your screen name says it all.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 23:23:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "samh32"
    }, 
    {
        "content": "\"http://gawker.com/5244126/obama-orders-burger-with-elitist-european-condiment?skyline=true&s=i\" has the video too.", 
        "intTime": 20090508, 
        "postID": 26, 
        "quote": "", 
        "reply": "\"http://gawker.com/5244126/obama-orders-burger-with-elitist-european-condiment?skyline=true&s=i\" has the video too.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 00:18:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "intTime": 20090508, 
        "postID": 27, 
        "quote": "", 
        "reply": "Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:16:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: A real American won't put anything fancier on their burger than French's mustard! I agree; just put some on my sandwich for today's lunch. \"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 28, 
        "quote": "Originally posted by scooter_mech: A real American won't put anything fancier on their burger than French's mustard!", 
        "reply": " I agree; just put some on my sandwich for today's lunch. \"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:47:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: A real American won't put anything fancier on their burger than French's mustard! Wink I see what you did there....", 
        "intTime": 20090508, 
        "postID": 29, 
        "quote": "A real American won't put anything fancier on their burger than French's mustard! Wink", 
        "reply": " I see what you did there....", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:49:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard! The count is now 44,300. Considering the popularity of the topic your mustard reference is far too subtle.", 
        "intTime": 20090508, 
        "postID": 30, 
        "quote": "Originally posted by scooter_mech: Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "reply": " The count is now 44,300. Considering the popularity of the topic your mustard reference is far too subtle.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 03:22:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It seems a bit of a cognitive disconnect, considering the number of times Hannity has accused Obama of class warfare. Is this not reference to class?", 
        "intTime": 20090508, 
        "postID": 31, 
        "quote": "", 
        "reply": "It seems a bit of a cognitive disconnect, considering the number of times Hannity has accused Obama of class warfare. Is this not reference to class?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 05:07:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 32, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 05:37:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "And the point of the post is?", 
        "intTime": 20090508, 
        "postID": 33, 
        "quote": "", 
        "reply": "And the point of the post is?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: And the point of the post is? To imply that Obama have extensive experience in gobbling sausage. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090508, 
        "postID": 34, 
        "quote": "Originally posted by Migbuster: And the point of the post is?", 
        "reply": " To imply that Obama have extensive experience in gobbling sausage. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:17:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 35, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:19:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Hey, hey, hey, watch the teeth!", 
        "intTime": 20090508, 
        "postID": 36, 
        "quote": "Originally posted by Kegler300:", 
        "reply": " Hey, hey, hey, watch the teeth!", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 13:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "67NOV"
    }, 
    {
        "content": "Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "intTime": 20090508, 
        "postID": 37, 
        "quote": "", 
        "reply": "Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 13:07:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "intTime": 20090508, 
        "postID": 38, 
        "quote": "Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "reply": " Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 15:27:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "Really, the point is that if you're going to do something to make you look like you're not an elitist, don't screw it up by showing that you are, in fact, an elitist. He went to a greasy burger joint to show that he was like everyone else, and he wound up showing that he's not like everyone else. Like Sen. Kerry wanting swiss cheese on his philly cheese-steak sandwich when he ran for President. Why pretend to be something you're not...wait a minute...oh yeah...who are we talking about...", 
        "intTime": 20090512, 
        "postID": 39, 
        "quote": "", 
        "reply": "Really, the point is that if you're going to do something to make you look like you're not an elitist, don't screw it up by showing that you are, in fact, an elitist. He went to a greasy burger joint to show that he was like everyone else, and he wound up showing that he's not like everyone else. Like Sen. Kerry wanting swiss cheese on his philly cheese-steak sandwich when he ran for President. Why pretend to be something you're not...wait a minute...oh yeah...who are we talking about...", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 08:51:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 40, 
        "quote": "Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "reply": " LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 09:33:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "L0A1"
    }, 
    {
        "content": "So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "intTime": 20090512, 
        "postID": 41, 
        "quote": "", 
        "reply": "So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 12:21:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "DocTrowerFMF"
    }, 
    {
        "content": "quote: Originally posted by DocTrowerFMF: So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day? I think it has more to do with ordering \"spicy brown mustard\" at a place that obviously wouldn't have it on hand. It was a greasy spoon burger joint where regular people order burgers the way regular people do.", 
        "intTime": 20090512, 
        "postID": 42, 
        "quote": "Originally posted by DocTrowerFMF: So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "reply": " I think it has more to do with ordering \"spicy brown mustard\" at a place that obviously wouldn't have it on hand. It was a greasy spoon burger joint where regular people order burgers the way regular people do.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 13:56:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. I find Rush entertaining. I just don't take him seriously. I'm not sure his audience is MEANT to take him seriously. Hannity is annoying as hell. Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "intTime": 20090512, 
        "postID": 43, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him.", 
        "reply": " I find Rush entertaining. I just don't take him seriously. I'm not sure his audience is MEANT to take him seriously. Hannity is annoying as hell. Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 14:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion. I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "intTime": 20090512, 
        "postID": 44, 
        "quote": "Originally posted by Bleah: Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "reply": " I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 15:21:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: SeaWitch1220: I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs... Yes he use to be cool. Too cool.", 
        "intTime": 20090512, 
        "postID": 45, 
        "quote": "SeaWitch1220: I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "reply": " Yes he use to be cool. Too cool.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 16:13:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "Remember, you are what you eat.", 
        "intTime": 20090512, 
        "postID": 46, 
        "quote": "", 
        "reply": "Remember, you are what you eat.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 16:35:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: The right is certainly more attractive, though I'm smitten with the newer, scrawnier, *****ier version. Irony dictates that she choose the gun. If she looked like that, I would convert faster than Zell Miller.", 
        "intTime": 20090512, 
        "postID": 47, 
        "quote": "Originally posted by Yooper_tj: The right is certainly more attractive, though I'm smitten with the newer, scrawnier, *****ier version. Irony dictates that she choose the gun.", 
        "reply": " If she looked like that, I would convert faster than Zell Miller.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 18:10:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "intTime": 20090512, 
        "postID": 48, 
        "quote": "Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans.", 
        "reply": " Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 18:59:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Pardon me, do you have any Grey Poupon? Give me a break, what a phony. Yep...I keep forgetting the code. Don't order cheddar or dijon because you like the taste; order cheddar and dijon because you're better than regular folk and real Americans...whatever was I thinking? Depends on where you're ordering. Sure, those upscale Chicago eateries, they probably have dijon. Small burger place by the side of the road....probably not. It's not just what he ordered, it's also how he ordered. It was obvious that he hasn't ordered many burgers for himself, but he has had a pizza chef flown in from St. Louis to DC and frequently eats $100.00 wagyu steaks at his Wednesday night cocktail parties...I'm sorry, I should back off and let him finish his waffle. By the way, how often do you eat wagyu steaks in these down economic times? These are the worst economic conditions since the Great Depression, ya know.", 
        "intTime": 20090512, 
        "postID": 49, 
        "quote": "Originally posted by Yooper_tj: quote: Pardon me, do you have any Grey Poupon? Give me a break, what a phony. Yep...I keep forgetting the code. Don't order cheddar or dijon because you like the taste; order cheddar and dijon because you're better than regular folk and real Americans...whatever was I thinking?", 
        "reply": " Depends on where you're ordering. Sure, those upscale Chicago eateries, they probably have dijon. Small burger place by the side of the road....probably not. It's not just what he ordered, it's also how he ordered. It was obvious that he hasn't ordered many burgers for himself, but he has had a pizza chef flown in from St. Louis to DC and frequently eats $100.00 wagyu steaks at his Wednesday night cocktail parties...I'm sorry, I should back off and let him finish his waffle. By the way, how often do you eat wagyu steaks in these down economic times? These are the worst economic conditions since the Great Depression, ya know.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 20:08:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony. I know you're not referering to the President of the United States as a \"phony\" But then again your screen name says it all.", 
        "intTime": 20090512, 
        "postID": 50, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "reply": " I know you're not referering to the President of the United States as a \"phony\" But then again your screen name says it all.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 23:23:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "samh32"
    }, 
    {
        "content": "\"http://gawker.com/5244126/obama-orders-burger-with-elitist-european-condiment?skyline=true&s=i\" has the video too.", 
        "intTime": 20090508, 
        "postID": 51, 
        "quote": "", 
        "reply": "\"http://gawker.com/5244126/obama-orders-burger-with-elitist-european-condiment?skyline=true&s=i\" has the video too.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 00:18:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "intTime": 20090508, 
        "postID": 52, 
        "quote": "", 
        "reply": "Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:16:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: A real American won't put anything fancier on their burger than French's mustard! I agree; just put some on my sandwich for today's lunch. \"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 53, 
        "quote": "Originally posted by scooter_mech: A real American won't put anything fancier on their burger than French's mustard!", 
        "reply": " I agree; just put some on my sandwich for today's lunch. \"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:47:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: A real American won't put anything fancier on their burger than French's mustard! Wink I see what you did there....", 
        "intTime": 20090508, 
        "postID": 54, 
        "quote": "A real American won't put anything fancier on their burger than French's mustard! Wink", 
        "reply": " I see what you did there....", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 02:49:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard! The count is now 44,300. Considering the popularity of the topic your mustard reference is far too subtle.", 
        "intTime": 20090508, 
        "postID": 55, 
        "quote": "Originally posted by scooter_mech: Just goes to show how popular Fox News is. I googled the three words hannity mustard and obama and got 28,100 hits. If no one watched, no one would care. A real American won't put anything fancier on their burger than French's mustard!", 
        "reply": " The count is now 44,300. Considering the popularity of the topic your mustard reference is far too subtle.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 03:22:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It seems a bit of a cognitive disconnect, considering the number of times Hannity has accused Obama of class warfare. Is this not reference to class?", 
        "intTime": 20090508, 
        "postID": 56, 
        "quote": "", 
        "reply": "It seems a bit of a cognitive disconnect, considering the number of times Hannity has accused Obama of class warfare. Is this not reference to class?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 05:07:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 57, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 05:37:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "And the point of the post is?", 
        "intTime": 20090508, 
        "postID": 58, 
        "quote": "", 
        "reply": "And the point of the post is?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: And the point of the post is? To imply that Obama have extensive experience in gobbling sausage. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090508, 
        "postID": 59, 
        "quote": "Originally posted by Migbuster: And the point of the post is?", 
        "reply": " To imply that Obama have extensive experience in gobbling sausage. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:17:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090508, 
        "postID": 60, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 06:19:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Hey, hey, hey, watch the teeth!", 
        "intTime": 20090508, 
        "postID": 61, 
        "quote": "Originally posted by Kegler300:", 
        "reply": " Hey, hey, hey, watch the teeth!", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 13:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "67NOV"
    }, 
    {
        "content": "Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "intTime": 20090508, 
        "postID": 62, 
        "quote": "", 
        "reply": "Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 13:07:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "intTime": 20090508, 
        "postID": 63, 
        "quote": "Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?)", 
        "reply": " Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-08 15:27:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "Really, the point is that if you're going to do something to make you look like you're not an elitist, don't screw it up by showing that you are, in fact, an elitist. He went to a greasy burger joint to show that he was like everyone else, and he wound up showing that he's not like everyone else. Like Sen. Kerry wanting swiss cheese on his philly cheese-steak sandwich when he ran for President. Why pretend to be something you're not...wait a minute...oh yeah...who are we talking about...", 
        "intTime": 20090512, 
        "postID": 64, 
        "quote": "", 
        "reply": "Really, the point is that if you're going to do something to make you look like you're not an elitist, don't screw it up by showing that you are, in fact, an elitist. He went to a greasy burger joint to show that he was like everyone else, and he wound up showing that he's not like everyone else. Like Sen. Kerry wanting swiss cheese on his philly cheese-steak sandwich when he ran for President. Why pretend to be something you're not...wait a minute...oh yeah...who are we talking about...", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 08:51:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 65, 
        "quote": "Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment.", 
        "reply": " LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 09:33:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "L0A1"
    }, 
    {
        "content": "So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "intTime": 20090512, 
        "postID": 66, 
        "quote": "", 
        "reply": "So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 12:21:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "DocTrowerFMF"
    }, 
    {
        "content": "quote: Originally posted by DocTrowerFMF: So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day? I think it has more to do with ordering \"spicy brown mustard\" at a place that obviously wouldn't have it on hand. It was a greasy spoon burger joint where regular people order burgers the way regular people do.", 
        "intTime": 20090512, 
        "postID": 67, 
        "quote": "Originally posted by DocTrowerFMF: So using spicy brown mustard as opposed to plain yellow or ketchup (which, IMO is for sissies, like mayo ) shows you're an elitist? I prefer spicy brown myself as well. I think it's all about taste You know, one of our senses... Which proves there's little to none of that going around to think he's being elitist. Christ. Slow day?", 
        "reply": " I think it has more to do with ordering \"spicy brown mustard\" at a place that obviously wouldn't have it on hand. It was a greasy spoon burger joint where regular people order burgers the way regular people do.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 13:56:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him. I find Rush entertaining. I just don't take him seriously. I'm not sure his audience is MEANT to take him seriously. Hannity is annoying as hell. Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "intTime": 20090512, 
        "postID": 68, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Bleah: quote: Originally posted by 1WW: Hannity must be desperate. (Think he's got Grey Poupon in HIS fridge?) Hannity is always desperate. It's his schtick. That and asking the same red herring, false dichotomy or \"no true scotsman\" question repeatedly over top of his \"guest\" while yelling at them for not answering (as if they could while his big yap is open.) When Rush says that either Pelosi or Clinton is shrill it's a fair observation, and true. When Hannity does the same it always makes me laugh, because he is much more shrill than either of them, and manages to be that way with the voice of a grown man - quite an accomplishment. LOL Bleah, I agree, I listen to talk radio but change it whenever Hannity is on, just his voice and repeating the same things over and over again get on my nerves. As far as Rush goes, I have always thought him a blow hard that is drenched in hypocrisy, so I NEVER listen to him. The only reason I know anything about him is because folks here LOVE to start threads about him.", 
        "reply": " I find Rush entertaining. I just don't take him seriously. I'm not sure his audience is MEANT to take him seriously. Hannity is annoying as hell. Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 14:02:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion. I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "intTime": 20090512, 
        "postID": 69, 
        "quote": "Originally posted by Bleah: Boortz, on the other hand, has entertaining talk radio mastered as an art form. There's a lot of stuff I disagree with him about, but the man makes a damned good radio host. Too bad \"that network\" won't carry him because he's not anti-abortion.", 
        "reply": " I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 15:21:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: SeaWitch1220: I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs... Yes he use to be cool. Too cool.", 
        "intTime": 20090512, 
        "postID": 70, 
        "quote": "SeaWitch1220: I gotta agree. I like Boortz and I used to like Rush. Something has happened to him over the years. Maybe it is the drugs...", 
        "reply": " Yes he use to be cool. Too cool.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 16:13:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "Remember, you are what you eat.", 
        "intTime": 20090512, 
        "postID": 71, 
        "quote": "", 
        "reply": "Remember, you are what you eat.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 16:35:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: The right is certainly more attractive, though I'm smitten with the newer, scrawnier, *****ier version. Irony dictates that she choose the gun. If she looked like that, I would convert faster than Zell Miller.", 
        "intTime": 20090512, 
        "postID": 72, 
        "quote": "Originally posted by Yooper_tj: The right is certainly more attractive, though I'm smitten with the newer, scrawnier, *****ier version. Irony dictates that she choose the gun.", 
        "reply": " If she looked like that, I would convert faster than Zell Miller.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 18:10:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "intTime": 20090512, 
        "postID": 73, 
        "quote": "Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans.", 
        "reply": " Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 18:59:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Pardon me, do you have any Grey Poupon? Give me a break, what a phony. Yep...I keep forgetting the code. Don't order cheddar or dijon because you like the taste; order cheddar and dijon because you're better than regular folk and real Americans...whatever was I thinking? Depends on where you're ordering. Sure, those upscale Chicago eateries, they probably have dijon. Small burger place by the side of the road....probably not. It's not just what he ordered, it's also how he ordered. It was obvious that he hasn't ordered many burgers for himself, but he has had a pizza chef flown in from St. Louis to DC and frequently eats $100.00 wagyu steaks at his Wednesday night cocktail parties...I'm sorry, I should back off and let him finish his waffle. By the way, how often do you eat wagyu steaks in these down economic times? These are the worst economic conditions since the Great Depression, ya know.", 
        "intTime": 20090512, 
        "postID": 74, 
        "quote": "Originally posted by Yooper_tj: quote: Pardon me, do you have any Grey Poupon? Give me a break, what a phony. Yep...I keep forgetting the code. Don't order cheddar or dijon because you like the taste; order cheddar and dijon because you're better than regular folk and real Americans...whatever was I thinking?", 
        "reply": " Depends on where you're ordering. Sure, those upscale Chicago eateries, they probably have dijon. Small burger place by the side of the road....probably not. It's not just what he ordered, it's also how he ordered. It was obvious that he hasn't ordered many burgers for himself, but he has had a pizza chef flown in from St. Louis to DC and frequently eats $100.00 wagyu steaks at his Wednesday night cocktail parties...I'm sorry, I should back off and let him finish his waffle. By the way, how often do you eat wagyu steaks in these down economic times? These are the worst economic conditions since the Great Depression, ya know.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 20:08:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony. I know you're not referering to the President of the United States as a \"phony\" But then again your screen name says it all.", 
        "intTime": 20090512, 
        "postID": 75, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Yooper_tj: quote: It was a greasy spoon burger joint where regular people order burgers the way regular people do. Sounds like a you betcha-ism for Real Americans. Actually, it looks like a publicity stunt that backfired. I think it was pretty funny that the entire press corps was there, and he flubbed it up. \"I want a regular cheddar cheese burger, no ketchup, with mustard....do you have any dijon?\" Pardon me, do you have any Grey Poupon? Give me a break, what a phony.", 
        "reply": " I know you're not referering to the President of the United States as a \"phony\" But then again your screen name says it all.", 
        "threadID": "409192893_8790087222001", 
        "time": "2009-05-12 23:23:00", 
        "title": "Sean Hannity: Obama wanted spicy mustard and not ketchup so he's an elitist.", 
        "userID": "samh32"
    }
]