[
    {
        "content": "Now an \"Emergency Works\" Program Before the Spring Offensive Vice President Joe Biden conceded for the first time in Brussels last Wednesday that the Taliban insurgency was driven by economics, and that \"70 percent [of the Taliban] are there for the jobs, because they are getting paid.\" Jobs for Afghans thanks all who have been forwarding these articles on this key aspect of the insurgency to Obama and your congressmen, as we have requested. I am ready to believe that Obama-Biden are in good faith looking for a way out of this impending disaster. The question is, now what? The question is not whether the surge is good or bad. The question is, what should our troops be doing in Afghanistan, whatever the number? If 70% of fighters are there to collect the Taliban's $8 per day \"living wage,\" which is indeed a living wage in Afghanistan, because an utterly failed reconstruction under George Bush leaves them looking at a 40% unemployment rate, then how to give these young men an alternative so they can, as General Karl Eikenberry told Congress, \"find wages to support their families?\" quote: \"Much of the enemy force is drawn from the ranks of unemployed men looking for wages to support their families.\" - Gen. Karl Eikenberry, Former Commander of US Forces in Afghanistan The problem with US policy in Afghanistan is that it has been a man trying to walk on one leg. The military side must complement the economic side, and the latter has been completely missing. As Jobs for Afghans has always held, the tricky part is getting money and jobs into the hands of the vast numbers of unemployed young Afghans, like 19 year-old Jaan Aghwa, who told the Institute of War and Peace Reporting: quote: \"I couldn’t find a job anywhere, so I had to join the Taleban. They give me money for my family expenditures. If I left the Taleban, what else could I do? I am not educated, so it’s hard to find a job, although a lot of educated people are also unemployed nowadays.\" The Jobs for Afghans solution? Focus, immediately, before the Spring offensive begins, on that part of the country's infrastructure which can be labor intensive, requires few foreign engineers present beyond initial surveying teams, and which is a vital part of the most basic services which government provides: trenchline which will hold pipes for water, electricity, and sewage systems, all almost completely missing from Afghanistan. It could employ hundreds of thousands of Afghans immediately. This is a place where 1 out of 4 infants die before the age of five from preventable disease, most of it born by dirty water. The fact that 8 years after the fall of the Taliban, the vast majority of the population lives in various stages of starvation and misery is why the Taliban is having a resurgence in the first place. The intrepid journalist Ann Jones reports: quote: \"Most Afghans, after the dispersal of the Taliban, were full of hope and ready to work. The tangible benefits of reconstruction -- jobs, housing, schools, health-care facilities -- could have rallied them to support the government and turn that illusory \"democracy\" into something like the real thing. But reconstruction didn't happen.\" For anyone really interested in understanding what is happening in Afghanistan, Jones' full report is a must-read. \"\"http://www.tomdispatch.com/post/116512/ann_jones_on_the_road_to_taliban_land An ABC News poll shows that in 2005, nearly 70% of Afghans approved viewed the US presence as positive. An astonishing 91% preferred the Karzai government to the Taliban. By 2007, only 42% of Afghans viewed the US positively. Preference for the Karzai government over the Taliban dropped to 84%. Now, two years later, those numbers can only have worsened. Those who ascribe the insurgency to unavoidable nationalism and Islamic ideology are wrong. Afghan hearts and minds were ours to lose, and lose them we have been doing. Employing up to a million men, digging thousands of miles of trenchline for basic infrastructure would require only local supervision of work crews, once surveyors mark the routes. Russian generals who made all the mistakes of trying to fight Afghans have suggested what US forces should really be doing: protecting work crews, rather than chasing Taliban all over the countryside and causing civilian casualties. McClatchy reports: quote: \"I believed as sincerely as American officers do now that we were fighting there to help make our country safer,\" said Grachev, who later became defense minister and sent in Russian units to quell Chechnya during the 1990s, a campaign that also ended in disaster. \"After the war, as a politician, I could see this war had been pointless.\" That said, Grachev offered some advice: Post soldiers to guard road projects and irrigation systems, and send in an army of engineers, doctors, mining experts and construction advisers. Pouring billions of dollars into infrastructure would be a lot more productive than firefights in far-flung villages, he said. \"You have to understand that in the economic sphere, Afghanistan is now at a stage lower than the Middle Ages,\" Grachev said. Another advantage of giving hundreds of thousands of men picks and shovels to dig ditches, right away: unlike schools and bridges, you can't really \"blow up\" a ditch. It will be there when the remainder of the project is ready, and meanwhile you are putting people to work right now. Otherwise it doesn't look good. NATO is finding that Afghans are fierce fighters, who will keep coming back despite almost unimaginably fearsome weapons, such as C-130 gunships. Where a typical firefight in Baghdad might last 30 minutes, a firefight in Afghanistan will go on for days, as fighters move in from across a district to engage. Iraqi tactics were largely hit-and-run. Afghan fighters show themselves, take casualties, and continiue closing in. $10 per day is what it would take young Afghans to say no to the Taliban. Congress should pass this Emergency Works program just to give them something to do besides shooting at our troops. Biden is starting to understand, so Obama must be too. Save a soldier's life, and keep the revival of common sense in America going. Jobs for Afghans \"\"http://jobsforafghans.org Please forward this article to President Obama: \"\"http://www.whitehouse.gov/contact/ and to your congress member: \"\"http://www.visi.com/juan/congress/ Youtube video, unemployment in Afghanistan: \"\"http://www.youtube.com/watch?v=_26BRimE_Bg", 
        "intTime": 20090313, 
        "postID": 1, 
        "quote": "\"Much of the enemy force is drawn from the ranks of unemployed men looking for wages to support their families.\" - Gen. Karl Eikenberry, Former Commander of US Forces in Afghanistan", 
        "reply": "Now an \"Emergency Works\" Program Before the Spring Offensive Vice President Joe Biden conceded for the first time in Brussels last Wednesday that the Taliban insurgency was driven by economics, and that \"70 percent [of the Taliban] are there for the jobs, because they are getting paid.\" Jobs for Afghans thanks all who have been forwarding these articles on this key aspect of the insurgency to Obama and your congressmen, as we have requested. I am ready to believe that Obama-Biden are in good faith looking for a way out of this impending disaster. The question is, now what? The question is not whether the surge is good or bad. The question is, what should our troops be doing in Afghanistan, whatever the number? If 70% of fighters are there to collect the Taliban's $8 per day \"living wage,\" which is indeed a living wage in Afghanistan, because an utterly failed reconstruction under George Bush leaves them looking at a 40% unemployment rate, then how to give these young men an alternative so they can, as General Karl Eikenberry told Congress, \"find wages to support their families?\"  The problem with US policy in Afghanistan is that it has been a man trying to walk on one leg. The military side must complement the economic side, and the latter has been completely missing. As Jobs for Afghans has always held, the tricky part is getting money and jobs into the hands of the vast numbers of unemployed young Afghans, like 19 year-old Jaan Aghwa, who told the Institute of War and Peace Reporting: quote: \"I couldn’t find a job anywhere, so I had to join the Taleban. They give me money for my family expenditures. If I left the Taleban, what else could I do? I am not educated, so it’s hard to find a job, although a lot of educated people are also unemployed nowadays.\" The Jobs for Afghans solution? Focus, immediately, before the Spring offensive begins, on that part of the country's infrastructure which can be labor intensive, requires few foreign engineers present beyond initial surveying teams, and which is a vital part of the most basic services which government provides: trenchline which will hold pipes for water, electricity, and sewage systems, all almost completely missing from Afghanistan. It could employ hundreds of thousands of Afghans immediately. This is a place where 1 out of 4 infants die before the age of five from preventable disease, most of it born by dirty water. The fact that 8 years after the fall of the Taliban, the vast majority of the population lives in various stages of starvation and misery is why the Taliban is having a resurgence in the first place. The intrepid journalist Ann Jones reports: quote: \"Most Afghans, after the dispersal of the Taliban, were full of hope and ready to work. The tangible benefits of reconstruction -- jobs, housing, schools, health-care facilities -- could have rallied them to support the government and turn that illusory \"democracy\" into something like the real thing. But reconstruction didn't happen.\" For anyone really interested in understanding what is happening in Afghanistan, Jones' full report is a must-read. \"\"http://www.tomdispatch.com/post/116512/ann_jones_on_the_road_to_taliban_land An ABC News poll shows that in 2005, nearly 70% of Afghans approved viewed the US presence as positive. An astonishing 91% preferred the Karzai government to the Taliban. By 2007, only 42% of Afghans viewed the US positively. Preference for the Karzai government over the Taliban dropped to 84%. Now, two years later, those numbers can only have worsened. Those who ascribe the insurgency to unavoidable nationalism and Islamic ideology are wrong. Afghan hearts and minds were ours to lose, and lose them we have been doing. Employing up to a million men, digging thousands of miles of trenchline for basic infrastructure would require only local supervision of work crews, once surveyors mark the routes. Russian generals who made all the mistakes of trying to fight Afghans have suggested what US forces should really be doing: protecting work crews, rather than chasing Taliban all over the countryside and causing civilian casualties. McClatchy reports: quote: \"I believed as sincerely as American officers do now that we were fighting there to help make our country safer,\" said Grachev, who later became defense minister and sent in Russian units to quell Chechnya during the 1990s, a campaign that also ended in disaster. \"After the war, as a politician, I could see this war had been pointless.\" That said, Grachev offered some advice: Post soldiers to guard road projects and irrigation systems, and send in an army of engineers, doctors, mining experts and construction advisers. Pouring billions of dollars into infrastructure would be a lot more productive than firefights in far-flung villages, he said. \"You have to understand that in the economic sphere, Afghanistan is now at a stage lower than the Middle Ages,\" Grachev said. Another advantage of giving hundreds of thousands of men picks and shovels to dig ditches, right away: unlike schools and bridges, you can't really \"blow up\" a ditch. It will be there when the remainder of the project is ready, and meanwhile you are putting people to work right now. Otherwise it doesn't look good. NATO is finding that Afghans are fierce fighters, who will keep coming back despite almost unimaginably fearsome weapons, such as C-130 gunships. Where a typical firefight in Baghdad might last 30 minutes, a firefight in Afghanistan will go on for days, as fighters move in from across a district to engage. Iraqi tactics were largely hit-and-run. Afghan fighters show themselves, take casualties, and continiue closing in. $10 per day is what it would take young Afghans to say no to the Taliban. Congress should pass this Emergency Works program just to give them something to do besides shooting at our troops. Biden is starting to understand, so Obama must be too. Save a soldier's life, and keep the revival of common sense in America going. Jobs for Afghans \"\"http://jobsforafghans.org Please forward this article to President Obama: \"\"http://www.whitehouse.gov/contact/ and to your congress member: \"\"http://www.visi.com/juan/congress/ Youtube video, unemployment in Afghanistan: \"\"http://www.youtube.com/watch?v=_26BRimE_Bg", 
        "threadID": "409192893_3900097712001", 
        "time": "2009-03-13 15:12:00", 
        "title": "You  Saved a Soldier's Life by Reaching Obama on Afghanistan Unemployment", 
        "userID": "WitchitaKid"
    }
]