[
    {
        "content": "Our landmark must be a fixed point, so here it is--we are at war. We are at war with people who quite openly state that they are at war with us. And God help us, the enemy is far more honest than our leaders. Let's give credit where credit is due: George W. Bush reacted correctly to the 9/11 attack by taking out the Taliban in Afghanistan. And he acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise. But Bush made some serious mistakes, and those mistakes continue to hamper and hurt us. IMO, his most serious mistake, in the immediate aftermath of the 9/11 attack, was his failure to adequately name the enemy who murdered 3,000 Americans in a single morning. Those people were murdered by Islamic terrorists. The terrorists who murdered them made their demands perfectly clear; they were the demands Mohammed made in the 700s. Submit to us or die. For whatever reason Bush labeled Islam a \"religion of peace\" and thus dodged a critical concept of the 21st Century. As much as I hate to say it, Osama bin Laden got what Bush fudged. Bin Laden saw a conflict between civilizations--Islamic against Western. Up to a point he was correct, but he missed the essential dividing point in the real struggle. This is a necessay fight to the death, but it is not necessarily limited to a contest between Islam and the West. This is a fight not only for the survival but for the soul of humanity. We cannot afford to lose this fight and must win it at all costs, but at the same time we must consider those costs. Our enemies are Islam and the secular notion of collectivism. We will not defeat those enemies at a debate table, and right now we can't even defeat them on a battlefield. Why? Because we refuse to really do what is necessary to win the fight. What do we need to do? We need to swallow hard and realize that certain enemies need to be destroyed. There is no room for equivocation. This war will kill some of our best people. That is unavoidable. But make their lost lives count--decimate the enemy to the point that all he can do is cry for mercy. Then silence that cry by finishing him off. We're not ready to do that just yet. A few more thousands of Americans will need to die before we're ready. God help us....", 
        "intTime": 20090405, 
        "postID": 1, 
        "quote": "", 
        "reply": "Our landmark must be a fixed point, so here it is--we are at war. We are at war with people who quite openly state that they are at war with us. And God help us, the enemy is far more honest than our leaders. Let's give credit where credit is due: George W. Bush reacted correctly to the 9/11 attack by taking out the Taliban in Afghanistan. And he acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise. But Bush made some serious mistakes, and those mistakes continue to hamper and hurt us. IMO, his most serious mistake, in the immediate aftermath of the 9/11 attack, was his failure to adequately name the enemy who murdered 3,000 Americans in a single morning. Those people were murdered by Islamic terrorists. The terrorists who murdered them made their demands perfectly clear; they were the demands Mohammed made in the 700s. Submit to us or die. For whatever reason Bush labeled Islam a \"religion of peace\" and thus dodged a critical concept of the 21st Century. As much as I hate to say it, Osama bin Laden got what Bush fudged. Bin Laden saw a conflict between civilizations--Islamic against Western. Up to a point he was correct, but he missed the essential dividing point in the real struggle. This is a necessay fight to the death, but it is not necessarily limited to a contest between Islam and the West. This is a fight not only for the survival but for the soul of humanity. We cannot afford to lose this fight and must win it at all costs, but at the same time we must consider those costs. Our enemies are Islam and the secular notion of collectivism. We will not defeat those enemies at a debate table, and right now we can't even defeat them on a battlefield. Why? Because we refuse to really do what is necessary to win the fight. What do we need to do? We need to swallow hard and realize that certain enemies need to be destroyed. There is no room for equivocation. This war will kill some of our best people. That is unavoidable. But make their lost lives count--decimate the enemy to the point that all he can do is cry for mercy. Then silence that cry by finishing him off. We're not ready to do that just yet. A few more thousands of Americans will need to die before we're ready. God help us....", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-05 14:33:00", 
        "title": "Where do we go from here...?", 
        "userID": "ipw533"
    }, 
    {
        "content": "“We can’t kill our way to victory.” General Petraeus Understanding the complexity of the enemy and the societies where the war is being fought are the first step to winning the war in A-stan/P-stan. President Bush never understood either, which is why after seven years of war in Afghanistan, the Taliban (who were taken out of power by Pres. Bush, but never defeated) think that they are now winning and al Qaeda has safe haven in Packistan. President Obama seems to have a better grasp on the situation. \"David Kilcullen, a counterinsurgency expert who has advised Petraeus, says, \"I've had tribal leaders and Afghan government officials at the province and district level tell me that 90 percent of the people we call the Taliban are actually tribal fighters or Pashtun nationalists or people pursuing their own agendas. Less than 10 percent are ideologically aligned with the Quetta Shura [Mullah Omar's leadership group] or Al Qaeda.\" These people are, in his view, \"almost certainly reconcilable under some circumstances.\" Beyond Afghanistan, too, it is crucial that we adopt a more sophisticated strategy toward radical Islam. This should come naturally to President Obama, who spoke often on the campaign trail of the need for just such a differentiated approach toward Muslim countries. Even the Washington Institute, a think tank often associated with conservatives, appears onboard. It is issuing a report this week that recommends, among other points, that the United States use more \"nuanced, noncombative rhetoric\" that avoids sweeping declarations like \"war on terror,\" \"global insurgency,\" even \"the Muslim world.\" Anything that emphasizes the variety of groups, movements and motives within that world strengthens the case that this is not a battle between Islam and the West. Bin Laden constantly argues that all these different groups are part of the same global movement. We should not play into his hands, and emphasize instead that many of these forces are local, have specific grievances and don't have much in common. The veil is not the same as the suicide belt. We can better pursue our values if we recognize the local and cultural context, and appreciate that people want to find their own balance between freedom and order, liberty and license. In the end, time is on our side. Bin Ladenism has already lost ground in almost every Muslim country. Radical Islam will follow the same path. Wherever it is tried—in Afghanistan, in Iraq, in parts of Nigeria and Pakistan—people weary of its charms very quickly. The truth is that all Islamists, violent or not, lack answers to the problems of the modern world. They do not have a world view that can satisfy the aspirations of modern men and women. We do. That's the most powerful weapon of all.\" Fareed Zakaria, Feb 28, 2009", 
        "intTime": 20090405, 
        "postID": 2, 
        "quote": "", 
        "reply": "“We can’t kill our way to victory.” General Petraeus Understanding the complexity of the enemy and the societies where the war is being fought are the first step to winning the war in A-stan/P-stan. President Bush never understood either, which is why after seven years of war in Afghanistan, the Taliban (who were taken out of power by Pres. Bush, but never defeated) think that they are now winning and al Qaeda has safe haven in Packistan. President Obama seems to have a better grasp on the situation. \"David Kilcullen, a counterinsurgency expert who has advised Petraeus, says, \"I've had tribal leaders and Afghan government officials at the province and district level tell me that 90 percent of the people we call the Taliban are actually tribal fighters or Pashtun nationalists or people pursuing their own agendas. Less than 10 percent are ideologically aligned with the Quetta Shura [Mullah Omar's leadership group] or Al Qaeda.\" These people are, in his view, \"almost certainly reconcilable under some circumstances.\" Beyond Afghanistan, too, it is crucial that we adopt a more sophisticated strategy toward radical Islam. This should come naturally to President Obama, who spoke often on the campaign trail of the need for just such a differentiated approach toward Muslim countries. Even the Washington Institute, a think tank often associated with conservatives, appears onboard. It is issuing a report this week that recommends, among other points, that the United States use more \"nuanced, noncombative rhetoric\" that avoids sweeping declarations like \"war on terror,\" \"global insurgency,\" even \"the Muslim world.\" Anything that emphasizes the variety of groups, movements and motives within that world strengthens the case that this is not a battle between Islam and the West. Bin Laden constantly argues that all these different groups are part of the same global movement. We should not play into his hands, and emphasize instead that many of these forces are local, have specific grievances and don't have much in common. The veil is not the same as the suicide belt. We can better pursue our values if we recognize the local and cultural context, and appreciate that people want to find their own balance between freedom and order, liberty and license. In the end, time is on our side. Bin Ladenism has already lost ground in almost every Muslim country. Radical Islam will follow the same path. Wherever it is tried—in Afghanistan, in Iraq, in parts of Nigeria and Pakistan—people weary of its charms very quickly. The truth is that all Islamists, violent or not, lack answers to the problems of the modern world. They do not have a world view that can satisfy the aspirations of modern men and women. We do. That's the most powerful weapon of all.\" Fareed Zakaria, Feb 28, 2009", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-05 15:12:00", 
        "title": "Where do we go from here...?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus No, but we can and should kill those most dedicated to our demise, while offering help and the olive branch to those who don't jump on the idiot islamonazi bandwagon.", 
        "intTime": 20090405, 
        "postID": 3, 
        "quote": "Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus", 
        "reply": " No, but we can and should kill those most dedicated to our demise, while offering help and the olive branch to those who don't jump on the idiot islamonazi bandwagon.", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-05 15:37:00", 
        "title": "Where do we go from here...?", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus No, but we can and should kill those most dedicated to our demise, while offering help and the olive branch to those who don't jump on the idiot islamonazi bandwagon. Agreed. Another aspect of the war in A-stan/P-stan that President Obama has long understood. During the campaign he said that the United States should attack al Qaeda when there is actionable intelligence and the Pakistanis cannot or will not act. Not long after that, President Bush ordered the first drone bombing of the enemy in P-stan. The misinformed went around saying Obama wanted to invade P-stan, which was a lie. President Obama has stepped up the remote control killing of al Qaeda and Taliban leaders since taking office. Happened again yesterday. \"ISLAMABAD, Pakistan, April 4 (UPI) -- Rockets fired from a U.S. drone killed 13 people at an alleged militant hideout in Pakistan's tribal region Saturday, sources say.\" If there are only a few thousand real bad guys, seems like killing them a dozen at a time is going to have a huge effect very soon on the ability of the enemy to wage war against us.", 
        "intTime": 20090405, 
        "postID": 4, 
        "quote": "Originally posted by RRR52: quote: Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus No, but we can and should kill those most dedicated to our demise, while offering help and the olive branch to those who don't jump on the idiot islamonazi bandwagon.", 
        "reply": " Agreed. Another aspect of the war in A-stan/P-stan that President Obama has long understood. During the campaign he said that the United States should attack al Qaeda when there is actionable intelligence and the Pakistanis cannot or will not act. Not long after that, President Bush ordered the first drone bombing of the enemy in P-stan. The misinformed went around saying Obama wanted to invade P-stan, which was a lie. President Obama has stepped up the remote control killing of al Qaeda and Taliban leaders since taking office. Happened again yesterday. \"ISLAMABAD, Pakistan, April 4 (UPI) -- Rockets fired from a U.S. drone killed 13 people at an alleged militant hideout in Pakistan's tribal region Saturday, sources say.\" If there are only a few thousand real bad guys, seems like killing them a dozen at a time is going to have a huge effect very soon on the ability of the enemy to wage war against us.", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-05 16:00:00", 
        "title": "Where do we go from here...?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by RRR52: quote: Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus No, but we can and should kill those most dedicated to our demise, while offering help and the olive branch to those who don't jump on the idiot islamonazi bandwagon. Agreed. Another aspect of the war in A-stan/P-stan that President Obama has long understood. During the campaign he said that the United States should attack al Qaeda when there is actionable intelligence and the Pakistanis cannot or will not act. Not long after that, President Bush ordered the first drone bombing of the enemy in P-stan. The misinformed went around saying Obama wanted to invade P-stan, which was a lie. President Obama has stepped up the remote control killing of al Qaeda and Taliban leaders since taking office. Happened again yesterday. \"ISLAMABAD, Pakistan, April 4 (UPI) -- Rockets fired from a U.S. drone killed 13 people at an alleged militant hideout in Pakistan's tribal region Saturday, sources say.\" If there are only a few thousand real bad guys, seems like killing them a dozen at a time is going to have a huge effect very soon on the ability of the enemy to wage war against us. That's not exactly right. cross-border incursions into P-stan via air and even ground assets were being used and were even spelled out inour SOFA agreements long before the messiah rode his magic Unicorn onto the world stage...", 
        "intTime": 20090405, 
        "postID": 5, 
        "quote": "Originally posted by xerello: quote: Originally posted by RRR52: quote: Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus No, but we can and should kill those most dedicated to our demise, while offering help and the olive branch to those who don't jump on the idiot islamonazi bandwagon. Agreed. Another aspect of the war in A-stan/P-stan that President Obama has long understood. During the campaign he said that the United States should attack al Qaeda when there is actionable intelligence and the Pakistanis cannot or will not act. Not long after that, President Bush ordered the first drone bombing of the enemy in P-stan. The misinformed went around saying Obama wanted to invade P-stan, which was a lie. President Obama has stepped up the remote control killing of al Qaeda and Taliban leaders since taking office. Happened again yesterday. \"ISLAMABAD, Pakistan, April 4 (UPI) -- Rockets fired from a U.S. drone killed 13 people at an alleged militant hideout in Pakistan's tribal region Saturday, sources say.\" If there are only a few thousand real bad guys, seems like killing them a dozen at a time is going to have a huge effect very soon on the ability of the enemy to wage war against us.", 
        "reply": " That's not exactly right. cross-border incursions into P-stan via air and even ground assets were being used and were even spelled out inour SOFA agreements long before the messiah rode his magic Unicorn onto the world stage...", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-05 17:51:00", 
        "title": "Where do we go from here...?", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by ipw533: Our landmark must be a fixed point, so here it is--we are at war. We are at war with people who quite openly state that they are at war with us. And God help us, the enemy is far more honest than our leaders. Let's give credit where credit is due: George W. Bush reacted correctly to the 9/11 attack by taking out the Taliban in Afghanistan. And he acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise. But Bush made some serious mistakes, and those mistakes continue to hamper and hurt us. IMO, his most serious mistake, in the immediate aftermath of the 9/11 attack, was his failure to adequately name the enemy who murdered 3,000 Americans in a single morning. Those people were murdered by Islamic terrorists. The terrorists who murdered them made their demands perfectly clear; they were the demands Mohammed made in the 700s. Submit to us or die. For whatever reason Bush labeled Islam a \"religion of peace\" and thus dodged a critical concept of the 21st Century. As much as I hate to say it, Osama bin Laden got what Bush fudged. Bin Laden saw a conflict between civilizations--Islamic against Western. Up to a point he was correct, but he missed the essential dividing point in the real struggle. This is a necessay fight to the death, but it is not necessarily limited to a contest between Islam and the West. This is a fight not only for the survival but for the soul of humanity. We cannot afford to lose this fight and must win it at all costs, but at the same time we must consider those costs. Our enemies are Islam and the secular notion of collectivism. We will not defeat those enemies at a debate table, and right now we can't even defeat them on a battlefield. Why? Because we refuse to really do what is necessary to win the fight. What do we need to do? We need to swallow hard and realize that certain enemies need to be destroyed. There is no room for equivocation. This war will kill some of our best people. That is unavoidable. But make their lost lives count--decimate the enemy to the point that all he can do is cry for mercy. Then silence that cry by finishing him off. We're not ready to do that just yet. A few more thousands of Americans will need to die before we're ready. God help us.... Our enemy are the terrorists who have thrown down the gauntlet. We deal with them accordingly. There's no need to victimize a billion people over the actions of a few extremists. We should have hit bin Laden, his cronies, and whoever else got in the way - then left Afghanistan. What was the point in staying there? Whom did that serve? What was this business about trying to democratize a people who, because of their spiritual beliefs and tribal customs, can't even comprehend the concept? And I'm not getting your tack on \"collectivism\" being hostile to our existence. We can't be a nation without some sense of collectivism. If we don't see ourselves as a people with things in common, how will the United States survive? Are you confusing the term with some notion of Marxism? I know that seems to be popular among a lot of people these days. If we have enemies who are actively working to disrupt or destroy our way of life, they must be dealt with accordingly. But I don't see a need to commit genocide. The threat of terrorism isn't existential. They may think themselves \"holy warriors\", but we don't need to honor that delusion. We get those little ****ants, strike them down forcefully and unceremoniously, and move on. I have no respect for their abilities and think they hold no real power outside of that which was given them by a bunch of ignorant ideologues who either overinflated the threat to cover up their own incompetence or used it as a pretext to further a political agenda. We just need to hunt them down and kill them. And we don't need to make a big deal of it. A terrorist is a coward, and cowards don't deserve the respect of a true warrior.", 
        "intTime": 20090405, 
        "postID": 6, 
        "quote": "Originally posted by ipw533: Our landmark must be a fixed point, so here it is--we are at war. We are at war with people who quite openly state that they are at war with us. And God help us, the enemy is far more honest than our leaders. Let's give credit where credit is due: George W. Bush reacted correctly to the 9/11 attack by taking out the Taliban in Afghanistan. And he acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise. But Bush made some serious mistakes, and those mistakes continue to hamper and hurt us. IMO, his most serious mistake, in the immediate aftermath of the 9/11 attack, was his failure to adequately name the enemy who murdered 3,000 Americans in a single morning. Those people were murdered by Islamic terrorists. The terrorists who murdered them made their demands perfectly clear; they were the demands Mohammed made in the 700s. Submit to us or die. For whatever reason Bush labeled Islam a \"religion of peace\" and thus dodged a critical concept of the 21st Century. As much as I hate to say it, Osama bin Laden got what Bush fudged. Bin Laden saw a conflict between civilizations--Islamic against Western. Up to a point he was correct, but he missed the essential dividing point in the real struggle. This is a necessay fight to the death, but it is not necessarily limited to a contest between Islam and the West. This is a fight not only for the survival but for the soul of humanity. We cannot afford to lose this fight and must win it at all costs, but at the same time we must consider those costs. Our enemies are Islam and the secular notion of collectivism. We will not defeat those enemies at a debate table, and right now we can't even defeat them on a battlefield. Why? Because we refuse to really do what is necessary to win the fight. What do we need to do? We need to swallow hard and realize that certain enemies need to be destroyed. There is no room for equivocation. This war will kill some of our best people. That is unavoidable. But make their lost lives count--decimate the enemy to the point that all he can do is cry for mercy. Then silence that cry by finishing him off. We're not ready to do that just yet. A few more thousands of Americans will need to die before we're ready. God help us....", 
        "reply": " Our enemy are the terrorists who have thrown down the gauntlet. We deal with them accordingly. There's no need to victimize a billion people over the actions of a few extremists. We should have hit bin Laden, his cronies, and whoever else got in the way - then left Afghanistan. What was the point in staying there? Whom did that serve? What was this business about trying to democratize a people who, because of their spiritual beliefs and tribal customs, can't even comprehend the concept? And I'm not getting your tack on \"collectivism\" being hostile to our existence. We can't be a nation without some sense of collectivism. If we don't see ourselves as a people with things in common, how will the United States survive? Are you confusing the term with some notion of Marxism? I know that seems to be popular among a lot of people these days. If we have enemies who are actively working to disrupt or destroy our way of life, they must be dealt with accordingly. But I don't see a need to commit genocide. The threat of terrorism isn't existential. They may think themselves \"holy warriors\", but we don't need to honor that delusion. We get those little ****ants, strike them down forcefully and unceremoniously, and move on. I have no respect for their abilities and think they hold no real power outside of that which was given them by a bunch of ignorant ideologues who either overinflated the threat to cover up their own incompetence or used it as a pretext to further a political agenda. We just need to hunt them down and kill them. And we don't need to make a big deal of it. A terrorist is a coward, and cowards don't deserve the respect of a true warrior.", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-05 19:39:00", 
        "title": "Where do we go from here...?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "well since we have lost all fortitude to stop the islamofascist threat we might as well bow to the king of saudi arabia and accept them as our islamic overlords....", 
        "intTime": 20090405, 
        "postID": 7, 
        "quote": "", 
        "reply": "well since we have lost all fortitude to stop the islamofascist threat we might as well bow to the king of saudi arabia and accept them as our islamic overlords....", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-05 20:58:00", 
        "title": "Where do we go from here...?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: [Bush] acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise. You have to be kidding me! The invasion of Iraq was a premeditated and calculated retaliation by a vindictive president and was based on purely personal reasons that had nothing whatsoever to do with the security of our nation. This was a totally unnecessary war that was based on proved lies, outlandish suppositions, and self-serving innuendo. Our nation is not more secure because of this act of a narcissistic and ego maniacal president, it is actually less so. Of course he did not finish the job it is an impossible task and was so from the beginning. Iraq may be in an unsteady state of forced democracy right now, but as soon as US forces leave, that will crumble into a world of Islamic theocracy ruled tribalism. As a result of this idiocy, more Iraqi people will die and the region will eventually be thrown into chaos.", 
        "intTime": 20090406, 
        "postID": 8, 
        "quote": "[Bush] acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise.", 
        "reply": " You have to be kidding me! The invasion of Iraq was a premeditated and calculated retaliation by a vindictive president and was based on purely personal reasons that had nothing whatsoever to do with the security of our nation. This was a totally unnecessary war that was based on proved lies, outlandish suppositions, and self-serving innuendo. Our nation is not more secure because of this act of a narcissistic and ego maniacal president, it is actually less so. Of course he did not finish the job it is an impossible task and was so from the beginning. Iraq may be in an unsteady state of forced democracy right now, but as soon as US forces leave, that will crumble into a world of Islamic theocracy ruled tribalism. As a result of this idiocy, more Iraqi people will die and the region will eventually be thrown into chaos.", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-06 04:49:00", 
        "title": "Where do we go from here...?", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: You have to be kidding me! The invasion of Iraq was a premeditated and calculated retaliation by a vindictive president and was based on purely personal reasons that had nothing whatsoever to do with the security of our nation. so you say but the facts state otherwise...more of that liberal revision of history i see...", 
        "intTime": 20090406, 
        "postID": 9, 
        "quote": "You have to be kidding me! The invasion of Iraq was a premeditated and calculated retaliation by a vindictive president and was based on purely personal reasons that had nothing whatsoever to do with the security of our nation.", 
        "reply": " so you say but the facts state otherwise...more of that liberal revision of history i see...", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-06 04:57:00", 
        "title": "Where do we go from here...?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: You have to be kidding me! The invasion of Iraq was a premeditated and calculated retaliation by a vindictive president and was based on purely personal reasons that had nothing whatsoever to do with the security of our nation. so you say but the facts state otherwise... I can certainly point to the 09/11 Commission Report and other well documented sources as a basis for my opinions, and have done so many times. However, I have yet to see you post anything that resembles fact to support any sophomoric opinion you express here. Anytime you find your cajones and want to go head-to-head with me on this, then bring on your sources and walk the walk...or keep on talking.", 
        "intTime": 20090406, 
        "postID": 10, 
        "quote": "Originally posted by outlaws93: quote: You have to be kidding me! The invasion of Iraq was a premeditated and calculated retaliation by a vindictive president and was based on purely personal reasons that had nothing whatsoever to do with the security of our nation. so you say but the facts state otherwise...", 
        "reply": " I can certainly point to the 09/11 Commission Report and other well documented sources as a basis for my opinions, and have done so many times. However, I have yet to see you post anything that resembles fact to support any sophomoric opinion you express here. Anytime you find your cajones and want to go head-to-head with me on this, then bring on your sources and walk the walk...or keep on talking.", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-06 05:02:00", 
        "title": "Where do we go from here...?", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: I can certainly point to the 09/11 Commission Report and other well documented sources as a basis for my opinions, and have done so many times. and that has many of time been proven inarcorate... quote: However, I have yet to see you post anything that resembles fact to support any sophomoric opinion you express here. yea because you never click my links... yea i can say ive never seen any proof from you if i never clicked your links...duh..", 
        "intTime": 20090406, 
        "postID": 11, 
        "quote": "I can certainly point to the 09/11 Commission Report and other well documented sources as a basis for my opinions, and have done so many times.", 
        "reply": " and that has many of time been proven inarcorate... quote: However, I have yet to see you post anything that resembles fact to support any sophomoric opinion you express here. yea because you never click my links... yea i can say ive never seen any proof from you if i never clicked your links...duh..", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-06 05:05:00", 
        "title": "Where do we go from here...?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "'If Zarqawi and [Osama] bin Laden gain control of Iraq, they would create a new training ground for future terrorist attacks,\" Bush said. ''They'd seize oil fields to fund their ambitions. They could recruit more terrorists by claiming a historic victory over the United States and our coalition.\" ---http://www.boston.com/news/nation/articles/2005/08/31/bush_gives_new_reason_for_iraq_war/", 
        "intTime": 20090406, 
        "postID": 12, 
        "quote": "", 
        "reply": "'If Zarqawi and [Osama] bin Laden gain control of Iraq, they would create a new training ground for future terrorist attacks,\" Bush said. ''They'd seize oil fields to fund their ambitions. They could recruit more terrorists by claiming a historic victory over the United States and our coalition.\" ---http://www.boston.com/news/nation/articles/2005/08/31/bush_gives_new_reason_for_iraq_war/", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-06 05:07:00", 
        "title": "Where do we go from here...?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: 'If Zarqawi and [Osama] bin Laden gain control of Iraq, they would create a new training ground for future terrorist attacks,\" Bush said. ''They'd seize oil fields to fund their ambitions. They could recruit more terrorists by claiming a historic victory over the United States and our coalition.\" ---http://www.boston.com/news/nation/articles/2005/08/31/bush_gives_new_reason_for_iraq_war/ Oh my god, the irony of you talking about revising history...", 
        "intTime": 20090406, 
        "postID": 13, 
        "quote": "Originally posted by outlaws93: 'If Zarqawi and [Osama] bin Laden gain control of Iraq, they would create a new training ground for future terrorist attacks,\" Bush said. ''They'd seize oil fields to fund their ambitions. They could recruit more terrorists by claiming a historic victory over the United States and our coalition.\" ---http://www.boston.com/news/nation/articles/2005/08/31/bush_gives_new_reason_for_iraq_war/", 
        "reply": " Oh my god, the irony of you talking about revising history...", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-06 06:28:00", 
        "title": "Where do we go from here...?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by outlaws93: 'If Zarqawi and [Osama] bin Laden gain control of Iraq, they would create a new training ground for future terrorist attacks,\" Bush said. ''They'd seize oil fields to fund their ambitions. They could recruit more terrorists by claiming a historic victory over the United States and our coalition.\" ---http://www.boston.com/news/nation/articles/2005/08/31/bush_gives_new_reason_for_iraq_war/ If? Pretty big bag of \"if\" to go with the \"could\". Now if that is your refute to the 9/11 Commission mentioned by Skin, then Point Skin. yea funny how when info is gathered from torture and its something one group of people wants to hear its becomes gods own truth but yet when its info we dont like or want to hear it is dismissed as people saying anything to get the torture to stop,... \\ quote: The 9/11 Commission suspected that critical information it used in its landmark report was the product of harsh interrogations of al-Qaida operatives - interrogations that many critics have labeled torture. Yet, commission staffers never questioned the agency about the interrogation techniques and in fact ordered a second round of interrogations specifically to ask additional questions of the same More.. operatives, ---http://www.liveleak.com/view?i=f4e_1202115095 Criticism of the 9/11 Commission includes a variety of criticisms of the 9/11 Commission, the congressional commission set up to investigate the September 11, 2001 attacks and chaired by former New Jersey Governor Thomas Kean. Conflicts of interest Lack of cooperation Resistance to investigation Deception ---http://en.wikipedia.org/wiki/Criticisms_of_the_9/11_Commission_Report", 
        "intTime": 20090406, 
        "postID": 14, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by outlaws93: 'If Zarqawi and [Osama] bin Laden gain control of Iraq, they would create a new training ground for future terrorist attacks,\" Bush said. ''They'd seize oil fields to fund their ambitions. They could recruit more terrorists by claiming a historic victory over the United States and our coalition.\" ---http://www.boston.com/news/nation/articles/2005/08/31/bush_gives_new_reason_for_iraq_war/ If? Pretty big bag of \"if\" to go with the \"could\". Now if that is your refute to the 9/11 Commission mentioned by Skin, then Point Skin.", 
        "reply": " yea funny how when info is gathered from torture and its something one group of people wants to hear its becomes gods own truth but yet when its info we dont like or want to hear it is dismissed as people saying anything to get the torture to stop,... \\ quote: The 9/11 Commission suspected that critical information it used in its landmark report was the product of harsh interrogations of al-Qaida operatives - interrogations that many critics have labeled torture. Yet, commission staffers never questioned the agency about the interrogation techniques and in fact ordered a second round of interrogations specifically to ask additional questions of the same More.. operatives, ---http://www.liveleak.com/view?i=f4e_1202115095 Criticism of the 9/11 Commission includes a variety of criticisms of the 9/11 Commission, the congressional commission set up to investigate the September 11, 2001 attacks and chaired by former New Jersey Governor Thomas Kean. Conflicts of interest Lack of cooperation Resistance to investigation Deception ---http://en.wikipedia.org/wiki/Criticisms_of_the_9/11_Commission_Report", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-06 06:39:00", 
        "title": "Where do we go from here...?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus Understanding the complexity of the enemy and the societies where the war is being fought are the first step to winning the war in A-stan/P-stan. President Bush never understood either, which is why after seven years of war in Afghanistan, the Taliban (who were taken out of power by Pres. Bush, but never defeated) think that they are now winning and al Qaeda has safe haven in Packistan. President Obama seems to have a better grasp on the situation. \"David Kilcullen, a counterinsurgency expert who has advised Petraeus, says, \"I've had tribal leaders and Afghan government officials at the province and district level tell me that 90 percent of the people we call the Taliban are actually tribal fighters or Pashtun nationalists or people pursuing their own agendas. Less than 10 percent are ideologically aligned with the Quetta Shura [Mullah Omar's leadership group] or Al Qaeda.\" These people are, in his view, \"almost certainly reconcilable under some circumstances.\" Beyond Afghanistan, too, it is crucial that we adopt a more sophisticated strategy toward radical Islam. This should come naturally to President Obama, who spoke often on the campaign trail of the need for just such a differentiated approach toward Muslim countries. Even the Washington Institute, a think tank often associated with conservatives, appears onboard. It is issuing a report this week that recommends, among other points, that the United States use more \"nuanced, noncombative rhetoric\" that avoids sweeping declarations like \"war on terror,\" \"global insurgency,\" even \"the Muslim world.\" Anything that emphasizes the variety of groups, movements and motives within that world strengthens the case that this is not a battle between Islam and the West. Bin Laden constantly argues that all these different groups are part of the same global movement. We should not play into his hands, and emphasize instead that many of these forces are local, have specific grievances and don't have much in common. The veil is not the same as the suicide belt. We can better pursue our values if we recognize the local and cultural context, and appreciate that people want to find their own balance between freedom and order, liberty and license. In the end, time is on our side. Bin Ladenism has already lost ground in almost every Muslim country. Radical Islam will follow the same path. Wherever it is tried—in Afghanistan, in Iraq, in parts of Nigeria and Pakistan—people weary of its charms very quickly. The truth is that all Islamists, violent or not, lack answers to the problems of the modern world. They do not have a world view that can satisfy the aspirations of modern men and women. We do. That's the most powerful weapon of all.\" Fareed Zakaria, Feb 28, 2009 How bout we let them have their half of the planet, and we'll have ours. I'm exagerrating slightly, but Land's sake, this planet really is big enough for all of us.", 
        "intTime": 20090407, 
        "postID": 15, 
        "quote": "Originally posted by xerello: “We can’t kill our way to victory.” General Petraeus Understanding the complexity of the enemy and the societies where the war is being fought are the first step to winning the war in A-stan/P-stan. President Bush never understood either, which is why after seven years of war in Afghanistan, the Taliban (who were taken out of power by Pres. Bush, but never defeated) think that they are now winning and al Qaeda has safe haven in Packistan. President Obama seems to have a better grasp on the situation. \"David Kilcullen, a counterinsurgency expert who has advised Petraeus, says, \"I've had tribal leaders and Afghan government officials at the province and district level tell me that 90 percent of the people we call the Taliban are actually tribal fighters or Pashtun nationalists or people pursuing their own agendas. Less than 10 percent are ideologically aligned with the Quetta Shura [Mullah Omar's leadership group] or Al Qaeda.\" These people are, in his view, \"almost certainly reconcilable under some circumstances.\" Beyond Afghanistan, too, it is crucial that we adopt a more sophisticated strategy toward radical Islam. This should come naturally to President Obama, who spoke often on the campaign trail of the need for just such a differentiated approach toward Muslim countries. Even the Washington Institute, a think tank often associated with conservatives, appears onboard. It is issuing a report this week that recommends, among other points, that the United States use more \"nuanced, noncombative rhetoric\" that avoids sweeping declarations like \"war on terror,\" \"global insurgency,\" even \"the Muslim world.\" Anything that emphasizes the variety of groups, movements and motives within that world strengthens the case that this is not a battle between Islam and the West. Bin Laden constantly argues that all these different groups are part of the same global movement. We should not play into his hands, and emphasize instead that many of these forces are local, have specific grievances and don't have much in common. The veil is not the same as the suicide belt. We can better pursue our values if we recognize the local and cultural context, and appreciate that people want to find their own balance between freedom and order, liberty and license. In the end, time is on our side. Bin Ladenism has already lost ground in almost every Muslim country. Radical Islam will follow the same path. Wherever it is tried—in Afghanistan, in Iraq, in parts of Nigeria and Pakistan—people weary of its charms very quickly. The truth is that all Islamists, violent or not, lack answers to the problems of the modern world. They do not have a world view that can satisfy the aspirations of modern men and women. We do. That's the most powerful weapon of all.\" Fareed Zakaria, Feb 28, 2009", 
        "reply": " How bout we let them have their half of the planet, and we'll have ours. I'm exagerrating slightly, but Land's sake, this planet really is big enough for all of us.", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-07 18:40:00", 
        "title": "Where do we go from here...?", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by ipw533: Our landmark must be a fixed point, so here it is--we are at war. We are at war with people who quite openly state that they are at war with us. And God help us, the enemy is far more honest than our leaders. Let's give credit where credit is due: George W. Bush reacted correctly to the 9/11 attack by taking out the Taliban in Afghanistan. And he acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise. But Bush made some serious mistakes, and those mistakes continue to hamper and hurt us. IMO, his most serious mistake, in the immediate aftermath of the 9/11 attack, was his failure to adequately name the enemy who murdered 3,000 Americans in a single morning. Those people were murdered by Islamic terrorists. The terrorists who murdered them made their demands perfectly clear; they were the demands Mohammed made in the 700s. Submit to us or die. For whatever reason Bush labeled Islam a \"religion of peace\" and thus dodged a critical concept of the 21st Century. As much as I hate to say it, Osama bin Laden got what Bush fudged. Bin Laden saw a conflict between civilizations--Islamic against Western. Up to a point he was correct, but he missed the essential dividing point in the real struggle. This is a necessay fight to the death, but it is not necessarily limited to a contest between Islam and the West. This is a fight not only for the survival but for the soul of humanity. We cannot afford to lose this fight and must win it at all costs, but at the same time we must consider those costs. Our enemies are Islam and the secular notion of collectivism. We will not defeat those enemies at a debate table, and right now we can't even defeat them on a battlefield. Why? Because we refuse to really do what is necessary to win the fight. What do we need to do? We need to swallow hard and realize that certain enemies need to be destroyed. There is no room for equivocation. This war will kill some of our best people. That is unavoidable. But make their lost lives count--decimate the enemy to the point that all he can do is cry for mercy. Then silence that cry by finishing him off. We're not ready to do that just yet. A few more thousands of Americans will need to die before we're ready. God help us.... Our enemy are the terrorists who have thrown down the gauntlet. We deal with them accordingly. There's no need to victimize a billion people over the actions of a few extremists. We should have hit bin Laden, his cronies, and whoever else got in the way - then left Afghanistan. What was the point in staying there? Whom did that serve? What was this business about trying to democratize a people who, because of their spiritual beliefs and tribal customs, can't even comprehend the concept? And I'm not getting your tack on \"collectivism\" being hostile to our existence. We can't be a nation without some sense of collectivism. If we don't see ourselves as a people with things in common, how will the United States survive? Are you confusing the term with some notion of Marxism? I know that seems to be popular among a lot of people these days. If we have enemies who are actively working to disrupt or destroy our way of life, they must be dealt with accordingly. But I don't see a need to commit genocide. The threat of terrorism isn't existential. They may think themselves \"holy warriors\", but we don't need to honor that delusion. We get those little ****ants, strike them down forcefully and unceremoniously, and move on. I have no respect for their abilities and think they hold no real power outside of that which was given them by a bunch of ignorant ideologues who either overinflated the threat to cover up their own incompetence or used it as a pretext to further a political agenda. We just need to hunt them down and kill them. And we don't need to make a big deal of it. A terrorist is a coward, and cowards don't deserve the respect of a true warrior. I like the way you're thinking here...", 
        "intTime": 20090407, 
        "postID": 16, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by ipw533: Our landmark must be a fixed point, so here it is--we are at war. We are at war with people who quite openly state that they are at war with us. And God help us, the enemy is far more honest than our leaders. Let's give credit where credit is due: George W. Bush reacted correctly to the 9/11 attack by taking out the Taliban in Afghanistan. And he acted correctly by deposing Saddam Hussein and turning Iraq into a nascent democracy. He did not finish the job, but considering that he had only 8 years and strong political opposition that's no surprise. But Bush made some serious mistakes, and those mistakes continue to hamper and hurt us. IMO, his most serious mistake, in the immediate aftermath of the 9/11 attack, was his failure to adequately name the enemy who murdered 3,000 Americans in a single morning. Those people were murdered by Islamic terrorists. The terrorists who murdered them made their demands perfectly clear; they were the demands Mohammed made in the 700s. Submit to us or die. For whatever reason Bush labeled Islam a \"religion of peace\" and thus dodged a critical concept of the 21st Century. As much as I hate to say it, Osama bin Laden got what Bush fudged. Bin Laden saw a conflict between civilizations--Islamic against Western. Up to a point he was correct, but he missed the essential dividing point in the real struggle. This is a necessay fight to the death, but it is not necessarily limited to a contest between Islam and the West. This is a fight not only for the survival but for the soul of humanity. We cannot afford to lose this fight and must win it at all costs, but at the same time we must consider those costs. Our enemies are Islam and the secular notion of collectivism. We will not defeat those enemies at a debate table, and right now we can't even defeat them on a battlefield. Why? Because we refuse to really do what is necessary to win the fight. What do we need to do? We need to swallow hard and realize that certain enemies need to be destroyed. There is no room for equivocation. This war will kill some of our best people. That is unavoidable. But make their lost lives count--decimate the enemy to the point that all he can do is cry for mercy. Then silence that cry by finishing him off. We're not ready to do that just yet. A few more thousands of Americans will need to die before we're ready. God help us.... Our enemy are the terrorists who have thrown down the gauntlet. We deal with them accordingly. There's no need to victimize a billion people over the actions of a few extremists. We should have hit bin Laden, his cronies, and whoever else got in the way - then left Afghanistan. What was the point in staying there? Whom did that serve? What was this business about trying to democratize a people who, because of their spiritual beliefs and tribal customs, can't even comprehend the concept? And I'm not getting your tack on \"collectivism\" being hostile to our existence. We can't be a nation without some sense of collectivism. If we don't see ourselves as a people with things in common, how will the United States survive? Are you confusing the term with some notion of Marxism? I know that seems to be popular among a lot of people these days. If we have enemies who are actively working to disrupt or destroy our way of life, they must be dealt with accordingly. But I don't see a need to commit genocide. The threat of terrorism isn't existential. They may think themselves \"holy warriors\", but we don't need to honor that delusion. We get those little ****ants, strike them down forcefully and unceremoniously, and move on. I have no respect for their abilities and think they hold no real power outside of that which was given them by a bunch of ignorant ideologues who either overinflated the threat to cover up their own incompetence or used it as a pretext to further a political agenda. We just need to hunt them down and kill them. And we don't need to make a big deal of it. A terrorist is a coward, and cowards don't deserve the respect of a true warrior.", 
        "reply": " I like the way you're thinking here...", 
        "threadID": "409192893_2930019912001", 
        "time": "2009-04-07 18:49:00", 
        "title": "Where do we go from here...?", 
        "userID": "Ruanne"
    }
]