[
    {
        "content": "I've been watching the Federal Communications Commission on C-SPAN2. Michael Coops the Acting Chairman (D) is pushing to Nationalize the Internet BroadBand. Is this just another step in taking control over what the people of this country have access to? Also discussed was \"government investment\"......TAXES for internet use! Are they infringing on your 1st Ammendment rights? Included was interest expressed in having access monitoring and content requirements. Just another step in the total control of the sheeple.", 
        "intTime": 20090409, 
        "postID": 1, 
        "quote": "", 
        "reply": "I've been watching the Federal Communications Commission on C-SPAN2. Michael Coops the Acting Chairman (D) is pushing to Nationalize the Internet BroadBand. Is this just another step in taking control over what the people of this country have access to? Also discussed was \"government investment\"......TAXES for internet use! Are they infringing on your 1st Ammendment rights? Included was interest expressed in having access monitoring and content requirements. Just another step in the total control of the sheeple.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-09 06:55:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "If China's nationalized internet is any indication, this is bad.", 
        "intTime": 20090409, 
        "postID": 2, 
        "quote": "", 
        "reply": "If China's nationalized internet is any indication, this is bad.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-09 15:10:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "10Tenths"
    }, 
    {
        "content": "It is for YOUR OWN GOOD! Keep your hands on the table! Now SMILE!", 
        "intTime": 20090409, 
        "postID": 3, 
        "quote": "", 
        "reply": "It is for YOUR OWN GOOD! Keep your hands on the table! Now SMILE!", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-09 17:43:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies.", 
        "intTime": 20090409, 
        "postID": 4, 
        "quote": "", 
        "reply": "I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-09 17:53:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies. I'm so on board with that idea...I pay for about 30 channels I have no use for..just to get NESN.", 
        "intTime": 20090409, 
        "postID": 5, 
        "quote": "Originally posted by Duster6: I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies.", 
        "reply": " I'm so on board with that idea...I pay for about 30 channels I have no use for..just to get NESN.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-09 18:13:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "threerings"
    }, 
    {
        "content": "Fully agree on that one. I want the Sci-Fi channel but I refuse to pay for the package that includes it. But I get six sports channels I never watch and four Spanish language ones that I can't understand.", 
        "intTime": 20090410, 
        "postID": 6, 
        "quote": "", 
        "reply": "Fully agree on that one. I want the Sci-Fi channel but I refuse to pay for the package that includes it. But I get six sports channels I never watch and four Spanish language ones that I can't understand.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-10 13:00:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: I've been watching the Federal Communications Commission on C-SPAN2. Michael Coops the Acting Chairman (D) is pushing to Nationalize the Internet BroadBand. Is this just another step in taking control over what the people of this country have access to? Also discussed was \"government investment\"......TAXES for internet use! Are they infringing on your 1st Ammendment rights? Included was interest expressed in having access monitoring and content requirements. Just another step in the total control of the sheeple. If you use an Internet service provider, you're likely already paying taxes for access to the Internet. The purpose of the national broadband plan is to ensure more people have access to the Internet. Congress already allocated $7.2 billion in the stimulus package that was passed in February. The FCC (of which Michael Copps is the head) will work with the private sector to make this happen. Seems to me that the federal government is just providing the horsepower to ensure more people have access. Is there something wrong with that? Besides, when the previous Administration enlisted the aid of the telecoms and ISPs on its wireless wiretapping initiative, the Internet had been effectively nationalized and whatever Fourth Amendment protections you may have been concerned about were abrogated.", 
        "intTime": 20090410, 
        "postID": 7, 
        "quote": "Originally posted by EspritDeCorps: I've been watching the Federal Communications Commission on C-SPAN2. Michael Coops the Acting Chairman (D) is pushing to Nationalize the Internet BroadBand. Is this just another step in taking control over what the people of this country have access to? Also discussed was \"government investment\"......TAXES for internet use! Are they infringing on your 1st Ammendment rights? Included was interest expressed in having access monitoring and content requirements. Just another step in the total control of the sheeple.", 
        "reply": " If you use an Internet service provider, you're likely already paying taxes for access to the Internet. The purpose of the national broadband plan is to ensure more people have access to the Internet. Congress already allocated $7.2 billion in the stimulus package that was passed in February. The FCC (of which Michael Copps is the head) will work with the private sector to make this happen. Seems to me that the federal government is just providing the horsepower to ensure more people have access. Is there something wrong with that? Besides, when the previous Administration enlisted the aid of the telecoms and ISPs on its wireless wiretapping initiative, the Internet had been effectively nationalized and whatever Fourth Amendment protections you may have been concerned about were abrogated.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-10 16:59:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies. Are you and threerings and shuman supporting government intervention in the free market? I am not saying I support government internet regulation (although I think it's inevitable since the stimulus dollars are already allocated). However, I also believe that cable companies can screw consumers in similar fashion to what they are doing with TV. For example, suppose the internet provider inserts a half-second delay into all traffic entering and leaving your cable modem. You probably would not notice this delay while browsing the web, sending and receiving email, or watching your favorite streaming media program. But say you wanted to use a VoIP telephony service such as Vonage. The quality of your internet phone calls would suffer. Of course, if you switch to your ISP's own VoIP product, the delay magically disappears - at an additional charge to you. Mcgreer is right about what the FCC is doing. I just hope that after the period of data gathering and input from interested parties, that a way can be found to encourage competition.", 
        "intTime": 20090410, 
        "postID": 8, 
        "quote": "Originally posted by Duster6: I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies.", 
        "reply": " Are you and threerings and shuman supporting government intervention in the free market? I am not saying I support government internet regulation (although I think it's inevitable since the stimulus dollars are already allocated). However, I also believe that cable companies can screw consumers in similar fashion to what they are doing with TV. For example, suppose the internet provider inserts a half-second delay into all traffic entering and leaving your cable modem. You probably would not notice this delay while browsing the web, sending and receiving email, or watching your favorite streaming media program. But say you wanted to use a VoIP telephony service such as Vonage. The quality of your internet phone calls would suffer. Of course, if you switch to your ISP's own VoIP product, the delay magically disappears - at an additional charge to you. Mcgreer is right about what the FCC is doing. I just hope that after the period of data gathering and input from interested parties, that a way can be found to encourage competition.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-10 18:07:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "92guru"
    }, 
    {
        "content": "quote: Originally posted by 92guru: quote: Originally posted by Duster6: I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies. Are you and threerings and shuman supporting government intervention in the free market? I am not saying I support government internet regulation (although I think it's inevitable since the stimulus dollars are already allocated). However, I also believe that cable companies can screw consumers in similar fashion to what they are doing with TV. For example, suppose the internet provider inserts a half-second delay into all traffic entering and leaving your cable modem. You probably would not notice this delay while browsing the web, sending and receiving email, or watching your favorite streaming media program. But say you wanted to use a VoIP telephony service such as Vonage. The quality of your internet phone calls would suffer. Of course, if you switch to your ISP's own VoIP product, the delay magically disappears - at an additional charge to you. Mcgreer is right about what the FCC is doing. I just hope that after the period of data gathering and input from interested parties, that a way can be found to encourage competition. Competition is absolutely necessary. When I left the States in 1995, there were probably thousands of ISPs here. When I returned last year, there are hardly any left, and the quality of service really and truly sucks. There's almost no competition outside of a very small handful of providers who provide the same products and services. They've merely carved up the territory.", 
        "intTime": 20090410, 
        "postID": 9, 
        "quote": "Originally posted by 92guru: quote: Originally posted by Duster6: I'm still waiting for the Government to let us pay for our cable channels that we pick instead of what is forced down our throats by the cable and satellite companies. Are you and threerings and shuman supporting government intervention in the free market? I am not saying I support government internet regulation (although I think it's inevitable since the stimulus dollars are already allocated). However, I also believe that cable companies can screw consumers in similar fashion to what they are doing with TV. For example, suppose the internet provider inserts a half-second delay into all traffic entering and leaving your cable modem. You probably would not notice this delay while browsing the web, sending and receiving email, or watching your favorite streaming media program. But say you wanted to use a VoIP telephony service such as Vonage. The quality of your internet phone calls would suffer. Of course, if you switch to your ISP's own VoIP product, the delay magically disappears - at an additional charge to you. Mcgreer is right about what the FCC is doing. I just hope that after the period of data gathering and input from interested parties, that a way can be found to encourage competition.", 
        "reply": " Competition is absolutely necessary. When I left the States in 1995, there were probably thousands of ISPs here. When I returned last year, there are hardly any left, and the quality of service really and truly sucks. There's almost no competition outside of a very small handful of providers who provide the same products and services. They've merely carved up the territory.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-10 18:25:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "mcgreer"
    }, 
    {
        "content": "More than likely there will come a day when people start using \"private\" networks again because of all the regulation and policing that the internet has turned in to. Some of you may remember the BBS systems we had before the \"internet\". I can see something like that coming back. I got on the internet when it was first made available to the general public and it was a whole different world than what it is now. It was trully a \"free\" place to be.", 
        "intTime": 20090410, 
        "postID": 10, 
        "quote": "", 
        "reply": "More than likely there will come a day when people start using \"private\" networks again because of all the regulation and policing that the internet has turned in to. Some of you may remember the BBS systems we had before the \"internet\". I can see something like that coming back. I got on the internet when it was first made available to the general public and it was a whole different world than what it is now. It was trully a \"free\" place to be.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-10 19:07:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Competition is absolutely necessary. Exactly and that's the problem in our so called free markets. For the most part there is no competition in many of the tele service areas. Either because of governments entities, government regulations or companies in cahoots with one another and setting price guidelines.", 
        "intTime": 20090410, 
        "postID": 11, 
        "quote": "Competition is absolutely necessary.", 
        "reply": " Exactly and that's the problem in our so called free markets. For the most part there is no competition in many of the tele service areas. Either because of governments entities, government regulations or companies in cahoots with one another and setting price guidelines.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-10 19:12:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by EspritDeCorps: I've been watching the Federal Communications Commission on C-SPAN2. Michael Coops the Acting Chairman (D) is pushing to Nationalize the Internet BroadBand. Is this just another step in taking control over what the people of this country have access to? Also discussed was \"government investment\"......TAXES for internet use! Are they infringing on your 1st Ammendment rights? Included was interest expressed in having access monitoring and content requirements. Just another step in the total control of the sheeple. If you use an Internet service provider, you're likely already paying taxes for access to the Internet. The purpose of the national broadband plan is to ensure more people have access to the Internet. Congress already allocated $7.2 billion in the stimulus package that was passed in February. The FCC (of which Michael Copps is the head) will work with the private sector to make this happen. Seems to me that the federal government is just providing the horsepower to ensure more people have access. Is there something wrong with that? Besides, when the previous Administration enlisted the aid of the telecoms and ISPs on its wireless wiretapping initiative, the Internet had been effectively nationalized and whatever Fourth Amendment protections you may have been concerned about were abrogated. I agree with you about ensuring more people have access to the net. However I don't think the government is the best instrument to get the job done without adding their \"special\" nuances. If you know what I mean!", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by EspritDeCorps: I've been watching the Federal Communications Commission on C-SPAN2. Michael Coops the Acting Chairman (D) is pushing to Nationalize the Internet BroadBand. Is this just another step in taking control over what the people of this country have access to? Also discussed was \"government investment\"......TAXES for internet use! Are they infringing on your 1st Ammendment rights? Included was interest expressed in having access monitoring and content requirements. Just another step in the total control of the sheeple. If you use an Internet service provider, you're likely already paying taxes for access to the Internet. The purpose of the national broadband plan is to ensure more people have access to the Internet. Congress already allocated $7.2 billion in the stimulus package that was passed in February. The FCC (of which Michael Copps is the head) will work with the private sector to make this happen. Seems to me that the federal government is just providing the horsepower to ensure more people have access. Is there something wrong with that? Besides, when the previous Administration enlisted the aid of the telecoms and ISPs on its wireless wiretapping initiative, the Internet had been effectively nationalized and whatever Fourth Amendment protections you may have been concerned about were abrogated.", 
        "reply": " I agree with you about ensuring more people have access to the net. However I don't think the government is the best instrument to get the job done without adding their \"special\" nuances. If you know what I mean!", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-13 15:17:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Competition is absolutely necessary. Exactly and that's the problem in our so called free markets. For the most part there is no competition in many of the tele service areas. Either because of governments entities, government regulations or companies in cahoots with one another and setting price guidelines. We have not had free markets during any of our lifetimes. The free market system in America died a long time ago. We have regulated markets.", 
        "intTime": 20090413, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: Competition is absolutely necessary. Exactly and that's the problem in our so called free markets. For the most part there is no competition in many of the tele service areas. Either because of governments entities, government regulations or companies in cahoots with one another and setting price guidelines.", 
        "reply": " We have not had free markets during any of our lifetimes. The free market system in America died a long time ago. We have regulated markets.", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-13 17:42:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: More than likely there will come a day when people start using \"private\" networks again because of all the regulation and policing that the internet has turned in to. Some of you may remember the BBS systems we had before the \"internet\". I can see something like that coming back. I got on the internet when it was first made available to the general public and it was a whole different world than what it is now. It was trully a \"free\" place to be. I remember those days before windows and the net. I ran one of the biggest BBS here in Fayetteville called \"The Army Post.\" It all seems primitive now but at the time it was pretty exciting stuff. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090415, 
        "postID": 14, 
        "quote": "Originally posted by crackerjacks61: More than likely there will come a day when people start using \"private\" networks again because of all the regulation and policing that the internet has turned in to. Some of you may remember the BBS systems we had before the \"internet\". I can see something like that coming back. I got on the internet when it was first made available to the general public and it was a whole different world than what it is now. It was trully a \"free\" place to be.", 
        "reply": " I remember those days before windows and the net. I ran one of the biggest BBS here in Fayetteville called \"The Army Post.\" It all seems primitive now but at the time it was pretty exciting stuff. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-15 06:22:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: The purpose of the national broadband plan is to ensure more people have access to the Internet. Congress already allocated $7.2 billion in the stimulus package that was passed in February. The FCC (of which Michael Copps is the head) will work with the private sector to make this happen. Seems to me that the federal government is just providing the horsepower to ensure more people have access. Is there something wrong with that? Depends...who is paying for it? I sure hope everyone has a chance to fast downloads of porn", 
        "intTime": 20090415, 
        "postID": 15, 
        "quote": "The purpose of the national broadband plan is to ensure more people have access to the Internet. Congress already allocated $7.2 billion in the stimulus package that was passed in February. The FCC (of which Michael Copps is the head) will work with the private sector to make this happen. Seems to me that the federal government is just providing the horsepower to ensure more people have access. Is there something wrong with that?", 
        "reply": " Depends...who is paying for it? I sure hope everyone has a chance to fast downloads of porn", 
        "threadID": "409192893_7930052022001", 
        "time": "2009-04-15 06:48:00", 
        "title": "Nationalized High-Speed Internet", 
        "userID": "ACR26"
    }
]