[
    {
        "content": "", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 05:45:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.”", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "", 
        "reply": "The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.”", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 07:39:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "xerello"
    }, 
    {
        "content": "Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks.", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "", 
        "reply": "Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 07:58:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "earmarks are wasteful spending. So, why does Obamas Adm have earmarks on this or any bill? Do as I say not as I do?", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "", 
        "reply": "earmarks are wasteful spending. So, why does Obamas Adm have earmarks on this or any bill? Do as I say not as I do?", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:13:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.” IF IF IF... The bottom line is the GOP is NOT in power.", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.”", 
        "reply": " IF IF IF... The bottom line is the GOP is NOT in power.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:17:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect.", 
        "intTime": 20090302, 
        "postID": 9, 
        "quote": "Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks.", 
        "reply": " John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:18:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: earmarks are wasteful spending. Some are, some aren't. That is the facts.", 
        "intTime": 20090302, 
        "postID": 10, 
        "quote": "earmarks are wasteful spending.", 
        "reply": " Some are, some aren't. That is the facts.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:31:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect. Bush lied and people died. Didn't see you get your panties in a wad of that fact.", 
        "intTime": 20090302, 
        "postID": 11, 
        "quote": "Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect.", 
        "reply": " Bush lied and people died. Didn't see you get your panties in a wad of that fact.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:32:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see.", 
        "intTime": 20090302, 
        "postID": 12, 
        "quote": "Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts.", 
        "reply": " Nuancing and parsing like your hero, I see.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:39:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see. Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, try doing a little research on your own.", 
        "intTime": 20090302, 
        "postID": 13, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see.", 
        "reply": " Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, try doing a little research on your own.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:44:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see. Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, do a little research on you own. Have done my research. And earmarks are what is wrong not right. Have been against them in ALL administrations. Not a new thing with me. Take another sip...", 
        "intTime": 20090302, 
        "postID": 14, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see. Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, do a little research on you own.", 
        "reply": " Have done my research. And earmarks are what is wrong not right. Have been against them in ALL administrations. Not a new thing with me. Take another sip...", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:48:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "intTime": 20090302, 
        "postID": 15, 
        "quote": "", 
        "reply": "I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:02:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget.", 
        "intTime": 20090302, 
        "postID": 16, 
        "quote": "Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts.", 
        "reply": " True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:02:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect. Bush lied and people died. Didn't see you get your panties in a wad of that fact. Bush never lied. Bush is gone. Even if Bush lied that does not excuse Obama.", 
        "intTime": 20090302, 
        "postID": 17, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect. Bush lied and people died. Didn't see you get your panties in a wad of that fact.", 
        "reply": " Bush never lied. Bush is gone. Even if Bush lied that does not excuse Obama.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:11:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new.", 
        "intTime": 20090302, 
        "postID": 18, 
        "quote": "Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "reply": " Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:12:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Are you a mod now?", 
        "intTime": 20090302, 
        "postID": 19, 
        "quote": "", 
        "reply": "Are you a mod now?", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:32:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget. You would have to \"ferret\" wasteful spending out of any bill. More nonsense.", 
        "intTime": 20090302, 
        "postID": 20, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget.", 
        "reply": " You would have to \"ferret\" wasteful spending out of any bill. More nonsense.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:34:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.” IF IF IF... The bottom line is the GOP is NOT in power. True, the GOPis not in power. So they make an issue of earmarks and then place thousands of earmarks into the spending bill. That is one reason they have so few elected officials in Congress – they say one thing and do another. “Spending is now out of control and will bankrupt the next generation” is what Republicans are saying now. They leave out the fact that n the twelve years that the Republicans held majorities in Congress (1994 to 2006), six of which there was a Republican president, the national dept increased by $4.075 trillion – almost doubling what it was when they came to power. Democrats don’t try to be fiscally responsible, they tax and spend. Republicans say they are fiscally responsible, but borrow and spend. Which is worse?", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "Originally posted by threerings: quote: Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.” IF IF IF... The bottom line is the GOP is NOT in power.", 
        "reply": " True, the GOPis not in power. So they make an issue of earmarks and then place thousands of earmarks into the spending bill. That is one reason they have so few elected officials in Congress – they say one thing and do another. “Spending is now out of control and will bankrupt the next generation” is what Republicans are saying now. They leave out the fact that n the twelve years that the Republicans held majorities in Congress (1994 to 2006), six of which there was a Republican president, the national dept increased by $4.075 trillion – almost doubling what it was when they came to power. Democrats don’t try to be fiscally responsible, they tax and spend. Republicans say they are fiscally responsible, but borrow and spend. Which is worse?", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:11:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new. OK here is the frothing headline: quote: Omnibus Spending Bill Loaded With $MILLIONS Of Earmarks From President Obama, Top Cabinet Members Now let me see if I got this straight, $410 billion dollar bill, and the frothing talking heads say: \"$MILLIONS of earmarks\". Malkin herself says it equals 45 BILLION. Well if it is in fact millions and not billions, you got yea another non story. If it is $5 billion, that would amount to about 1%, hardly worth frothing over. I bet DoD loses that much every month.", 
        "intTime": 20090302, 
        "postID": 22, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new.", 
        "reply": " OK here is the frothing headline: quote: Omnibus Spending Bill Loaded With $MILLIONS Of Earmarks From President Obama, Top Cabinet Members Now let me see if I got this straight, $410 billion dollar bill, and the frothing talking heads say: \"$MILLIONS of earmarks\". Malkin herself says it equals 45 BILLION. Well if it is in fact millions and not billions, you got yea another non story. If it is $5 billion, that would amount to about 1%, hardly worth frothing over. I bet DoD loses that much every month.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:23:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next...", 
        "intTime": 20090302, 
        "postID": 23, 
        "quote": "Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "reply": " They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next...", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:34:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next... So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****.", 
        "intTime": 20090302, 
        "postID": 24, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next...", 
        "reply": " So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:36:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "intTime": 20090302, 
        "postID": 25, 
        "quote": "Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\"", 
        "reply": "An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ...  Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:54:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next... So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****. Why was the Filipino vet issue put on the economic giveaway bill? Pork is bad. And as I pinted out that benefits are theri for those vets so why more money on a bill that has nothing to do with it. How bout the swamp mouse in san fran? money to non-profit groups? how bout tatoo removal on the omnibus bill. and pointing out 1 earmark that may or may not be legit does not validate the massive amounts of BS earmarks on all these bills by these idiots in congress. And I say you would probably be an expert on shiite. But in this case you're wrong.", 
        "intTime": 20090302, 
        "postID": 26, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next... So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****.", 
        "reply": " Why was the Filipino vet issue put on the economic giveaway bill? Pork is bad. And as I pinted out that benefits are theri for those vets so why more money on a bill that has nothing to do with it. How bout the swamp mouse in san fran? money to non-profit groups? how bout tatoo removal on the omnibus bill. and pointing out 1 earmark that may or may not be legit does not validate the massive amounts of BS earmarks on all these bills by these idiots in congress. And I say you would probably be an expert on shiite. But in this case you're wrong.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:56:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out. Some people cant get it thru their heads that those sites have been around and people go to them. I sited them earlier on other posts in the past and have gone to this and others, under a republican adm too. But hey I am just mean co'z his majesty is in office.", 
        "intTime": 20090302, 
        "postID": 27, 
        "quote": "Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "reply": " Some people cant get it thru their heads that those sites have been around and people go to them. I sited them earlier on other posts in the past and have gone to this and others, under a republican adm too. But hey I am just mean co'z his majesty is in office.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:02:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out. OK $14 billion and what was the total budget? More majoring in the minors. DoD loses that every month or so, don't see you screaming about that.", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "reply": " OK $14 billion and what was the total budget? More majoring in the minors. DoD loses that every month or so, don't see you screaming about that.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:03:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage.", 
        "intTime": 20090302, 
        "postID": 29, 
        "quote": "", 
        "reply": "Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:11:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage. LOL ... by your measure, nor are CEO salaries, comp packages, and bonuses.", 
        "intTime": 20090302, 
        "postID": 30, 
        "quote": "Originally posted by FrJohn1123: Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage.", 
        "reply": " LOL ... by your measure, nor are CEO salaries, comp packages, and bonuses.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:18:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "", 
        "intTime": 20090302, 
        "postID": 34, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 05:45:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.”", 
        "intTime": 20090302, 
        "postID": 35, 
        "quote": "", 
        "reply": "The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.”", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 07:39:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "xerello"
    }, 
    {
        "content": "Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks.", 
        "intTime": 20090302, 
        "postID": 36, 
        "quote": "", 
        "reply": "Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 07:58:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "earmarks are wasteful spending. So, why does Obamas Adm have earmarks on this or any bill? Do as I say not as I do?", 
        "intTime": 20090302, 
        "postID": 37, 
        "quote": "", 
        "reply": "earmarks are wasteful spending. So, why does Obamas Adm have earmarks on this or any bill? Do as I say not as I do?", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:13:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.” IF IF IF... The bottom line is the GOP is NOT in power.", 
        "intTime": 20090302, 
        "postID": 38, 
        "quote": "Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.”", 
        "reply": " IF IF IF... The bottom line is the GOP is NOT in power.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:17:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect.", 
        "intTime": 20090302, 
        "postID": 39, 
        "quote": "Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks.", 
        "reply": " John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:18:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: earmarks are wasteful spending. Some are, some aren't. That is the facts.", 
        "intTime": 20090302, 
        "postID": 40, 
        "quote": "earmarks are wasteful spending.", 
        "reply": " Some are, some aren't. That is the facts.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:31:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect. Bush lied and people died. Didn't see you get your panties in a wad of that fact.", 
        "intTime": 20090302, 
        "postID": 41, 
        "quote": "Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect.", 
        "reply": " Bush lied and people died. Didn't see you get your panties in a wad of that fact.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:32:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see.", 
        "intTime": 20090302, 
        "postID": 42, 
        "quote": "Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts.", 
        "reply": " Nuancing and parsing like your hero, I see.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:39:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see. Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, try doing a little research on your own.", 
        "intTime": 20090302, 
        "postID": 43, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see.", 
        "reply": " Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, try doing a little research on your own.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:44:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see. Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, do a little research on you own. Have done my research. And earmarks are what is wrong not right. Have been against them in ALL administrations. Not a new thing with me. Take another sip...", 
        "intTime": 20090302, 
        "postID": 44, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. Nuancing and parsing like your hero, I see. Parsing? Hardly. Thousands of earmarks are passed every year and good deal of them do good things. You listen to idiots too much, do a little research on you own.", 
        "reply": " Have done my research. And earmarks are what is wrong not right. Have been against them in ALL administrations. Not a new thing with me. Take another sip...", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 08:48:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "intTime": 20090302, 
        "postID": 45, 
        "quote": "", 
        "reply": "I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:02:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget.", 
        "intTime": 20090302, 
        "postID": 46, 
        "quote": "Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts.", 
        "reply": " True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:02:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect. Bush lied and people died. Didn't see you get your panties in a wad of that fact. Bush never lied. Bush is gone. Even if Bush lied that does not excuse Obama.", 
        "intTime": 20090302, 
        "postID": 47, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by threerings: quote: Originally posted by FrJohn1123: Typical of the republicans, chasing windmills and minoring in the majors while majoring in the minors. The problem is wasteful spending, not earmarks. John, Obama LIED. Obama is still not telling the truth. In a court of law, if you are caught telling lie, ABOUT ANYTHING, then the rest of what you have to say is now suspect. Bush lied and people died. Didn't see you get your panties in a wad of that fact.", 
        "reply": " Bush never lied. Bush is gone. Even if Bush lied that does not excuse Obama.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:11:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new.", 
        "intTime": 20090302, 
        "postID": 48, 
        "quote": "Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "reply": " Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:12:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Are you a mod now?", 
        "intTime": 20090302, 
        "postID": 49, 
        "quote": "", 
        "reply": "Are you a mod now?", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:32:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget. You would have to \"ferret\" wasteful spending out of any bill. More nonsense.", 
        "intTime": 20090302, 
        "postID": 50, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: quote: earmarks are wasteful spending. Some are, some aren't. That is the facts. True ... and ALL have bypassed the normal budget process that is designed to ferret out the \"are nots\" from the \"ares\" ... and prioritize the \"ares\" within other vetted spending needs and against a limited budget.", 
        "reply": " You would have to \"ferret\" wasteful spending out of any bill. More nonsense.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 09:34:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.” IF IF IF... The bottom line is the GOP is NOT in power. True, the GOPis not in power. So they make an issue of earmarks and then place thousands of earmarks into the spending bill. That is one reason they have so few elected officials in Congress – they say one thing and do another. “Spending is now out of control and will bankrupt the next generation” is what Republicans are saying now. They leave out the fact that n the twelve years that the Republicans held majorities in Congress (1994 to 2006), six of which there was a Republican president, the national dept increased by $4.075 trillion – almost doubling what it was when they came to power. Democrats don’t try to be fiscally responsible, they tax and spend. Republicans say they are fiscally responsible, but borrow and spend. Which is worse?", 
        "intTime": 20090302, 
        "postID": 51, 
        "quote": "Originally posted by threerings: quote: Originally posted by xerello: The earmark trough is bi-partisan and deep. If the Republicans were in power, they would have 60% of the earmarks. Right now they have only 40%. “WASHINGTON -- Republicans are expected to deliver a daylong rant Wednesday against Democratic spending legislation, yet the bill is loaded with thousands of pet projects that Republican lawmakers inserted. “House Democrats estimate that Republicans inserted 40 percent of the earmarks in the bill. An independent budget watchdog group, Taxpayers for Common Sense, said the 60-40 Democratic-Republican ratio followed historical patterns.” “Sen. Thad Cochran of Mississippi, the top Republican on Senate Appropriations, backs earmarks including a $950,000 nature education center in Moss Point, Miss. He defends earmarks.” \"You have to take these on a case-by-case basis,\" he said. \"A lot of these projects are justified.\" “Rep. Ralph Hall, R-Texas, included $142,500 for emergency repairs to the Sam Rayburn Library and Museum in Austin, Texas. Sen. John Ensign, R-Nev., joined state colleagues to include $1.425 million for Nevada \"statewide bus facilities.\" The top two Republicans on Congress' money committees also inserted local projects.” IF IF IF... The bottom line is the GOP is NOT in power.", 
        "reply": " True, the GOPis not in power. So they make an issue of earmarks and then place thousands of earmarks into the spending bill. That is one reason they have so few elected officials in Congress – they say one thing and do another. “Spending is now out of control and will bankrupt the next generation” is what Republicans are saying now. They leave out the fact that n the twelve years that the Republicans held majorities in Congress (1994 to 2006), six of which there was a Republican president, the national dept increased by $4.075 trillion – almost doubling what it was when they came to power. Democrats don’t try to be fiscally responsible, they tax and spend. Republicans say they are fiscally responsible, but borrow and spend. Which is worse?", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:11:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new. OK here is the frothing headline: quote: Omnibus Spending Bill Loaded With $MILLIONS Of Earmarks From President Obama, Top Cabinet Members Now let me see if I got this straight, $410 billion dollar bill, and the frothing talking heads say: \"$MILLIONS of earmarks\". Malkin herself says it equals 45 BILLION. Well if it is in fact millions and not billions, you got yea another non story. If it is $5 billion, that would amount to about 1%, hardly worth frothing over. I bet DoD loses that much every month.", 
        "intTime": 20090302, 
        "postID": 52, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. Irrelevant examples. Both the benefits for Filipinos and the AMT patch were in the stimulus bill. Has nothing to do with the Omnibus bill under discussion. However ... the question that should be asked is why the Congress did not pass legislation last year (or in prior years) that addressed both these issues through the normal budget vetting process instead of addressing them through a sleight of hand addition to a bill in which they do not belong. Neither issue is new.", 
        "reply": " OK here is the frothing headline: quote: Omnibus Spending Bill Loaded With $MILLIONS Of Earmarks From President Obama, Top Cabinet Members Now let me see if I got this straight, $410 billion dollar bill, and the frothing talking heads say: \"$MILLIONS of earmarks\". Malkin herself says it equals 45 BILLION. Well if it is in fact millions and not billions, you got yea another non story. If it is $5 billion, that would amount to about 1%, hardly worth frothing over. I bet DoD loses that much every month.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:23:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next...", 
        "intTime": 20090302, 
        "postID": 53, 
        "quote": "Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is.", 
        "reply": " They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next...", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:34:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next... So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****.", 
        "intTime": 20090302, 
        "postID": 54, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next...", 
        "reply": " So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:36:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "intTime": 20090302, 
        "postID": 55, 
        "quote": "Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\"", 
        "reply": "An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ...  Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:54:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next... So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****. Why was the Filipino vet issue put on the economic giveaway bill? Pork is bad. And as I pinted out that benefits are theri for those vets so why more money on a bill that has nothing to do with it. How bout the swamp mouse in san fran? money to non-profit groups? how bout tatoo removal on the omnibus bill. and pointing out 1 earmark that may or may not be legit does not validate the massive amounts of BS earmarks on all these bills by these idiots in congress. And I say you would probably be an expert on shiite. But in this case you're wrong.", 
        "intTime": 20090302, 
        "postID": 56, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: I suppose given Filipino veterans the benefits they were promised from WWII are a wasteful earmarks, or the indexing of the AMT is another. So please tell those affected how wasteful it is. They were given benefits promised from ww2. I know because I provided support to them back in 92 while stationed in HI, where they were arriving and my wifes uncle was one. And you should look at the VA site, itstates what benes they get. Besides it didnt belong on a stimulus bill, but on a va bill or defense bill at worse. next... So the two I listed are called pork by you and the pundits(regardless of what bill they are in), and you say pork is bad. I say you are full of ****.", 
        "reply": " Why was the Filipino vet issue put on the economic giveaway bill? Pork is bad. And as I pinted out that benefits are theri for those vets so why more money on a bill that has nothing to do with it. How bout the swamp mouse in san fran? money to non-profit groups? how bout tatoo removal on the omnibus bill. and pointing out 1 earmark that may or may not be legit does not validate the massive amounts of BS earmarks on all these bills by these idiots in congress. And I say you would probably be an expert on shiite. But in this case you're wrong.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 10:56:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out. Some people cant get it thru their heads that those sites have been around and people go to them. I sited them earlier on other posts in the past and have gone to this and others, under a republican adm too. But hey I am just mean co'z his majesty is in office.", 
        "intTime": 20090302, 
        "postID": 57, 
        "quote": "Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "reply": " Some people cant get it thru their heads that those sites have been around and people go to them. I sited them earlier on other posts in the past and have gone to this and others, under a republican adm too. But hey I am just mean co'z his majesty is in office.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:02:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out. OK $14 billion and what was the total budget? More majoring in the minors. DoD loses that every month or so, don't see you screaming about that.", 
        "intTime": 20090302, 
        "postID": 58, 
        "quote": "Originally posted by I_M_Qwerty: An excellent source for information on earmarks is Taxpayers for Common Sense, a non-partisan group that is frequently cited by the New York Times among many others. On the Omnibus Bill ... quote: Taxpayers for Common Sense (TCS) has been going through the omnibus to pull together a total number of earmarks and dollar amount. TCS found 8,570 disclosed earmarks worth $7.7 billion. When you add the $6.6 billion in disclosed earmarks that were in the three FY09 spending bills that passed in the fall (Defense, DHS, MilCon/VA) you end up with $14.3 billion worth of disclosed earmarks in FY09. The apples-to-apples comparison from 2008 yielded $14.8 billion, so there was a $500 million reduction in disclosed earmarks between FY08 and FY09. A big disparity between TCS’s number and the Committee number ($3.8 billion) is that the Appropriations Committee chooses not to include earmarks from project-based accounts in their totals, despite the fact that they were not requested by the administration. For example, the Corps of Engineers budget is made up of hundreds of projects that add up to the agency total. These numbers are not included in the committee totals or in their reduction predictions. In addition, the committee ascribes many operations and maintenance projects to the President when they were not actually requested as part of the FY09 budget. <more> \"http://www.taxpayer.net/resources.php?category=&type=Project&proj_id=1961&action=Headlines By TCS\" Further, TCS gives lie to the assertion by some that earmarks are readily discernable in the bills as viewable at Thomas ... quote: Finally, we can only provide numbers for disclosed earmarks. These are the projects with a member’s name next to them. However, TCS has been doing earmark analysis for many years and we found a lot of “looks like earmark, talks like an earmark” provisions in the bill that we tally as “undisclosed” earmarks, so our totals are apple-to-apple with previous years. For instance, last year TCS found billions ($3.5B) of undisclosed earmarks to go with the earmarks disclosed by the committees ($14.8B). This number will take a lot more digging to figure out.", 
        "reply": " OK $14 billion and what was the total budget? More majoring in the minors. DoD loses that every month or so, don't see you screaming about that.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:03:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage.", 
        "intTime": 20090302, 
        "postID": 59, 
        "quote": "", 
        "reply": "Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:11:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage. LOL ... by your measure, nor are CEO salaries, comp packages, and bonuses.", 
        "intTime": 20090302, 
        "postID": 60, 
        "quote": "Originally posted by FrJohn1123: Let me help you out. The 2009 budget will exceed $3 trillion. Given that total, $14 billion equals less than 1/2 of 1%. Hardly worth the press coverage.", 
        "reply": " LOL ... by your measure, nor are CEO salaries, comp packages, and bonuses.", 
        "threadID": "409192893_5940042612001", 
        "time": "2009-03-02 11:18:00", 
        "title": "President and His Inner Circle Have Earmarks in Omnibus", 
        "userID": "I_M_Qwerty"
    }
]