[
    {
        "content": "Isn't it great to see we are being sold out even moreso by our Govt when it comes to illegals. If anyone does know Solis background they wouldnt be surprised Labor Secretary Says Making Sure Undocumented Workers Get Paid Will Be Priority Wednesday, April 29, 2009 By Victor Epstein, Associated Press 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=47381' Paramus, N.J. (AP) - Ensuring undocumented workers get paid and improving worker safety are two priorities for the Department of Labor, its first Hispanic secretary said Wednesday. Hilda Solis visited a green jobs event in northern New Jersey, where she said unpaid wages will continue to be a problem for day laborers until comprehensive immigration reform is undertaken at the federal level. But she cautioned that stabilizing the economy and health care reform must come first for President Barack Obama's administration. Day laborers, many of them Hispanic, are sometimes denied payment and are afraid to press for wages when they're in the country illegally. Solis, who took office Feb. 24, said she takes this \"very seriously.\" Thats the chance they take for being here illegally,They can go home. \"We're going to have people going out in the field and investigating,\" Solis said, noting that she differs from her predecessor, Elaine Chao, in this approach. \"We're going to be more robust in this area and also with respect to OSHA.\"Yeh spend taxpayer to make sure illegals get paid. Meanwhile your nitwit counterpart in DHS doesnt investigate Illegals or enforece squat <edit> Solis spoke privately with a group of local Hispanic leaders, including Perth Amboy Mayor Wilda Diaz, about workplace safety before the event. \"In terms of Latinos in the work force, we're probably the ones that are faced with the most fatalities and injuries,\" Solis told them, citing the many Hispanics in the construction industry. Hispanics are 20% of construction but they get injured more than anyone else, why? Solis said the national discussion of comprehensive immigration reform will begin this summer. She said goals include eliminating the underground economy that has sprouted up around illegal workers and preventing the separation of families that include children who are U.S. citizens and others who have not been granted legal entry. Via La Raza~! We knew it was coming Solis and New Jersey Gov. Jon Corzine toured the Paramus training academy of Local 164 of the International Brotherhood of Electrical Workers, which offers instruction in solar panel and wind turbine installation. Solis lauded Corzine for his leadership role in increasing solar array installations in New Jersey and in pursuing federal funds for the unemployed. New Jersey's master energy plan calls for the creation of 20,000 green jobs by 2020. Unemployment in the Garden State rose for the 14th straight month in March to 8.2 percent, less than the U.S. rate of 8.5 percent. \"The most important thing we have to do is lift the overall economy because a rising tide lifts all boats,\" Corzine said. Solis and Corzine also met with seven unemployed workers. Solis told them that green jobs and the health care and IT industries will be leaders in job creation in coming years. The workers told them that it's hard to make ends meet with an unemployment check in New Jersey because of the high cost of living. The median household income for a family of four in New Jersey is $94,441, according to the U.S. Department of Health and Human Services. Solis is at least the second high-level member of the Obama administration in the past month to appear with Corzine, who trailed Republican gubernatorial challenger Chris Christie in a Monmouth University/Gannett New Jersey poll released Wednesday. EPA Administrator Lisa Jackson held a news conference with Corzine on ship pollution March 30 in Newark.", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "Isn't it great to see we are being sold out even moreso by our Govt when it comes to illegals. If anyone does know Solis background they wouldnt be surprised Labor Secretary Says Making Sure Undocumented Workers Get Paid Will Be Priority Wednesday, April 29, 2009 By Victor Epstein, Associated Press 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=47381' Paramus, N.J. (AP) - Ensuring undocumented workers get paid and improving worker safety are two priorities for the Department of Labor, its first Hispanic secretary said Wednesday. Hilda Solis visited a green jobs event in northern New Jersey, where she said unpaid wages will continue to be a problem for day laborers until comprehensive immigration reform is undertaken at the federal level. But she cautioned that stabilizing the economy and health care reform must come first for President Barack Obama's administration. Day laborers, many of them Hispanic, are sometimes denied payment and are afraid to press for wages when they're in the country illegally. Solis, who took office Feb. 24, said she takes this \"very seriously.\" Thats the chance they take for being here illegally,They can go home. \"We're going to have people going out in the field and investigating,\" Solis said, noting that she differs from her predecessor, Elaine Chao, in this approach. \"We're going to be more robust in this area and also with respect to OSHA.\"Yeh spend taxpayer to make sure illegals get paid. Meanwhile your nitwit counterpart in DHS doesnt investigate Illegals or enforece squat <edit> Solis spoke privately with a group of local Hispanic leaders, including Perth Amboy Mayor Wilda Diaz, about workplace safety before the event. \"In terms of Latinos in the work force, we're probably the ones that are faced with the most fatalities and injuries,\" Solis told them, citing the many Hispanics in the construction industry. Hispanics are 20% of construction but they get injured more than anyone else, why? Solis said the national discussion of comprehensive immigration reform will begin this summer. She said goals include eliminating the underground economy that has sprouted up around illegal workers and preventing the separation of families that include children who are U.S. citizens and others who have not been granted legal entry. Via La Raza~! We knew it was coming Solis and New Jersey Gov. Jon Corzine toured the Paramus training academy of Local 164 of the International Brotherhood of Electrical Workers, which offers instruction in solar panel and wind turbine installation. Solis lauded Corzine for his leadership role in increasing solar array installations in New Jersey and in pursuing federal funds for the unemployed. New Jersey's master energy plan calls for the creation of 20,000 green jobs by 2020. Unemployment in the Garden State rose for the 14th straight month in March to 8.2 percent, less than the U.S. rate of 8.5 percent. \"The most important thing we have to do is lift the overall economy because a rising tide lifts all boats,\" Corzine said. Solis and Corzine also met with seven unemployed workers. Solis told them that green jobs and the health care and IT industries will be leaders in job creation in coming years. The workers told them that it's hard to make ends meet with an unemployment check in New Jersey because of the high cost of living. The median household income for a family of four in New Jersey is $94,441, according to the U.S. Department of Health and Human Services. Solis is at least the second high-level member of the Obama administration in the past month to appear with Corzine, who trailed Republican gubernatorial challenger Chris Christie in a Monmouth University/Gannett New Jersey poll released Wednesday. EPA Administrator Lisa Jackson held a news conference with Corzine on ship pollution March 30 in Newark.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 05:28:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 05:53:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "samh32"
    }, 
    {
        "content": "", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 05:56:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "Hispanics are 20% of construction but they get injured more than anyone else, why?", 
        "reply": " Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 06:22:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant.", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "", 
        "reply": "Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 06:29:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "", 
        "reply": "Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 07:39:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid. Also because the employers willing to break the law to employ illegals are also willing to break the laws about safety. The employers also know the illegals are less likely to report unsafe conditions.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "reply": " Also because the employers willing to break the law to employ illegals are also willing to break the laws about safety. The employers also know the illegals are less likely to report unsafe conditions.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 08:45:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "", 
        "reply": "I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 08:51:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "As long as they lay off thousands of auto workers, I'm all for it. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "", 
        "reply": "As long as they lay off thousands of auto workers, I'm all for it. \"The World's Finest\"", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:01:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name.", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "", 
        "reply": "I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:23:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are.", 
        "reply": " Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:25:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name. Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke..", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name.", 
        "reply": " Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke..", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:30:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Have you not been following the news?", 
        "intTime": 20090430, 
        "postID": 13, 
        "quote": "Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "reply": " Have you not been following the news?", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:33:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office.", 
        "intTime": 20090430, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "reply": " I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 10:06:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Yup, and that's comming back to bite us. So since it's Bush's fault all illegals will get amnesty and a path to citizenship. How will we deal with the next batch of illegals? They will get amnesty and be given a path to citizenship. See how simple it is to surrender.", 
        "intTime": 20090430, 
        "postID": 15, 
        "quote": "", 
        "reply": "Yup, and that's comming back to bite us. So since it's Bush's fault all illegals will get amnesty and a path to citizenship. How will we deal with the next batch of illegals? They will get amnesty and be given a path to citizenship. See how simple it is to surrender.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 10:23:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid. Maybe its because they No habla....", 
        "intTime": 20090430, 
        "postID": 16, 
        "quote": "Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "reply": " Maybe its because they No habla....", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:27:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? There were raids then, there will be no raids now.", 
        "intTime": 20090430, 
        "postID": 17, 
        "quote": "Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "reply": " There were raids then, there will be no raids now.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:30:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office. Since Eisenhower, has anyone done anything about the border?", 
        "intTime": 20090430, 
        "postID": 18, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office.", 
        "reply": " Since Eisenhower, has anyone done anything about the border?", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:39:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name. Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke.. What exactly am I \"slithering and oozing\" around? And what \"drama?\" Alright, let me see if I can refute your impressively abstract and meandering counter. There is a difference between a terrorist and an illegal immigrant (admittedly, terrorists are usually illegal immigrants but the reverse is very rarely true). Just like there is a difference between a serial killer and a compulsive shoplifter. The punishment and treatment of one is not appropriate to the other. Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things. How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? The same way that providing aid and comfort to criminals is! If you want to say that Jeffrey Daumer or Osama bin Laden are not people, I will not argue. But people do not stop being people until they get to the extreme end of the spectrum. Illegal immigration just does not cut it. By the way, was \"Liberals are a damn joke\" a poke at me, or just how you end conversations? Either way its quite endearing, I was just curious.", 
        "intTime": 20090430, 
        "postID": 19, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name. Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke..", 
        "reply": " What exactly am I \"slithering and oozing\" around? And what \"drama?\" Alright, let me see if I can refute your impressively abstract and meandering counter. There is a difference between a terrorist and an illegal immigrant (admittedly, terrorists are usually illegal immigrants but the reverse is very rarely true). Just like there is a difference between a serial killer and a compulsive shoplifter. The punishment and treatment of one is not appropriate to the other. Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things. How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? The same way that providing aid and comfort to criminals is! If you want to say that Jeffrey Daumer or Osama bin Laden are not people, I will not argue. But people do not stop being people until they get to the extreme end of the spectrum. Illegal immigration just does not cut it. By the way, was \"Liberals are a damn joke\" a poke at me, or just how you end conversations? Either way its quite endearing, I was just curious.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:47:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things. But then you go on and contradict yourself. Our justice system is... they are to be deported immediately AFTER they have been screened to ensure they are not wanted for crimes. I guess we should use the super secret double probation option on them. I actually concur with what Pres Bush did for one reason. I reflected on the day that Elian Gonzales was basically ripped from his families arms to be sent back to Cuba. The picture of the ATF dude in full battle rattle with an MP-5 up close and personal...He was doing what he was ordered to do but... I was not proud of our country that day. To suddenly deport 20 million would be a replay of that scene again and again with the kids caught in the middle. I am all for business but I do not ever support American business using illegals. If they showed due process to determine legal status then they are blameless. If not or knowingly promote the highering of illegals they should be fined. Not draconian the first couple of times but enough to make them think. As the fines increase no more illegals hired. But the government has to help to ensure they are not illegal. To have the fines reset back to zero the company would have to be spectacular for a while. I also want a guest worker program...all that juicy tax money to be had with the knowledge of who the heck the people are. The Soviets tried a fence patrolled by dogs that would shred a human with but one word. Guard posts every so often with some as I am told having liquid cooled machine guns mounted. Then continual roving armed guards with AK's. A lot of \"Papers please\". Still people got through. We need to control the flow and we have to remove the handouts as best we can to reduce by a huge number the illegals. If we got 19 million to go home and 1 million are left that is a pretty good start....-IMHO", 
        "intTime": 20090430, 
        "postID": 20, 
        "quote": "Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things.", 
        "reply": " But then you go on and contradict yourself. Our justice system is... they are to be deported immediately AFTER they have been screened to ensure they are not wanted for crimes. I guess we should use the super secret double probation option on them. I actually concur with what Pres Bush did for one reason. I reflected on the day that Elian Gonzales was basically ripped from his families arms to be sent back to Cuba. The picture of the ATF dude in full battle rattle with an MP-5 up close and personal...He was doing what he was ordered to do but... I was not proud of our country that day. To suddenly deport 20 million would be a replay of that scene again and again with the kids caught in the middle. I am all for business but I do not ever support American business using illegals. If they showed due process to determine legal status then they are blameless. If not or knowingly promote the highering of illegals they should be fined. Not draconian the first couple of times but enough to make them think. As the fines increase no more illegals hired. But the government has to help to ensure they are not illegal. To have the fines reset back to zero the company would have to be spectacular for a while. I also want a guest worker program...all that juicy tax money to be had with the knowledge of who the heck the people are. The Soviets tried a fence patrolled by dogs that would shred a human with but one word. Guard posts every so often with some as I am told having liquid cooled machine guns mounted. Then continual roving armed guards with AK's. A lot of \"Papers please\". Still people got through. We need to control the flow and we have to remove the handouts as best we can to reduce by a huge number the illegals. If we got 19 million to go home and 1 million are left that is a pretty good start....-IMHO", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:14:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers.", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "reply": " Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:53:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system. This message has been edited. Last edited by: rayld2, Thu 30 April 2009 09:21 PM", 
        "intTime": 20090430, 
        "postID": 22, 
        "quote": "Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are.", 
        "reply": " BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system. This message has been edited. Last edited by: rayld2, Thu 30 April 2009 09:21 PM", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:57:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses", 
        "intTime": 20090430, 
        "postID": 23, 
        "quote": "Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers", 
        "reply": " You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:59:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "ACR26"
    }, 
    {
        "content": "I think if we owe somebody or some country money we should pay them. Except if that somebody or some country commits a serious crime against us. I also believe that our grand children and our kids should have to work the rest of their lives and pay in interest the $120.000 that Obama and Bush have already cost this country. If we cared we would have stopped it. But we sat by and did nothing.", 
        "intTime": 20090430, 
        "postID": 24, 
        "quote": "", 
        "reply": "I think if we owe somebody or some country money we should pay them. Except if that somebody or some country commits a serious crime against us. I also believe that our grand children and our kids should have to work the rest of their lives and pay in interest the $120.000 that Obama and Bush have already cost this country. If we cared we would have stopped it. But we sat by and did nothing.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 15:03:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid. Or maybe it is because they can then sue.", 
        "intTime": 20090430, 
        "postID": 25, 
        "quote": "Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "reply": " Or maybe it is because they can then sue.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 17:44:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses YOU are leaving out that it was the REPUBLICAN Bush admin that stonewalled implementing a worker check system that met the legal requirements. For example they kept reintroducing the same system that had been turned down by the courts WITH NO CHANGES starting another round of court fights and delays. The Republicans spent MORE on repeatedly introducing a legally faulty system and defending it in court than it would have cost to implemented the complete system and delayed any system for years.", 
        "intTime": 20090430, 
        "postID": 26, 
        "quote": "Originally posted by ACR26: quote: Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses", 
        "reply": " YOU are leaving out that it was the REPUBLICAN Bush admin that stonewalled implementing a worker check system that met the legal requirements. For example they kept reintroducing the same system that had been turned down by the courts WITH NO CHANGES starting another round of court fights and delays. The Republicans spent MORE on repeatedly introducing a legally faulty system and defending it in court than it would have cost to implemented the complete system and delayed any system for years.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 21:26:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant. Exactly correct It does work so if they wont deport them make them less desirable to be hired. Works all the time on prevailing rate jobs when the employers are caught and have to pay all the back wages plus benefits. Theres more than one way to skin a cat.", 
        "intTime": 20090501, 
        "postID": 27, 
        "quote": "Originally posted by bill_kananen: Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant.", 
        "reply": " Exactly correct It does work so if they wont deport them make them less desirable to be hired. Works all the time on prevailing rate jobs when the employers are caught and have to pay all the back wages plus benefits. Theres more than one way to skin a cat.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 01:05:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "john2x"
    }, 
    {
        "content": "step one. Make sure the company pays them for their back wages. step two. Fine company heavily for hiring illegal immigrants. step three. Deport the illegal immigrant. Why things like this become politicized is beyond me. It's all pretty cut and dried. It's illegal to not pay someone you hired just because you don't don't feel like paying them. It's illegal to hire illegal immigrants. and it's illegal to....be here illegally. Barney Miller could solve this in under 22 minutes.", 
        "intTime": 20090501, 
        "postID": 28, 
        "quote": "", 
        "reply": "step one. Make sure the company pays them for their back wages. step two. Fine company heavily for hiring illegal immigrants. step three. Deport the illegal immigrant. Why things like this become politicized is beyond me. It's all pretty cut and dried. It's illegal to not pay someone you hired just because you don't don't feel like paying them. It's illegal to hire illegal immigrants. and it's illegal to....be here illegally. Barney Miller could solve this in under 22 minutes.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 01:37:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? There were raids then, there will be no raids now. I disagree. Name a few, please? Under the CLINTON administration, I saw MANY raids on illegal camps in my San Diego County town. The Border Patrol was constantly closing off streets to enact these. It was a pain in the ass, and I'd have to drive an extra three or four miles to get home. But the law was being enforced, so I sucked it up. Under Bush: nothing. ZERO. ZILCH. So far under Obama: nothing. ZERO. ZILCH. Time will tell.", 
        "intTime": 20090501, 
        "postID": 29, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? There were raids then, there will be no raids now.", 
        "reply": " I disagree. Name a few, please? Under the CLINTON administration, I saw MANY raids on illegal camps in my San Diego County town. The Border Patrol was constantly closing off streets to enact these. It was a pain in the ass, and I'd have to drive an extra three or four miles to get home. But the law was being enforced, so I sucked it up. Under Bush: nothing. ZERO. ZILCH. So far under Obama: nothing. ZERO. ZILCH. Time will tell.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 10:03:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system. Why are you directing this towards me? I CLEARLY WROTE BUSH DIDN'T DO ENOUGH. Is it because of my comment about the current administration? If so, need to get over it because it's true, they aren't doing a thing about it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 30, 
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system.", 
        "reply": " Why are you directing this towards me? I CLEARLY WROTE BUSH DIDN'T DO ENOUGH. Is it because of my comment about the current administration? If so, need to get over it because it's true, they aren't doing a thing about it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 10:12:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "L0A1"
    }, 
    {
        "content": "Isn't it great to see we are being sold out even moreso by our Govt when it comes to illegals. If anyone does know Solis background they wouldnt be surprised Labor Secretary Says Making Sure Undocumented Workers Get Paid Will Be Priority Wednesday, April 29, 2009 By Victor Epstein, Associated Press 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=47381' Paramus, N.J. (AP) - Ensuring undocumented workers get paid and improving worker safety are two priorities for the Department of Labor, its first Hispanic secretary said Wednesday. Hilda Solis visited a green jobs event in northern New Jersey, where she said unpaid wages will continue to be a problem for day laborers until comprehensive immigration reform is undertaken at the federal level. But she cautioned that stabilizing the economy and health care reform must come first for President Barack Obama's administration. Day laborers, many of them Hispanic, are sometimes denied payment and are afraid to press for wages when they're in the country illegally. Solis, who took office Feb. 24, said she takes this \"very seriously.\" Thats the chance they take for being here illegally,They can go home. \"We're going to have people going out in the field and investigating,\" Solis said, noting that she differs from her predecessor, Elaine Chao, in this approach. \"We're going to be more robust in this area and also with respect to OSHA.\"Yeh spend taxpayer to make sure illegals get paid. Meanwhile your nitwit counterpart in DHS doesnt investigate Illegals or enforece squat <edit> Solis spoke privately with a group of local Hispanic leaders, including Perth Amboy Mayor Wilda Diaz, about workplace safety before the event. \"In terms of Latinos in the work force, we're probably the ones that are faced with the most fatalities and injuries,\" Solis told them, citing the many Hispanics in the construction industry. Hispanics are 20% of construction but they get injured more than anyone else, why? Solis said the national discussion of comprehensive immigration reform will begin this summer. She said goals include eliminating the underground economy that has sprouted up around illegal workers and preventing the separation of families that include children who are U.S. citizens and others who have not been granted legal entry. Via La Raza~! We knew it was coming Solis and New Jersey Gov. Jon Corzine toured the Paramus training academy of Local 164 of the International Brotherhood of Electrical Workers, which offers instruction in solar panel and wind turbine installation. Solis lauded Corzine for his leadership role in increasing solar array installations in New Jersey and in pursuing federal funds for the unemployed. New Jersey's master energy plan calls for the creation of 20,000 green jobs by 2020. Unemployment in the Garden State rose for the 14th straight month in March to 8.2 percent, less than the U.S. rate of 8.5 percent. \"The most important thing we have to do is lift the overall economy because a rising tide lifts all boats,\" Corzine said. Solis and Corzine also met with seven unemployed workers. Solis told them that green jobs and the health care and IT industries will be leaders in job creation in coming years. The workers told them that it's hard to make ends meet with an unemployment check in New Jersey because of the high cost of living. The median household income for a family of four in New Jersey is $94,441, according to the U.S. Department of Health and Human Services. Solis is at least the second high-level member of the Obama administration in the past month to appear with Corzine, who trailed Republican gubernatorial challenger Chris Christie in a Monmouth University/Gannett New Jersey poll released Wednesday. EPA Administrator Lisa Jackson held a news conference with Corzine on ship pollution March 30 in Newark.", 
        "intTime": 20090430, 
        "postID": 31, 
        "quote": "", 
        "reply": "Isn't it great to see we are being sold out even moreso by our Govt when it comes to illegals. If anyone does know Solis background they wouldnt be surprised Labor Secretary Says Making Sure Undocumented Workers Get Paid Will Be Priority Wednesday, April 29, 2009 By Victor Epstein, Associated Press 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=47381' Paramus, N.J. (AP) - Ensuring undocumented workers get paid and improving worker safety are two priorities for the Department of Labor, its first Hispanic secretary said Wednesday. Hilda Solis visited a green jobs event in northern New Jersey, where she said unpaid wages will continue to be a problem for day laborers until comprehensive immigration reform is undertaken at the federal level. But she cautioned that stabilizing the economy and health care reform must come first for President Barack Obama's administration. Day laborers, many of them Hispanic, are sometimes denied payment and are afraid to press for wages when they're in the country illegally. Solis, who took office Feb. 24, said she takes this \"very seriously.\" Thats the chance they take for being here illegally,They can go home. \"We're going to have people going out in the field and investigating,\" Solis said, noting that she differs from her predecessor, Elaine Chao, in this approach. \"We're going to be more robust in this area and also with respect to OSHA.\"Yeh spend taxpayer to make sure illegals get paid. Meanwhile your nitwit counterpart in DHS doesnt investigate Illegals or enforece squat <edit> Solis spoke privately with a group of local Hispanic leaders, including Perth Amboy Mayor Wilda Diaz, about workplace safety before the event. \"In terms of Latinos in the work force, we're probably the ones that are faced with the most fatalities and injuries,\" Solis told them, citing the many Hispanics in the construction industry. Hispanics are 20% of construction but they get injured more than anyone else, why? Solis said the national discussion of comprehensive immigration reform will begin this summer. She said goals include eliminating the underground economy that has sprouted up around illegal workers and preventing the separation of families that include children who are U.S. citizens and others who have not been granted legal entry. Via La Raza~! We knew it was coming Solis and New Jersey Gov. Jon Corzine toured the Paramus training academy of Local 164 of the International Brotherhood of Electrical Workers, which offers instruction in solar panel and wind turbine installation. Solis lauded Corzine for his leadership role in increasing solar array installations in New Jersey and in pursuing federal funds for the unemployed. New Jersey's master energy plan calls for the creation of 20,000 green jobs by 2020. Unemployment in the Garden State rose for the 14th straight month in March to 8.2 percent, less than the U.S. rate of 8.5 percent. \"The most important thing we have to do is lift the overall economy because a rising tide lifts all boats,\" Corzine said. Solis and Corzine also met with seven unemployed workers. Solis told them that green jobs and the health care and IT industries will be leaders in job creation in coming years. The workers told them that it's hard to make ends meet with an unemployment check in New Jersey because of the high cost of living. The median household income for a family of four in New Jersey is $94,441, according to the U.S. Department of Health and Human Services. Solis is at least the second high-level member of the Obama administration in the past month to appear with Corzine, who trailed Republican gubernatorial challenger Chris Christie in a Monmouth University/Gannett New Jersey poll released Wednesday. EPA Administrator Lisa Jackson held a news conference with Corzine on ship pollution March 30 in Newark.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 05:28:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "", 
        "intTime": 20090430, 
        "postID": 32, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 05:53:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "samh32"
    }, 
    {
        "content": "", 
        "intTime": 20090430, 
        "postID": 33, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 05:56:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "intTime": 20090430, 
        "postID": 34, 
        "quote": "Hispanics are 20% of construction but they get injured more than anyone else, why?", 
        "reply": " Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 06:22:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant.", 
        "intTime": 20090430, 
        "postID": 35, 
        "quote": "", 
        "reply": "Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 06:29:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "intTime": 20090430, 
        "postID": 36, 
        "quote": "", 
        "reply": "Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 07:39:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid. Also because the employers willing to break the law to employ illegals are also willing to break the laws about safety. The employers also know the illegals are less likely to report unsafe conditions.", 
        "intTime": 20090430, 
        "postID": 37, 
        "quote": "Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "reply": " Also because the employers willing to break the law to employ illegals are also willing to break the laws about safety. The employers also know the illegals are less likely to report unsafe conditions.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 08:45:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "intTime": 20090430, 
        "postID": 38, 
        "quote": "", 
        "reply": "I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 08:51:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "As long as they lay off thousands of auto workers, I'm all for it. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 39, 
        "quote": "", 
        "reply": "As long as they lay off thousands of auto workers, I'm all for it. \"The World's Finest\"", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:01:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name.", 
        "intTime": 20090430, 
        "postID": 40, 
        "quote": "", 
        "reply": "I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:23:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090430, 
        "postID": 41, 
        "quote": "Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are.", 
        "reply": " Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:25:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name. Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke..", 
        "intTime": 20090430, 
        "postID": 42, 
        "quote": "Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name.", 
        "reply": " Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke..", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:30:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Have you not been following the news?", 
        "intTime": 20090430, 
        "postID": 43, 
        "quote": "Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "reply": " Have you not been following the news?", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 09:33:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office.", 
        "intTime": 20090430, 
        "postID": 44, 
        "quote": "Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "reply": " I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 10:06:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Yup, and that's comming back to bite us. So since it's Bush's fault all illegals will get amnesty and a path to citizenship. How will we deal with the next batch of illegals? They will get amnesty and be given a path to citizenship. See how simple it is to surrender.", 
        "intTime": 20090430, 
        "postID": 45, 
        "quote": "", 
        "reply": "Yup, and that's comming back to bite us. So since it's Bush's fault all illegals will get amnesty and a path to citizenship. How will we deal with the next batch of illegals? They will get amnesty and be given a path to citizenship. See how simple it is to surrender.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 10:23:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid. Maybe its because they No habla....", 
        "intTime": 20090430, 
        "postID": 46, 
        "quote": "Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "reply": " Maybe its because they No habla....", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:27:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? There were raids then, there will be no raids now.", 
        "intTime": 20090430, 
        "postID": 47, 
        "quote": "Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore?", 
        "reply": " There were raids then, there will be no raids now.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:30:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office. Since Eisenhower, has anyone done anything about the border?", 
        "intTime": 20090430, 
        "postID": 48, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... I found it ironic how former President Bush was so buddy budy with former Mexican President Fox and didn’t do anything about the border during his eight years in office.", 
        "reply": " Since Eisenhower, has anyone done anything about the border?", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:39:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name. Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke.. What exactly am I \"slithering and oozing\" around? And what \"drama?\" Alright, let me see if I can refute your impressively abstract and meandering counter. There is a difference between a terrorist and an illegal immigrant (admittedly, terrorists are usually illegal immigrants but the reverse is very rarely true). Just like there is a difference between a serial killer and a compulsive shoplifter. The punishment and treatment of one is not appropriate to the other. Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things. How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? The same way that providing aid and comfort to criminals is! If you want to say that Jeffrey Daumer or Osama bin Laden are not people, I will not argue. But people do not stop being people until they get to the extreme end of the spectrum. Illegal immigration just does not cut it. By the way, was \"Liberals are a damn joke\" a poke at me, or just how you end conversations? Either way its quite endearing, I was just curious.", 
        "intTime": 20090430, 
        "postID": 49, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by cosmicfish: I am not in favor of illegal immigration. These are people who have broken the law, and need to be deported. Those citizens and corporations which aided them or brought them here need to be held criminally responsible. There are some issues with children born in this country - but that's a seperate issue. The fact that someone is here illegally does not mean that they are slave labor. Many of them do not know what they are getting into when they come here, and while they are here criminally, they are still people. Companies that endanger their lives should be held responsible, just as if they endangered a citizen's life. Companies that refuse to pay them are robbing them - yes it is a crime to steal from another criminal. Worse, immigrants without money are unable to escape even back to their own country - they truly become slaves in all but name. Sure, the whole \"They are people,\" drama line comes out...well in the case, the terrorists who behead, maim, and slaughter thousands of people including Americans are not worthy of our justice system.....Whats the counter argument? How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? You want to slither and ooze your way around the issue fine by me. Liberals are a damn joke..", 
        "reply": " What exactly am I \"slithering and oozing\" around? And what \"drama?\" Alright, let me see if I can refute your impressively abstract and meandering counter. There is a difference between a terrorist and an illegal immigrant (admittedly, terrorists are usually illegal immigrants but the reverse is very rarely true). Just like there is a difference between a serial killer and a compulsive shoplifter. The punishment and treatment of one is not appropriate to the other. Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things. How does providng aid and comfort to illegal immigrants \"upholding US Values\"?? The same way that providing aid and comfort to criminals is! If you want to say that Jeffrey Daumer or Osama bin Laden are not people, I will not argue. But people do not stop being people until they get to the extreme end of the spectrum. Illegal immigration just does not cut it. By the way, was \"Liberals are a damn joke\" a poke at me, or just how you end conversations? Either way its quite endearing, I was just curious.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 12:47:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things. But then you go on and contradict yourself. Our justice system is... they are to be deported immediately AFTER they have been screened to ensure they are not wanted for crimes. I guess we should use the super secret double probation option on them. I actually concur with what Pres Bush did for one reason. I reflected on the day that Elian Gonzales was basically ripped from his families arms to be sent back to Cuba. The picture of the ATF dude in full battle rattle with an MP-5 up close and personal...He was doing what he was ordered to do but... I was not proud of our country that day. To suddenly deport 20 million would be a replay of that scene again and again with the kids caught in the middle. I am all for business but I do not ever support American business using illegals. If they showed due process to determine legal status then they are blameless. If not or knowingly promote the highering of illegals they should be fined. Not draconian the first couple of times but enough to make them think. As the fines increase no more illegals hired. But the government has to help to ensure they are not illegal. To have the fines reset back to zero the company would have to be spectacular for a while. I also want a guest worker program...all that juicy tax money to be had with the knowledge of who the heck the people are. The Soviets tried a fence patrolled by dogs that would shred a human with but one word. Guard posts every so often with some as I am told having liquid cooled machine guns mounted. Then continual roving armed guards with AK's. A lot of \"Papers please\". Still people got through. We need to control the flow and we have to remove the handouts as best we can to reduce by a huge number the illegals. If we got 19 million to go home and 1 million are left that is a pretty good start....-IMHO", 
        "intTime": 20090430, 
        "postID": 50, 
        "quote": "Oh, and everyone is worthy of our justice system. Half the time we spend on foreign relations is convincing other countries that they should really be using ours. Yes, even under Republican Presidents, although then we often grow attached to decidedly UN-American justice systems - they can be convenient for certain things.", 
        "reply": " But then you go on and contradict yourself. Our justice system is... they are to be deported immediately AFTER they have been screened to ensure they are not wanted for crimes. I guess we should use the super secret double probation option on them. I actually concur with what Pres Bush did for one reason. I reflected on the day that Elian Gonzales was basically ripped from his families arms to be sent back to Cuba. The picture of the ATF dude in full battle rattle with an MP-5 up close and personal...He was doing what he was ordered to do but... I was not proud of our country that day. To suddenly deport 20 million would be a replay of that scene again and again with the kids caught in the middle. I am all for business but I do not ever support American business using illegals. If they showed due process to determine legal status then they are blameless. If not or knowingly promote the highering of illegals they should be fined. Not draconian the first couple of times but enough to make them think. As the fines increase no more illegals hired. But the government has to help to ensure they are not illegal. To have the fines reset back to zero the company would have to be spectacular for a while. I also want a guest worker program...all that juicy tax money to be had with the knowledge of who the heck the people are. The Soviets tried a fence patrolled by dogs that would shred a human with but one word. Guard posts every so often with some as I am told having liquid cooled machine guns mounted. Then continual roving armed guards with AK's. A lot of \"Papers please\". Still people got through. We need to control the flow and we have to remove the handouts as best we can to reduce by a huge number the illegals. If we got 19 million to go home and 1 million are left that is a pretty good start....-IMHO", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:14:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons... Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers.", 
        "intTime": 20090430, 
        "postID": 51, 
        "quote": "Originally posted by Irwin_R_Schyster: I find it ironic how the liberals shout and scream about the law when it comes to so-called \"torture\" during the Bush Administration, but are gleefully anticipating a policy that rewards people who willfully break US laws, depress US Wages, introduce criminal elements, and distort the social fabric... Morons...", 
        "reply": " Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:53:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system. This message has been edited. Last edited by: rayld2, Thu 30 April 2009 09:21 PM", 
        "intTime": 20090430, 
        "postID": 52, 
        "quote": "Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are.", 
        "reply": " BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system. This message has been edited. Last edited by: rayld2, Thu 30 April 2009 09:21 PM", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:57:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses", 
        "intTime": 20090430, 
        "postID": 53, 
        "quote": "Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers", 
        "reply": " You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 14:59:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "ACR26"
    }, 
    {
        "content": "I think if we owe somebody or some country money we should pay them. Except if that somebody or some country commits a serious crime against us. I also believe that our grand children and our kids should have to work the rest of their lives and pay in interest the $120.000 that Obama and Bush have already cost this country. If we cared we would have stopped it. But we sat by and did nothing.", 
        "intTime": 20090430, 
        "postID": 54, 
        "quote": "", 
        "reply": "I think if we owe somebody or some country money we should pay them. Except if that somebody or some country commits a serious crime against us. I also believe that our grand children and our kids should have to work the rest of their lives and pay in interest the $120.000 that Obama and Bush have already cost this country. If we cared we would have stopped it. But we sat by and did nothing.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 15:03:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid. Or maybe it is because they can then sue.", 
        "intTime": 20090430, 
        "postID": 55, 
        "quote": "Originally posted by xnavycg: quote: Hispanics are 20% of construction but they get injured more than anyone else, why? Probably because they are going to be doing the most dangerous work if they want to get paid.", 
        "reply": " Or maybe it is because they can then sue.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 17:44:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses YOU are leaving out that it was the REPUBLICAN Bush admin that stonewalled implementing a worker check system that met the legal requirements. For example they kept reintroducing the same system that had been turned down by the courts WITH NO CHANGES starting another round of court fights and delays. The Republicans spent MORE on repeatedly introducing a legally faulty system and defending it in court than it would have cost to implemented the complete system and delayed any system for years.", 
        "intTime": 20090430, 
        "postID": 56, 
        "quote": "Originally posted by ACR26: quote: Actually the only ones acting like MORONS are the ones buying into the misdirection of protect the border when the ONLY cost effective solution (in fact IMo the only workable solution) is to enforce the laws against the employers (large fines for companies and jail time for managers who know of SHOULD know about it) to reduce the demand for illegal workers You are forgetting that a. Those managers can be sued for asking. b. The government is not HELPING managers to check if they are illegal or not. I do think we need to take away the reason for them to be here in all aspects but I think the government should lead the way and do everything they can to help the businesses", 
        "reply": " YOU are leaving out that it was the REPUBLICAN Bush admin that stonewalled implementing a worker check system that met the legal requirements. For example they kept reintroducing the same system that had been turned down by the courts WITH NO CHANGES starting another round of court fights and delays. The Republicans spent MORE on repeatedly introducing a legally faulty system and defending it in court than it would have cost to implemented the complete system and delayed any system for years.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-04-30 21:26:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant. Exactly correct It does work so if they wont deport them make them less desirable to be hired. Works all the time on prevailing rate jobs when the employers are caught and have to pay all the back wages plus benefits. Theres more than one way to skin a cat.", 
        "intTime": 20090501, 
        "postID": 57, 
        "quote": "Originally posted by bill_kananen: Ignoring the loonie lefties let's look at some possibilities. Insuring the illegal aliens get paid will make them less desirable as workers. By making illegals less desirable can stop and maybe even reverse the wage erosion in the labor markets. May not be all bad. Obviously enforcement hasn't been an effective deterant.", 
        "reply": " Exactly correct It does work so if they wont deport them make them less desirable to be hired. Works all the time on prevailing rate jobs when the employers are caught and have to pay all the back wages plus benefits. Theres more than one way to skin a cat.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 01:05:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "john2x"
    }, 
    {
        "content": "step one. Make sure the company pays them for their back wages. step two. Fine company heavily for hiring illegal immigrants. step three. Deport the illegal immigrant. Why things like this become politicized is beyond me. It's all pretty cut and dried. It's illegal to not pay someone you hired just because you don't don't feel like paying them. It's illegal to hire illegal immigrants. and it's illegal to....be here illegally. Barney Miller could solve this in under 22 minutes.", 
        "intTime": 20090501, 
        "postID": 58, 
        "quote": "", 
        "reply": "step one. Make sure the company pays them for their back wages. step two. Fine company heavily for hiring illegal immigrants. step three. Deport the illegal immigrant. Why things like this become politicized is beyond me. It's all pretty cut and dried. It's illegal to not pay someone you hired just because you don't don't feel like paying them. It's illegal to hire illegal immigrants. and it's illegal to....be here illegally. Barney Miller could solve this in under 22 minutes.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 01:37:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? There were raids then, there will be no raids now. I disagree. Name a few, please? Under the CLINTON administration, I saw MANY raids on illegal camps in my San Diego County town. The Border Patrol was constantly closing off streets to enact these. It was a pain in the ass, and I'd have to drive an extra three or four miles to get home. But the law was being enforced, so I sucked it up. Under Bush: nothing. ZERO. ZILCH. So far under Obama: nothing. ZERO. ZILCH. Time will tell.", 
        "intTime": 20090501, 
        "postID": 59, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? Did the Bush administration treat this issue any differently, really? Where are the trade unions in all of this mess? Don't they have ANY clout anymore? There were raids then, there will be no raids now.", 
        "reply": " I disagree. Name a few, please? Under the CLINTON administration, I saw MANY raids on illegal camps in my San Diego County town. The Border Patrol was constantly closing off streets to enact these. It was a pain in the ass, and I'd have to drive an extra three or four miles to get home. But the law was being enforced, so I sucked it up. Under Bush: nothing. ZERO. ZILCH. So far under Obama: nothing. ZERO. ZILCH. Time will tell.", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 10:03:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system. Why are you directing this towards me? I CLEARLY WROTE BUSH DIDN'T DO ENOUGH. Is it because of my comment about the current administration? If so, need to get over it because it's true, they aren't doing a thing about it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 60, 
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: quote: Originally posted by 1WW: Some thoughts ..... If these workers actually WORKED, pay them for their labor -- then deport their asses ASAP. Why are the construction companies who hired them NOT BEING PUNISHED?? It's not being enforced by the new administration Did the Bush administration treat this issue any differently, really? Yes, they started to crack down on companies that hired them. Still the Bush Admin didn't do nearly enough either. New Administration now wants them all to become legal. Where are the trade unions in all of this mess? Don't they have ANY clout anymore? Not in right to work states, to which a lot of the border states near Mexico are. BS the Bush admin did a few SHOW raids but they did not really crack down on companies. For example in many of the raids they would check only the shift coming off work and not the shift arriving at work and VERY little has been done to the employers. Also the Bush admin stonewalled for years on implementing a LEGAL and usable worker verification system.", 
        "reply": " Why are you directing this towards me? I CLEARLY WROTE BUSH DIDN'T DO ENOUGH. Is it because of my comment about the current administration? If so, need to get over it because it's true, they aren't doing a thing about it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2710041222001", 
        "time": "2009-05-01 10:12:00", 
        "title": "Labor Secretary Says Making Sure Illegal Alien Workers Get Paid Will Be Priority", 
        "userID": "L0A1"
    }
]