[
    {
        "content": "I posted this thread last November, before Obama Derangement Syndrome was in it's full effect and before Americans came under the hostage taking hands of pirates as is the case right now. That sound you hear today is the sound of a different tune being sung.", 
        "intTime": 20090410, 
        "postID": 9, 
        "quote": "", 
        "reply": "I posted this thread last November, before Obama Derangement Syndrome was in it's full effect and before Americans came under the hostage taking hands of pirates as is the case right now. That sound you hear today is the sound of a different tune being sung.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:12:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: What's up with all these Tanker Hijackings? Isn't it obvious? The USA and Europe have surrendered to the muslim pirates.", 
        "intTime": 20090410, 
        "postID": 10, 
        "quote": "What's up with all these Tanker Hijackings?", 
        "reply": " Isn't it obvious? The USA and Europe have surrendered to the muslim pirates.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:34:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "intTime": 20090410, 
        "postID": 11, 
        "quote": "Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham?", 
        "reply": " In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:36:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "The Obama doctrine is to bow, scrape, and appologize.", 
        "intTime": 20090410, 
        "postID": 12, 
        "quote": "", 
        "reply": "The Obama doctrine is to bow, scrape, and appologize.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:42:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... \"The World's Finest\"", 
        "intTime": 20090410, 
        "postID": 13, 
        "quote": "", 
        "reply": "It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... \"The World's Finest\"", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:57:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Kegler300: Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... Yeah, he'll tackle the problem of giving illegal aliens a path to citizenship.", 
        "intTime": 20090410, 
        "postID": 14, 
        "quote": "Kegler300: Maybe when he returns from his cut-America-down-to-size tour, he'll take some action...", 
        "reply": " Yeah, he'll tackle the problem of giving illegal aliens a path to citizenship.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 08:12:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? How in the hell is this President Bush's fault? That was the most ludicris thing I have ever heard. Just for the record, the hijackings have increased in the last couple of months (5 last week). It seems since the democrats came to office, it embolden the hijackers. They know that the dems aren't going to do anything. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 15, 
        "quote": "Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham?", 
        "reply": " How in the hell is this President Bush's fault? That was the most ludicris thing I have ever heard. Just for the record, the hijackings have increased in the last couple of months (5 last week). It seems since the democrats came to office, it embolden the hijackers. They know that the dems aren't going to do anything. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:07:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "And also for the record, I originally posted this thread several months ago.", 
        "intTime": 20090410, 
        "postID": 16, 
        "quote": "", 
        "reply": "And also for the record, I originally posted this thread several months ago.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:10:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "And when obama got into office, they got worse. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 17, 
        "quote": "", 
        "reply": "And when obama got into office, they got worse. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:17:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "intTime": 20090410, 
        "postID": 18, 
        "quote": "Originally posted by mnoble1066: And when obama got into office, they got worse..", 
        "reply": " Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:21:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 19, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "reply": " Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:29:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "intTime": 20090410, 
        "postID": 20, 
        "quote": "Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself.", 
        "reply": " Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:31:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied... Neither does your accusation against President Bush. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 21, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "reply": " Neither does your accusation against President Bush. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:34:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: Neither does your accusation against President Bush. Which was what exactly? That the Bush Doctrine was BS? That the GWOT was a sham?", 
        "intTime": 20090410, 
        "postID": 22, 
        "quote": "Originally posted by mnoble1066: Neither does your accusation against President Bush.", 
        "reply": " Which was what exactly? That the Bush Doctrine was BS? That the GWOT was a sham?", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:37:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call! It's all under control Kerry is having hearings and Obama is peddling his mortgage plan.", 
        "intTime": 20090410, 
        "postID": 23, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "reply": " It's all under control Kerry is having hearings and Obama is peddling his mortgage plan.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:38:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... May I Mr PrezBo, yes I may. Tell the ships CO to buzz the dingy capcizing it it while having SEALS on point to dispatch the drowning pirates and rescue the Capt. Not that hard. But you keep em circling any action that may result in harm to the pirates might be considered Bushesque.", 
        "intTime": 20090410, 
        "postID": 24, 
        "quote": "Originally posted by Kegler300: It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action...", 
        "reply": " May I Mr PrezBo, yes I may. Tell the ships CO to buzz the dingy capcizing it it while having SEALS on point to dispatch the drowning pirates and rescue the Capt. Not that hard. But you keep em circling any action that may result in harm to the pirates might be considered Bushesque.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:41:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: That the GWOT was sham? Tell that to those who believed in it, fought for, was wounded for and died for. All of my buddies here in the army, air force, and marine corps, believe in what there doing down range. It's good to live in a patriotic community. I myself spent time in the sand box, will proudly do it again in the name of the war on terror. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 25, 
        "quote": "That the GWOT was sham?", 
        "reply": " Tell that to those who believed in it, fought for, was wounded for and died for. All of my buddies here in the army, air force, and marine corps, believe in what there doing down range. It's good to live in a patriotic community. I myself spent time in the sand box, will proudly do it again in the name of the war on terror. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:42:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "One of the key differences I've noticed between Obama and Bush is that Obama has kept his mouth closed about these scummy pirates. He has not mentioned them, or even officially acknowledged them and he has not given them the status they seek of even being mentioned by the President of the United States. Such mention would elevate their status and give them the credibility they desire. This is something Bush was a master at, turning terrorists into big time world stage players by getting in the mud with them and practically calling them out personally. Obama is clearly not that stupid and he is letting the situation get handled at the appropriate level, which is NOT HIS. He's the President of the United States, and the President should not and ought not be dealing one one with a few pirates. Simple as that. Kudos to a real world leader, President Obama.", 
        "intTime": 20090410, 
        "postID": 26, 
        "quote": "", 
        "reply": "One of the key differences I've noticed between Obama and Bush is that Obama has kept his mouth closed about these scummy pirates. He has not mentioned them, or even officially acknowledged them and he has not given them the status they seek of even being mentioned by the President of the United States. Such mention would elevate their status and give them the credibility they desire. This is something Bush was a master at, turning terrorists into big time world stage players by getting in the mud with them and practically calling them out personally. Obama is clearly not that stupid and he is letting the situation get handled at the appropriate level, which is NOT HIS. He's the President of the United States, and the President should not and ought not be dealing one one with a few pirates. Simple as that. Kudos to a real world leader, President Obama.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:45:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "Ignoring them makes them go away. Gees, Why didn't President Bush think of that... Oh..I know why, Because President Bush was in touch with reality. bho either has lost or never had any sense of it. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 27, 
        "quote": "", 
        "reply": "Ignoring them makes them go away. Gees, Why didn't President Bush think of that... Oh..I know why, Because President Bush was in touch with reality. bho either has lost or never had any sense of it. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:49:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Obama: Quick dispatch a OCO 33 person Team. 10)Lawyers 2) FBI negotiators 2) Dept of Treasury flunkies to disburse ransom funds. 7) Govt psychologists, to give treatment to Pirates to to absolve US Govt of lawsuits brought on by stress. 1) CIA director to make sure they arent tortured. 5) Int'l Red Cross to observe to make sure the Pirates are treated humanely. 1) Immigration official to arrange refugee status and 'Green Card' for Pirats. 4) DHS personal 1ea for the Pirates to arranage social services upon arrival in US. 1) Latte sipping tech savvy 20 something metro manbag carrying WH employee to get rescued, released merchant Capt a phone call from the President to show concern of his plight...as long as it doesnt interview with another Obama speech during primetime, After lunch, before dinner, morning not also possible becuse of viewership.", 
        "intTime": 20090410, 
        "postID": 28, 
        "quote": "", 
        "reply": "Obama: Quick dispatch a OCO 33 person Team. 10)Lawyers 2) FBI negotiators 2) Dept of Treasury flunkies to disburse ransom funds. 7) Govt psychologists, to give treatment to Pirates to to absolve US Govt of lawsuits brought on by stress. 1) CIA director to make sure they arent tortured. 5) Int'l Red Cross to observe to make sure the Pirates are treated humanely. 1) Immigration official to arrange refugee status and 'Green Card' for Pirats. 4) DHS personal 1ea for the Pirates to arranage social services upon arrival in US. 1) Latte sipping tech savvy 20 something metro manbag carrying WH employee to get rescued, released merchant Capt a phone call from the President to show concern of his plight...as long as it doesnt interview with another Obama speech during primetime, After lunch, before dinner, morning not also possible becuse of viewership.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:55:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Obama's got his top-notch negotiating team working on the hostage crisis... \"The World's Finest\"", 
        "intTime": 20090410, 
        "postID": 29, 
        "quote": "", 
        "reply": "Obama's got his top-notch negotiating team working on the hostage crisis... \"The World's Finest\"", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:57:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I posted this thread last November, before Obama Derangement Syndrome was in it's full effect and before Americans came under the hostage taking hands of pirates as is the case right now. That sound you hear today is the sound of a different tune being sung.", 
        "intTime": 20090410, 
        "postID": 38, 
        "quote": "", 
        "reply": "I posted this thread last November, before Obama Derangement Syndrome was in it's full effect and before Americans came under the hostage taking hands of pirates as is the case right now. That sound you hear today is the sound of a different tune being sung.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:12:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: What's up with all these Tanker Hijackings? Isn't it obvious? The USA and Europe have surrendered to the muslim pirates.", 
        "intTime": 20090410, 
        "postID": 39, 
        "quote": "What's up with all these Tanker Hijackings?", 
        "reply": " Isn't it obvious? The USA and Europe have surrendered to the muslim pirates.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:34:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "intTime": 20090410, 
        "postID": 40, 
        "quote": "Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham?", 
        "reply": " In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:36:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "The Obama doctrine is to bow, scrape, and appologize.", 
        "intTime": 20090410, 
        "postID": 41, 
        "quote": "", 
        "reply": "The Obama doctrine is to bow, scrape, and appologize.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:42:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... \"The World's Finest\"", 
        "intTime": 20090410, 
        "postID": 42, 
        "quote": "", 
        "reply": "It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... \"The World's Finest\"", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:57:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Kegler300: Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... Yeah, he'll tackle the problem of giving illegal aliens a path to citizenship.", 
        "intTime": 20090410, 
        "postID": 43, 
        "quote": "Kegler300: Maybe when he returns from his cut-America-down-to-size tour, he'll take some action...", 
        "reply": " Yeah, he'll tackle the problem of giving illegal aliens a path to citizenship.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 08:12:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? How in the hell is this President Bush's fault? That was the most ludicris thing I have ever heard. Just for the record, the hijackings have increased in the last couple of months (5 last week). It seems since the democrats came to office, it embolden the hijackers. They know that the dems aren't going to do anything. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 44, 
        "quote": "Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham?", 
        "reply": " How in the hell is this President Bush's fault? That was the most ludicris thing I have ever heard. Just for the record, the hijackings have increased in the last couple of months (5 last week). It seems since the democrats came to office, it embolden the hijackers. They know that the dems aren't going to do anything. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:07:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "And also for the record, I originally posted this thread several months ago.", 
        "intTime": 20090410, 
        "postID": 45, 
        "quote": "", 
        "reply": "And also for the record, I originally posted this thread several months ago.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:10:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "And when obama got into office, they got worse. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 46, 
        "quote": "", 
        "reply": "And when obama got into office, they got worse. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:17:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "intTime": 20090410, 
        "postID": 47, 
        "quote": "Originally posted by mnoble1066: And when obama got into office, they got worse..", 
        "reply": " Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:21:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 48, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "reply": " Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:29:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "intTime": 20090410, 
        "postID": 49, 
        "quote": "Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself.", 
        "reply": " Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:31:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied... Neither does your accusation against President Bush. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 50, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "reply": " Neither does your accusation against President Bush. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:34:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: Neither does your accusation against President Bush. Which was what exactly? That the Bush Doctrine was BS? That the GWOT was a sham?", 
        "intTime": 20090410, 
        "postID": 51, 
        "quote": "Originally posted by mnoble1066: Neither does your accusation against President Bush.", 
        "reply": " Which was what exactly? That the Bush Doctrine was BS? That the GWOT was a sham?", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:37:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call! It's all under control Kerry is having hearings and Obama is peddling his mortgage plan.", 
        "intTime": 20090410, 
        "postID": 52, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "reply": " It's all under control Kerry is having hearings and Obama is peddling his mortgage plan.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:38:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... May I Mr PrezBo, yes I may. Tell the ships CO to buzz the dingy capcizing it it while having SEALS on point to dispatch the drowning pirates and rescue the Capt. Not that hard. But you keep em circling any action that may result in harm to the pirates might be considered Bushesque.", 
        "intTime": 20090410, 
        "postID": 53, 
        "quote": "Originally posted by Kegler300: It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action...", 
        "reply": " May I Mr PrezBo, yes I may. Tell the ships CO to buzz the dingy capcizing it it while having SEALS on point to dispatch the drowning pirates and rescue the Capt. Not that hard. But you keep em circling any action that may result in harm to the pirates might be considered Bushesque.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:41:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: That the GWOT was sham? Tell that to those who believed in it, fought for, was wounded for and died for. All of my buddies here in the army, air force, and marine corps, believe in what there doing down range. It's good to live in a patriotic community. I myself spent time in the sand box, will proudly do it again in the name of the war on terror. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 54, 
        "quote": "That the GWOT was sham?", 
        "reply": " Tell that to those who believed in it, fought for, was wounded for and died for. All of my buddies here in the army, air force, and marine corps, believe in what there doing down range. It's good to live in a patriotic community. I myself spent time in the sand box, will proudly do it again in the name of the war on terror. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:42:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "One of the key differences I've noticed between Obama and Bush is that Obama has kept his mouth closed about these scummy pirates. He has not mentioned them, or even officially acknowledged them and he has not given them the status they seek of even being mentioned by the President of the United States. Such mention would elevate their status and give them the credibility they desire. This is something Bush was a master at, turning terrorists into big time world stage players by getting in the mud with them and practically calling them out personally. Obama is clearly not that stupid and he is letting the situation get handled at the appropriate level, which is NOT HIS. He's the President of the United States, and the President should not and ought not be dealing one one with a few pirates. Simple as that. Kudos to a real world leader, President Obama.", 
        "intTime": 20090410, 
        "postID": 55, 
        "quote": "", 
        "reply": "One of the key differences I've noticed between Obama and Bush is that Obama has kept his mouth closed about these scummy pirates. He has not mentioned them, or even officially acknowledged them and he has not given them the status they seek of even being mentioned by the President of the United States. Such mention would elevate their status and give them the credibility they desire. This is something Bush was a master at, turning terrorists into big time world stage players by getting in the mud with them and practically calling them out personally. Obama is clearly not that stupid and he is letting the situation get handled at the appropriate level, which is NOT HIS. He's the President of the United States, and the President should not and ought not be dealing one one with a few pirates. Simple as that. Kudos to a real world leader, President Obama.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:45:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "Ignoring them makes them go away. Gees, Why didn't President Bush think of that... Oh..I know why, Because President Bush was in touch with reality. bho either has lost or never had any sense of it. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 56, 
        "quote": "", 
        "reply": "Ignoring them makes them go away. Gees, Why didn't President Bush think of that... Oh..I know why, Because President Bush was in touch with reality. bho either has lost or never had any sense of it. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:49:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Obama: Quick dispatch a OCO 33 person Team. 10)Lawyers 2) FBI negotiators 2) Dept of Treasury flunkies to disburse ransom funds. 7) Govt psychologists, to give treatment to Pirates to to absolve US Govt of lawsuits brought on by stress. 1) CIA director to make sure they arent tortured. 5) Int'l Red Cross to observe to make sure the Pirates are treated humanely. 1) Immigration official to arrange refugee status and 'Green Card' for Pirats. 4) DHS personal 1ea for the Pirates to arranage social services upon arrival in US. 1) Latte sipping tech savvy 20 something metro manbag carrying WH employee to get rescued, released merchant Capt a phone call from the President to show concern of his plight...as long as it doesnt interview with another Obama speech during primetime, After lunch, before dinner, morning not also possible becuse of viewership.", 
        "intTime": 20090410, 
        "postID": 57, 
        "quote": "", 
        "reply": "Obama: Quick dispatch a OCO 33 person Team. 10)Lawyers 2) FBI negotiators 2) Dept of Treasury flunkies to disburse ransom funds. 7) Govt psychologists, to give treatment to Pirates to to absolve US Govt of lawsuits brought on by stress. 1) CIA director to make sure they arent tortured. 5) Int'l Red Cross to observe to make sure the Pirates are treated humanely. 1) Immigration official to arrange refugee status and 'Green Card' for Pirats. 4) DHS personal 1ea for the Pirates to arranage social services upon arrival in US. 1) Latte sipping tech savvy 20 something metro manbag carrying WH employee to get rescued, released merchant Capt a phone call from the President to show concern of his plight...as long as it doesnt interview with another Obama speech during primetime, After lunch, before dinner, morning not also possible becuse of viewership.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:55:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Obama's got his top-notch negotiating team working on the hostage crisis... \"The World's Finest\"", 
        "intTime": 20090410, 
        "postID": 58, 
        "quote": "", 
        "reply": "Obama's got his top-notch negotiating team working on the hostage crisis... \"The World's Finest\"", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:57:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I posted this thread last November, before Obama Derangement Syndrome was in it's full effect and before Americans came under the hostage taking hands of pirates as is the case right now. That sound you hear today is the sound of a different tune being sung.", 
        "intTime": 20090410, 
        "postID": 67, 
        "quote": "", 
        "reply": "I posted this thread last November, before Obama Derangement Syndrome was in it's full effect and before Americans came under the hostage taking hands of pirates as is the case right now. That sound you hear today is the sound of a different tune being sung.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:12:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: What's up with all these Tanker Hijackings? Isn't it obvious? The USA and Europe have surrendered to the muslim pirates.", 
        "intTime": 20090410, 
        "postID": 68, 
        "quote": "What's up with all these Tanker Hijackings?", 
        "reply": " Isn't it obvious? The USA and Europe have surrendered to the muslim pirates.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:34:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "intTime": 20090410, 
        "postID": 69, 
        "quote": "Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham?", 
        "reply": " In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:36:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "The Obama doctrine is to bow, scrape, and appologize.", 
        "intTime": 20090410, 
        "postID": 70, 
        "quote": "", 
        "reply": "The Obama doctrine is to bow, scrape, and appologize.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:42:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... \"The World's Finest\"", 
        "intTime": 20090410, 
        "postID": 71, 
        "quote": "", 
        "reply": "It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... \"The World's Finest\"", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 07:57:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Kegler300: Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... Yeah, he'll tackle the problem of giving illegal aliens a path to citizenship.", 
        "intTime": 20090410, 
        "postID": 72, 
        "quote": "Kegler300: Maybe when he returns from his cut-America-down-to-size tour, he'll take some action...", 
        "reply": " Yeah, he'll tackle the problem of giving illegal aliens a path to citizenship.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 08:12:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? How in the hell is this President Bush's fault? That was the most ludicris thing I have ever heard. Just for the record, the hijackings have increased in the last couple of months (5 last week). It seems since the democrats came to office, it embolden the hijackers. They know that the dems aren't going to do anything. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 73, 
        "quote": "Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham?", 
        "reply": " How in the hell is this President Bush's fault? That was the most ludicris thing I have ever heard. Just for the record, the hijackings have increased in the last couple of months (5 last week). It seems since the democrats came to office, it embolden the hijackers. They know that the dems aren't going to do anything. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:07:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "And also for the record, I originally posted this thread several months ago.", 
        "intTime": 20090410, 
        "postID": 74, 
        "quote": "", 
        "reply": "And also for the record, I originally posted this thread several months ago.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:10:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "And when obama got into office, they got worse. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 75, 
        "quote": "", 
        "reply": "And when obama got into office, they got worse. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:17:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "intTime": 20090410, 
        "postID": 76, 
        "quote": "Originally posted by mnoble1066: And when obama got into office, they got worse..", 
        "reply": " Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:21:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 77, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!!", 
        "reply": " Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:29:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "intTime": 20090410, 
        "postID": 78, 
        "quote": "Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself.", 
        "reply": " Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:31:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied... Neither does your accusation against President Bush. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 79, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: quote: Originally posted by Killswitch_Engage: quote: Originally posted by mnoble1066: And when obama got into office, they got worse.. Can you back that up with hard data? The only that's changed from where I stand has been the response to it by the partisan politicos. When it was still Bush world, it was a big ocean, these were not terrorists but pirates, and we could not be in all places at once. Now that Obama is in Office, these are Muslim Terrorists, and Obama needs to do something NOW!! Yahoo news, it says that the Alabama was the sixth vessel to be hijacked in a week. Look it up youself. Yahoo News lol... That does not prove your claim that international piracy is up since President Barack Obama took the Oath of Office. Or that the two have anything whatsoever to do each other as you implied...", 
        "reply": " Neither does your accusation against President Bush. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:34:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: Neither does your accusation against President Bush. Which was what exactly? That the Bush Doctrine was BS? That the GWOT was a sham?", 
        "intTime": 20090410, 
        "postID": 80, 
        "quote": "Originally posted by mnoble1066: Neither does your accusation against President Bush.", 
        "reply": " Which was what exactly? That the Bush Doctrine was BS? That the GWOT was a sham?", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:37:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call! It's all under control Kerry is having hearings and Obama is peddling his mortgage plan.", 
        "intTime": 20090410, 
        "postID": 81, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by Killswitch_Engage: And why are we not doing anything about it? According to the basic tenets of the Bush Doctrine (just don't ask Sarah Palin to explain) and the principles of the GWOT (GLOBAL War on Terror) it would seem to me that wherever and whenever terrorists are active, our military should be there in some form or fashion to help the victims, and fight and kill the terrorists, like in India the past couple days and with all these hijacked tankers. Was the Bush Doctrine really BS all along? Is the \"Global\" War on Terror a sham? In case you haven't noticed, Bush is no longer President.....it's Obama's call!", 
        "reply": " It's all under control Kerry is having hearings and Obama is peddling his mortgage plan.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:38:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action... May I Mr PrezBo, yes I may. Tell the ships CO to buzz the dingy capcizing it it while having SEALS on point to dispatch the drowning pirates and rescue the Capt. Not that hard. But you keep em circling any action that may result in harm to the pirates might be considered Bushesque.", 
        "intTime": 20090410, 
        "postID": 82, 
        "quote": "Originally posted by Kegler300: It does seem strange that the nObama Administration is paralyzed by four islamic extremists in a dingy. Maybe when he returns from his cut-America-down-to-size tour, he'll take some action...", 
        "reply": " May I Mr PrezBo, yes I may. Tell the ships CO to buzz the dingy capcizing it it while having SEALS on point to dispatch the drowning pirates and rescue the Capt. Not that hard. But you keep em circling any action that may result in harm to the pirates might be considered Bushesque.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:41:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: That the GWOT was sham? Tell that to those who believed in it, fought for, was wounded for and died for. All of my buddies here in the army, air force, and marine corps, believe in what there doing down range. It's good to live in a patriotic community. I myself spent time in the sand box, will proudly do it again in the name of the war on terror. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 83, 
        "quote": "That the GWOT was sham?", 
        "reply": " Tell that to those who believed in it, fought for, was wounded for and died for. All of my buddies here in the army, air force, and marine corps, believe in what there doing down range. It's good to live in a patriotic community. I myself spent time in the sand box, will proudly do it again in the name of the war on terror. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:42:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "One of the key differences I've noticed between Obama and Bush is that Obama has kept his mouth closed about these scummy pirates. He has not mentioned them, or even officially acknowledged them and he has not given them the status they seek of even being mentioned by the President of the United States. Such mention would elevate their status and give them the credibility they desire. This is something Bush was a master at, turning terrorists into big time world stage players by getting in the mud with them and practically calling them out personally. Obama is clearly not that stupid and he is letting the situation get handled at the appropriate level, which is NOT HIS. He's the President of the United States, and the President should not and ought not be dealing one one with a few pirates. Simple as that. Kudos to a real world leader, President Obama.", 
        "intTime": 20090410, 
        "postID": 84, 
        "quote": "", 
        "reply": "One of the key differences I've noticed between Obama and Bush is that Obama has kept his mouth closed about these scummy pirates. He has not mentioned them, or even officially acknowledged them and he has not given them the status they seek of even being mentioned by the President of the United States. Such mention would elevate their status and give them the credibility they desire. This is something Bush was a master at, turning terrorists into big time world stage players by getting in the mud with them and practically calling them out personally. Obama is clearly not that stupid and he is letting the situation get handled at the appropriate level, which is NOT HIS. He's the President of the United States, and the President should not and ought not be dealing one one with a few pirates. Simple as that. Kudos to a real world leader, President Obama.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:45:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "Ignoring them makes them go away. Gees, Why didn't President Bush think of that... Oh..I know why, Because President Bush was in touch with reality. bho either has lost or never had any sense of it. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090410, 
        "postID": 85, 
        "quote": "", 
        "reply": "Ignoring them makes them go away. Gees, Why didn't President Bush think of that... Oh..I know why, Because President Bush was in touch with reality. bho either has lost or never had any sense of it. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:49:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Obama: Quick dispatch a OCO 33 person Team. 10)Lawyers 2) FBI negotiators 2) Dept of Treasury flunkies to disburse ransom funds. 7) Govt psychologists, to give treatment to Pirates to to absolve US Govt of lawsuits brought on by stress. 1) CIA director to make sure they arent tortured. 5) Int'l Red Cross to observe to make sure the Pirates are treated humanely. 1) Immigration official to arrange refugee status and 'Green Card' for Pirats. 4) DHS personal 1ea for the Pirates to arranage social services upon arrival in US. 1) Latte sipping tech savvy 20 something metro manbag carrying WH employee to get rescued, released merchant Capt a phone call from the President to show concern of his plight...as long as it doesnt interview with another Obama speech during primetime, After lunch, before dinner, morning not also possible becuse of viewership.", 
        "intTime": 20090410, 
        "postID": 86, 
        "quote": "", 
        "reply": "Obama: Quick dispatch a OCO 33 person Team. 10)Lawyers 2) FBI negotiators 2) Dept of Treasury flunkies to disburse ransom funds. 7) Govt psychologists, to give treatment to Pirates to to absolve US Govt of lawsuits brought on by stress. 1) CIA director to make sure they arent tortured. 5) Int'l Red Cross to observe to make sure the Pirates are treated humanely. 1) Immigration official to arrange refugee status and 'Green Card' for Pirats. 4) DHS personal 1ea for the Pirates to arranage social services upon arrival in US. 1) Latte sipping tech savvy 20 something metro manbag carrying WH employee to get rescued, released merchant Capt a phone call from the President to show concern of his plight...as long as it doesnt interview with another Obama speech during primetime, After lunch, before dinner, morning not also possible becuse of viewership.", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:55:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Obama's got his top-notch negotiating team working on the hostage crisis... \"The World's Finest\"", 
        "intTime": 20090410, 
        "postID": 87, 
        "quote": "", 
        "reply": "Obama's got his top-notch negotiating team working on the hostage crisis... \"The World's Finest\"", 
        "threadID": "409192893_7230087702001", 
        "time": "2009-04-10 09:57:00", 
        "title": "What's up with all these Tanker Hijackings?", 
        "userID": "Kegler300"
    }
]