[
    {
        "content": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "intTime": 20090518, 
        "postID": 1, 
        "quote": "", 
        "reply": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:29:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Toss the animals behind cages, and throw away the key...", 
        "intTime": 20090518, 
        "postID": 2, 
        "quote": "", 
        "reply": "Toss the animals behind cages, and throw away the key...", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:36:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 3, 
        "quote": "Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "reply": " I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:45:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "intTime": 20090518, 
        "postID": 4, 
        "quote": "Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key...", 
        "reply": " Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "intTime": 20090518, 
        "postID": 5, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries.", 
        "reply": " Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "reply": " Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:15:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:28:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "", 
        "reply": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:43:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "intTime": 20090518, 
        "postID": 10, 
        "quote": "", 
        "reply": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:38:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 11, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals?", 
        "reply": " Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:41:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "intTime": 20090518, 
        "postID": 12, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "reply": " Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 18:00:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "AKinNC"
    }, 
    {
        "content": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "intTime": 20090518, 
        "postID": 13, 
        "quote": "", 
        "reply": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:19:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "intTime": 20090518, 
        "postID": 14, 
        "quote": "", 
        "reply": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:37:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary. Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "intTime": 20090519, 
        "postID": 15, 
        "quote": "Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "reply": " Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 02:59:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "intTime": 20090519, 
        "postID": 16, 
        "quote": "", 
        "reply": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:05:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic. Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "intTime": 20090519, 
        "postID": 17, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "reply": " Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:54:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "intTime": 20090519, 
        "postID": 18, 
        "quote": "", 
        "reply": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "quote: Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up. You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "intTime": 20090519, 
        "postID": 19, 
        "quote": "Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "reply": " You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "If only I could.", 
        "intTime": 20090519, 
        "postID": 20, 
        "quote": "", 
        "reply": "If only I could.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "intTime": 20090519, 
        "postID": 21, 
        "quote": "", 
        "reply": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "intTime": 20090519, 
        "postID": 22, 
        "quote": "", 
        "reply": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "intTime": 20090519, 
        "postID": 23, 
        "quote": "", 
        "reply": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:53:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit. You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "intTime": 20090519, 
        "postID": 24, 
        "quote": "Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "reply": " You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that? I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "intTime": 20090519, 
        "postID": 25, 
        "quote": "Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "reply": " I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:03:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 26, 
        "quote": "Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "reply": " We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:06:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "intTime": 20090519, 
        "postID": 27, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:18:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "intTime": 20090519, 
        "postID": 28, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:24:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "intTime": 20090519, 
        "postID": 29, 
        "quote": "", 
        "reply": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "intTime": 20090519, 
        "postID": 30, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is?", 
        "reply": " It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:52:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "foxred03"
    }, 
    {
        "content": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "intTime": 20090518, 
        "postID": 31, 
        "quote": "", 
        "reply": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:29:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Toss the animals behind cages, and throw away the key...", 
        "intTime": 20090518, 
        "postID": 32, 
        "quote": "", 
        "reply": "Toss the animals behind cages, and throw away the key...", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:36:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 33, 
        "quote": "Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "reply": " I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:45:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "intTime": 20090518, 
        "postID": 34, 
        "quote": "Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key...", 
        "reply": " Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "intTime": 20090518, 
        "postID": 35, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "intTime": 20090518, 
        "postID": 36, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries.", 
        "reply": " Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 37, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "reply": " Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:15:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "intTime": 20090518, 
        "postID": 38, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:28:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "intTime": 20090518, 
        "postID": 39, 
        "quote": "", 
        "reply": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:43:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "intTime": 20090518, 
        "postID": 40, 
        "quote": "", 
        "reply": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:38:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 41, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals?", 
        "reply": " Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:41:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "intTime": 20090518, 
        "postID": 42, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "reply": " Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 18:00:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "AKinNC"
    }, 
    {
        "content": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "intTime": 20090518, 
        "postID": 43, 
        "quote": "", 
        "reply": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:19:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "intTime": 20090518, 
        "postID": 44, 
        "quote": "", 
        "reply": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:37:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary. Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "intTime": 20090519, 
        "postID": 45, 
        "quote": "Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "reply": " Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 02:59:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "intTime": 20090519, 
        "postID": 46, 
        "quote": "", 
        "reply": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:05:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic. Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "intTime": 20090519, 
        "postID": 47, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "reply": " Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:54:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "intTime": 20090519, 
        "postID": 48, 
        "quote": "", 
        "reply": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "quote: Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up. You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "intTime": 20090519, 
        "postID": 49, 
        "quote": "Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "reply": " You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "If only I could.", 
        "intTime": 20090519, 
        "postID": 50, 
        "quote": "", 
        "reply": "If only I could.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "intTime": 20090519, 
        "postID": 51, 
        "quote": "", 
        "reply": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "intTime": 20090519, 
        "postID": 52, 
        "quote": "", 
        "reply": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "intTime": 20090519, 
        "postID": 53, 
        "quote": "", 
        "reply": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:53:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit. You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "intTime": 20090519, 
        "postID": 54, 
        "quote": "Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "reply": " You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that? I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "intTime": 20090519, 
        "postID": 55, 
        "quote": "Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "reply": " I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:03:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 56, 
        "quote": "Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "reply": " We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:06:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "intTime": 20090519, 
        "postID": 57, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:18:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "intTime": 20090519, 
        "postID": 58, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:24:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "intTime": 20090519, 
        "postID": 59, 
        "quote": "", 
        "reply": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "intTime": 20090519, 
        "postID": 60, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is?", 
        "reply": " It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:52:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "foxred03"
    }, 
    {
        "content": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "intTime": 20090518, 
        "postID": 61, 
        "quote": "", 
        "reply": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:29:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Toss the animals behind cages, and throw away the key...", 
        "intTime": 20090518, 
        "postID": 62, 
        "quote": "", 
        "reply": "Toss the animals behind cages, and throw away the key...", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:36:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 63, 
        "quote": "Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "reply": " I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:45:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "intTime": 20090518, 
        "postID": 64, 
        "quote": "Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key...", 
        "reply": " Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "intTime": 20090518, 
        "postID": 65, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "intTime": 20090518, 
        "postID": 66, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries.", 
        "reply": " Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 67, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "reply": " Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:15:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "intTime": 20090518, 
        "postID": 68, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:28:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "intTime": 20090518, 
        "postID": 69, 
        "quote": "", 
        "reply": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:43:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "intTime": 20090518, 
        "postID": 70, 
        "quote": "", 
        "reply": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:38:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 71, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals?", 
        "reply": " Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:41:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "intTime": 20090518, 
        "postID": 72, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "reply": " Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 18:00:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "AKinNC"
    }, 
    {
        "content": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "intTime": 20090518, 
        "postID": 73, 
        "quote": "", 
        "reply": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:19:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "intTime": 20090518, 
        "postID": 74, 
        "quote": "", 
        "reply": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:37:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary. Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "intTime": 20090519, 
        "postID": 75, 
        "quote": "Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "reply": " Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 02:59:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "intTime": 20090519, 
        "postID": 76, 
        "quote": "", 
        "reply": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:05:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic. Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "intTime": 20090519, 
        "postID": 77, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "reply": " Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:54:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "intTime": 20090519, 
        "postID": 78, 
        "quote": "", 
        "reply": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "quote: Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up. You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "intTime": 20090519, 
        "postID": 79, 
        "quote": "Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "reply": " You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "If only I could.", 
        "intTime": 20090519, 
        "postID": 80, 
        "quote": "", 
        "reply": "If only I could.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "intTime": 20090519, 
        "postID": 81, 
        "quote": "", 
        "reply": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "intTime": 20090519, 
        "postID": 82, 
        "quote": "", 
        "reply": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "intTime": 20090519, 
        "postID": 83, 
        "quote": "", 
        "reply": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:53:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit. You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "intTime": 20090519, 
        "postID": 84, 
        "quote": "Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "reply": " You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that? I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "intTime": 20090519, 
        "postID": 85, 
        "quote": "Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "reply": " I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:03:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 86, 
        "quote": "Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "reply": " We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:06:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "intTime": 20090519, 
        "postID": 87, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:18:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "intTime": 20090519, 
        "postID": 88, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:24:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "intTime": 20090519, 
        "postID": 89, 
        "quote": "", 
        "reply": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "intTime": 20090519, 
        "postID": 90, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is?", 
        "reply": " It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:52:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "foxred03"
    }, 
    {
        "content": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "intTime": 20090518, 
        "postID": 91, 
        "quote": "", 
        "reply": "Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:29:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Toss the animals behind cages, and throw away the key...", 
        "intTime": 20090518, 
        "postID": 92, 
        "quote": "", 
        "reply": "Toss the animals behind cages, and throw away the key...", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:36:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 93, 
        "quote": "Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html", 
        "reply": " I doubt that is any different ratio then in most countries. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:45:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "intTime": 20090518, 
        "postID": 94, 
        "quote": "Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key...", 
        "reply": " Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "intTime": 20090518, 
        "postID": 95, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " We waste alot of money in the prisons. On good food, television, light...etc..etc", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "intTime": 20090518, 
        "postID": 96, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries.", 
        "reply": " Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 14:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 97, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate.", 
        "reply": " Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:15:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "intTime": 20090518, 
        "postID": 98, 
        "quote": "Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use?", 
        "reply": " And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:28:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "intTime": 20090518, 
        "postID": 99, 
        "quote": "", 
        "reply": "Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 15:43:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "intTime": 20090518, 
        "postID": 100, 
        "quote": "", 
        "reply": "Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:38:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 101, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals?", 
        "reply": " Wow you are strict, you want to put people to death for back child support? WOw. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 17:41:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "intTime": 20090518, 
        "postID": 102, 
        "quote": "Originally posted by Usamp27: Look I work at a prison and there are alot of Male Inmates that are in for some really stupid reasons. Top of that list is Back Child Support. One way to start cutting the costs is to start enforcing the Death Penalty. I Dont believe that a death sentence should end in Natural Causes. The other thing that drives me crazy is that there is a Law stating we have to provide Cable Television to the Inmates. We dont provide that for our soldiers why should we for criminals? As far as people raising their children right I have personally seen mothers come to visit and slap thier sons for being a criminal or as one mother put it a IDIOT", 
        "reply": " Working at a prison, I'm sure you can appreciate the effect that cable TV has on inmates with nothing but time on their hands and no other outlets for their boredom. I think a little cable TV is a fair trade for more cooperative inmates.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 18:00:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "AKinNC"
    }, 
    {
        "content": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "intTime": 20090518, 
        "postID": 103, 
        "quote": "", 
        "reply": "We can debate the \"cage\" and what to feed the folks or let them do, or how to re-educate them...but have 1 American out of a 100 in prison was exactly we saw in the USSR under Stalin... think about it! Maybe our system needs a redo?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:19:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "intTime": 20090518, 
        "postID": 104, 
        "quote": "", 
        "reply": "The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-18 23:37:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary. Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "intTime": 20090519, 
        "postID": 105, 
        "quote": "Originally posted by Mom2APAJ: Kids are not taught to be responsible for their own actions, that life has value and there are consequences for their actions. We have brought this one ourselves by not allowing children to be disciplined in school or at home. If it walks, talks and acts like a thug it deserves not to live freely in society. My recent trip to what was once the oldest, most respected cemetery in Memphis that now lies in the heart of \"gang central\" confirms that severe consequences for crimes and gang membership should be enforced. I was literally taking my life in my hands to visit the graves of my Grandparents. I couldn't even visit the graves of my Great-Grandparents because their graves were in the oldest part of the cemetery and the cemetery management couldn't guarantee I'd be safe \"back there\" out of sight of the mortuary.", 
        "reply": " Don't blame the school for the parents failure. If kids aren't being taught that, it's because it's not being taught at home.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 02:59:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "intTime": 20090519, 
        "postID": 106, 
        "quote": "", 
        "reply": "Want to know the reason so many America's are in jail? It's simple: The War on Drugs. But, the figure cited by the OP is just those incarcerated and does not include persons on parole or probation. Include those, and it goes much higher. Among black males, the total number involved with our criminal justice system, in one form or another, is about 65%. Anyone would have a hard time convincing me that blacks are the ONLY racial/ethnic group in which 65% are criminals. I suspect something else is at play here, wouldn't you?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:05:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic. Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "intTime": 20090519, 
        "postID": 107, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by TallestTree: quote: Originally posted by Irwin_R_Schyster: Toss the animals behind cages, and throw away the key... Do you think you should pay $30,000/year/inmate to imprison someone for getting caught with possession of an illegal drug which was intended for their own personal use? And, your point is what? If the person who was arrested, tried and convicted for illegal drug usage...that's his/her problem. He/she ran afoul of the established City/County/State law(s) governing the illegal possession of drugs...willingly, deliberately and knowingly. Some countries enforce the Death Penalty, or lesser punishment(s)...loss of a limb, for example, for drug possession/usage. I, for one, don't feel it is my responsibility to pay out of pocket to house, feed and provide 'entertainment' for some nincompoop who did something willingly stupid. He/she got themself/selves in this mess...let them work out of it... No sympathy from me on this topic.", 
        "reply": " Amen to that. It seems that this day and age, people refuse to accept responsibility for their own actions.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 03:54:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "intTime": 20090519, 
        "postID": 108, 
        "quote": "", 
        "reply": "Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "quote: Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up. You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "intTime": 20090519, 
        "postID": 109, 
        "quote": "Originally posted by Vorpal: Let's release some of these crooks into the neihgborhoods of the people crying about them being locked up.", 
        "reply": " You can release the 'dead beat dads', the stoners, and the any of the other non-violent criminals in my neighborhood. I don't see any reason why the government should have any say over what a person puts in their body so long as it does not impact others - there is no logic to support the legalization of alcohol over marijuana.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 07:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "If only I could.", 
        "intTime": 20090519, 
        "postID": 110, 
        "quote": "", 
        "reply": "If only I could.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "Vorpal"
    }, 
    {
        "content": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "intTime": 20090519, 
        "postID": 111, 
        "quote": "", 
        "reply": "Good points here. To bad the general public can't see them or get involved? What is wrong with out political system that these debates are muffled and nothing heard?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:31:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "intTime": 20090519, 
        "postID": 112, 
        "quote": "", 
        "reply": "What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:48:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "intTime": 20090519, 
        "postID": 113, 
        "quote": "", 
        "reply": "The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:53:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit. You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "intTime": 20090519, 
        "postID": 114, 
        "quote": "Originally posted by Thud357L: The prison system is largely a privatized industry. Each prisoner has a monetized value which is increased by sub-third world labor costs. The more prisoners, the more profit.", 
        "reply": " You are exactly right. Privatization of our criminal system is a big problem as it creates incentive for people to be incarcerated i.e. prison lobbyists influence laws that increase the duration of sentences as well as the severity of crimes that result in a prison sentence.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 08:57:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that? I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "intTime": 20090519, 
        "postID": 115, 
        "quote": "Originally posted by fishnfanatic: The question I have to those that don't like the high incarceration rate. Would you gripe about the high crime rates if those people weren't in prison? Seems they always have to have something to whine about. They don't have enough to do in their lives to they make others miserable with their crying. I'm not saying the legal system isn't broke, it is. Why not start your whining about that?", 
        "reply": " I think that is the point of this discussion - to explore why we have the highest incarceration rate in the world despite our position as the world's super power (or at least we use to be).", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:03:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 116, 
        "quote": "Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives?", 
        "reply": " We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:06:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "intTime": 20090519, 
        "postID": 117, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " That sounds more than a tad familiar! We have anti-terrorist legislation that is used to stop party members speaking out at conference. All this can do is bring the law into disrepute. I don't want people to misunderstand me: of course I want to see offenders punished, but even more than that, I want to see a reduction in crime. The current system is clearly not achieving that end.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:18:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high. Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "intTime": 20090519, 
        "postID": 118, 
        "quote": "Originally posted by L0A1: quote: Originally posted by BritishAlly: What follows is not a pro-offender comment, nor is it a holier-than-thou comment from here in the UK. Yes, our incarceration rates are lower than those in the US, but they are, I believe, the highest in Western Europe. My comments apply primarily to the UK, as I know more about British than American society. If the number of people in prison is rising, then this is, at least in part, because the number of crimes is increasing. This surely shows that, at some fundamental level, the current system is not working. Reintroduction of the death penalty in the UK would not significantly change this, as the vast majority of people in prison are not there for offences that any civilised society would consider suitable for the death penalty. In these circumstances, is it not reasonable to at least consider alternatives? We here in the US keep creating news laws to be broken, everything from Dead beat dad laws to hate crimes. So because of this our incarceration rate is very high.", 
        "reply": " Absolutely! So long as profitability is directly proportional to the number of inmates being incarcerated, we are going to see all kinds of creative reasons to justify imprisoning people.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:24:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "intTime": 20090519, 
        "postID": 119, 
        "quote": "", 
        "reply": "Something else to think about is the increased unemployment rate as well as the number of people on food stamps... this is important to consider as it is an indication of desperation. When an honest person is laid off of work and cannot afford to feed their family, that ordinarily honest person will compromise their values and steal in order to survive. When it comes to either seeing your child go hungry or stealing, it makes it a much easier decision to break the law. Does this person deserve to be punished, yes. Would imprisoning him/her serve to rehabilitate them, NO - because this person made a rational decision based upon their circumstances, incarcerating them would only serve to influence this person in a negative way by forcing them to be surrounded by more hardened criminals.", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:46:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "TallestTree"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is? It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "intTime": 20090519, 
        "postID": 120, 
        "quote": "Originally posted by L0A1: quote: Originally posted by TallestTree: quote: Originally posted by L0A1: quote: Originally posted by TallestTree: Are 1 in 100 Americans in prison because there are a lot of bad Americans or is it the result of our out of control legal system? This article is a year old and in all likelihood the number of Americans behind bars has increased. NY TIMES - 1 in 100 U.S. Adults Behind Bars, New Study Says //www.nytimes.com/2008/02/28/us/28cnd-prison.html I doubt that is any different ratio then in most countries. Actually the United States has the highest incarceration rate in the world with Russia being the closest second and European countries on average incarcerating less than 5 times our incarceration rate. Ok, depending on your view that either means our Justice system is better, or it's broke. Which do you think it is?", 
        "reply": " It's not just the justice system, it's our society. We just have extremely high crime and we need to get it under control. The money spent dealing with criminals is a huge drain. There aren't any easy solutions but our crime rate is shameful. Check out the link, America ranks 24th in muder rates. ++http://www.nationmaster.com/graph/cri_mur_percap-crime-murders-per-capita", 
        "threadID": "409192893_3040085322001", 
        "time": "2009-05-19 09:52:00", 
        "title": "1 in 100 Americans are in prison...", 
        "userID": "foxred03"
    }
]