[
    {
        "content": "I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "", 
        "reply": "I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:20:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Did Durbin and Reid write his speech? \"The World's Finest\"", 
        "intTime": 20090521, 
        "postID": 2, 
        "quote": "", 
        "reply": "Did Durbin and Reid write his speech? \"The World's Finest\"", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:27:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "As to the subject line - YES, every time. It almost makes me cringe to see the two names in one sentence. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 3, 
        "quote": "", 
        "reply": "As to the subject line - YES, every time. It almost makes me cringe to see the two names in one sentence. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "intTime": 20090521, 
        "postID": 4, 
        "quote": "", 
        "reply": "I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean? It means that he found out during the election that not wearing the flag pin was hurting him in the polls...after that, he started wearing one.", 
        "intTime": 20090521, 
        "postID": 5, 
        "quote": "Originally posted by 5727609: I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "reply": " It means that he found out during the election that not wearing the flag pin was hurting him in the polls...after that, he started wearing one.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:54:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "What kind of flag, hammer and sickle?", 
        "intTime": 20090521, 
        "postID": 6, 
        "quote": "", 
        "reply": "What kind of flag, hammer and sickle?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:59:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. ... did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. You must not have listened very carefully. The President lists what he will do with all but a very few prisoners who cannot be released, but cannot be tried. We are currently in the process of reviewing each of the detainee cases at Guantanamo to determine the appropriate policy for dealing with them. As we do so, we are acutely aware that under the last Administration, detainees were released only to return to the battlefield. That is why we are doing away with the poorly planned, haphazard approach that let those detainees go in the past. Instead, we are treating these cases with the care and attention that the law requires and our security demands. Going forward, these cases will fall into five distinct categories. First, when feasible, we will try those who have violated American criminal laws in federal courts – courts provided for by the United States Constitution. Some have derided our federal courts as incapable of handling the trials of terrorists. They are wrong. Our courts and juries of our citizens are tough enough to convict terrorists, and the record makes that clear. Ramzi Yousef tried to blow up the World Trade Center – he was convicted in our courts, and is serving a life sentence in U.S. prison. Zaccarias Moussaoui has been identified as the 20th 9/11 hijacker – he was convicted in our courts, and he too is serving a life sentence in prison. If we can try those terrorists in our courts and hold them in our prisons, then we can do the same with detainees from Guantanamo. Recently, we prosecuted and received a guilty plea from a detainee – al-Marri – in federal court after years of legal confusion. We are preparing to transfer another detainee to the Southern District of New York, where he will face trial on charges related to the 1998 bombings of our embassies in Kenya and Tanzania – bombings that killed over 200 people. Preventing this detainee from coming to our shores would prevent his trial and conviction. And after over a decade, it is time to finally see that justice is served, and that is what we intend to do. The second category of cases involves detainees who violate the laws of war and are best tried through Military Commissions. Military commissions have a history in the United States dating back to George Washington and the Revolutionary War. They are an appropriate venue for trying detainees for violations of the laws of war. They allow for the protection of sensitive sources and methods of intelligence-gathering; for the safety and security of participants; and for the presentation of evidence gathered from the battlefield that cannot be effectively presented in federal Courts. Now, some have suggested that this represents a reversal on my part. They are wrong. In 2006, I did strongly oppose legislation proposed by the Bush Administration and passed by the Congress because it failed to establish a legitimate legal framework, with the kind of meaningful due process and rights for the accused that could stand up on appeal. I did, however, support the use of military commissions to try detainees, provided there were several reforms. And those are the reforms that we are making. Instead of using the flawed Commissions of the last seven years, my Administration is bringing our Commissions in line with the rule of law. The rule will no longer permit us to use as evidence statements that have been obtained using cruel, inhuman, or degrading interrogation methods. We will no longer place the burden to prove that hearsay is unreliable on the opponent of the hearsay. And we will give detainees greater latitude in selecting their own counsel, and more protections if they refuse to testify. These reforms – among others – will make our Military Commissions a more credible and effective means of administering justice, and I will work with Congress and legal authorities across the political spectrum on legislation to ensure that these Commissions are fair, legitimate, and effective. The third category of detainees includes those who we have been ordered released by the courts. Let me repeat what I said earlier: this has absolutely nothing to do with my decision to close Guantanamo. It has to do with the rule of law. The courts have found that there is no legitimate reason to hold twenty-one of the people currently held at Guantanamo. Twenty of these findings took place before I came into office. The United States is a nation of laws, and we must abide by these rulings. The fourth category of cases involves detainees who we have determined can be transferred safely to another country. So far, our review team has approved fifty detainees for transfer. And my Administration is in ongoing discussions with a number of other countries about the transfer of detainees to their soil for detention and rehabilitation. Finally, there remains the question of detainees at Guantanamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantanamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture – like other prisoners of war – must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified.", 
        "intTime": 20090521, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. ... did not offer one little suggestion on what he is going to do with those 200 plus Terrorist.", 
        "reply": " You must not have listened very carefully. The President lists what he will do with all but a very few prisoners who cannot be released, but cannot be tried. We are currently in the process of reviewing each of the detainee cases at Guantanamo to determine the appropriate policy for dealing with them. As we do so, we are acutely aware that under the last Administration, detainees were released only to return to the battlefield. That is why we are doing away with the poorly planned, haphazard approach that let those detainees go in the past. Instead, we are treating these cases with the care and attention that the law requires and our security demands. Going forward, these cases will fall into five distinct categories. First, when feasible, we will try those who have violated American criminal laws in federal courts – courts provided for by the United States Constitution. Some have derided our federal courts as incapable of handling the trials of terrorists. They are wrong. Our courts and juries of our citizens are tough enough to convict terrorists, and the record makes that clear. Ramzi Yousef tried to blow up the World Trade Center – he was convicted in our courts, and is serving a life sentence in U.S. prison. Zaccarias Moussaoui has been identified as the 20th 9/11 hijacker – he was convicted in our courts, and he too is serving a life sentence in prison. If we can try those terrorists in our courts and hold them in our prisons, then we can do the same with detainees from Guantanamo. Recently, we prosecuted and received a guilty plea from a detainee – al-Marri – in federal court after years of legal confusion. We are preparing to transfer another detainee to the Southern District of New York, where he will face trial on charges related to the 1998 bombings of our embassies in Kenya and Tanzania – bombings that killed over 200 people. Preventing this detainee from coming to our shores would prevent his trial and conviction. And after over a decade, it is time to finally see that justice is served, and that is what we intend to do. The second category of cases involves detainees who violate the laws of war and are best tried through Military Commissions. Military commissions have a history in the United States dating back to George Washington and the Revolutionary War. They are an appropriate venue for trying detainees for violations of the laws of war. They allow for the protection of sensitive sources and methods of intelligence-gathering; for the safety and security of participants; and for the presentation of evidence gathered from the battlefield that cannot be effectively presented in federal Courts. Now, some have suggested that this represents a reversal on my part. They are wrong. In 2006, I did strongly oppose legislation proposed by the Bush Administration and passed by the Congress because it failed to establish a legitimate legal framework, with the kind of meaningful due process and rights for the accused that could stand up on appeal. I did, however, support the use of military commissions to try detainees, provided there were several reforms. And those are the reforms that we are making. Instead of using the flawed Commissions of the last seven years, my Administration is bringing our Commissions in line with the rule of law. The rule will no longer permit us to use as evidence statements that have been obtained using cruel, inhuman, or degrading interrogation methods. We will no longer place the burden to prove that hearsay is unreliable on the opponent of the hearsay. And we will give detainees greater latitude in selecting their own counsel, and more protections if they refuse to testify. These reforms – among others – will make our Military Commissions a more credible and effective means of administering justice, and I will work with Congress and legal authorities across the political spectrum on legislation to ensure that these Commissions are fair, legitimate, and effective. The third category of detainees includes those who we have been ordered released by the courts. Let me repeat what I said earlier: this has absolutely nothing to do with my decision to close Guantanamo. It has to do with the rule of law. The courts have found that there is no legitimate reason to hold twenty-one of the people currently held at Guantanamo. Twenty of these findings took place before I came into office. The United States is a nation of laws, and we must abide by these rulings. The fourth category of cases involves detainees who we have determined can be transferred safely to another country. So far, our review team has approved fifty detainees for transfer. And my Administration is in ongoing discussions with a number of other countries about the transfer of detainees to their soil for detention and rehabilitation. Finally, there remains the question of detainees at Guantanamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantanamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture – like other prisoners of war – must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:45:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO. Agreed. Obama is just rambling on about what may or may not happen, ifs and buts....Is this the kind of resolve we want in matters of National Security? He and the liberals look indecisive, confused, and divided about how to protect America... Cheney had his \"You're ******* right I ordered the code red!!!\" moment today", 
        "intTime": 20090521, 
        "postID": 8, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "reply": " Agreed. Obama is just rambling on about what may or may not happen, ifs and buts....Is this the kind of resolve we want in matters of National Security? He and the liberals look indecisive, confused, and divided about how to protect America... Cheney had his \"You're ******* right I ordered the code red!!!\" moment today", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:51:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "intTime": 20090521, 
        "postID": 9, 
        "quote": "", 
        "reply": "Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:55:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... Talk about partisan rant....Cheney defended torture? Only three Haji's were waterboarded, big deal, I would much rather trust the GOP to combat those digusting individuals in the middle east than these confused, probably stoned liberals who cannot make up their mind as to what to do....", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " Talk about partisan rant....Cheney defended torture? Only three Haji's were waterboarded, big deal, I would much rather trust the GOP to combat those digusting individuals in the middle east than these confused, probably stoned liberals who cannot make up their mind as to what to do....", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:01:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "", 
        "reply": "What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:11:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Obama is a slick speaker but true to form it was anothers fault...nor did he offer an idea of what \"he\" would have done differently.... just another finger pointing speech with no solution or how to get there. Cheney laid it out and up front. I have to side with Cheney on this one. As for closing Gitmo? Obama said when he was running that closing Gitmo would be one of the first things he'd do..... and that he did. But now, because he has no clue or plan of what to do with the detainees and no one wants them in their state, they'll have to stay. Obama will say, \"I said I would, I gave the order but they wouldn't let me\", again, not his fault. Just wait and see. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "", 
        "reply": "Obama is a slick speaker but true to form it was anothers fault...nor did he offer an idea of what \"he\" would have done differently.... just another finger pointing speech with no solution or how to get there. Cheney laid it out and up front. I have to side with Cheney on this one. As for closing Gitmo? Obama said when he was running that closing Gitmo would be one of the first things he'd do..... and that he did. But now, because he has no clue or plan of what to do with the detainees and no one wants them in their state, they'll have to stay. Obama will say, \"I said I would, I gave the order but they wouldn't let me\", again, not his fault. Just wait and see. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:13:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: What kind of flag, hammer and sickle? Indeed! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "Originally posted by mnoble1066: What kind of flag, hammer and sickle?", 
        "reply": " Indeed! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:28:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "", 
        "reply": "Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Hoooah Cheney!!!!!", 
        "intTime": 20090521, 
        "postID": 15, 
        "quote": "", 
        "reply": "Hoooah Cheney!!!!!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\" I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... WRONG,... ...He defended the deceisions made to keep this nation safe @ the time when the deceision had to be made, and that we were not cutting off heads in order to do it,... ... The \"Dim-o-crabs\" are just so content to mop up the leftovers after sitting on their collective arses, and looking to come out smelling like the rose,... ...Terrorists are bullies, Hit them hard right off the bat, or with a bat as far as I'm concerned, they have no boundries on how far they will go to bring us down,and will stoop to anything to distroy our way of life,... ... Cheney does have a big pair, and said it loud, and clear, whereas BHO's spokesman stood stammering over the release of the CIA's memo's to prove \"Nancy\" knew what was going on anyway back then,... The dem's, one step forward, three steps sideways, two reverse, which way were we going again,... ...", 
        "intTime": 20090521, 
        "postID": 16, 
        "quote": "Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\" I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " WRONG,... ...He defended the deceisions made to keep this nation safe @ the time when the deceision had to be made, and that we were not cutting off heads in order to do it,... ... The \"Dim-o-crabs\" are just so content to mop up the leftovers after sitting on their collective arses, and looking to come out smelling like the rose,... ...Terrorists are bullies, Hit them hard right off the bat, or with a bat as far as I'm concerned, they have no boundries on how far they will go to bring us down,and will stoop to anything to distroy our way of life,... ... Cheney does have a big pair, and said it loud, and clear, whereas BHO's spokesman stood stammering over the release of the CIA's memo's to prove \"Nancy\" knew what was going on anyway back then,... The dem's, one step forward, three steps sideways, two reverse, which way were we going again,... ...", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:53:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Terrror"
    }, 
    {
        "content": "OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "intTime": 20090521, 
        "postID": 17, 
        "quote": "", 
        "reply": "OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:33:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Obama vs Dick Cheney. Cheney wins. Cheney won what? A cupie doll? Fact is Obama is the PotUS and Cheney can suck but. The whole idea that torture makes us safer has not been proven and is disputed by many experts in the field.", 
        "intTime": 20090521, 
        "postID": 18, 
        "quote": "Obama vs Dick Cheney. Cheney wins.", 
        "reply": " Cheney won what? A cupie doll? Fact is Obama is the PotUS and Cheney can suck but. The whole idea that torture makes us safer has not been proven and is disputed by many experts in the field.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:46:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC! Cheney is the Sith Lord!!!!!!! Geez, get it right!!!! Seriously, strength of convictions, I'll say it again and again. When you waffle and flip-flop day in and day out, it shows that you lead on a whim, and that there's no inner strength. You know, the day's coming very soon when President Obama won't be able to blame President Bush anymore...", 
        "intTime": 20090521, 
        "postID": 19, 
        "quote": "Originally posted by Sgt_Salaam: OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "reply": " Cheney is the Sith Lord!!!!!!! Geez, get it right!!!! Seriously, strength of convictions, I'll say it again and again. When you waffle and flip-flop day in and day out, it shows that you lead on a whim, and that there's no inner strength. You know, the day's coming very soon when President Obama won't be able to blame President Bush anymore...", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:47:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Well, let's think about the effect of bringing the islamofascists and other terrorists at Gitmo to the USA. As the Chinese islamofascists would be imediately executed by the Chinese Gvt., well, they will come here. Further, the other nations of Origin of the terrorists refuse to take them back, the lot would come here. Once on formal (not leased) USA soil. it will be argued that they are due FULL American Constitutional rights as the Supreme Court HAS ALREADY stated. The argument that they are prisoners of war and that the Gvt. may hold them until the ending of hostilities as has been the case since \"parole\" has been inoperative since the Civil War will be ignored. So many will get , with the ACLU's assistance, the very best legal help from an organization willing to spend MILLIONS to free just one of these terrorists. And being very PC these days , many will be freed. After all, are we not a nation of laws (unless you are a bond holder of GM or Chrysler)? As we cannot send them back to their nations or origin, as they'd be killed there, we must free them and let them stay. We will, ultimately, provide food, shelter, preach their ideology of hate & murder and a place to attack us from within our own borders. Somehow, this does not seem to cross Mr. Obama's mind. Or that of his administration. Unless, of course, they are lying to us, or are more ignorant than dirt. You chose. And your solution to this dilema might be....what?", 
        "intTime": 20090521, 
        "postID": 20, 
        "quote": "", 
        "reply": "Well, let's think about the effect of bringing the islamofascists and other terrorists at Gitmo to the USA. As the Chinese islamofascists would be imediately executed by the Chinese Gvt., well, they will come here. Further, the other nations of Origin of the terrorists refuse to take them back, the lot would come here. Once on formal (not leased) USA soil. it will be argued that they are due FULL American Constitutional rights as the Supreme Court HAS ALREADY stated. The argument that they are prisoners of war and that the Gvt. may hold them until the ending of hostilities as has been the case since \"parole\" has been inoperative since the Civil War will be ignored. So many will get , with the ACLU's assistance, the very best legal help from an organization willing to spend MILLIONS to free just one of these terrorists. And being very PC these days , many will be freed. After all, are we not a nation of laws (unless you are a bond holder of GM or Chrysler)? As we cannot send them back to their nations or origin, as they'd be killed there, we must free them and let them stay. We will, ultimately, provide food, shelter, preach their ideology of hate & murder and a place to attack us from within our own borders. Somehow, this does not seem to cross Mr. Obama's mind. Or that of his administration. Unless, of course, they are lying to us, or are more ignorant than dirt. You chose. And your solution to this dilema might be....what?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:53:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "peter3_1"
    }, 
    {
        "content": "I wonder if the people of Selma Alabama still like Obama?", 
        "intTime": 20090521, 
        "postID": 21, 
        "quote": "", 
        "reply": "I wonder if the people of Selma Alabama still like Obama?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 14:27:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "intTime": 20090521, 
        "postID": 22, 
        "quote": "Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "reply": " Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 22:01:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 23, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "reply": " as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 22:50:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\". The worst of them will be tried and executed or sent to prison for life without parole, just like the terrorists from the Oklahoma City bombing and the first World Trade Center bombing were, among others. That is, unless all the evidence against them is declared inadmissible due to the torture they were subjected to by the Bush gang. As the President has said, there are a few detainees we have no reliable & admissable evidence against, yet they clearly pose a potential threat if released. I expect it will take some time to figure out the best way to legally handle those cases. I'd rather they take the time to do it right, rather than rushing into colossal macho blunders like the last administration. Any suggestion that Obama will just set terrorists free on US soil is simply absurd. The cases against Zubayda & KSM would have been much more secure had they never been subjected to waterboarding. If they aren't convicted of anything because the evidence is ruled inadmissible we will have \"the Decider\" to thank for it. And let's not forget that 2/3 of the original detainees at Gitmo had already been released while Bush was still in office. Some of them turned out to have been innocent, and have posed no threat since being released. An alarming number of others have since turned up fighting alongside our enemies in Iraq and Afghanistan though. If all those detainees were dangerous terrorists as Cheney keeps insisting, WTF did the Bush administration release them for? WTF did that do to keep us safe?", 
        "intTime": 20090521, 
        "postID": 24, 
        "quote": "Originally posted by Duster6: Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "reply": " The worst of them will be tried and executed or sent to prison for life without parole, just like the terrorists from the Oklahoma City bombing and the first World Trade Center bombing were, among others. That is, unless all the evidence against them is declared inadmissible due to the torture they were subjected to by the Bush gang. As the President has said, there are a few detainees we have no reliable & admissable evidence against, yet they clearly pose a potential threat if released. I expect it will take some time to figure out the best way to legally handle those cases. I'd rather they take the time to do it right, rather than rushing into colossal macho blunders like the last administration. Any suggestion that Obama will just set terrorists free on US soil is simply absurd. The cases against Zubayda & KSM would have been much more secure had they never been subjected to waterboarding. If they aren't convicted of anything because the evidence is ruled inadmissible we will have \"the Decider\" to thank for it. And let's not forget that 2/3 of the original detainees at Gitmo had already been released while Bush was still in office. Some of them turned out to have been innocent, and have posed no threat since being released. An alarming number of others have since turned up fighting alongside our enemies in Iraq and Afghanistan though. If all those detainees were dangerous terrorists as Cheney keeps insisting, WTF did the Bush administration release them for? WTF did that do to keep us safe?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 23:09:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: ...As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... I agree. Cheney is a poster boy for what drove the swing voters to reject the GOP and vote for Obama. The man has zero credibility with the vast majority of Americans. I'm tempted to believe that he is hoping and praying for another terrorist attack on US soil because it would salvage his nearly non-existent credibility. The longer he runs his mouth, the more likely the GOP will continue to shrink.", 
        "intTime": 20090521, 
        "postID": 25, 
        "quote": "Originally posted by Sgt_Salaam: ...As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " I agree. Cheney is a poster boy for what drove the swing voters to reject the GOP and vote for Obama. The man has zero credibility with the vast majority of Americans. I'm tempted to believe that he is hoping and praying for another terrorist attack on US soil because it would salvage his nearly non-existent credibility. The longer he runs his mouth, the more likely the GOP will continue to shrink.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 23:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. Is that the same Glenn Beck who was forced to admit to lying when he got caught red-handed on The View on Wednesday? The one who also admitted on that same show that he never fact-checks what he says on his show, and that he doesn't report actual news, just his personal opinions? The same Glenn Beck who then on his own radio show the following day retracted the admission to lying he made the day before on their show? He even said he should demand an apology from the women on that show. Do you think that's what he meant by, \"say what you mean and mean what you say\"? Why, the nerve of those women, using his own words to prove he's full of BS! <http://www.politicususa.com/en/Glenn-Beck-The-View>", 
        "intTime": 20090522, 
        "postID": 26, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon.", 
        "reply": " Is that the same Glenn Beck who was forced to admit to lying when he got caught red-handed on The View on Wednesday? The one who also admitted on that same show that he never fact-checks what he says on his show, and that he doesn't report actual news, just his personal opinions? The same Glenn Beck who then on his own radio show the following day retracted the admission to lying he made the day before on their show? He even said he should demand an apology from the women on that show. Do you think that's what he meant by, \"say what you mean and mean what you say\"? Why, the nerve of those women, using his own words to prove he's full of BS! <http://www.politicususa.com/en/Glenn-Beck-The-View>", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 00:03:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 27, 
        "quote": "", 
        "reply": "President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 01:34:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! Time to put the bottle down and go to bed... \"The World's Finest\"", 
        "intTime": 20090522, 
        "postID": 28, 
        "quote": "Originally posted by ProgMod: President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections!", 
        "reply": " Time to put the bottle down and go to bed... \"The World's Finest\"", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 02:46:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO. There is not one shred of proof that torturing prisoners has saved even one American life or thwarted even one act of terrorism. Not one. But it is abundantly clear that the last administration's anything goes attitude has put more Americans at risk, cost invaluable allied support, and cast our culture as hypocritical. The ends do not justify the means, and it was a dark day for America when Dubya and Dick started us down that path. Gitmo needs to be closed immediately, and Dick needs to take a page from Dubya's current playbook and just go away! Every time he opens his mouth, he does more harm to America's image as a peace loving law abiding nation, and this makes us less safe and puts our brave young men and women fighting the real war against terrorism at greater risk...of course that is something that a draft-dodging talking head would not understand. Cheney is not, \"right,\" he is just plain stupid. He reminds me of the child who continues to argue with his parents to try to justify his stupidity.", 
        "intTime": 20090522, 
        "postID": 29, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "reply": " There is not one shred of proof that torturing prisoners has saved even one American life or thwarted even one act of terrorism. Not one. But it is abundantly clear that the last administration's anything goes attitude has put more Americans at risk, cost invaluable allied support, and cast our culture as hypocritical. The ends do not justify the means, and it was a dark day for America when Dubya and Dick started us down that path. Gitmo needs to be closed immediately, and Dick needs to take a page from Dubya's current playbook and just go away! Every time he opens his mouth, he does more harm to America's image as a peace loving law abiding nation, and this makes us less safe and puts our brave young men and women fighting the real war against terrorism at greater risk...of course that is something that a draft-dodging talking head would not understand. Cheney is not, \"right,\" he is just plain stupid. He reminds me of the child who continues to argue with his parents to try to justify his stupidity.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 04:29:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "skinman13"
    }, 
    {
        "content": "I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "intTime": 20090521, 
        "postID": 30, 
        "quote": "", 
        "reply": "I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:20:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Did Durbin and Reid write his speech? \"The World's Finest\"", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "", 
        "reply": "Did Durbin and Reid write his speech? \"The World's Finest\"", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:27:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "As to the subject line - YES, every time. It almost makes me cringe to see the two names in one sentence. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "", 
        "reply": "As to the subject line - YES, every time. It almost makes me cringe to see the two names in one sentence. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "", 
        "reply": "I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean? It means that he found out during the election that not wearing the flag pin was hurting him in the polls...after that, he started wearing one.", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "Originally posted by 5727609: I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "reply": " It means that he found out during the election that not wearing the flag pin was hurting him in the polls...after that, he started wearing one.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:54:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "What kind of flag, hammer and sickle?", 
        "intTime": 20090521, 
        "postID": 35, 
        "quote": "", 
        "reply": "What kind of flag, hammer and sickle?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:59:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. ... did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. You must not have listened very carefully. The President lists what he will do with all but a very few prisoners who cannot be released, but cannot be tried. We are currently in the process of reviewing each of the detainee cases at Guantanamo to determine the appropriate policy for dealing with them. As we do so, we are acutely aware that under the last Administration, detainees were released only to return to the battlefield. That is why we are doing away with the poorly planned, haphazard approach that let those detainees go in the past. Instead, we are treating these cases with the care and attention that the law requires and our security demands. Going forward, these cases will fall into five distinct categories. First, when feasible, we will try those who have violated American criminal laws in federal courts – courts provided for by the United States Constitution. Some have derided our federal courts as incapable of handling the trials of terrorists. They are wrong. Our courts and juries of our citizens are tough enough to convict terrorists, and the record makes that clear. Ramzi Yousef tried to blow up the World Trade Center – he was convicted in our courts, and is serving a life sentence in U.S. prison. Zaccarias Moussaoui has been identified as the 20th 9/11 hijacker – he was convicted in our courts, and he too is serving a life sentence in prison. If we can try those terrorists in our courts and hold them in our prisons, then we can do the same with detainees from Guantanamo. Recently, we prosecuted and received a guilty plea from a detainee – al-Marri – in federal court after years of legal confusion. We are preparing to transfer another detainee to the Southern District of New York, where he will face trial on charges related to the 1998 bombings of our embassies in Kenya and Tanzania – bombings that killed over 200 people. Preventing this detainee from coming to our shores would prevent his trial and conviction. And after over a decade, it is time to finally see that justice is served, and that is what we intend to do. The second category of cases involves detainees who violate the laws of war and are best tried through Military Commissions. Military commissions have a history in the United States dating back to George Washington and the Revolutionary War. They are an appropriate venue for trying detainees for violations of the laws of war. They allow for the protection of sensitive sources and methods of intelligence-gathering; for the safety and security of participants; and for the presentation of evidence gathered from the battlefield that cannot be effectively presented in federal Courts. Now, some have suggested that this represents a reversal on my part. They are wrong. In 2006, I did strongly oppose legislation proposed by the Bush Administration and passed by the Congress because it failed to establish a legitimate legal framework, with the kind of meaningful due process and rights for the accused that could stand up on appeal. I did, however, support the use of military commissions to try detainees, provided there were several reforms. And those are the reforms that we are making. Instead of using the flawed Commissions of the last seven years, my Administration is bringing our Commissions in line with the rule of law. The rule will no longer permit us to use as evidence statements that have been obtained using cruel, inhuman, or degrading interrogation methods. We will no longer place the burden to prove that hearsay is unreliable on the opponent of the hearsay. And we will give detainees greater latitude in selecting their own counsel, and more protections if they refuse to testify. These reforms – among others – will make our Military Commissions a more credible and effective means of administering justice, and I will work with Congress and legal authorities across the political spectrum on legislation to ensure that these Commissions are fair, legitimate, and effective. The third category of detainees includes those who we have been ordered released by the courts. Let me repeat what I said earlier: this has absolutely nothing to do with my decision to close Guantanamo. It has to do with the rule of law. The courts have found that there is no legitimate reason to hold twenty-one of the people currently held at Guantanamo. Twenty of these findings took place before I came into office. The United States is a nation of laws, and we must abide by these rulings. The fourth category of cases involves detainees who we have determined can be transferred safely to another country. So far, our review team has approved fifty detainees for transfer. And my Administration is in ongoing discussions with a number of other countries about the transfer of detainees to their soil for detention and rehabilitation. Finally, there remains the question of detainees at Guantanamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantanamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture – like other prisoners of war – must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified.", 
        "intTime": 20090521, 
        "postID": 36, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. ... did not offer one little suggestion on what he is going to do with those 200 plus Terrorist.", 
        "reply": " You must not have listened very carefully. The President lists what he will do with all but a very few prisoners who cannot be released, but cannot be tried. We are currently in the process of reviewing each of the detainee cases at Guantanamo to determine the appropriate policy for dealing with them. As we do so, we are acutely aware that under the last Administration, detainees were released only to return to the battlefield. That is why we are doing away with the poorly planned, haphazard approach that let those detainees go in the past. Instead, we are treating these cases with the care and attention that the law requires and our security demands. Going forward, these cases will fall into five distinct categories. First, when feasible, we will try those who have violated American criminal laws in federal courts – courts provided for by the United States Constitution. Some have derided our federal courts as incapable of handling the trials of terrorists. They are wrong. Our courts and juries of our citizens are tough enough to convict terrorists, and the record makes that clear. Ramzi Yousef tried to blow up the World Trade Center – he was convicted in our courts, and is serving a life sentence in U.S. prison. Zaccarias Moussaoui has been identified as the 20th 9/11 hijacker – he was convicted in our courts, and he too is serving a life sentence in prison. If we can try those terrorists in our courts and hold them in our prisons, then we can do the same with detainees from Guantanamo. Recently, we prosecuted and received a guilty plea from a detainee – al-Marri – in federal court after years of legal confusion. We are preparing to transfer another detainee to the Southern District of New York, where he will face trial on charges related to the 1998 bombings of our embassies in Kenya and Tanzania – bombings that killed over 200 people. Preventing this detainee from coming to our shores would prevent his trial and conviction. And after over a decade, it is time to finally see that justice is served, and that is what we intend to do. The second category of cases involves detainees who violate the laws of war and are best tried through Military Commissions. Military commissions have a history in the United States dating back to George Washington and the Revolutionary War. They are an appropriate venue for trying detainees for violations of the laws of war. They allow for the protection of sensitive sources and methods of intelligence-gathering; for the safety and security of participants; and for the presentation of evidence gathered from the battlefield that cannot be effectively presented in federal Courts. Now, some have suggested that this represents a reversal on my part. They are wrong. In 2006, I did strongly oppose legislation proposed by the Bush Administration and passed by the Congress because it failed to establish a legitimate legal framework, with the kind of meaningful due process and rights for the accused that could stand up on appeal. I did, however, support the use of military commissions to try detainees, provided there were several reforms. And those are the reforms that we are making. Instead of using the flawed Commissions of the last seven years, my Administration is bringing our Commissions in line with the rule of law. The rule will no longer permit us to use as evidence statements that have been obtained using cruel, inhuman, or degrading interrogation methods. We will no longer place the burden to prove that hearsay is unreliable on the opponent of the hearsay. And we will give detainees greater latitude in selecting their own counsel, and more protections if they refuse to testify. These reforms – among others – will make our Military Commissions a more credible and effective means of administering justice, and I will work with Congress and legal authorities across the political spectrum on legislation to ensure that these Commissions are fair, legitimate, and effective. The third category of detainees includes those who we have been ordered released by the courts. Let me repeat what I said earlier: this has absolutely nothing to do with my decision to close Guantanamo. It has to do with the rule of law. The courts have found that there is no legitimate reason to hold twenty-one of the people currently held at Guantanamo. Twenty of these findings took place before I came into office. The United States is a nation of laws, and we must abide by these rulings. The fourth category of cases involves detainees who we have determined can be transferred safely to another country. So far, our review team has approved fifty detainees for transfer. And my Administration is in ongoing discussions with a number of other countries about the transfer of detainees to their soil for detention and rehabilitation. Finally, there remains the question of detainees at Guantanamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantanamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture – like other prisoners of war – must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:45:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO. Agreed. Obama is just rambling on about what may or may not happen, ifs and buts....Is this the kind of resolve we want in matters of National Security? He and the liberals look indecisive, confused, and divided about how to protect America... Cheney had his \"You're ******* right I ordered the code red!!!\" moment today", 
        "intTime": 20090521, 
        "postID": 37, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "reply": " Agreed. Obama is just rambling on about what may or may not happen, ifs and buts....Is this the kind of resolve we want in matters of National Security? He and the liberals look indecisive, confused, and divided about how to protect America... Cheney had his \"You're ******* right I ordered the code red!!!\" moment today", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:51:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "intTime": 20090521, 
        "postID": 38, 
        "quote": "", 
        "reply": "Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:55:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... Talk about partisan rant....Cheney defended torture? Only three Haji's were waterboarded, big deal, I would much rather trust the GOP to combat those digusting individuals in the middle east than these confused, probably stoned liberals who cannot make up their mind as to what to do....", 
        "intTime": 20090521, 
        "postID": 39, 
        "quote": "Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " Talk about partisan rant....Cheney defended torture? Only three Haji's were waterboarded, big deal, I would much rather trust the GOP to combat those digusting individuals in the middle east than these confused, probably stoned liberals who cannot make up their mind as to what to do....", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:01:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "intTime": 20090521, 
        "postID": 40, 
        "quote": "", 
        "reply": "What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:11:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Obama is a slick speaker but true to form it was anothers fault...nor did he offer an idea of what \"he\" would have done differently.... just another finger pointing speech with no solution or how to get there. Cheney laid it out and up front. I have to side with Cheney on this one. As for closing Gitmo? Obama said when he was running that closing Gitmo would be one of the first things he'd do..... and that he did. But now, because he has no clue or plan of what to do with the detainees and no one wants them in their state, they'll have to stay. Obama will say, \"I said I would, I gave the order but they wouldn't let me\", again, not his fault. Just wait and see. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 41, 
        "quote": "", 
        "reply": "Obama is a slick speaker but true to form it was anothers fault...nor did he offer an idea of what \"he\" would have done differently.... just another finger pointing speech with no solution or how to get there. Cheney laid it out and up front. I have to side with Cheney on this one. As for closing Gitmo? Obama said when he was running that closing Gitmo would be one of the first things he'd do..... and that he did. But now, because he has no clue or plan of what to do with the detainees and no one wants them in their state, they'll have to stay. Obama will say, \"I said I would, I gave the order but they wouldn't let me\", again, not his fault. Just wait and see. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:13:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: What kind of flag, hammer and sickle? Indeed! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 42, 
        "quote": "Originally posted by mnoble1066: What kind of flag, hammer and sickle?", 
        "reply": " Indeed! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:28:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "intTime": 20090521, 
        "postID": 43, 
        "quote": "", 
        "reply": "Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Hoooah Cheney!!!!!", 
        "intTime": 20090521, 
        "postID": 44, 
        "quote": "", 
        "reply": "Hoooah Cheney!!!!!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\" I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... WRONG,... ...He defended the deceisions made to keep this nation safe @ the time when the deceision had to be made, and that we were not cutting off heads in order to do it,... ... The \"Dim-o-crabs\" are just so content to mop up the leftovers after sitting on their collective arses, and looking to come out smelling like the rose,... ...Terrorists are bullies, Hit them hard right off the bat, or with a bat as far as I'm concerned, they have no boundries on how far they will go to bring us down,and will stoop to anything to distroy our way of life,... ... Cheney does have a big pair, and said it loud, and clear, whereas BHO's spokesman stood stammering over the release of the CIA's memo's to prove \"Nancy\" knew what was going on anyway back then,... The dem's, one step forward, three steps sideways, two reverse, which way were we going again,... ...", 
        "intTime": 20090521, 
        "postID": 45, 
        "quote": "Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\" I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " WRONG,... ...He defended the deceisions made to keep this nation safe @ the time when the deceision had to be made, and that we were not cutting off heads in order to do it,... ... The \"Dim-o-crabs\" are just so content to mop up the leftovers after sitting on their collective arses, and looking to come out smelling like the rose,... ...Terrorists are bullies, Hit them hard right off the bat, or with a bat as far as I'm concerned, they have no boundries on how far they will go to bring us down,and will stoop to anything to distroy our way of life,... ... Cheney does have a big pair, and said it loud, and clear, whereas BHO's spokesman stood stammering over the release of the CIA's memo's to prove \"Nancy\" knew what was going on anyway back then,... The dem's, one step forward, three steps sideways, two reverse, which way were we going again,... ...", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:53:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Terrror"
    }, 
    {
        "content": "OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "intTime": 20090521, 
        "postID": 46, 
        "quote": "", 
        "reply": "OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:33:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Obama vs Dick Cheney. Cheney wins. Cheney won what? A cupie doll? Fact is Obama is the PotUS and Cheney can suck but. The whole idea that torture makes us safer has not been proven and is disputed by many experts in the field.", 
        "intTime": 20090521, 
        "postID": 47, 
        "quote": "Obama vs Dick Cheney. Cheney wins.", 
        "reply": " Cheney won what? A cupie doll? Fact is Obama is the PotUS and Cheney can suck but. The whole idea that torture makes us safer has not been proven and is disputed by many experts in the field.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:46:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC! Cheney is the Sith Lord!!!!!!! Geez, get it right!!!! Seriously, strength of convictions, I'll say it again and again. When you waffle and flip-flop day in and day out, it shows that you lead on a whim, and that there's no inner strength. You know, the day's coming very soon when President Obama won't be able to blame President Bush anymore...", 
        "intTime": 20090521, 
        "postID": 48, 
        "quote": "Originally posted by Sgt_Salaam: OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "reply": " Cheney is the Sith Lord!!!!!!! Geez, get it right!!!! Seriously, strength of convictions, I'll say it again and again. When you waffle and flip-flop day in and day out, it shows that you lead on a whim, and that there's no inner strength. You know, the day's coming very soon when President Obama won't be able to blame President Bush anymore...", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:47:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Well, let's think about the effect of bringing the islamofascists and other terrorists at Gitmo to the USA. As the Chinese islamofascists would be imediately executed by the Chinese Gvt., well, they will come here. Further, the other nations of Origin of the terrorists refuse to take them back, the lot would come here. Once on formal (not leased) USA soil. it will be argued that they are due FULL American Constitutional rights as the Supreme Court HAS ALREADY stated. The argument that they are prisoners of war and that the Gvt. may hold them until the ending of hostilities as has been the case since \"parole\" has been inoperative since the Civil War will be ignored. So many will get , with the ACLU's assistance, the very best legal help from an organization willing to spend MILLIONS to free just one of these terrorists. And being very PC these days , many will be freed. After all, are we not a nation of laws (unless you are a bond holder of GM or Chrysler)? As we cannot send them back to their nations or origin, as they'd be killed there, we must free them and let them stay. We will, ultimately, provide food, shelter, preach their ideology of hate & murder and a place to attack us from within our own borders. Somehow, this does not seem to cross Mr. Obama's mind. Or that of his administration. Unless, of course, they are lying to us, or are more ignorant than dirt. You chose. And your solution to this dilema might be....what?", 
        "intTime": 20090521, 
        "postID": 49, 
        "quote": "", 
        "reply": "Well, let's think about the effect of bringing the islamofascists and other terrorists at Gitmo to the USA. As the Chinese islamofascists would be imediately executed by the Chinese Gvt., well, they will come here. Further, the other nations of Origin of the terrorists refuse to take them back, the lot would come here. Once on formal (not leased) USA soil. it will be argued that they are due FULL American Constitutional rights as the Supreme Court HAS ALREADY stated. The argument that they are prisoners of war and that the Gvt. may hold them until the ending of hostilities as has been the case since \"parole\" has been inoperative since the Civil War will be ignored. So many will get , with the ACLU's assistance, the very best legal help from an organization willing to spend MILLIONS to free just one of these terrorists. And being very PC these days , many will be freed. After all, are we not a nation of laws (unless you are a bond holder of GM or Chrysler)? As we cannot send them back to their nations or origin, as they'd be killed there, we must free them and let them stay. We will, ultimately, provide food, shelter, preach their ideology of hate & murder and a place to attack us from within our own borders. Somehow, this does not seem to cross Mr. Obama's mind. Or that of his administration. Unless, of course, they are lying to us, or are more ignorant than dirt. You chose. And your solution to this dilema might be....what?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:53:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "peter3_1"
    }, 
    {
        "content": "I wonder if the people of Selma Alabama still like Obama?", 
        "intTime": 20090521, 
        "postID": 50, 
        "quote": "", 
        "reply": "I wonder if the people of Selma Alabama still like Obama?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 14:27:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "intTime": 20090521, 
        "postID": 51, 
        "quote": "Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "reply": " Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 22:01:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 52, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "reply": " as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 22:50:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\". The worst of them will be tried and executed or sent to prison for life without parole, just like the terrorists from the Oklahoma City bombing and the first World Trade Center bombing were, among others. That is, unless all the evidence against them is declared inadmissible due to the torture they were subjected to by the Bush gang. As the President has said, there are a few detainees we have no reliable & admissable evidence against, yet they clearly pose a potential threat if released. I expect it will take some time to figure out the best way to legally handle those cases. I'd rather they take the time to do it right, rather than rushing into colossal macho blunders like the last administration. Any suggestion that Obama will just set terrorists free on US soil is simply absurd. The cases against Zubayda & KSM would have been much more secure had they never been subjected to waterboarding. If they aren't convicted of anything because the evidence is ruled inadmissible we will have \"the Decider\" to thank for it. And let's not forget that 2/3 of the original detainees at Gitmo had already been released while Bush was still in office. Some of them turned out to have been innocent, and have posed no threat since being released. An alarming number of others have since turned up fighting alongside our enemies in Iraq and Afghanistan though. If all those detainees were dangerous terrorists as Cheney keeps insisting, WTF did the Bush administration release them for? WTF did that do to keep us safe?", 
        "intTime": 20090521, 
        "postID": 53, 
        "quote": "Originally posted by Duster6: Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "reply": " The worst of them will be tried and executed or sent to prison for life without parole, just like the terrorists from the Oklahoma City bombing and the first World Trade Center bombing were, among others. That is, unless all the evidence against them is declared inadmissible due to the torture they were subjected to by the Bush gang. As the President has said, there are a few detainees we have no reliable & admissable evidence against, yet they clearly pose a potential threat if released. I expect it will take some time to figure out the best way to legally handle those cases. I'd rather they take the time to do it right, rather than rushing into colossal macho blunders like the last administration. Any suggestion that Obama will just set terrorists free on US soil is simply absurd. The cases against Zubayda & KSM would have been much more secure had they never been subjected to waterboarding. If they aren't convicted of anything because the evidence is ruled inadmissible we will have \"the Decider\" to thank for it. And let's not forget that 2/3 of the original detainees at Gitmo had already been released while Bush was still in office. Some of them turned out to have been innocent, and have posed no threat since being released. An alarming number of others have since turned up fighting alongside our enemies in Iraq and Afghanistan though. If all those detainees were dangerous terrorists as Cheney keeps insisting, WTF did the Bush administration release them for? WTF did that do to keep us safe?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 23:09:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: ...As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... I agree. Cheney is a poster boy for what drove the swing voters to reject the GOP and vote for Obama. The man has zero credibility with the vast majority of Americans. I'm tempted to believe that he is hoping and praying for another terrorist attack on US soil because it would salvage his nearly non-existent credibility. The longer he runs his mouth, the more likely the GOP will continue to shrink.", 
        "intTime": 20090521, 
        "postID": 54, 
        "quote": "Originally posted by Sgt_Salaam: ...As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " I agree. Cheney is a poster boy for what drove the swing voters to reject the GOP and vote for Obama. The man has zero credibility with the vast majority of Americans. I'm tempted to believe that he is hoping and praying for another terrorist attack on US soil because it would salvage his nearly non-existent credibility. The longer he runs his mouth, the more likely the GOP will continue to shrink.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 23:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. Is that the same Glenn Beck who was forced to admit to lying when he got caught red-handed on The View on Wednesday? The one who also admitted on that same show that he never fact-checks what he says on his show, and that he doesn't report actual news, just his personal opinions? The same Glenn Beck who then on his own radio show the following day retracted the admission to lying he made the day before on their show? He even said he should demand an apology from the women on that show. Do you think that's what he meant by, \"say what you mean and mean what you say\"? Why, the nerve of those women, using his own words to prove he's full of BS! <http://www.politicususa.com/en/Glenn-Beck-The-View>", 
        "intTime": 20090522, 
        "postID": 55, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon.", 
        "reply": " Is that the same Glenn Beck who was forced to admit to lying when he got caught red-handed on The View on Wednesday? The one who also admitted on that same show that he never fact-checks what he says on his show, and that he doesn't report actual news, just his personal opinions? The same Glenn Beck who then on his own radio show the following day retracted the admission to lying he made the day before on their show? He even said he should demand an apology from the women on that show. Do you think that's what he meant by, \"say what you mean and mean what you say\"? Why, the nerve of those women, using his own words to prove he's full of BS! <http://www.politicususa.com/en/Glenn-Beck-The-View>", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 00:03:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 56, 
        "quote": "", 
        "reply": "President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 01:34:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! Time to put the bottle down and go to bed... \"The World's Finest\"", 
        "intTime": 20090522, 
        "postID": 57, 
        "quote": "Originally posted by ProgMod: President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections!", 
        "reply": " Time to put the bottle down and go to bed... \"The World's Finest\"", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 02:46:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO. There is not one shred of proof that torturing prisoners has saved even one American life or thwarted even one act of terrorism. Not one. But it is abundantly clear that the last administration's anything goes attitude has put more Americans at risk, cost invaluable allied support, and cast our culture as hypocritical. The ends do not justify the means, and it was a dark day for America when Dubya and Dick started us down that path. Gitmo needs to be closed immediately, and Dick needs to take a page from Dubya's current playbook and just go away! Every time he opens his mouth, he does more harm to America's image as a peace loving law abiding nation, and this makes us less safe and puts our brave young men and women fighting the real war against terrorism at greater risk...of course that is something that a draft-dodging talking head would not understand. Cheney is not, \"right,\" he is just plain stupid. He reminds me of the child who continues to argue with his parents to try to justify his stupidity.", 
        "intTime": 20090522, 
        "postID": 58, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "reply": " There is not one shred of proof that torturing prisoners has saved even one American life or thwarted even one act of terrorism. Not one. But it is abundantly clear that the last administration's anything goes attitude has put more Americans at risk, cost invaluable allied support, and cast our culture as hypocritical. The ends do not justify the means, and it was a dark day for America when Dubya and Dick started us down that path. Gitmo needs to be closed immediately, and Dick needs to take a page from Dubya's current playbook and just go away! Every time he opens his mouth, he does more harm to America's image as a peace loving law abiding nation, and this makes us less safe and puts our brave young men and women fighting the real war against terrorism at greater risk...of course that is something that a draft-dodging talking head would not understand. Cheney is not, \"right,\" he is just plain stupid. He reminds me of the child who continues to argue with his parents to try to justify his stupidity.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 04:29:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "skinman13"
    }, 
    {
        "content": "I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "intTime": 20090521, 
        "postID": 59, 
        "quote": "", 
        "reply": "I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:20:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Did Durbin and Reid write his speech? \"The World's Finest\"", 
        "intTime": 20090521, 
        "postID": 60, 
        "quote": "", 
        "reply": "Did Durbin and Reid write his speech? \"The World's Finest\"", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:27:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "As to the subject line - YES, every time. It almost makes me cringe to see the two names in one sentence. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 61, 
        "quote": "", 
        "reply": "As to the subject line - YES, every time. It almost makes me cringe to see the two names in one sentence. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "intTime": 20090521, 
        "postID": 62, 
        "quote": "", 
        "reply": "I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:38:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean? It means that he found out during the election that not wearing the flag pin was hurting him in the polls...after that, he started wearing one.", 
        "intTime": 20090521, 
        "postID": 63, 
        "quote": "Originally posted by 5727609: I have always liked Cheney because he is a good clear and rational thinker as witnessed today. Peoplw may not like his coneection w/ haliburton but neither does Obama and as we hav e heard wants trickle up to the poor house policies. Obama has shredded the Constitution with his announced closing of Gitmo He calls the war on Islamoterrorism Overseas contingency operations. I wonder who is pulling this mans' strings for the decisions he makes. Will he grant these scum legal counsel? Can you say ACLU. Is he in bed with this anti- American group? I do not like this President nor many in his \"administration\". I feel many of his policies are not good for this nation for which many are sacrificing life and limb. I feel infuriated every time the guy opens his mouth. NEVER have I heard him speek well of the one nation under God. At least he wears a flag pin now. What could that mean?", 
        "reply": " It means that he found out during the election that not wearing the flag pin was hurting him in the polls...after that, he started wearing one.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:54:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "What kind of flag, hammer and sickle?", 
        "intTime": 20090521, 
        "postID": 64, 
        "quote": "", 
        "reply": "What kind of flag, hammer and sickle?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 10:59:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. ... did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. You must not have listened very carefully. The President lists what he will do with all but a very few prisoners who cannot be released, but cannot be tried. We are currently in the process of reviewing each of the detainee cases at Guantanamo to determine the appropriate policy for dealing with them. As we do so, we are acutely aware that under the last Administration, detainees were released only to return to the battlefield. That is why we are doing away with the poorly planned, haphazard approach that let those detainees go in the past. Instead, we are treating these cases with the care and attention that the law requires and our security demands. Going forward, these cases will fall into five distinct categories. First, when feasible, we will try those who have violated American criminal laws in federal courts – courts provided for by the United States Constitution. Some have derided our federal courts as incapable of handling the trials of terrorists. They are wrong. Our courts and juries of our citizens are tough enough to convict terrorists, and the record makes that clear. Ramzi Yousef tried to blow up the World Trade Center – he was convicted in our courts, and is serving a life sentence in U.S. prison. Zaccarias Moussaoui has been identified as the 20th 9/11 hijacker – he was convicted in our courts, and he too is serving a life sentence in prison. If we can try those terrorists in our courts and hold them in our prisons, then we can do the same with detainees from Guantanamo. Recently, we prosecuted and received a guilty plea from a detainee – al-Marri – in federal court after years of legal confusion. We are preparing to transfer another detainee to the Southern District of New York, where he will face trial on charges related to the 1998 bombings of our embassies in Kenya and Tanzania – bombings that killed over 200 people. Preventing this detainee from coming to our shores would prevent his trial and conviction. And after over a decade, it is time to finally see that justice is served, and that is what we intend to do. The second category of cases involves detainees who violate the laws of war and are best tried through Military Commissions. Military commissions have a history in the United States dating back to George Washington and the Revolutionary War. They are an appropriate venue for trying detainees for violations of the laws of war. They allow for the protection of sensitive sources and methods of intelligence-gathering; for the safety and security of participants; and for the presentation of evidence gathered from the battlefield that cannot be effectively presented in federal Courts. Now, some have suggested that this represents a reversal on my part. They are wrong. In 2006, I did strongly oppose legislation proposed by the Bush Administration and passed by the Congress because it failed to establish a legitimate legal framework, with the kind of meaningful due process and rights for the accused that could stand up on appeal. I did, however, support the use of military commissions to try detainees, provided there were several reforms. And those are the reforms that we are making. Instead of using the flawed Commissions of the last seven years, my Administration is bringing our Commissions in line with the rule of law. The rule will no longer permit us to use as evidence statements that have been obtained using cruel, inhuman, or degrading interrogation methods. We will no longer place the burden to prove that hearsay is unreliable on the opponent of the hearsay. And we will give detainees greater latitude in selecting their own counsel, and more protections if they refuse to testify. These reforms – among others – will make our Military Commissions a more credible and effective means of administering justice, and I will work with Congress and legal authorities across the political spectrum on legislation to ensure that these Commissions are fair, legitimate, and effective. The third category of detainees includes those who we have been ordered released by the courts. Let me repeat what I said earlier: this has absolutely nothing to do with my decision to close Guantanamo. It has to do with the rule of law. The courts have found that there is no legitimate reason to hold twenty-one of the people currently held at Guantanamo. Twenty of these findings took place before I came into office. The United States is a nation of laws, and we must abide by these rulings. The fourth category of cases involves detainees who we have determined can be transferred safely to another country. So far, our review team has approved fifty detainees for transfer. And my Administration is in ongoing discussions with a number of other countries about the transfer of detainees to their soil for detention and rehabilitation. Finally, there remains the question of detainees at Guantanamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantanamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture – like other prisoners of war – must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified.", 
        "intTime": 20090521, 
        "postID": 65, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. ... did not offer one little suggestion on what he is going to do with those 200 plus Terrorist.", 
        "reply": " You must not have listened very carefully. The President lists what he will do with all but a very few prisoners who cannot be released, but cannot be tried. We are currently in the process of reviewing each of the detainee cases at Guantanamo to determine the appropriate policy for dealing with them. As we do so, we are acutely aware that under the last Administration, detainees were released only to return to the battlefield. That is why we are doing away with the poorly planned, haphazard approach that let those detainees go in the past. Instead, we are treating these cases with the care and attention that the law requires and our security demands. Going forward, these cases will fall into five distinct categories. First, when feasible, we will try those who have violated American criminal laws in federal courts – courts provided for by the United States Constitution. Some have derided our federal courts as incapable of handling the trials of terrorists. They are wrong. Our courts and juries of our citizens are tough enough to convict terrorists, and the record makes that clear. Ramzi Yousef tried to blow up the World Trade Center – he was convicted in our courts, and is serving a life sentence in U.S. prison. Zaccarias Moussaoui has been identified as the 20th 9/11 hijacker – he was convicted in our courts, and he too is serving a life sentence in prison. If we can try those terrorists in our courts and hold them in our prisons, then we can do the same with detainees from Guantanamo. Recently, we prosecuted and received a guilty plea from a detainee – al-Marri – in federal court after years of legal confusion. We are preparing to transfer another detainee to the Southern District of New York, where he will face trial on charges related to the 1998 bombings of our embassies in Kenya and Tanzania – bombings that killed over 200 people. Preventing this detainee from coming to our shores would prevent his trial and conviction. And after over a decade, it is time to finally see that justice is served, and that is what we intend to do. The second category of cases involves detainees who violate the laws of war and are best tried through Military Commissions. Military commissions have a history in the United States dating back to George Washington and the Revolutionary War. They are an appropriate venue for trying detainees for violations of the laws of war. They allow for the protection of sensitive sources and methods of intelligence-gathering; for the safety and security of participants; and for the presentation of evidence gathered from the battlefield that cannot be effectively presented in federal Courts. Now, some have suggested that this represents a reversal on my part. They are wrong. In 2006, I did strongly oppose legislation proposed by the Bush Administration and passed by the Congress because it failed to establish a legitimate legal framework, with the kind of meaningful due process and rights for the accused that could stand up on appeal. I did, however, support the use of military commissions to try detainees, provided there were several reforms. And those are the reforms that we are making. Instead of using the flawed Commissions of the last seven years, my Administration is bringing our Commissions in line with the rule of law. The rule will no longer permit us to use as evidence statements that have been obtained using cruel, inhuman, or degrading interrogation methods. We will no longer place the burden to prove that hearsay is unreliable on the opponent of the hearsay. And we will give detainees greater latitude in selecting their own counsel, and more protections if they refuse to testify. These reforms – among others – will make our Military Commissions a more credible and effective means of administering justice, and I will work with Congress and legal authorities across the political spectrum on legislation to ensure that these Commissions are fair, legitimate, and effective. The third category of detainees includes those who we have been ordered released by the courts. Let me repeat what I said earlier: this has absolutely nothing to do with my decision to close Guantanamo. It has to do with the rule of law. The courts have found that there is no legitimate reason to hold twenty-one of the people currently held at Guantanamo. Twenty of these findings took place before I came into office. The United States is a nation of laws, and we must abide by these rulings. The fourth category of cases involves detainees who we have determined can be transferred safely to another country. So far, our review team has approved fifty detainees for transfer. And my Administration is in ongoing discussions with a number of other countries about the transfer of detainees to their soil for detention and rehabilitation. Finally, there remains the question of detainees at Guantanamo who cannot be prosecuted yet who pose a clear danger to the American people. I want to be honest: this is the toughest issue we will face. We are going to exhaust every avenue that we have to prosecute those at Guantanamo who pose a danger to our country. But even when this process is complete, there may be a number of people who cannot be prosecuted for past crimes, but who nonetheless pose a threat to the security of the United States. Examples of that threat include people who have received extensive explosives training at al Qaeda training camps, commanded Taliban troops in battle, expressed their allegiance to Osama bin Laden, or otherwise made it clear that they want to kill Americans. These are people who, in effect, remain at war with the United States. As I said, I am not going to release individuals who endanger the American people. Al Qaeda terrorists and their affiliates are at war with the United States, and those that we capture – like other prisoners of war – must be prevented from attacking us again. However, we must recognize that these detention policies cannot be unbounded. That is why my Administration has begun to reshape these standards to ensure they are in line with the rule of law. We must have clear, defensible and lawful standards for those who fall in this category. We must have fair procedures so that we don’t make mistakes. We must have a thorough process of periodic review, so that any prolonged detention is carefully evaluated and justified.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:45:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO. Agreed. Obama is just rambling on about what may or may not happen, ifs and buts....Is this the kind of resolve we want in matters of National Security? He and the liberals look indecisive, confused, and divided about how to protect America... Cheney had his \"You're ******* right I ordered the code red!!!\" moment today", 
        "intTime": 20090521, 
        "postID": 66, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "reply": " Agreed. Obama is just rambling on about what may or may not happen, ifs and buts....Is this the kind of resolve we want in matters of National Security? He and the liberals look indecisive, confused, and divided about how to protect America... Cheney had his \"You're ******* right I ordered the code red!!!\" moment today", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:51:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "intTime": 20090521, 
        "postID": 67, 
        "quote": "", 
        "reply": "Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 11:55:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... Talk about partisan rant....Cheney defended torture? Only three Haji's were waterboarded, big deal, I would much rather trust the GOP to combat those digusting individuals in the middle east than these confused, probably stoned liberals who cannot make up their mind as to what to do....", 
        "intTime": 20090521, 
        "postID": 68, 
        "quote": "Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\". I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " Talk about partisan rant....Cheney defended torture? Only three Haji's were waterboarded, big deal, I would much rather trust the GOP to combat those digusting individuals in the middle east than these confused, probably stoned liberals who cannot make up their mind as to what to do....", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:01:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "intTime": 20090521, 
        "postID": 69, 
        "quote": "", 
        "reply": "What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:11:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Obama is a slick speaker but true to form it was anothers fault...nor did he offer an idea of what \"he\" would have done differently.... just another finger pointing speech with no solution or how to get there. Cheney laid it out and up front. I have to side with Cheney on this one. As for closing Gitmo? Obama said when he was running that closing Gitmo would be one of the first things he'd do..... and that he did. But now, because he has no clue or plan of what to do with the detainees and no one wants them in their state, they'll have to stay. Obama will say, \"I said I would, I gave the order but they wouldn't let me\", again, not his fault. Just wait and see. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 70, 
        "quote": "", 
        "reply": "Obama is a slick speaker but true to form it was anothers fault...nor did he offer an idea of what \"he\" would have done differently.... just another finger pointing speech with no solution or how to get there. Cheney laid it out and up front. I have to side with Cheney on this one. As for closing Gitmo? Obama said when he was running that closing Gitmo would be one of the first things he'd do..... and that he did. But now, because he has no clue or plan of what to do with the detainees and no one wants them in their state, they'll have to stay. Obama will say, \"I said I would, I gave the order but they wouldn't let me\", again, not his fault. Just wait and see. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:13:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: What kind of flag, hammer and sickle? Indeed! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 71, 
        "quote": "Originally posted by mnoble1066: What kind of flag, hammer and sickle?", 
        "reply": " Indeed! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:28:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "intTime": 20090521, 
        "postID": 72, 
        "quote": "", 
        "reply": "Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Hoooah Cheney!!!!!", 
        "intTime": 20090521, 
        "postID": 73, 
        "quote": "", 
        "reply": "Hoooah Cheney!!!!!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\" I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... WRONG,... ...He defended the deceisions made to keep this nation safe @ the time when the deceision had to be made, and that we were not cutting off heads in order to do it,... ... The \"Dim-o-crabs\" are just so content to mop up the leftovers after sitting on their collective arses, and looking to come out smelling like the rose,... ...Terrorists are bullies, Hit them hard right off the bat, or with a bat as far as I'm concerned, they have no boundries on how far they will go to bring us down,and will stoop to anything to distroy our way of life,... ... Cheney does have a big pair, and said it loud, and clear, whereas BHO's spokesman stood stammering over the release of the CIA's memo's to prove \"Nancy\" knew what was going on anyway back then,... The dem's, one step forward, three steps sideways, two reverse, which way were we going again,... ...", 
        "intTime": 20090521, 
        "postID": 74, 
        "quote": "Originally posted by Sgt_Salaam: Thanks xerello, I read that first post and shook my head at that partisan rant. I heard the speech as well, he outlined a clear strategy for what they plan to do with the detainees. It's one thing to disagree with the plan, but don't blatantly lie and state \"did not offer one little suggestion on what he is going to do with those 200 plus Terrorist\" I'm glad you provided the text. I listened to Cheney as well and his entire speech focused on defending the Bush Administration. The only talking point I agreed with him on was the releasing of the results of the \"enhanced interrogation\" it is only fair that they be released so that Americans like myself who are undecided on the issue can make up their minds about torture. As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " WRONG,... ...He defended the deceisions made to keep this nation safe @ the time when the deceision had to be made, and that we were not cutting off heads in order to do it,... ... The \"Dim-o-crabs\" are just so content to mop up the leftovers after sitting on their collective arses, and looking to come out smelling like the rose,... ...Terrorists are bullies, Hit them hard right off the bat, or with a bat as far as I'm concerned, they have no boundries on how far they will go to bring us down,and will stoop to anything to distroy our way of life,... ... Cheney does have a big pair, and said it loud, and clear, whereas BHO's spokesman stood stammering over the release of the CIA's memo's to prove \"Nancy\" knew what was going on anyway back then,... The dem's, one step forward, three steps sideways, two reverse, which way were we going again,... ...", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 12:53:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Terrror"
    }, 
    {
        "content": "OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "intTime": 20090521, 
        "postID": 75, 
        "quote": "", 
        "reply": "OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:33:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Obama vs Dick Cheney. Cheney wins. Cheney won what? A cupie doll? Fact is Obama is the PotUS and Cheney can suck but. The whole idea that torture makes us safer has not been proven and is disputed by many experts in the field.", 
        "intTime": 20090521, 
        "postID": 76, 
        "quote": "Obama vs Dick Cheney. Cheney wins.", 
        "reply": " Cheney won what? A cupie doll? Fact is Obama is the PotUS and Cheney can suck but. The whole idea that torture makes us safer has not been proven and is disputed by many experts in the field.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:46:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC! Cheney is the Sith Lord!!!!!!! Geez, get it right!!!! Seriously, strength of convictions, I'll say it again and again. When you waffle and flip-flop day in and day out, it shows that you lead on a whim, and that there's no inner strength. You know, the day's coming very soon when President Obama won't be able to blame President Bush anymore...", 
        "intTime": 20090521, 
        "postID": 77, 
        "quote": "Originally posted by Sgt_Salaam: OK, keep crying about Darth Cheney, meanwhile your party is in shambles. If you really think your going to win a national election with Darth Cheney in the spotlight, your just as delusional as many of you were last year stating that there was no way Obama was going to win! Run to Fox News, but remember no amount of watching it is going to win the House, Senate, White House, or Judiciary (2 picks possibly) That's the facts you don't have to like them but what did Cheney's speech today and the Republican talking points do to help win elections? It just made you guys feel good and be able to make more cute comments about your CINC!", 
        "reply": " Cheney is the Sith Lord!!!!!!! Geez, get it right!!!! Seriously, strength of convictions, I'll say it again and again. When you waffle and flip-flop day in and day out, it shows that you lead on a whim, and that there's no inner strength. You know, the day's coming very soon when President Obama won't be able to blame President Bush anymore...", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:47:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Well, let's think about the effect of bringing the islamofascists and other terrorists at Gitmo to the USA. As the Chinese islamofascists would be imediately executed by the Chinese Gvt., well, they will come here. Further, the other nations of Origin of the terrorists refuse to take them back, the lot would come here. Once on formal (not leased) USA soil. it will be argued that they are due FULL American Constitutional rights as the Supreme Court HAS ALREADY stated. The argument that they are prisoners of war and that the Gvt. may hold them until the ending of hostilities as has been the case since \"parole\" has been inoperative since the Civil War will be ignored. So many will get , with the ACLU's assistance, the very best legal help from an organization willing to spend MILLIONS to free just one of these terrorists. And being very PC these days , many will be freed. After all, are we not a nation of laws (unless you are a bond holder of GM or Chrysler)? As we cannot send them back to their nations or origin, as they'd be killed there, we must free them and let them stay. We will, ultimately, provide food, shelter, preach their ideology of hate & murder and a place to attack us from within our own borders. Somehow, this does not seem to cross Mr. Obama's mind. Or that of his administration. Unless, of course, they are lying to us, or are more ignorant than dirt. You chose. And your solution to this dilema might be....what?", 
        "intTime": 20090521, 
        "postID": 78, 
        "quote": "", 
        "reply": "Well, let's think about the effect of bringing the islamofascists and other terrorists at Gitmo to the USA. As the Chinese islamofascists would be imediately executed by the Chinese Gvt., well, they will come here. Further, the other nations of Origin of the terrorists refuse to take them back, the lot would come here. Once on formal (not leased) USA soil. it will be argued that they are due FULL American Constitutional rights as the Supreme Court HAS ALREADY stated. The argument that they are prisoners of war and that the Gvt. may hold them until the ending of hostilities as has been the case since \"parole\" has been inoperative since the Civil War will be ignored. So many will get , with the ACLU's assistance, the very best legal help from an organization willing to spend MILLIONS to free just one of these terrorists. And being very PC these days , many will be freed. After all, are we not a nation of laws (unless you are a bond holder of GM or Chrysler)? As we cannot send them back to their nations or origin, as they'd be killed there, we must free them and let them stay. We will, ultimately, provide food, shelter, preach their ideology of hate & murder and a place to attack us from within our own borders. Somehow, this does not seem to cross Mr. Obama's mind. Or that of his administration. Unless, of course, they are lying to us, or are more ignorant than dirt. You chose. And your solution to this dilema might be....what?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 13:53:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "peter3_1"
    }, 
    {
        "content": "I wonder if the people of Selma Alabama still like Obama?", 
        "intTime": 20090521, 
        "postID": 79, 
        "quote": "", 
        "reply": "I wonder if the people of Selma Alabama still like Obama?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 14:27:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "intTime": 20090521, 
        "postID": 80, 
        "quote": "Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions.", 
        "reply": " Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 22:01:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 81, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them!", 
        "reply": " as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 22:50:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\". The worst of them will be tried and executed or sent to prison for life without parole, just like the terrorists from the Oklahoma City bombing and the first World Trade Center bombing were, among others. That is, unless all the evidence against them is declared inadmissible due to the torture they were subjected to by the Bush gang. As the President has said, there are a few detainees we have no reliable & admissable evidence against, yet they clearly pose a potential threat if released. I expect it will take some time to figure out the best way to legally handle those cases. I'd rather they take the time to do it right, rather than rushing into colossal macho blunders like the last administration. Any suggestion that Obama will just set terrorists free on US soil is simply absurd. The cases against Zubayda & KSM would have been much more secure had they never been subjected to waterboarding. If they aren't convicted of anything because the evidence is ruled inadmissible we will have \"the Decider\" to thank for it. And let's not forget that 2/3 of the original detainees at Gitmo had already been released while Bush was still in office. Some of them turned out to have been innocent, and have posed no threat since being released. An alarming number of others have since turned up fighting alongside our enemies in Iraq and Afghanistan though. If all those detainees were dangerous terrorists as Cheney keeps insisting, WTF did the Bush administration release them for? WTF did that do to keep us safe?", 
        "intTime": 20090521, 
        "postID": 82, 
        "quote": "Originally posted by Duster6: Lets face it. Obama is going to make sure these terrorist go free. Keep track of these crooks. How? Just keep watching Fox news. What do you think is going to happen to these morons when they have their day in court? Most of them will be let go for time served. Some will sit in OUR prisons for a year or two and the rest will be turned over to some other country to be freed quietly by that country. I'm sure our top lawyers from the beloved ACLU will be peeing their pants to represent these bearded terrorist. Other Lawyers out to make a fast buck and a name will be wasting our tax money to defend them. Its all about our justice system and Obama's \"I have a dream\".", 
        "reply": " The worst of them will be tried and executed or sent to prison for life without parole, just like the terrorists from the Oklahoma City bombing and the first World Trade Center bombing were, among others. That is, unless all the evidence against them is declared inadmissible due to the torture they were subjected to by the Bush gang. As the President has said, there are a few detainees we have no reliable & admissable evidence against, yet they clearly pose a potential threat if released. I expect it will take some time to figure out the best way to legally handle those cases. I'd rather they take the time to do it right, rather than rushing into colossal macho blunders like the last administration. Any suggestion that Obama will just set terrorists free on US soil is simply absurd. The cases against Zubayda & KSM would have been much more secure had they never been subjected to waterboarding. If they aren't convicted of anything because the evidence is ruled inadmissible we will have \"the Decider\" to thank for it. And let's not forget that 2/3 of the original detainees at Gitmo had already been released while Bush was still in office. Some of them turned out to have been innocent, and have posed no threat since being released. An alarming number of others have since turned up fighting alongside our enemies in Iraq and Afghanistan though. If all those detainees were dangerous terrorists as Cheney keeps insisting, WTF did the Bush administration release them for? WTF did that do to keep us safe?", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 23:09:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: ...As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image.... I agree. Cheney is a poster boy for what drove the swing voters to reject the GOP and vote for Obama. The man has zero credibility with the vast majority of Americans. I'm tempted to believe that he is hoping and praying for another terrorist attack on US soil because it would salvage his nearly non-existent credibility. The longer he runs his mouth, the more likely the GOP will continue to shrink.", 
        "intTime": 20090521, 
        "postID": 83, 
        "quote": "Originally posted by Sgt_Salaam: ...As far as winning? Neither one as they were two different scripts. Obama talked about his plans for Guantanamo and the future of detainees, Cheney defended torture. Eitherway, it's a loss for the GOP when their most prominent face right now is part of a past administration. Unless Cheney is running in 2010 or 2012, the GOP needs to freshen up their image....", 
        "reply": " I agree. Cheney is a poster boy for what drove the swing voters to reject the GOP and vote for Obama. The man has zero credibility with the vast majority of Americans. I'm tempted to believe that he is hoping and praying for another terrorist attack on US soil because it would salvage his nearly non-existent credibility. The longer he runs his mouth, the more likely the GOP will continue to shrink.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-21 23:31:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon. Is that the same Glenn Beck who was forced to admit to lying when he got caught red-handed on The View on Wednesday? The one who also admitted on that same show that he never fact-checks what he says on his show, and that he doesn't report actual news, just his personal opinions? The same Glenn Beck who then on his own radio show the following day retracted the admission to lying he made the day before on their show? He even said he should demand an apology from the women on that show. Do you think that's what he meant by, \"say what you mean and mean what you say\"? Why, the nerve of those women, using his own words to prove he's full of BS! <http://www.politicususa.com/en/Glenn-Beck-The-View>", 
        "intTime": 20090522, 
        "postID": 84, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by BPCR45_90: quote: Originally posted by psychoABN: What the left hates about Vice President Cheney: He's got a pair...and they don't know what to make of that...'cause most of them don't know what it means for someone to have the courage of their convictions. Just imagine what he might have accomplished if he'd only had a sense of reality to go with them! as Glenn Beck often says... \"say what you mean and mean what you say\"... not many in Washington know this principle... Cheney did just that this afternoon.", 
        "reply": " Is that the same Glenn Beck who was forced to admit to lying when he got caught red-handed on The View on Wednesday? The one who also admitted on that same show that he never fact-checks what he says on his show, and that he doesn't report actual news, just his personal opinions? The same Glenn Beck who then on his own radio show the following day retracted the admission to lying he made the day before on their show? He even said he should demand an apology from the women on that show. Do you think that's what he meant by, \"say what you mean and mean what you say\"? Why, the nerve of those women, using his own words to prove he's full of BS! <http://www.politicususa.com/en/Glenn-Beck-The-View>", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 00:03:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 85, 
        "quote": "", 
        "reply": "President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 01:34:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections! Time to put the bottle down and go to bed... \"The World's Finest\"", 
        "intTime": 20090522, 
        "postID": 86, 
        "quote": "Originally posted by ProgMod: President Obama won the debate, and won it decisively! If I were a GOPer, I'd be outright embarrassed that Cheney now openly appears to be the spokesman for that party. May he continue to be \"on point\" for the GOP throughout the upcoming congressional campaigns for the 2010 elections!", 
        "reply": " Time to put the bottle down and go to bed... \"The World's Finest\"", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 02:46:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO. There is not one shred of proof that torturing prisoners has saved even one American life or thwarted even one act of terrorism. Not one. But it is abundantly clear that the last administration's anything goes attitude has put more Americans at risk, cost invaluable allied support, and cast our culture as hypocritical. The ends do not justify the means, and it was a dark day for America when Dubya and Dick started us down that path. Gitmo needs to be closed immediately, and Dick needs to take a page from Dubya's current playbook and just go away! Every time he opens his mouth, he does more harm to America's image as a peace loving law abiding nation, and this makes us less safe and puts our brave young men and women fighting the real war against terrorism at greater risk...of course that is something that a draft-dodging talking head would not understand. Cheney is not, \"right,\" he is just plain stupid. He reminds me of the child who continues to argue with his parents to try to justify his stupidity.", 
        "intTime": 20090522, 
        "postID": 87, 
        "quote": "Originally posted by Duster6: I listened to Obama's speech today on the Terrorist locked up in Gitmo and the subject of torture. True to form he blamed Bush for everything but did not offer one little suggestion on what he is going to do with those 200 plus Terrorist. On the other hand, Cheney came out and said he and Bush OK'd enhanced interrogation (waterborading) and that it got results and saved American lives. I don't like Cheney, never have. However, in this case he is absolutely right IMO.", 
        "reply": " There is not one shred of proof that torturing prisoners has saved even one American life or thwarted even one act of terrorism. Not one. But it is abundantly clear that the last administration's anything goes attitude has put more Americans at risk, cost invaluable allied support, and cast our culture as hypocritical. The ends do not justify the means, and it was a dark day for America when Dubya and Dick started us down that path. Gitmo needs to be closed immediately, and Dick needs to take a page from Dubya's current playbook and just go away! Every time he opens his mouth, he does more harm to America's image as a peace loving law abiding nation, and this makes us less safe and puts our brave young men and women fighting the real war against terrorism at greater risk...of course that is something that a draft-dodging talking head would not understand. Cheney is not, \"right,\" he is just plain stupid. He reminds me of the child who continues to argue with his parents to try to justify his stupidity.", 
        "threadID": "409192893_3280078322001", 
        "time": "2009-05-22 04:29:00", 
        "title": "Obama vs Dick Cheney.  Cheney wins.", 
        "userID": "skinman13"
    }
]