[
    {
        "content": "you be the judge, and then think if you are traveling north to hunt and have to drive thru dc due to road construction or some other delay and you get stopped... \"http://www.washingtonpost.com/wp-dyn/content/article/2009/01/13/AR2009011302840.html\" you be the judge, me, i think its crap", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "you be the judge, and then think if you are traveling north to hunt and have to drive thru dc due to road construction or some other delay and you get stopped... \"http://www.washingtonpost.com/wp-dyn/content/article/2009/01/13/AR2009011302840.html\" you be the judge, me, i think its crap", 
        "threadID": "409192893_2720002812001", 
        "time": "2009-03-18 08:44:00", 
        "title": "is this glass half full or half empty, More DC gun law crap", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: you be the judge, and then think if you are traveling north to hunt and have to drive thru dc due to road construction or some other delay and you get stopped... \"http://www.washingtonpost.com/wp-dyn/content/article/2009/01/13/AR2009011302840.html\" you be the judge, me, i think its crap This is an example of why I am not and probably never will be an advocate for State's Rights: we cross too many state borders on a daily basis to be able to keep track of how the laws change as you cross the lines. There are only two real issues here: Was it loaded, and did he have his permit with him? Both come down to he said/she said. If the gun was loaded, that was an issue if he did not have a permit for concealed carry. If he did not have his permit with him, they would have no way of quickly knowing it was a legal firearm. If he it was unloaded (or he had the concealed carry permit) and he could show his permit to the officers at the scene, then this was a waste of everyone's time, money, and dignity. If that was not the case...", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "Originally posted by Ira1945: you be the judge, and then think if you are traveling north to hunt and have to drive thru dc due to road construction or some other delay and you get stopped... \"http://www.washingtonpost.com/wp-dyn/content/article/2009/01/13/AR2009011302840.html\" you be the judge, me, i think its crap", 
        "reply": " This is an example of why I am not and probably never will be an advocate for State's Rights: we cross too many state borders on a daily basis to be able to keep track of how the laws change as you cross the lines. There are only two real issues here: Was it loaded, and did he have his permit with him? Both come down to he said/she said. If the gun was loaded, that was an issue if he did not have a permit for concealed carry. If he did not have his permit with him, they would have no way of quickly knowing it was a legal firearm. If he it was unloaded (or he had the concealed carry permit) and he could show his permit to the officers at the scene, then this was a waste of everyone's time, money, and dignity. If that was not the case...", 
        "threadID": "409192893_2720002812001", 
        "time": "2009-03-18 14:37:00", 
        "title": "is this glass half full or half empty, More DC gun law crap", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: DC has one of the toughest gun laws in the country and has had for several years. As a matter of fact, practically no one can legitimately own a handgun in DC, except a few people who were \"grandfather\" in when the law was originally passed. And my recollection is that these particular guns must be kept disassembled and separated from their ammunition, so that they are useless for self-defense purposes. Loaded or not, makes no difference in DC. Their hand gun laws make it impossible for a private citizen to follow the law and have a usable hand gun for protection unless you want to throw it at someone!", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "DC has one of the toughest gun laws in the country and has had for several years. As a matter of fact, practically no one can legitimately own a handgun in DC, except a few people who were \"grandfather\" in when the law was originally passed. And my recollection is that these particular guns must be kept disassembled and separated from their ammunition, so that they are useless for self-defense purposes.", 
        "reply": " Loaded or not, makes no difference in DC. Their hand gun laws make it impossible for a private citizen to follow the law and have a usable hand gun for protection unless you want to throw it at someone!", 
        "threadID": "409192893_2720002812001", 
        "time": "2009-03-18 22:29:00", 
        "title": "is this glass half full or half empty, More DC gun law crap", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "One thing I find ironic is that Libertarians don't have a problem with localization of government - as long as it benefits their point of view. Even Republicans want localized government - to benefit them. And so, this is a classic case of crying wolf. As you all are suggesting, it would be easier if there were more uniformity - that is, of course, when it's convenient. In conclusion: The glass is neither half-empty or half-full. It's twice as big as it needs to be...", 
        "intTime": 20090319, 
        "postID": 4, 
        "quote": "", 
        "reply": "One thing I find ironic is that Libertarians don't have a problem with localization of government - as long as it benefits their point of view. Even Republicans want localized government - to benefit them. And so, this is a classic case of crying wolf. As you all are suggesting, it would be easier if there were more uniformity - that is, of course, when it's convenient. In conclusion: The glass is neither half-empty or half-full. It's twice as big as it needs to be...", 
        "threadID": "409192893_2720002812001", 
        "time": "2009-03-19 20:07:00", 
        "title": "is this glass half full or half empty, More DC gun law crap", 
        "userID": "boazjones"
    }
]