[
    {
        "content": "tru dat President Obama’s First 70 Days It really does all make sense. By Victor Davis Hanson Read the whole article:'http://article.nationalreview.com/?q=YWI4ZDcwMzNiZmQ5MmQ4MzkwNjEyOGEyMGU3N2JmMjY=&w=MA==' If you believed that the story of the United States is more a narrative of gender, race, and class oppression than of brave souls promoting liberty and trying to reify the promise of the Constitution, then you would have empathy for fellow victims of such endemic Western oppression ....... If you believed that the traditions and customs of the United States are largely a story of the oppressed overcoming the perniciousness of the privileged, rather than the collective efforts of the many to stop tyranny, then you would talk about past oppression, past victimization, and past unfairness far more than you would evoke Shiloh, the Meuse-Argonne, or Iwo Jima. If you believed that the United States is hardly exceptional, but merely one nation not all that different from others, then you would have confidence in the aggregate wisdom of the United Nations, and the cultural and economic paradigms provided by the nations of the European Union ....... In other words, if you believed as President Obama and many of his advisors do, then you would do what Obama and his advisors are now doing. In other words, if you believed as President Obama and many of his advisors do, then you would do what Obama and his advisors are now doing.", 
        "intTime": 20090402, 
        "postID": 1, 
        "quote": "", 
        "reply": "tru dat President Obama’s First 70 Days It really does all make sense. By Victor Davis Hanson Read the whole article:'http://article.nationalreview.com/?q=YWI4ZDcwMzNiZmQ5MmQ4MzkwNjEyOGEyMGU3N2JmMjY=&w=MA==' If you believed that the story of the United States is more a narrative of gender, race, and class oppression than of brave souls promoting liberty and trying to reify the promise of the Constitution, then you would have empathy for fellow victims of such endemic Western oppression ....... If you believed that the traditions and customs of the United States are largely a story of the oppressed overcoming the perniciousness of the privileged, rather than the collective efforts of the many to stop tyranny, then you would talk about past oppression, past victimization, and past unfairness far more than you would evoke Shiloh, the Meuse-Argonne, or Iwo Jima. If you believed that the United States is hardly exceptional, but merely one nation not all that different from others, then you would have confidence in the aggregate wisdom of the United Nations, and the cultural and economic paradigms provided by the nations of the European Union ....... In other words, if you believed as President Obama and many of his advisors do, then you would do what Obama and his advisors are now doing. In other words, if you believed as President Obama and many of his advisors do, then you would do what Obama and his advisors are now doing.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-02 08:30:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: If you believed that the United States is hardly exceptional, but merely one nation not all that different from others, then you would have confidence in the aggregate wisdom of the United Nations, and the cultural and economic paradigms provided by the nations of the European Union ....... Probably nothing burns my butt more than the socialist view of \"we're all the same.\" BS! No, we're not! America is the MOST blessed country on the planet. MUCH of that has to do with our military - the real backbone of our country. Heck, the backbone of the planet. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090402, 
        "postID": 2, 
        "quote": "If you believed that the United States is hardly exceptional, but merely one nation not all that different from others, then you would have confidence in the aggregate wisdom of the United Nations, and the cultural and economic paradigms provided by the nations of the European Union .......", 
        "reply": " Probably nothing burns my butt more than the socialist view of \"we're all the same.\" BS! No, we're not! America is the MOST blessed country on the planet. MUCH of that has to do with our military - the real backbone of our country. Heck, the backbone of the planet. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-02 08:39:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: If you believed that the United States is hardly exceptional, but merely one nation not all that different from others, then you would have confidence in the aggregate wisdom of the United Nations, and the cultural and economic paradigms provided by the nations of the European Union ....... Probably nothing burns my butt more than the socialist view of \"we're all the same.\" BS! No, we're not! America is the MOST blessed country on the planet. MUCH of that has to do with our military - the real backbone of our country. Heck, the backbone of the planet. What's in funnier is how much we hear how Diverse we are, but oops we are all the same, AT the same time. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 3, 
        "quote": "Originally posted by PinkBlossoms: quote: If you believed that the United States is hardly exceptional, but merely one nation not all that different from others, then you would have confidence in the aggregate wisdom of the United Nations, and the cultural and economic paradigms provided by the nations of the European Union ....... Probably nothing burns my butt more than the socialist view of \"we're all the same.\" BS! No, we're not! America is the MOST blessed country on the planet. MUCH of that has to do with our military - the real backbone of our country. Heck, the backbone of the planet.", 
        "reply": " What's in funnier is how much we hear how Diverse we are, but oops we are all the same, AT the same time. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-02 08:47:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! HAHhahahahah...", 
        "intTime": 20090402, 
        "postID": 4, 
        "quote": "Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job!", 
        "reply": " HAHhahahahah...", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-02 09:19:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack?", 
        "intTime": 20090402, 
        "postID": 5, 
        "quote": "Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job!", 
        "reply": " Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack?", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-02 09:49:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack? It will be Bush's fault for not getting OBL. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 6, 
        "quote": "Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack?", 
        "reply": " It will be Bush's fault for not getting OBL. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-02 10:16:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack? It will be Bush's fault for not getting OBL. Glad to see your finaly becoming a \"librial\" there LOA1...", 
        "intTime": 20090402, 
        "postID": 7, 
        "quote": "Originally posted by L0A1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack? It will be Bush's fault for not getting OBL.", 
        "reply": " Glad to see your finaly becoming a \"librial\" there LOA1...", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-02 14:05:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by L0A1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack? It will be Bush's fault for not getting OBL. Glad to see your finaly becoming a \"librial\" there LOA1...", 
        "intTime": 20090404, 
        "postID": 8, 
        "quote": "Originally posted by Tangler: quote: Originally posted by L0A1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack? It will be Bush's fault for not getting OBL. Glad to see your finaly becoming a \"librial\" there LOA1...", 
        "reply": "", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-04 06:36:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else.", 
        "intTime": 20090404, 
        "postID": 9, 
        "quote": "", 
        "reply": "My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-04 06:39:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack? It will be Bush's fault for not getting OBL. BINGO!!!!! Bush really screwed the pooch on Afghanistan. I guess completing the mission against those that actually attacked the United States is was overrated. Just one of a long list of failures accumulated by the Republicans. This message has been edited. Last edited by: WepsFP, Sat 04 April 2009 04:57 PM", 
        "intTime": 20090404, 
        "postID": 10, 
        "quote": "Originally posted by L0A1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Have we been attacked? No. Therefore using the same standard that the right has used for the last eight years, he is doing a GREAT job! Will you be saying what a great job or making EXCUSES if and when (God forbid!) we get hit with the next 9/11 styled attack? It will be Bush's fault for not getting OBL.", 
        "reply": " BINGO!!!!! Bush really screwed the pooch on Afghanistan. I guess completing the mission against those that actually attacked the United States is was overrated. Just one of a long list of failures accumulated by the Republicans. This message has been edited. Last edited by: WepsFP, Sat 04 April 2009 04:57 PM", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-04 15:49:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else. How much responsibility are you taking for the screwed up condition this country is in? After all, the majority of the blame rest with failed Republican policies and a rubber stamping President. Rest assured Mommy....The United States is on the mend. The economy is recovering, other countries are slowly respecting US again. Best of all, your failed party is virtually incapable of causing further damage.", 
        "intTime": 20090404, 
        "postID": 11, 
        "quote": "Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else.", 
        "reply": " How much responsibility are you taking for the screwed up condition this country is in? After all, the majority of the blame rest with failed Republican policies and a rubber stamping President. Rest assured Mommy....The United States is on the mend. The economy is recovering, other countries are slowly respecting US again. Best of all, your failed party is virtually incapable of causing further damage.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-04 15:58:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else. How much responsibility are you taking for the screwed up condition this country is in? After all, the majority of the blame rest with failed Republican policies and a rubber stamping President. Rest assured Mommy....The United States is on the mend. The economy is recovering, other countries are slowly respecting US again. Best of all, your failed party is virtually incapable of causing further damage. Let us not forget LCDR, that the Republicans controlled both houses of Congress for six out of the eight years of Bush tenure. I find it incredibly amusing, that the Dems get all the blame for all of the country's failures, in only controlling the Congress just two of those eight years. And it won't matter if President Obama/administration is successful in fixing the economic woes. The folks who despise him the most made themselves very clear about their distaste for the man back during the November elections. I don't like to use the word hate, however, hatred for this man started a long time ago. That mind set simply won't change regardless how successful he is. Yep, it's really that simple with the mind set of the hard core neocon-whingers. Since \"mind sets\" are literally set in stone by a lot of folks on this site, it makes me wonder, why even bother to argue against one another? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090405, 
        "postID": 12, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else. How much responsibility are you taking for the screwed up condition this country is in? After all, the majority of the blame rest with failed Republican policies and a rubber stamping President. Rest assured Mommy....The United States is on the mend. The economy is recovering, other countries are slowly respecting US again. Best of all, your failed party is virtually incapable of causing further damage.", 
        "reply": " Let us not forget LCDR, that the Republicans controlled both houses of Congress for six out of the eight years of Bush tenure. I find it incredibly amusing, that the Dems get all the blame for all of the country's failures, in only controlling the Congress just two of those eight years. And it won't matter if President Obama/administration is successful in fixing the economic woes. The folks who despise him the most made themselves very clear about their distaste for the man back during the November elections. I don't like to use the word hate, however, hatred for this man started a long time ago. That mind set simply won't change regardless how successful he is. Yep, it's really that simple with the mind set of the hard core neocon-whingers. Since \"mind sets\" are literally set in stone by a lot of folks on this site, it makes me wonder, why even bother to argue against one another? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 04:10:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else. Do you even listen to the President? Have you heard a single thing he has said? President Obama: \"Washington is all in a tizzy and everybody is pointing fingers at each other and saying it's their fault, the Democrats' fault, the Republicans' fault,\" he said at a town hall meeting Wednesday. \"Listen, I'll take responsibility. I'm the President.\" \"I will be held accountable. I have got four years,\" the president said. \"I think a year from now people are going to see that we are starting to make some progress, but there is still going to be some pain out there. If I do not have this [economic recovery] done in three years, then there is going to be a one-term proposition", 
        "intTime": 20090405, 
        "postID": 13, 
        "quote": "Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else.", 
        "reply": " Do you even listen to the President? Have you heard a single thing he has said? President Obama: \"Washington is all in a tizzy and everybody is pointing fingers at each other and saying it's their fault, the Democrats' fault, the Republicans' fault,\" he said at a town hall meeting Wednesday. \"Listen, I'll take responsibility. I'm the President.\" \"I will be held accountable. I have got four years,\" the president said. \"I think a year from now people are going to see that we are starting to make some progress, but there is still going to be some pain out there. If I do not have this [economic recovery] done in three years, then there is going to be a one-term proposition", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 05:19:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "well one thing is for sure in his first 70days he has spent more then any other president in their entire time served as potus...", 
        "intTime": 20090405, 
        "postID": 14, 
        "quote": "", 
        "reply": "well one thing is for sure in his first 70days he has spent more then any other president in their entire time served as potus...", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 05:28:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well one thing is for sure in his first 70days he has spent more then any other president in their entire time served as potus... Disaster recovery is expensive.", 
        "intTime": 20090405, 
        "postID": 15, 
        "quote": "Originally posted by outlaws93: well one thing is for sure in his first 70days he has spent more then any other president in their entire time served as potus...", 
        "reply": " Disaster recovery is expensive.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 05:41:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "yea if you dont know what you are doing...even more so if you are incompetent like the case in new orleans how the local gov dropped the ball there....funny how n.o. cost 10x more then the rest of the gulf area hit and still hasnt been fixed... hell that same year in florida we got hit by 6 name storms crap load of damage and today you cant tell anything was even damage... well just 2 parts of captiva island now... all obama has done in the 70days is rack up a hell of a debt... greater then bush or anyother potus in history....", 
        "intTime": 20090405, 
        "postID": 16, 
        "quote": "", 
        "reply": "yea if you dont know what you are doing...even more so if you are incompetent like the case in new orleans how the local gov dropped the ball there....funny how n.o. cost 10x more then the rest of the gulf area hit and still hasnt been fixed... hell that same year in florida we got hit by 6 name storms crap load of damage and today you cant tell anything was even damage... well just 2 parts of captiva island now... all obama has done in the 70days is rack up a hell of a debt... greater then bush or anyother potus in history....", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 05:49:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else. Do you even listen to the President? Have you heard a single thing he has said? President Obama: \"Washington is all in a tizzy and everybody is pointing fingers at each other and saying it's their fault, the Democrats' fault, the Republicans' fault,\" he said at a town hall meeting Wednesday. \"Listen, I'll take responsibility. I'm the President.\" \"I will be held accountable. I have got four years,\" the president said. \"I think a year from now people are going to see that we are starting to make some progress, but there is still going to be some pain out there. If I do not have this [economic recovery] done in three years, then there is going to be a one-term proposition That statement would have a lot more credibility if he didn't keep making references to the previous administration every time someone questions his policies.", 
        "intTime": 20090405, 
        "postID": 17, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Mom2APAJ: My system glitched before I could type my reply of... Typical Dem/liberal mindset... don't take responsibility, blame it on someone else. Do you even listen to the President? Have you heard a single thing he has said? President Obama: \"Washington is all in a tizzy and everybody is pointing fingers at each other and saying it's their fault, the Democrats' fault, the Republicans' fault,\" he said at a town hall meeting Wednesday. \"Listen, I'll take responsibility. I'm the President.\" \"I will be held accountable. I have got four years,\" the president said. \"I think a year from now people are going to see that we are starting to make some progress, but there is still going to be some pain out there. If I do not have this [economic recovery] done in three years, then there is going to be a one-term proposition", 
        "reply": " That statement would have a lot more credibility if he didn't keep making references to the previous administration every time someone questions his policies.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 06:03:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "BayStateGal"
    }, 
    {
        "content": "quote: Originally posted by BayStateGal: That statement would have a lot more credibility if he didn't keep making references to the previous administration every time someone questions his policies. LOL...You all can try really hard, but it simply cannot be denied (despite attempts by Dick Cheney) that Barack Obama walked into a disaster not of his making. Sean Hannity can scream his Mark Levine talking points (he has gotten so much more screechy since Alan Combs left) as loud as he likes, but the American people aren't buying it. The President, by saying that he didn't make the mess, but is taking responsibility for the clean up...is simply stating FACTS. I understand that responsibility and facts will take some getting used to after the last eight years. We'll give ya'll some time to adjust.", 
        "intTime": 20090405, 
        "postID": 18, 
        "quote": "Originally posted by BayStateGal: That statement would have a lot more credibility if he didn't keep making references to the previous administration every time someone questions his policies.", 
        "reply": " LOL...You all can try really hard, but it simply cannot be denied (despite attempts by Dick Cheney) that Barack Obama walked into a disaster not of his making. Sean Hannity can scream his Mark Levine talking points (he has gotten so much more screechy since Alan Combs left) as loud as he likes, but the American people aren't buying it. The President, by saying that he didn't make the mess, but is taking responsibility for the clean up...is simply stating FACTS. I understand that responsibility and facts will take some getting used to after the last eight years. We'll give ya'll some time to adjust.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 06:33:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "", 
        "intTime": 20090405, 
        "postID": 19, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 06:45:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "How soon we forget that BHO was a senator under the Bush admin, and did nothing of consequence except sow the seeds for his presidential run. ...At a time when HIS party controlled congress.", 
        "intTime": 20090405, 
        "postID": 20, 
        "quote": "", 
        "reply": "How soon we forget that BHO was a senator under the Bush admin, and did nothing of consequence except sow the seeds for his presidential run. ...At a time when HIS party controlled congress.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 06:50:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: How soon we forget that BHO was a senator under the Bush admin, and did nothing of consequence except sow the seeds for his presidential run. ...At a time when HIS party controlled congress. Nice try, but that was more of a Hmmm, \"nothing of consequence\"? Perhaps you should look up the Lugar-Obama bill and the Coburn-Obama Transparency Act. You might, while you are looking, note that President Obama, in his first two years as Senator (at a time when the GOP was in control), sponsored 152 bills and resolutions, and cosponsored 427.", 
        "intTime": 20090405, 
        "postID": 21, 
        "quote": "Originally posted by MaddogK: How soon we forget that BHO was a senator under the Bush admin, and did nothing of consequence except sow the seeds for his presidential run. ...At a time when HIS party controlled congress.", 
        "reply": " Nice try, but that was more of a Hmmm, \"nothing of consequence\"? Perhaps you should look up the Lugar-Obama bill and the Coburn-Obama Transparency Act. You might, while you are looking, note that President Obama, in his first two years as Senator (at a time when the GOP was in control), sponsored 152 bills and resolutions, and cosponsored 427.", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 07:13:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Coburn-Obama Transparency Act \"The bill was introduced by Senator Tom Coburn, for himself and Senators Barack Obama, Tom Carper and John McCain on April 6, 2006.\" The above is the seeds that I referred to earlier. ...more to come, but Barry rubber stamped more stuff than he voted on, I'll be posting his attendance shortly. (voting 'present' doesn't count)", 
        "intTime": 20090405, 
        "postID": 22, 
        "quote": "Coburn-Obama Transparency Act", 
        "reply": " \"The bill was introduced by Senator Tom Coburn, for himself and Senators Barack Obama, Tom Carper and John McCain on April 6, 2006.\" The above is the seeds that I referred to earlier. ...more to come, but Barry rubber stamped more stuff than he voted on, I'll be posting his attendance shortly. (voting 'present' doesn't count)", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 07:18:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Coburn-Obama Transparency Act \"The bill was introduced by Senator Tom Coburn, for himself and Senators Barack Obama, Tom Carper and John McCain on April 6, 2006.\" The above is the seeds that I referred to earlier. ...more to come, but Barry rubber stamped more stuff than he voted on, I'll be posting his attendance shortly. (voting 'present' doesn't count) Too weak to be worthy of even a \"Biff\".", 
        "intTime": 20090405, 
        "postID": 23, 
        "quote": "Originally posted by MaddogK: quote: Coburn-Obama Transparency Act \"The bill was introduced by Senator Tom Coburn, for himself and Senators Barack Obama, Tom Carper and John McCain on April 6, 2006.\" The above is the seeds that I referred to earlier. ...more to come, but Barry rubber stamped more stuff than he voted on, I'll be posting his attendance shortly. (voting 'present' doesn't count)", 
        "reply": " Too weak to be worthy of even a \"Biff\".", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 07:40:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Coburn-Obama Transparency Act \"The bill was introduced by Senator Tom Coburn, for himself and Senators Barack Obama, Tom Carper and John McCain on April 6, 2006.\" The above is the seeds that I referred to earlier. ...more to come, but Barry rubber stamped more stuff than he voted on, I'll be posting his attendance shortly. (voting 'present' doesn't count) well after they are done revising that part of history it wont say that and none of that ever happen....", 
        "intTime": 20090405, 
        "postID": 24, 
        "quote": "Originally posted by MaddogK: quote: Coburn-Obama Transparency Act \"The bill was introduced by Senator Tom Coburn, for himself and Senators Barack Obama, Tom Carper and John McCain on April 6, 2006.\" The above is the seeds that I referred to earlier. ...more to come, but Barry rubber stamped more stuff than he voted on, I'll be posting his attendance shortly. (voting 'present' doesn't count)", 
        "reply": " well after they are done revising that part of history it wont say that and none of that ever happen....", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-05 09:43:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Too Funny! The chimp look is so Dubya........ This message has been edited. Last edited by: ProgMod, Mon 06 April 2009 06:10 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090406, 
        "postID": 25, 
        "quote": "Originally posted by SeaWitch1220:", 
        "reply": " Too Funny! The chimp look is so Dubya........ This message has been edited. Last edited by: ProgMod, Mon 06 April 2009 06:10 PM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8000036912001", 
        "time": "2009-04-06 05:06:00", 
        "title": "President Obama’s First 70 Days", 
        "userID": "ProgMod"
    }
]