[
    {
        "content": "In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction.", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "", 
        "reply": "In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 09:28:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction. Yes and no. Bonuses provide a wide range of use from Robbing the stock holders to circumventing benefits paid on percentages of wages. Its a legal method to steal profits and cook the books. As a CEO I could appoint my wife a consultant and award her a large bonus effectively increasing my bonus. Thats how Maddoffs wife got to claim 65 million as personal money she earned and the 7 million Penthouse. Its concept is sold as a reward for a job well done. Well really? I was always under the impression thats what the paycheck represented? Isnt that what were paid to do? And if you didnt you got fired. In the case of some employees I could justify bonuses for new hires who lets say were hired for thier expertise and gauranteed the employer they could increase profits by x amount. The salary they were requesting was far above what the employer was prepared to pay. So they sign a contract that says he gets X amount in salary and the balance in bonus only if he produces what he said he could. Thats a contract. But blanket yearly bonuses for all are a BS move to steal from stock holders. The way it works in the real world is that the Bd of directors declare a bonus and the CEO gives each dept head X amount of dollars including his own bonus to distribute to his people as he sees fit. The dept head then deducts his and decides on an individual basis how to divide the balance. This leave room for kickbacks and dissention within the depts. Cash Bonuses are really not a good Idea IMO there are other methods to reward employees.", 
        "intTime": 20090320, 
        "postID": 2, 
        "quote": "Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction.", 
        "reply": " Yes and no. Bonuses provide a wide range of use from Robbing the stock holders to circumventing benefits paid on percentages of wages. Its a legal method to steal profits and cook the books. As a CEO I could appoint my wife a consultant and award her a large bonus effectively increasing my bonus. Thats how Maddoffs wife got to claim 65 million as personal money she earned and the 7 million Penthouse. Its concept is sold as a reward for a job well done. Well really? I was always under the impression thats what the paycheck represented? Isnt that what were paid to do? And if you didnt you got fired. In the case of some employees I could justify bonuses for new hires who lets say were hired for thier expertise and gauranteed the employer they could increase profits by x amount. The salary they were requesting was far above what the employer was prepared to pay. So they sign a contract that says he gets X amount in salary and the balance in bonus only if he produces what he said he could. Thats a contract. But blanket yearly bonuses for all are a BS move to steal from stock holders. The way it works in the real world is that the Bd of directors declare a bonus and the CEO gives each dept head X amount of dollars including his own bonus to distribute to his people as he sees fit. The dept head then deducts his and decides on an individual basis how to divide the balance. This leave room for kickbacks and dissention within the depts. Cash Bonuses are really not a good Idea IMO there are other methods to reward employees.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 10:47:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "john2x"
    }, 
    {
        "content": "I have no objections to truly performance based bonuses, whether the CEO wants to award an across-the-board bonus based on overall company performance, or whether they select specific people and reward them for specific achievements (beating sales margin, or always making fresh coffee). I do not even mind if someone gets a majority of their income that way (that's what waiters do!) PROVIDED IT IS PERFORMANCE BASED. The problems here are that people were getting bonuses with nonexistant or marginal performance requirements. The overall problem is that these people were unwatched and overpaid.", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "", 
        "reply": "I have no objections to truly performance based bonuses, whether the CEO wants to award an across-the-board bonus based on overall company performance, or whether they select specific people and reward them for specific achievements (beating sales margin, or always making fresh coffee). I do not even mind if someone gets a majority of their income that way (that's what waiters do!) PROVIDED IT IS PERFORMANCE BASED. The problems here are that people were getting bonuses with nonexistant or marginal performance requirements. The overall problem is that these people were unwatched and overpaid.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 10:58:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction. Most corporate bonuses are contracted. Some are performance based, others may be based of a departments performance. There are retention bonuses as well. These are used to hold onto folks that ARE doing good for the company and you do not wish them to go to another competitor. Retention bonuses are also used when a lay off is pending and you want to get as much work out of an employeee before their layoff, which might be in 6 months or longer. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction.", 
        "reply": " Most corporate bonuses are contracted. Some are performance based, others may be based of a departments performance. There are retention bonuses as well. These are used to hold onto folks that ARE doing good for the company and you do not wish them to go to another competitor. Retention bonuses are also used when a lay off is pending and you want to get as much work out of an employeee before their layoff, which might be in 6 months or longer. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 11:14:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: What a screwy world we live in. It's all been designed this way. We slept, they built.", 
        "intTime": 20090320, 
        "postID": 5, 
        "quote": "What a screwy world we live in.", 
        "reply": " It's all been designed this way. We slept, they built.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 11:26:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Dont get me wrong When I was managment I to enjoyed the big bonuses but really never could see the purpose specially so in years when we were running in the red. Then instead of cutting them completely they just reduced them some. made no sense from a business point of view. It just became SOP.", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "", 
        "reply": "Dont get me wrong When I was managment I to enjoyed the big bonuses but really never could see the purpose specially so in years when we were running in the red. Then instead of cutting them completely they just reduced them some. made no sense from a business point of view. It just became SOP.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 11:45:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by soscorpio: quote: What a screwy world we live in. It's all been designed this way. We slept, they built. OK now we are awake, so why does everyone resist getting our house in order? No one wants order in the house. Took far to long to clutter the house in the first place and is exactly how they want it. Clutter creates confusions, Confusion creates Cash. It need more than a broom now, It needs a Bulldozer and fresh rebuild.", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by soscorpio: quote: What a screwy world we live in. It's all been designed this way. We slept, they built. OK now we are awake, so why does everyone resist getting our house in order?", 
        "reply": " No one wants order in the house. Took far to long to clutter the house in the first place and is exactly how they want it. Clutter creates confusions, Confusion creates Cash. It need more than a broom now, It needs a Bulldozer and fresh rebuild.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 12:15:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: recisely WHAT....is a \"bonus?\" I have no idea. During 22 years of military and 30 years teaching high school, I never saw one. I did put a couple of my subordinates in for a few, which they got (Civil Service), but that 's it - - Wandering and Wondering", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "recisely WHAT....is a \"bonus?\"", 
        "reply": " I have no idea. During 22 years of military and 30 years teaching high school, I never saw one. I did put a couple of my subordinates in for a few, which they got (Civil Service), but that 's it - - Wandering and Wondering", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-20 18:42:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Based on the opinions I'm reading here....it seems to me that the term \"bonus\" is a nomenclature problem, i.e. a gimmick as our CEO here implies. If that is true, then isn't at least PART of our problem one of correctly describing what we're really doing? If our legislators genuinely want to take better approaches to these corporations that are \"too big to fail\"....perhaps they ought to look first to insuring that gimmicks to raid the treasury are eliminated.", 
        "intTime": 20090321, 
        "postID": 9, 
        "quote": "", 
        "reply": "Based on the opinions I'm reading here....it seems to me that the term \"bonus\" is a nomenclature problem, i.e. a gimmick as our CEO here implies. If that is true, then isn't at least PART of our problem one of correctly describing what we're really doing? If our legislators genuinely want to take better approaches to these corporations that are \"too big to fail\"....perhaps they ought to look first to insuring that gimmicks to raid the treasury are eliminated.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-21 09:54:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "19022583"
    }, 
    {
        "content": "I have received a few bonuses...for couple a Christmas I got a turkey, once I got a lb of butter. Later, I actually got two cash bonuses for a total of $700, requested by my immediate supervisor, based strictly on and justified by exceptional job performance. The fat cat bonuses I see now should actually be spelled \"bone us\".", 
        "intTime": 20090321, 
        "postID": 10, 
        "quote": "", 
        "reply": "I have received a few bonuses...for couple a Christmas I got a turkey, once I got a lb of butter. Later, I actually got two cash bonuses for a total of $700, requested by my immediate supervisor, based strictly on and justified by exceptional job performance. The fat cat bonuses I see now should actually be spelled \"bone us\".", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-21 16:16:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "The folks that you are talking about should have gotten a pink slip way before things got this bad. Not millions of dollars. quote: Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction.", 
        "intTime": 20090321, 
        "postID": 11, 
        "quote": "Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction.", 
        "reply": "The folks that you are talking about should have gotten a pink slip way before things got this bad. Not millions of dollars. ", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-21 19:29:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "Jakeontheflip"
    }, 
    {
        "content": "quote: Originally posted by Jakeontheflip: The folks that you are talking about should have gotten a pink slip way before things got this bad. Not millions of dollars. quote: Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction. Thats one definition. Another is a contract that spell out terms of employement with yearly adjustments with or without conditional clauses. The word Bonus is used to describe many arrangments and policies when it should be used only in the terms you mentioned A thank you from a company that made profits above expectations and as an incentive to keep up the good work.", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "Originally posted by Jakeontheflip: The folks that you are talking about should have gotten a pink slip way before things got this bad. Not millions of dollars. quote: Originally posted by 19022583: In MY profession....a \"bonus\" AIN'T something that is, or can be....contracted for. It's something OVER & ABOVE one's salary for a job well done. When the job AIN'T....done well, a \"bonus\" is OUT of the question! Therefore, the question of \"bonus\" payments at AIG has NO traction.", 
        "reply": " Thats one definition. Another is a contract that spell out terms of employement with yearly adjustments with or without conditional clauses. The word Bonus is used to describe many arrangments and policies when it should be used only in the terms you mentioned A thank you from a company that made profits above expectations and as an incentive to keep up the good work.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-22 00:18:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "john2x"
    }, 
    {
        "content": "An interesting post on this thread was, Should the military continue giving retention bonuses since were 11 trillion in debt? And if so how is that any different than what AIG did? I may have missed it but I didnt see any responses and that would be interesting as this is a military website with many active Vets. So what do you think? There are alternatives such as conscription and lower pay rates till we start showing a surplus. Just curious as to what the justifications would be as compared to AIG since no stipulations were included as to how the money was to be spent.", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "", 
        "reply": "An interesting post on this thread was, Should the military continue giving retention bonuses since were 11 trillion in debt? And if so how is that any different than what AIG did? I may have missed it but I didnt see any responses and that would be interesting as this is a military website with many active Vets. So what do you think? There are alternatives such as conscription and lower pay rates till we start showing a surplus. Just curious as to what the justifications would be as compared to AIG since no stipulations were included as to how the money was to be spent.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-22 00:29:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Just curious as to what the justifications would be as compared to AIG since no stipulations were included as to how the money was to be spent. The military is there (for lack of a better word) for public safety. AIG is there to make a profit. The military is fighting two wars in addition to its other duties. AIG's has nearly committed suicide from neglecting its duties. Military retention bonuses are to keep experienced and valued people in their positins. We know they are experienced and valued becuase of training and a system of evaluations and promotions that mostly weeds out those who aren't \"valued\". AIG retention bonuses were crated by AIG executives for AIG executives who belive they are \"valued\" only because they are AIG executives. They believe this despite bankrupting the company and taking government hand outs. in short....the two are not even close to being comparable.", 
        "intTime": 20090322, 
        "postID": 14, 
        "quote": "Just curious as to what the justifications would be as compared to AIG since no stipulations were included as to how the money was to be spent.", 
        "reply": " The military is there (for lack of a better word) for public safety. AIG is there to make a profit. The military is fighting two wars in addition to its other duties. AIG's has nearly committed suicide from neglecting its duties. Military retention bonuses are to keep experienced and valued people in their positins. We know they are experienced and valued becuase of training and a system of evaluations and promotions that mostly weeds out those who aren't \"valued\". AIG retention bonuses were crated by AIG executives for AIG executives who belive they are \"valued\" only because they are AIG executives. They believe this despite bankrupting the company and taking government hand outs. in short....the two are not even close to being comparable.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-22 01:03:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by john2x: An interesting post on this thread was, Should the military continue giving retention bonuses since were 11 trillion in debt? And if so how is that any different than what AIG did? I may have missed it but I didnt see any responses and that would be interesting as this is a military website with many active Vets. So what do you think? There are alternatives such as conscription and lower pay rates till we start showing a surplus. Just curious as to what the justifications would be as compared to AIG since no stipulations were included as to how the money was to be spent. First off, Obama has already seen to limiting pay for the Military by limiting the COLA. The men and women Defending this Country should not have their pay limited, after all they ARE putting their lives on the line for us. Secondly, retention bonuses help the Military keep men and women in shorage MOS's in the Military and without those they will lose a lot more. You know as well as I do that the Government does not have the balls to reinstitute the draft and that is the reason they discontinued it in the first place. Now they have people who signed on the line freely of their own accord.", 
        "intTime": 20090322, 
        "postID": 15, 
        "quote": "Originally posted by john2x: An interesting post on this thread was, Should the military continue giving retention bonuses since were 11 trillion in debt? And if so how is that any different than what AIG did? I may have missed it but I didnt see any responses and that would be interesting as this is a military website with many active Vets. So what do you think? There are alternatives such as conscription and lower pay rates till we start showing a surplus. Just curious as to what the justifications would be as compared to AIG since no stipulations were included as to how the money was to be spent.", 
        "reply": " First off, Obama has already seen to limiting pay for the Military by limiting the COLA. The men and women Defending this Country should not have their pay limited, after all they ARE putting their lives on the line for us. Secondly, retention bonuses help the Military keep men and women in shorage MOS's in the Military and without those they will lose a lot more. You know as well as I do that the Government does not have the balls to reinstitute the draft and that is the reason they discontinued it in the first place. Now they have people who signed on the line freely of their own accord.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-22 01:29:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "dhd123"
    }, 
    {
        "content": "Interesting replys,Except the concept is exactly the same. Putting your life on the line for your country is every every ones responsibility and duty. Same could be said for the Police, fire fighters,Iron workers,secret service,FBI, and anyone who has a hazardous job. Fact is we are a nation of laws that were meant to be adjudicated equally. Once exceptions are made were does it stop. If laws are wrong ammend them spell out all the exceptions lest they become precedents and used in different scienerios in the future. In AIGs case although morally wrong IMO is legal and the fault lies with our Government incompetants who wrote the agreements in the Bail out bills not spelling out how the money could be used. In fact AIG when compared to the military was at a disadvantage considering options. They could not retain critical personel with out large retention bonuses, wheras conscription would have filled all vacancys. The military has far more options that they chose not to use other than the retention bonuses. Conscription has a wide berth with a catch phrase For the good of service to retain and release.", 
        "intTime": 20090322, 
        "postID": 16, 
        "quote": "", 
        "reply": "Interesting replys,Except the concept is exactly the same. Putting your life on the line for your country is every every ones responsibility and duty. Same could be said for the Police, fire fighters,Iron workers,secret service,FBI, and anyone who has a hazardous job. Fact is we are a nation of laws that were meant to be adjudicated equally. Once exceptions are made were does it stop. If laws are wrong ammend them spell out all the exceptions lest they become precedents and used in different scienerios in the future. In AIGs case although morally wrong IMO is legal and the fault lies with our Government incompetants who wrote the agreements in the Bail out bills not spelling out how the money could be used. In fact AIG when compared to the military was at a disadvantage considering options. They could not retain critical personel with out large retention bonuses, wheras conscription would have filled all vacancys. The military has far more options that they chose not to use other than the retention bonuses. Conscription has a wide berth with a catch phrase For the good of service to retain and release.", 
        "threadID": "409192893_9660014812001", 
        "time": "2009-03-22 10:25:00", 
        "title": "Precisely WHAT....is a \"bonus?\"", 
        "userID": "john2x"
    }
]