[
    {
        "content": "\"AmeriCorps Week WHEREAS, service to others is a hallmark of the American spirit, and throughout our history, citizens have stepped up to meet everyday challenges by volunteering in their communities; and ....... NOW, THEREFORE, I, Sarah Palin, Governor of the state of Alaska, do hereby proclaim May 9-16, 2009 as AmeriCorps Week\" Ahh But Ms Neo Republican herself, Michele Bachmann, does not agree so much with President Obama or the Alaskan Govenor.. \"It's under the guise of -- quote -- volunteerism. But it's not volunteers at all. It's paying people to do work on behalf of government. ... I believe that there is a very strong chance that we will see that young people will be put into mandatory service. And the real concerns is that there are provisions for what I would call re-education camps for young people, where young people have to go and get trained in a philosophy that the government puts forward and then they have to go to work in some of these politically correct forums.\" Good PR work to Palin, good politics as usuall for Obama bashing from Bachman. T.O. Related Links: \"http://blogs.citypages.com/blotter/2009/04/bachmann_americ.php\" \"http://www.gov.state.ak.us/proclamations.php?id=1802\"", 
        "intTime": 20090509, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"AmeriCorps Week WHEREAS, service to others is a hallmark of the American spirit, and throughout our history, citizens have stepped up to meet everyday challenges by volunteering in their communities; and ....... NOW, THEREFORE, I, Sarah Palin, Governor of the state of Alaska, do hereby proclaim May 9-16, 2009 as AmeriCorps Week\" Ahh But Ms Neo Republican herself, Michele Bachmann, does not agree so much with President Obama or the Alaskan Govenor.. \"It's under the guise of -- quote -- volunteerism. But it's not volunteers at all. It's paying people to do work on behalf of government. ... I believe that there is a very strong chance that we will see that young people will be put into mandatory service. And the real concerns is that there are provisions for what I would call re-education camps for young people, where young people have to go and get trained in a philosophy that the government puts forward and then they have to go to work in some of these politically correct forums.\" Good PR work to Palin, good politics as usuall for Obama bashing from Bachman. T.O. Related Links: \"http://blogs.citypages.com/blotter/2009/04/bachmann_americ.php\" \"http://www.gov.state.ak.us/proclamations.php?id=1802\"", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-09 21:08:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Mrs. Palin is a class act and always has been. Mrs. Bachman sees a bogeyman at every corner - politics as usual. What's wrong with \"paying people to do work on behalf of the government\" in an economy where many people can't find a job? A job is a job! Paying me to help others is somehow a bad thing? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090510, 
        "postID": 2, 
        "quote": "", 
        "reply": "Mrs. Palin is a class act and always has been. Mrs. Bachman sees a bogeyman at every corner - politics as usual. What's wrong with \"paying people to do work on behalf of the government\" in an economy where many people can't find a job? A job is a job! Paying me to help others is somehow a bad thing? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 04:28:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Mrs. Palin is a class act and always has been. No, she is not. She was every bit on the same level as Mrs. Bachmann during last year's Presidential election.", 
        "intTime": 20090510, 
        "postID": 3, 
        "quote": "Originally posted by FollowMeInfantry: Mrs. Palin is a class act and always has been.", 
        "reply": " No, she is not. She was every bit on the same level as Mrs. Bachmann during last year's Presidential election.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 09:17:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Mrs. Palin is a class act and always has been. Mrs. Bachman sees a bogeyman at every corner - politics as usual. What's wrong with \"paying people to do work on behalf of the government\" in an economy where many people can't find a job? A job is a job! Paying me to help others is somehow a bad thing? Surely you jest.", 
        "intTime": 20090510, 
        "postID": 4, 
        "quote": "Originally posted by FollowMeInfantry: Mrs. Palin is a class act and always has been. Mrs. Bachman sees a bogeyman at every corner - politics as usual. What's wrong with \"paying people to do work on behalf of the government\" in an economy where many people can't find a job? A job is a job! Paying me to help others is somehow a bad thing?", 
        "reply": " Surely you jest.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 09:28:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090510, 
        "postID": 5, 
        "quote": "", 
        "reply": "Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 09:39:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds.", 
        "intTime": 20090510, 
        "postID": 6, 
        "quote": "Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly.", 
        "reply": " Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 10:02:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment.", 
        "intTime": 20090510, 
        "postID": 7, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds.", 
        "reply": " I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 10:18:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad.", 
        "intTime": 20090510, 
        "postID": 8, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment.", 
        "reply": " See how petty and ignorant that statement was? No? Too bad.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 10:35:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090510, 
        "postID": 9, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment.", 
        "reply": " My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 10:36:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad. Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem?", 
        "intTime": 20090510, 
        "postID": 10, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad.", 
        "reply": " Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem?", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 10:57:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? Don’t claim to be from the party of family values if your own family is like an episode of Jerry Springer. That would be my point.", 
        "intTime": 20090510, 
        "postID": 11, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point?", 
        "reply": " Don’t claim to be from the party of family values if your own family is like an episode of Jerry Springer. That would be my point.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 10:58:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad. Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem? You remind me of a 13 year old girl I knew once.", 
        "intTime": 20090510, 
        "postID": 12, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad. Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem?", 
        "reply": " You remind me of a 13 year old girl I knew once.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 11:06:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad. Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem? You remind me of a 13 year old girl I knew once. You know 13 year old girls that are 20 year active veterans of the armed forces?", 
        "intTime": 20090510, 
        "postID": 13, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad. Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem? You remind me of a 13 year old girl I knew once.", 
        "reply": " You know 13 year old girls that are 20 year active veterans of the armed forces?", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 11:09:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "xnavycg"
    }, 
    {
        "content": "I get that you love Sara and know for a fact that she can do no wrong. But a good portion of Americans think that she is a babbling fool. And, if she couldn’t handle herself with that evil liberal media, what would she do when North Korea, Russia, or China decides to step up? If John McCain didn’t give up on my state (Michigan) and picked a better running mate (Huckabee) then he would have had my vote, quitter had to pick another Dan Quail and look what happened.", 
        "intTime": 20090510, 
        "postID": 14, 
        "quote": "", 
        "reply": "I get that you love Sara and know for a fact that she can do no wrong. But a good portion of Americans think that she is a babbling fool. And, if she couldn’t handle herself with that evil liberal media, what would she do when North Korea, Russia, or China decides to step up? If John McCain didn’t give up on my state (Michigan) and picked a better running mate (Huckabee) then he would have had my vote, quitter had to pick another Dan Quail and look what happened.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 11:19:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: I get that you love Sara and know for a fact that she can do no wrong. But a good portion of Americans think that she is a babbling fool. And, if she couldn’t handle herself with that evil liberal media, what would she do when North Korea, Russia, or China decides to step up? If John McCain didn’t give up on my state (Michigan) and picked a better running mate (Huckabee) then he would have had my vote, quitter had to pick another Dan Quail and look what happened. Well, that is a more mature comment. However, with all due respect...you don't get it. I do think Sarah can make mistakes. I have seen the mistakes she has made here in Alaska. I do believe that it was John McCain's mistake to nominate her. Her experience didn't include being able to perform the duties of the nation's VP. She is more of an honest person that most politians,so that alone would have done her in. She did make the mistake of accepting the nomination, but she has more than paid for that. What is the point of continuing to slam her now? She isn't the VP. Biden is. As far as Huckabee goes, I would have voted for him as CIC if he had stayed with it. It is a damn shame he did not. Also, I don't know how you can compare her to Dan Quail.", 
        "intTime": 20090510, 
        "postID": 15, 
        "quote": "Originally posted by xnavycg: I get that you love Sara and know for a fact that she can do no wrong. But a good portion of Americans think that she is a babbling fool. And, if she couldn’t handle herself with that evil liberal media, what would she do when North Korea, Russia, or China decides to step up? If John McCain didn’t give up on my state (Michigan) and picked a better running mate (Huckabee) then he would have had my vote, quitter had to pick another Dan Quail and look what happened.", 
        "reply": " Well, that is a more mature comment. However, with all due respect...you don't get it. I do think Sarah can make mistakes. I have seen the mistakes she has made here in Alaska. I do believe that it was John McCain's mistake to nominate her. Her experience didn't include being able to perform the duties of the nation's VP. She is more of an honest person that most politians,so that alone would have done her in. She did make the mistake of accepting the nomination, but she has more than paid for that. What is the point of continuing to slam her now? She isn't the VP. Biden is. As far as Huckabee goes, I would have voted for him as CIC if he had stayed with it. It is a damn shame he did not. Also, I don't know how you can compare her to Dan Quail.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 11:45:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Ahh But Ms Neo Republican herself, Michele Bachmann, does not agree so much with President Obama or the Alaskan Govenor.. Good ol' CJ just can't refer to the GOP without stooping to name calling. Just because the senator is paranoid is no reason to believe the government is not out to get you. And an informed public is one which is armed with the knowlege to see the fallacy of the left. The Republican fear, which is quickly spreading through right-wing pundits, is from some original language that would make AmeriCorps service a requirement for young people. That language has been stripped from the bill. Still, you gotta love a source that also reports on \"an Klingon electronic dictionary born in Dinkytown\"", 
        "intTime": 20090510, 
        "postID": 16, 
        "quote": "Ahh But Ms Neo Republican herself, Michele Bachmann, does not agree so much with President Obama or the Alaskan Govenor..", 
        "reply": " Good ol' CJ just can't refer to the GOP without stooping to name calling. Just because the senator is paranoid is no reason to believe the government is not out to get you. And an informed public is one which is armed with the knowlege to see the fallacy of the left. The Republican fear, which is quickly spreading through right-wing pundits, is from some original language that would make AmeriCorps service a requirement for young people. That language has been stripped from the bill. Still, you gotta love a source that also reports on \"an Klingon electronic dictionary born in Dinkytown\"", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-10 23:51:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: The Republican fear, which is quickly spreading through right-wing pundits, is from some original language that would make AmeriCorps service a requirement for young people. which is really funny when you consider that Orrin Hatch wrote the bill.", 
        "intTime": 20090511, 
        "postID": 17, 
        "quote": "The Republican fear, which is quickly spreading through right-wing pundits, is from some original language that would make AmeriCorps service a requirement for young people.", 
        "reply": " which is really funny when you consider that Orrin Hatch wrote the bill.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-11 00:20:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: I get that you love Sara and know for a fact that she can do no wrong. But a good portion of Americans think that she is a babbling fool. And, if she couldn’t handle herself with that evil liberal media, what would she do when North Korea, Russia, or China decides to step up? If John McCain didn’t give up on my state (Michigan) and picked a better running mate (Huckabee) then he would have had my vote, quitter had to pick another Dan Quail and look what happened. She could talk them to death like Joe Biden.... I find it amazing that Senator Biden tried for years to get the nomination and was dismissed by his own party time and again, but when he was piucked as VP candidate, it was like mannah from heaven, winning the lotto, or just a sgroke of genious. And then people camplain and poke fun at Sarah Palin.", 
        "intTime": 20090511, 
        "postID": 18, 
        "quote": "Originally posted by xnavycg: I get that you love Sara and know for a fact that she can do no wrong. But a good portion of Americans think that she is a babbling fool. And, if she couldn’t handle herself with that evil liberal media, what would she do when North Korea, Russia, or China decides to step up? If John McCain didn’t give up on my state (Michigan) and picked a better running mate (Huckabee) then he would have had my vote, quitter had to pick another Dan Quail and look what happened.", 
        "reply": " She could talk them to death like Joe Biden.... I find it amazing that Senator Biden tried for years to get the nomination and was dismissed by his own party time and again, but when he was piucked as VP candidate, it was like mannah from heaven, winning the lotto, or just a sgroke of genious. And then people camplain and poke fun at Sarah Palin.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-11 07:15:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? Don’t claim to be from the party of family values if your own family is like an episode of Jerry Springer. That would be my point. So any family that has a teenage daughter get pregenant is like Jerry Springer? That any parents of such are responsible and have no moral values? If that is your opinion, then I take it you did not have premarital sex in high school or college or whatever?", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? Don’t claim to be from the party of family values if your own family is like an episode of Jerry Springer. That would be my point.", 
        "reply": " So any family that has a teenage daughter get pregenant is like Jerry Springer? That any parents of such are responsible and have no moral values? If that is your opinion, then I take it you did not have premarital sex in high school or college or whatever?", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-11 07:18:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Ahh But Ms Neo Republican herself, Michele Bachmann, does not agree so much with President Obama or the Alaskan Govenor.. Good ol' CJ just can't refer to the GOP without stooping to name calling. Just because the senator is paranoid is no reason to believe the government is not out to get you. And an informed public is one which is armed with the knowlege to see the fallacy of the left. The Republican fear, which is quickly spreading through right-wing pundits, is from some original language that would make AmeriCorps service a requirement for young people. That language has been stripped from the bill. Still, you gotta love a source that also reports on \"an Klingon electronic dictionary born in Dinkytown\" I agree with the mandantory service being dropped. There should be incentives such as help for education and some training, etc. But service should be voluntary.", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "Originally posted by scooter_mech: quote: Ahh But Ms Neo Republican herself, Michele Bachmann, does not agree so much with President Obama or the Alaskan Govenor.. Good ol' CJ just can't refer to the GOP without stooping to name calling. Just because the senator is paranoid is no reason to believe the government is not out to get you. And an informed public is one which is armed with the knowlege to see the fallacy of the left. The Republican fear, which is quickly spreading through right-wing pundits, is from some original language that would make AmeriCorps service a requirement for young people. That language has been stripped from the bill. Still, you gotta love a source that also reports on \"an Klingon electronic dictionary born in Dinkytown\"", 
        "reply": " I agree with the mandantory service being dropped. There should be incentives such as help for education and some training, etc. But service should be voluntary.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-11 07:19:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? Mine too. They also seem to have this bad habit of not judging people just for the sake of passing judgment. Maybe I should disown them?", 
        "intTime": 20090511, 
        "postID": 21, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point?", 
        "reply": " Mine too. They also seem to have this bad habit of not judging people just for the sake of passing judgment. Maybe I should disown them?", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-11 07:46:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by xnavycg: quote: Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? Don’t claim to be from the party of family values if your own family is like an episode of Jerry Springer. That would be my point. So any family that has a teenage daughter get pregenant is like Jerry Springer? That any parents of such are responsible and have no moral values? If that is your opinion, then I take it you did not have premarital sex in high school or college or whatever? Are all teen age daughters the children of conservative family value politicians? Have you seen the tabloids ant the check out lane recently? Are all pregnant teens featured as prominently? Do all pregnant teen daughters have such gems as the fathers of there children? And as a matter of fact, I did wait until marriage due to a very religious up bringing. Contrary to what you may think, I am quite conservative, just not a Republican. Or Democrat for that matter.", 
        "intTime": 20090512, 
        "postID": 22, 
        "quote": "Originally posted by sw614: quote: Originally posted by xnavycg: quote: Originally posted by FollowMeInfantry: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. My loving, intelligent, moral children that were raised in a very Christian home are not pregnant, either. What's the point? Don’t claim to be from the party of family values if your own family is like an episode of Jerry Springer. That would be my point. So any family that has a teenage daughter get pregenant is like Jerry Springer? That any parents of such are responsible and have no moral values? If that is your opinion, then I take it you did not have premarital sex in high school or college or whatever?", 
        "reply": " Are all teen age daughters the children of conservative family value politicians? Have you seen the tabloids ant the check out lane recently? Are all pregnant teens featured as prominently? Do all pregnant teen daughters have such gems as the fathers of there children? And as a matter of fact, I did wait until marriage due to a very religious up bringing. Contrary to what you may think, I am quite conservative, just not a Republican. Or Democrat for that matter.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-12 04:55:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "xnavycg"
    }, 
    {
        "content": "\"And as a matter of fact, I did wait until marriage due to a very religious up bringing. Contrary to what you may think, I am quite conservative, just not a Republican. Or Democrat for that matter.\" Then that is commendable. And regardless of you thinking what I think, I was just seeing if you practice what you preach. Many who point fingers do not. Don't read the tabloids, but basing the \"Jerry Springer\" statement on them is somewhat silly. Do all teenage pregnancies have responsible people involved? No. Do all marriages have responsible parties involved? No. But that does not mean the entire family is disfunctional. To say that Govenor Palin is not who she seems because of the mistake her daughter and her daughter's boyfriend made is a bit of gulit by association. You can try to instill proper attitude and good judgement, but at the end of the day, teenagers make upo their own minds.", 
        "intTime": 20090512, 
        "postID": 23, 
        "quote": "", 
        "reply": "\"And as a matter of fact, I did wait until marriage due to a very religious up bringing. Contrary to what you may think, I am quite conservative, just not a Republican. Or Democrat for that matter.\" Then that is commendable. And regardless of you thinking what I think, I was just seeing if you practice what you preach. Many who point fingers do not. Don't read the tabloids, but basing the \"Jerry Springer\" statement on them is somewhat silly. Do all teenage pregnancies have responsible people involved? No. Do all marriages have responsible parties involved? No. But that does not mean the entire family is disfunctional. To say that Govenor Palin is not who she seems because of the mistake her daughter and her daughter's boyfriend made is a bit of gulit by association. You can try to instill proper attitude and good judgement, but at the end of the day, teenagers make upo their own minds.", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-12 07:04:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. OMG Daaaammmnnn slaaaamm... oh crap. hahahaha!!! lmao. Don't forget it's not hateful to call someone a domestic terrorist either..slander I wish he would sue her for slander, now that would be the icing on the cake...lol", 
        "intTime": 20090512, 
        "postID": 24, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment.", 
        "reply": " OMG Daaaammmnnn slaaaamm... oh crap. hahahaha!!! lmao. Don't forget it's not hateful to call someone a domestic terrorist either..slander I wish he would sue her for slander, now that would be the icing on the cake...lol", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-12 19:07:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad. Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem? Come on man, it's ok for them to \"spread thier wings\" once in a while just like everyone else", 
        "intTime": 20090512, 
        "postID": 25, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by xnavycg: quote: Originally posted by AngelHeart: quote: Originally posted by FollowMeInfantry: Well, I am going to get it from both sides of the partisan hacks, so might as well let 'er fly. Not from me. FMI. I agree with you, she is a class act. The blind and ignorant perception coming from the mouths of some posters here is to be expected. It is all because our Governor was unfortunate enough to get put in the position of not only dealing with a completely bias media but a blind and hateful society as well. She was unprepared for the vile reaction of the dems in the lower 48, to her nomination. It started the minute that happened. No one even knew who she was at that time, but they hated her anyway. She was unprepared for the petty, vicious attacks from the masses. They even brought her children into the vicious attacks against her. She may have faltered a few times but if you really looked closely, you would see that she handled it all with grace. This, all in spite of the shock of being thrown to the wolves by the very person who put her there. The ones who hate her, do not care who she really is. There hatred is based on bias and fear. There is no use in even discussing it with them because the have made up their ignorant minds. I’m just thankful that my hateful, ignorant, non-value having liberal kids that are raised in a non Christian home are not pregnant at the moment. See how petty and ignorant that statement was? No? Too bad. Yes, just like your governors “family values” LMAO!!! Are you sure she isn't a Dem?", 
        "reply": " Come on man, it's ok for them to \"spread thier wings\" once in a while just like everyone else", 
        "threadID": "409192893_6860029222001", 
        "time": "2009-05-12 19:10:00", 
        "title": "Palin Supports President Obama's National Service", 
        "userID": "crackerjacks61"
    }
]