[
    {
        "content": "i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "", 
        "reply": "i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 04:51:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us. Government owns the rental car company?", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "reply": " Government owns the rental car company?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 04:55:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Thud357L"
    }, 
    {
        "content": "someone doesn't know the difference between a fee and a tax.", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "", 
        "reply": "someone doesn't know the difference between a fee and a tax.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 04:58:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "reply": "", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 05:28:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "samh32"
    }, 
    {
        "content": "LOL... Like there are no taxes and fees imposed on bus riders. Actually there is NOTING funny about how the government squeezes every nickle and dime out of us. Now think about how many nickels and dimes it's going to take to provide health insurance to every one in the nation, including illegal aliens. I'm from the government. I'm here to help you.", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "", 
        "reply": "LOL... Like there are no taxes and fees imposed on bus riders. Actually there is NOTING funny about how the government squeezes every nickle and dime out of us. Now think about how many nickels and dimes it's going to take to provide health insurance to every one in the nation, including illegal aliens. I'm from the government. I'm here to help you.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:35:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: someone doesn't know the difference between a fee and a tax. Yeh, a fee is another word for tax.", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "Originally posted by karlhungusjr: someone doesn't know the difference between a fee and a tax.", 
        "reply": " Yeh, a fee is another word for tax.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:47:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "yea go greyhound...i got me a whole lot of greyhound time... but you got to take the time because it will take a few days to get anywhere... out of state anyways... it takes 3 days for me to go from fl to mo.... and almost 4-5 days to go from fl to nj... but it was snowing at the time... ive been all over the place on them buses...", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "", 
        "reply": "yea go greyhound...i got me a whole lot of greyhound time... but you got to take the time because it will take a few days to get anywhere... out of state anyways... it takes 3 days for me to go from fl to mo.... and almost 4-5 days to go from fl to nj... but it was snowing at the time... ive been all over the place on them buses...", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:50:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "outlaws93"
    }, 
    {
        "content": "So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves.", 
        "intTime": 20090415, 
        "postID": 8, 
        "quote": "", 
        "reply": "So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:57:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you?", 
        "intTime": 20090415, 
        "postID": 9, 
        "quote": "mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent.", 
        "reply": " You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:08:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "A Transaction Privilege Tax is a state tax. In fact it's an Arizona state tax. Guess what party runs Arizona? An Airport Access Fee is a fee the airport charges rental car companies to use the airport grounds, passed on to the customer.", 
        "intTime": 20090415, 
        "postID": 10, 
        "quote": "", 
        "reply": "A Transaction Privilege Tax is a state tax. In fact it's an Arizona state tax. Guess what party runs Arizona? An Airport Access Fee is a fee the airport charges rental car companies to use the airport grounds, passed on to the customer.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:17:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? No.", 
        "intTime": 20090415, 
        "postID": 11, 
        "quote": "Originally posted by bill_kananen: quote: mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you?", 
        "reply": " No.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:17:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I'd like to know what anti-tax people see as an alternative to taxes. Any takers?", 
        "intTime": 20090415, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'd like to know what anti-tax people see as an alternative to taxes. Any takers?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:18:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. So you have been to one? You have the exact knowledge of what it is all about? Or are you gathering your information from talking pundits?", 
        "intTime": 20090415, 
        "postID": 13, 
        "quote": "And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed.", 
        "reply": " So you have been to one? You have the exact knowledge of what it is all about? Or are you gathering your information from talking pundits?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:21:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "ACR26"
    }, 
    {
        "content": "How about getting people like Tim Gertner and Charlie Rangel to pay their taxes on time and pay all their penalties and fines?", 
        "intTime": 20090415, 
        "postID": 14, 
        "quote": "", 
        "reply": "How about getting people like Tim Gertner and Charlie Rangel to pay their taxes on time and pay all their penalties and fines?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:21:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No. It was coherent enough to get Obama elected. Why is it not coherent enough now?", 
        "intTime": 20090415, 
        "postID": 15, 
        "quote": "bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No.", 
        "reply": " It was coherent enough to get Obama elected. Why is it not coherent enough now?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:26:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No. It was coherent enough to get Obama elected. Whay is it not coherent enough now? That's right. All throughout the whole campaign, the debates, the town hall meetings, his campaign website, the only message was the words 'hope and change.' And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts?", 
        "intTime": 20090415, 
        "postID": 16, 
        "quote": "Originally posted by bill_kananen: quote: bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No. It was coherent enough to get Obama elected. Whay is it not coherent enough now?", 
        "reply": " That's right. All throughout the whole campaign, the debates, the town hall meetings, his campaign website, the only message was the words 'hope and change.' And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:33:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: esample1: And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts? All they will have to say is \"Not Obama.\" Any lib/socialist will be called \"O'Same.\" Anyway this is about taxes. Just have to promise that everyone making less then $100,000 will be entitles to earned income credit and full deduction for college loan interest. Anyone with private health insurance will be able to take it off the top as an income adjustment.", 
        "intTime": 20090415, 
        "postID": 17, 
        "quote": "esample1: And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts?", 
        "reply": " All they will have to say is \"Not Obama.\" Any lib/socialist will be called \"O'Same.\" Anyway this is about taxes. Just have to promise that everyone making less then $100,000 will be entitles to earned income credit and full deduction for college loan interest. Anyone with private health insurance will be able to take it off the top as an income adjustment.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:49:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers? I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight. \"The World's Finest\"", 
        "intTime": 20090415, 
        "postID": 18, 
        "quote": "Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers?", 
        "reply": " I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight. \"The World's Finest\"", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:53:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers? I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight. OK - but this has gone on forever. For openers, all taxation is confiscatory and redistributive. Secondly, there seems to be little desire to want to hold those who are currently in Congress accountable for the passage of those policies that brought us to a $1.3 trillion debt on Inauguration Day 2009. Think about everything - everything that's going on with our tax dollars, and leave out the political ideology when you do that. We're getting soaked for thousands of different reasons, and have been for a long time. But now, people want to themselves in a lather over it, when if they had been paying attention over all these years instead of thinking of how they can get more, more, more with little thought for the future, we likely wouldn't be here today. And people want to blame Barack Obama? I find that laughable. His election was preventable. Hell, all of this country's problems were preventable. But people didn't pay attention, the country is listing, and no one wants to accept responsibility. If we had been financially sound, I guarantee you Obama would never have been elected. Hell, he wouldn't have had a platform to run on. Just like any other politician, he exploited an opportunity. I don't like the idea of all these deficits, either, but everything I know tells me that our sleepwalking through the years got us here.", 
        "intTime": 20090415, 
        "postID": 19, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers? I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight.", 
        "reply": " OK - but this has gone on forever. For openers, all taxation is confiscatory and redistributive. Secondly, there seems to be little desire to want to hold those who are currently in Congress accountable for the passage of those policies that brought us to a $1.3 trillion debt on Inauguration Day 2009. Think about everything - everything that's going on with our tax dollars, and leave out the political ideology when you do that. We're getting soaked for thousands of different reasons, and have been for a long time. But now, people want to themselves in a lather over it, when if they had been paying attention over all these years instead of thinking of how they can get more, more, more with little thought for the future, we likely wouldn't be here today. And people want to blame Barack Obama? I find that laughable. His election was preventable. Hell, all of this country's problems were preventable. But people didn't pay attention, the country is listing, and no one wants to accept responsibility. If we had been financially sound, I guarantee you Obama would never have been elected. Hell, he wouldn't have had a platform to run on. Just like any other politician, he exploited an opportunity. I don't like the idea of all these deficits, either, but everything I know tells me that our sleepwalking through the years got us here.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 08:28:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "CNN 4/15/09 David M. Walker served as comptroller general of the United States and head of the Government Accountability Office from 1998 to 2008. Regardless of what politicians tell you, any additional accumulations of debt are, absent dramatic reductions in the size and role of government, basically deferred tax increases. Remember the old saw? \"You can pay me now or you can pay me later, with interest.\" To help put things in perspective, the Peterson Foundation calculated the federal government accumulated $56.4 trillion in total liabilities and unfunded promises for Medicare and Social Security as of September 30, 2008. The numbers used to calculate this figure come directly from the audited financial statements of the U.S. government. If $56.4 trillion in financial commitments is too big a number to digest, think of it as $483,000 per American household, or $184,000 for every man, woman and child in the country. Even broken down, the numbers can be tough to swallow. Yes, you've paid your taxes, but you still bear a significant share of the government's own financial burden.", 
        "intTime": 20090415, 
        "postID": 20, 
        "quote": "", 
        "reply": "CNN 4/15/09 David M. Walker served as comptroller general of the United States and head of the Government Accountability Office from 1998 to 2008. Regardless of what politicians tell you, any additional accumulations of debt are, absent dramatic reductions in the size and role of government, basically deferred tax increases. Remember the old saw? \"You can pay me now or you can pay me later, with interest.\" To help put things in perspective, the Peterson Foundation calculated the federal government accumulated $56.4 trillion in total liabilities and unfunded promises for Medicare and Social Security as of September 30, 2008. The numbers used to calculate this figure come directly from the audited financial statements of the U.S. government. If $56.4 trillion in financial commitments is too big a number to digest, think of it as $483,000 per American household, or $184,000 for every man, woman and child in the country. Even broken down, the numbers can be tough to swallow. Yes, you've paid your taxes, but you still bear a significant share of the government's own financial burden.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 08:31:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "(CNN)4-15-09 -- Tax day is an annual stress test for millions of Americans, but Wednesday's Internal Revenue Service filing deadline may be the toughest one yet for many who can't pay their mortgages or rent, let alone a big tax bill. The IRS has a monthly payment plan, but it comes with an upfront fee, stiff penalties and interest, making it more costly than a commercial loan. Between 2 million and 3 million taxpayers a year follow that route. \"Bring your checkbook when you go to file an extension,\" said Amy McAnarney, executive director of the Tax Institute at H&R Block. \"The tax that isn't paid by April 15 is subject to interest and penalties, so it's best to pay as much as you can even if you are requesting an extension.\" More people should use the Geitner and Rangel plan. Don't pay it on time. Then don't pay the interest or penalties when cought. That should qualify you to get a job in the Obama administration.", 
        "intTime": 20090415, 
        "postID": 21, 
        "quote": "", 
        "reply": "(CNN)4-15-09 -- Tax day is an annual stress test for millions of Americans, but Wednesday's Internal Revenue Service filing deadline may be the toughest one yet for many who can't pay their mortgages or rent, let alone a big tax bill. The IRS has a monthly payment plan, but it comes with an upfront fee, stiff penalties and interest, making it more costly than a commercial loan. Between 2 million and 3 million taxpayers a year follow that route. \"Bring your checkbook when you go to file an extension,\" said Amy McAnarney, executive director of the Tax Institute at H&R Block. \"The tax that isn't paid by April 15 is subject to interest and penalties, so it's best to pay as much as you can even if you are requesting an extension.\" More people should use the Geitner and Rangel plan. Don't pay it on time. Then don't pay the interest or penalties when cought. That should qualify you to get a job in the Obama administration.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 09:17:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Try to pay it this year.....but next year, if things haven't better for those that earn and seem to pay the way for many that don't.....expect that taxes will be withheld until such reform is instigated. The times, she are a changin'! \"We reserve the right to refuse service to politician's!\"", 
        "intTime": 20090415, 
        "postID": 22, 
        "quote": "", 
        "reply": "Try to pay it this year.....but next year, if things haven't better for those that earn and seem to pay the way for many that don't.....expect that taxes will be withheld until such reform is instigated. The times, she are a changin'! \"We reserve the right to refuse service to politician's!\"", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 13:56:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "Again - why has it taken so long for people to complain? Things have gone way too far for an easy fix.", 
        "intTime": 20090415, 
        "postID": 23, 
        "quote": "", 
        "reply": "Again - why has it taken so long for people to complain? Things have gone way too far for an easy fix.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:02:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights.", 
        "intTime": 20090415, 
        "postID": 24, 
        "quote": "Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves.", 
        "reply": " The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:02:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights. People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process?", 
        "intTime": 20090415, 
        "postID": 25, 
        "quote": "Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights.", 
        "reply": " People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:06:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\"", 
        "intTime": 20090415, 
        "postID": 26, 
        "quote": "", 
        "reply": "We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\"", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:09:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\" It isn't grassroots if anyone in the media started it.", 
        "intTime": 20090415, 
        "postID": 27, 
        "quote": "Originally posted by _cash_: We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\"", 
        "reply": " It isn't grassroots if anyone in the media started it.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:11:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights. People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process? Gun Rights (Second Amendment), yes. The other's you mention, NOT! Issues for example School Bond taxes for a Bond Bill that was voted down thrice. Unrestricted spending by lawmaker's....no accountability. Check around.....many many things.......the answer now is STOP! You're not getting it right! STOP!", 
        "intTime": 20090415, 
        "postID": 28, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights. People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process?", 
        "reply": " Gun Rights (Second Amendment), yes. The other's you mention, NOT! Issues for example School Bond taxes for a Bond Bill that was voted down thrice. Unrestricted spending by lawmaker's....no accountability. Check around.....many many things.......the answer now is STOP! You're not getting it right! STOP!", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:16:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before?", 
        "intTime": 20090415, 
        "postID": 29, 
        "quote": "", 
        "reply": "OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:22:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before? People have been complaining all along......nobody and especially no politician's have been listening. That's why we are now at this point.....and now, they had better listen and act. The people, the constituancy vs: lawmaker's that won't listen and perform unwisely with the people's monies. My opinion.....but I bet they'll listen now! These same folks will vote them back to the farms they came from.", 
        "intTime": 20090415, 
        "postID": 30, 
        "quote": "Originally posted by mcgreer: OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before?", 
        "reply": " People have been complaining all along......nobody and especially no politician's have been listening. That's why we are now at this point.....and now, they had better listen and act. The people, the constituancy vs: lawmaker's that won't listen and perform unwisely with the people's monies. My opinion.....but I bet they'll listen now! These same folks will vote them back to the farms they came from.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:29:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "intTime": 20090415, 
        "postID": 31, 
        "quote": "", 
        "reply": "i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 04:51:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us. Government owns the rental car company?", 
        "intTime": 20090415, 
        "postID": 32, 
        "quote": "Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "reply": " Government owns the rental car company?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 04:55:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Thud357L"
    }, 
    {
        "content": "someone doesn't know the difference between a fee and a tax.", 
        "intTime": 20090415, 
        "postID": 33, 
        "quote": "", 
        "reply": "someone doesn't know the difference between a fee and a tax.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 04:58:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "intTime": 20090415, 
        "postID": 34, 
        "quote": "Originally posted by threerings: i recently rented a car at an airport... I was charged a \"Transaction Privilege Tax\" of $36.00. When I asked the very nice girl at the counter what the tax was for, she explained it was for renting the car AT the airport.. Further down on the bill was an AIRPORT ACCESS FEE of $98.00. When I pointed that out she shrugged and just kind of looked uncomfortable... Just thought it was funny how the government is squeezing every single dime out of us.", 
        "reply": "", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 05:28:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "samh32"
    }, 
    {
        "content": "LOL... Like there are no taxes and fees imposed on bus riders. Actually there is NOTING funny about how the government squeezes every nickle and dime out of us. Now think about how many nickels and dimes it's going to take to provide health insurance to every one in the nation, including illegal aliens. I'm from the government. I'm here to help you.", 
        "intTime": 20090415, 
        "postID": 35, 
        "quote": "", 
        "reply": "LOL... Like there are no taxes and fees imposed on bus riders. Actually there is NOTING funny about how the government squeezes every nickle and dime out of us. Now think about how many nickels and dimes it's going to take to provide health insurance to every one in the nation, including illegal aliens. I'm from the government. I'm here to help you.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:35:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: someone doesn't know the difference between a fee and a tax. Yeh, a fee is another word for tax.", 
        "intTime": 20090415, 
        "postID": 36, 
        "quote": "Originally posted by karlhungusjr: someone doesn't know the difference between a fee and a tax.", 
        "reply": " Yeh, a fee is another word for tax.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:47:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "yea go greyhound...i got me a whole lot of greyhound time... but you got to take the time because it will take a few days to get anywhere... out of state anyways... it takes 3 days for me to go from fl to mo.... and almost 4-5 days to go from fl to nj... but it was snowing at the time... ive been all over the place on them buses...", 
        "intTime": 20090415, 
        "postID": 37, 
        "quote": "", 
        "reply": "yea go greyhound...i got me a whole lot of greyhound time... but you got to take the time because it will take a few days to get anywhere... out of state anyways... it takes 3 days for me to go from fl to mo.... and almost 4-5 days to go from fl to nj... but it was snowing at the time... ive been all over the place on them buses...", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:50:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "outlaws93"
    }, 
    {
        "content": "So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves.", 
        "intTime": 20090415, 
        "postID": 38, 
        "quote": "", 
        "reply": "So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 06:57:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you?", 
        "intTime": 20090415, 
        "postID": 39, 
        "quote": "mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent.", 
        "reply": " You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:08:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "A Transaction Privilege Tax is a state tax. In fact it's an Arizona state tax. Guess what party runs Arizona? An Airport Access Fee is a fee the airport charges rental car companies to use the airport grounds, passed on to the customer.", 
        "intTime": 20090415, 
        "postID": 40, 
        "quote": "", 
        "reply": "A Transaction Privilege Tax is a state tax. In fact it's an Arizona state tax. Guess what party runs Arizona? An Airport Access Fee is a fee the airport charges rental car companies to use the airport grounds, passed on to the customer.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:17:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? No.", 
        "intTime": 20090415, 
        "postID": 41, 
        "quote": "Originally posted by bill_kananen: quote: mcgreer: I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you?", 
        "reply": " No.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:17:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I'd like to know what anti-tax people see as an alternative to taxes. Any takers?", 
        "intTime": 20090415, 
        "postID": 42, 
        "quote": "", 
        "reply": "I'd like to know what anti-tax people see as an alternative to taxes. Any takers?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:18:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. So you have been to one? You have the exact knowledge of what it is all about? Or are you gathering your information from talking pundits?", 
        "intTime": 20090415, 
        "postID": 43, 
        "quote": "And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed.", 
        "reply": " So you have been to one? You have the exact knowledge of what it is all about? Or are you gathering your information from talking pundits?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:21:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "ACR26"
    }, 
    {
        "content": "How about getting people like Tim Gertner and Charlie Rangel to pay their taxes on time and pay all their penalties and fines?", 
        "intTime": 20090415, 
        "postID": 44, 
        "quote": "", 
        "reply": "How about getting people like Tim Gertner and Charlie Rangel to pay their taxes on time and pay all their penalties and fines?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:21:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No. It was coherent enough to get Obama elected. Why is it not coherent enough now?", 
        "intTime": 20090415, 
        "postID": 45, 
        "quote": "bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No.", 
        "reply": " It was coherent enough to get Obama elected. Why is it not coherent enough now?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:26:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No. It was coherent enough to get Obama elected. Whay is it not coherent enough now? That's right. All throughout the whole campaign, the debates, the town hall meetings, his campaign website, the only message was the words 'hope and change.' And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts?", 
        "intTime": 20090415, 
        "postID": 46, 
        "quote": "Originally posted by bill_kananen: quote: bill_kananen: You're right! From now on we are going to protest for HOPE and CHANGE. That coherent enough for you? mcgreer: No. It was coherent enough to get Obama elected. Whay is it not coherent enough now?", 
        "reply": " That's right. All throughout the whole campaign, the debates, the town hall meetings, his campaign website, the only message was the words 'hope and change.' And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:33:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: esample1: And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts? All they will have to say is \"Not Obama.\" Any lib/socialist will be called \"O'Same.\" Anyway this is about taxes. Just have to promise that everyone making less then $100,000 will be entitles to earned income credit and full deduction for college loan interest. Anyone with private health insurance will be able to take it off the top as an income adjustment.", 
        "intTime": 20090415, 
        "postID": 47, 
        "quote": "esample1: And you think you Republicans will ever get back into office with this kind of rhetoric from the wingnuts?", 
        "reply": " All they will have to say is \"Not Obama.\" Any lib/socialist will be called \"O'Same.\" Anyway this is about taxes. Just have to promise that everyone making less then $100,000 will be entitles to earned income credit and full deduction for college loan interest. Anyone with private health insurance will be able to take it off the top as an income adjustment.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:49:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers? I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight. \"The World's Finest\"", 
        "intTime": 20090415, 
        "postID": 48, 
        "quote": "Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers?", 
        "reply": " I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight. \"The World's Finest\"", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 07:53:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers? I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight. OK - but this has gone on forever. For openers, all taxation is confiscatory and redistributive. Secondly, there seems to be little desire to want to hold those who are currently in Congress accountable for the passage of those policies that brought us to a $1.3 trillion debt on Inauguration Day 2009. Think about everything - everything that's going on with our tax dollars, and leave out the political ideology when you do that. We're getting soaked for thousands of different reasons, and have been for a long time. But now, people want to themselves in a lather over it, when if they had been paying attention over all these years instead of thinking of how they can get more, more, more with little thought for the future, we likely wouldn't be here today. And people want to blame Barack Obama? I find that laughable. His election was preventable. Hell, all of this country's problems were preventable. But people didn't pay attention, the country is listing, and no one wants to accept responsibility. If we had been financially sound, I guarantee you Obama would never have been elected. Hell, he wouldn't have had a platform to run on. Just like any other politician, he exploited an opportunity. I don't like the idea of all these deficits, either, but everything I know tells me that our sleepwalking through the years got us here.", 
        "intTime": 20090415, 
        "postID": 49, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by mcgreer: I'd like to know what anti-tax people see as an alternative to taxes. Any takers? I don't think anyone is \"antitax\" as in not paying any taxes at all. It has more to do with the confiscatory taxation it's going to take to pay off the trillions of dollars in debt obama is accumulating, an oppressive government, and wasteful spending on social programs. The government has now almost completely exempted at least half of the wage earners in this country from any responsibility for federal taxes at all. I think most Americans are tired of giving the government more money because of the wasteful spending and lack of oversight.", 
        "reply": " OK - but this has gone on forever. For openers, all taxation is confiscatory and redistributive. Secondly, there seems to be little desire to want to hold those who are currently in Congress accountable for the passage of those policies that brought us to a $1.3 trillion debt on Inauguration Day 2009. Think about everything - everything that's going on with our tax dollars, and leave out the political ideology when you do that. We're getting soaked for thousands of different reasons, and have been for a long time. But now, people want to themselves in a lather over it, when if they had been paying attention over all these years instead of thinking of how they can get more, more, more with little thought for the future, we likely wouldn't be here today. And people want to blame Barack Obama? I find that laughable. His election was preventable. Hell, all of this country's problems were preventable. But people didn't pay attention, the country is listing, and no one wants to accept responsibility. If we had been financially sound, I guarantee you Obama would never have been elected. Hell, he wouldn't have had a platform to run on. Just like any other politician, he exploited an opportunity. I don't like the idea of all these deficits, either, but everything I know tells me that our sleepwalking through the years got us here.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 08:28:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "CNN 4/15/09 David M. Walker served as comptroller general of the United States and head of the Government Accountability Office from 1998 to 2008. Regardless of what politicians tell you, any additional accumulations of debt are, absent dramatic reductions in the size and role of government, basically deferred tax increases. Remember the old saw? \"You can pay me now or you can pay me later, with interest.\" To help put things in perspective, the Peterson Foundation calculated the federal government accumulated $56.4 trillion in total liabilities and unfunded promises for Medicare and Social Security as of September 30, 2008. The numbers used to calculate this figure come directly from the audited financial statements of the U.S. government. If $56.4 trillion in financial commitments is too big a number to digest, think of it as $483,000 per American household, or $184,000 for every man, woman and child in the country. Even broken down, the numbers can be tough to swallow. Yes, you've paid your taxes, but you still bear a significant share of the government's own financial burden.", 
        "intTime": 20090415, 
        "postID": 50, 
        "quote": "", 
        "reply": "CNN 4/15/09 David M. Walker served as comptroller general of the United States and head of the Government Accountability Office from 1998 to 2008. Regardless of what politicians tell you, any additional accumulations of debt are, absent dramatic reductions in the size and role of government, basically deferred tax increases. Remember the old saw? \"You can pay me now or you can pay me later, with interest.\" To help put things in perspective, the Peterson Foundation calculated the federal government accumulated $56.4 trillion in total liabilities and unfunded promises for Medicare and Social Security as of September 30, 2008. The numbers used to calculate this figure come directly from the audited financial statements of the U.S. government. If $56.4 trillion in financial commitments is too big a number to digest, think of it as $483,000 per American household, or $184,000 for every man, woman and child in the country. Even broken down, the numbers can be tough to swallow. Yes, you've paid your taxes, but you still bear a significant share of the government's own financial burden.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 08:31:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "(CNN)4-15-09 -- Tax day is an annual stress test for millions of Americans, but Wednesday's Internal Revenue Service filing deadline may be the toughest one yet for many who can't pay their mortgages or rent, let alone a big tax bill. The IRS has a monthly payment plan, but it comes with an upfront fee, stiff penalties and interest, making it more costly than a commercial loan. Between 2 million and 3 million taxpayers a year follow that route. \"Bring your checkbook when you go to file an extension,\" said Amy McAnarney, executive director of the Tax Institute at H&R Block. \"The tax that isn't paid by April 15 is subject to interest and penalties, so it's best to pay as much as you can even if you are requesting an extension.\" More people should use the Geitner and Rangel plan. Don't pay it on time. Then don't pay the interest or penalties when cought. That should qualify you to get a job in the Obama administration.", 
        "intTime": 20090415, 
        "postID": 51, 
        "quote": "", 
        "reply": "(CNN)4-15-09 -- Tax day is an annual stress test for millions of Americans, but Wednesday's Internal Revenue Service filing deadline may be the toughest one yet for many who can't pay their mortgages or rent, let alone a big tax bill. The IRS has a monthly payment plan, but it comes with an upfront fee, stiff penalties and interest, making it more costly than a commercial loan. Between 2 million and 3 million taxpayers a year follow that route. \"Bring your checkbook when you go to file an extension,\" said Amy McAnarney, executive director of the Tax Institute at H&R Block. \"The tax that isn't paid by April 15 is subject to interest and penalties, so it's best to pay as much as you can even if you are requesting an extension.\" More people should use the Geitner and Rangel plan. Don't pay it on time. Then don't pay the interest or penalties when cought. That should qualify you to get a job in the Obama administration.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 09:17:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Try to pay it this year.....but next year, if things haven't better for those that earn and seem to pay the way for many that don't.....expect that taxes will be withheld until such reform is instigated. The times, she are a changin'! \"We reserve the right to refuse service to politician's!\"", 
        "intTime": 20090415, 
        "postID": 52, 
        "quote": "", 
        "reply": "Try to pay it this year.....but next year, if things haven't better for those that earn and seem to pay the way for many that don't.....expect that taxes will be withheld until such reform is instigated. The times, she are a changin'! \"We reserve the right to refuse service to politician's!\"", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 13:56:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "Again - why has it taken so long for people to complain? Things have gone way too far for an easy fix.", 
        "intTime": 20090415, 
        "postID": 53, 
        "quote": "", 
        "reply": "Again - why has it taken so long for people to complain? Things have gone way too far for an easy fix.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:02:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights.", 
        "intTime": 20090415, 
        "postID": 54, 
        "quote": "Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves.", 
        "reply": " The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:02:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights. People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process?", 
        "intTime": 20090415, 
        "postID": 55, 
        "quote": "Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights.", 
        "reply": " People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:06:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\"", 
        "intTime": 20090415, 
        "postID": 56, 
        "quote": "", 
        "reply": "We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\"", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:09:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\" It isn't grassroots if anyone in the media started it.", 
        "intTime": 20090415, 
        "postID": 57, 
        "quote": "Originally posted by _cash_: We made Tea today! In Lake Superior! It was a great Rally and a good turnout....At Duluth, MN.....great signs! People are now signing up for the next one. Check for a Tea Party near you. Send your lawmaker's each a tea bag! This is \"grassroots\" and the purest voice of the people. \"God Bless America!\"", 
        "reply": " It isn't grassroots if anyone in the media started it.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:11:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights. People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process? Gun Rights (Second Amendment), yes. The other's you mention, NOT! Issues for example School Bond taxes for a Bond Bill that was voted down thrice. Unrestricted spending by lawmaker's....no accountability. Check around.....many many things.......the answer now is STOP! You're not getting it right! STOP!", 
        "intTime": 20090415, 
        "postID": 58, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by _cash_: quote: Originally posted by mcgreer: So why is there such a collective knickers-twisting over taxes now? This makes absolutely no sense to me. Seems to be just another stupid excuse for pundits who would otherwise be marginalized to divide conservatives and liberals, and therefore keep themselves relevant so they can make money off people's fear and ignorance. And those who bite into this stuff need to start thinking for themselves. This \"tea party\" nonsense is misdirected, misguided, and misinformed. The Boston Tea Party was a protest by small business owners over what was essentially a corporate tax break. And I thought those who promote and participate in these \"tea parties\" supported corporate tax breaks. I mean, people have the right to protest over whatever they wish. But if they want credibility, the protest should at least be coherent. I believe that those pundits are using susceptible people in order to promote and enrich themselves. The Tea Parties are about \"Life.....Liberty....and the persuit of Happiness\"! Can you now see the reasoning for such Rally's? All three of these area's are now in distress in our Nation. Everything being protested relates to these three Rights. People can, and have, applied that standard to almost every special interest in the United States. That includes abortion, gun rights, consumption of alcohol and drugs, same-sex marriage, prayer in schools...the list is endless. So, applying that standard, explain how, exactly, those three rights are being compromised in a manner that goes beyond typical taxation, which is the result of due process?", 
        "reply": " Gun Rights (Second Amendment), yes. The other's you mention, NOT! Issues for example School Bond taxes for a Bond Bill that was voted down thrice. Unrestricted spending by lawmaker's....no accountability. Check around.....many many things.......the answer now is STOP! You're not getting it right! STOP!", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:16:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }, 
    {
        "content": "OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before?", 
        "intTime": 20090415, 
        "postID": 59, 
        "quote": "", 
        "reply": "OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before?", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:22:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before? People have been complaining all along......nobody and especially no politician's have been listening. That's why we are now at this point.....and now, they had better listen and act. The people, the constituancy vs: lawmaker's that won't listen and perform unwisely with the people's monies. My opinion.....but I bet they'll listen now! These same folks will vote them back to the farms they came from.", 
        "intTime": 20090415, 
        "postID": 60, 
        "quote": "Originally posted by mcgreer: OK - so explain it to me, then. Taxation by the federal government is legal per Article I, Section 2 and the Sixteenth Amendment of the Constitution. And (once again) a tax break by George III that favored the East India Company over small businessmen of the American colonies inspired the first Boston Tea Party. So, what is this complaint all about? It makes no sense to me at all. Why the complaint about taxation now? Why haven't you done it before?", 
        "reply": " People have been complaining all along......nobody and especially no politician's have been listening. That's why we are now at this point.....and now, they had better listen and act. The people, the constituancy vs: lawmaker's that won't listen and perform unwisely with the people's monies. My opinion.....but I bet they'll listen now! These same folks will vote them back to the farms they came from.", 
        "threadID": "409192893_4590067022001", 
        "time": "2009-04-15 14:29:00", 
        "title": "Taxes Taxes Taxes", 
        "userID": "_cash_"
    }
]