[
    {
        "content": "well lets see now, she is not even on the banking cmt, but she delivers billions to fdic and they in turn set up sweetheart deal with feinstein hubby who gets a contract to sell tarp homes and earn good commission and bonus on all of it... then he sets up and buys tons of stock and the next day it rises 40% Democrats hump another one \"\"http://wizbangblog.com/content/2009/04/21/wash-times-democrat-sen-feinstein-helped-her-husbands-firm-to-the-tune-of-25b.php\"\"", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "", 
        "reply": "well lets see now, she is not even on the banking cmt, but she delivers billions to fdic and they in turn set up sweetheart deal with feinstein hubby who gets a contract to sell tarp homes and earn good commission and bonus on all of it... then he sets up and buys tons of stock and the next day it rises 40% Democrats hump another one \"\"http://wizbangblog.com/content/2009/04/21/wash-times-democrat-sen-feinstein-helped-her-husbands-firm-to-the-tune-of-25b.php\"\"", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-21 14:37:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Aaaaaaaannnddddd she will be re-elected. How quaint", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "Aaaaaaaannnddddd she will be re-elected. How quaint", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-21 15:12:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "ACR26"
    }, 
    {
        "content": "Yeah, I read that her hubby's organization is to be a big beneficiary of the spendulus or some other federal waste at our expense. The underlying conflict of interest this appears to create is one that no self-respecting servant of the people would tolerate. But these public non-servants for life don't give a damn about the implied or actual corruption. This is a \"Post-corruption Congress,\" baby.", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "", 
        "reply": "Yeah, I read that her hubby's organization is to be a big beneficiary of the spendulus or some other federal waste at our expense. The underlying conflict of interest this appears to create is one that no self-respecting servant of the people would tolerate. But these public non-servants for life don't give a damn about the implied or actual corruption. This is a \"Post-corruption Congress,\" baby.", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-22 17:46:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "RRR52"
    }, 
    {
        "content": "SWEEEEEET!", 
        "intTime": 20090423, 
        "postID": 4, 
        "quote": "", 
        "reply": "SWEEEEEET!", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-23 00:07:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "She and her husband have done nothing wrong. If they had I'm sure Nancy or Harry or even Obama would have asked for an investigation into their financial affairs. Now don't get me wrong, I think she is a scum bag just like all the other political morons in Congress but this thing has been out in the open for too long without any IRS follow up.", 
        "intTime": 20090423, 
        "postID": 5, 
        "quote": "", 
        "reply": "She and her husband have done nothing wrong. If they had I'm sure Nancy or Harry or even Obama would have asked for an investigation into their financial affairs. Now don't get me wrong, I think she is a scum bag just like all the other political morons in Congress but this thing has been out in the open for too long without any IRS follow up.", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-23 04:25:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: She and her husband have done nothing wrong. If they had I'm sure Nancy or Harry or even Obama would have asked for an investigation into their financial affairs. Now don't get me wrong, I think she is a scum bag just like all the other political morons in Congress but this thing has been out in the open for too long without any IRS follow up. no, dont think so, this is rather new, she negotiated a lot of dollars for banking cmt, and she is not even on that cmt.. then her husb is awarded huge contract to allow him to sell tarp houses at commission. and then he formulated stock deal that as soon as the deal to sell tarp houses worked the stock went up by 40 per cent and he was a huge stock holder this is all rather recent", 
        "intTime": 20090423, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: She and her husband have done nothing wrong. If they had I'm sure Nancy or Harry or even Obama would have asked for an investigation into their financial affairs. Now don't get me wrong, I think she is a scum bag just like all the other political morons in Congress but this thing has been out in the open for too long without any IRS follow up.", 
        "reply": " no, dont think so, this is rather new, she negotiated a lot of dollars for banking cmt, and she is not even on that cmt.. then her husb is awarded huge contract to allow him to sell tarp houses at commission. and then he formulated stock deal that as soon as the deal to sell tarp houses worked the stock went up by 40 per cent and he was a huge stock holder this is all rather recent", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-23 05:14:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "Ira1945"
    }, 
    {
        "content": "because of your tax dollars...", 
        "intTime": 20090423, 
        "postID": 7, 
        "quote": "", 
        "reply": "because of your tax dollars...", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-23 05:35:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "outlaws93"
    }, 
    {
        "content": "all politicians should have to follow the same rules as people on disability... cant make more then so much per year...", 
        "intTime": 20090423, 
        "postID": 8, 
        "quote": "", 
        "reply": "all politicians should have to follow the same rules as people on disability... cant make more then so much per year...", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-23 05:37:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: outlaws93: all politicians should have to follow the same rules as people on disability... cant make more then so much per year... LOL... the first laugh of the day. And just how would that come about? What part of \"we won, we can do whatever we want\" don't you understand. Feinstein is an excellent example of a socialist leader.", 
        "intTime": 20090423, 
        "postID": 9, 
        "quote": "outlaws93: all politicians should have to follow the same rules as people on disability... cant make more then so much per year...", 
        "reply": " LOL... the first laugh of the day. And just how would that come about? What part of \"we won, we can do whatever we want\" don't you understand. Feinstein is an excellent example of a socialist leader.", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-23 06:06:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: outlaws93: all politicians should have to follow the same rules as people on disability... cant make more then so much per year... LOL... the first laugh of the day. And just how would that come about? What part of \"we won, we can do whatever we want\" don't you understand. Feinstein is an excellent example of a socialist leader. yup good point...", 
        "intTime": 20090423, 
        "postID": 10, 
        "quote": "Originally posted by bill_kananen: quote: outlaws93: all politicians should have to follow the same rules as people on disability... cant make more then so much per year... LOL... the first laugh of the day. And just how would that come about? What part of \"we won, we can do whatever we want\" don't you understand. Feinstein is an excellent example of a socialist leader.", 
        "reply": " yup good point...", 
        "threadID": "409192893_3890083122001", 
        "time": "2009-04-23 06:23:00", 
        "title": "Feinstein 8th richest person in DC  wonder how", 
        "userID": "outlaws93"
    }
]