[
    {
        "content": "Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "intTime": 20090321, 
        "postID": 1, 
        "quote": "", 
        "reply": "Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 03:58:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "Originally posted by Duster6: Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "reply": "", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 05:00:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "blane"
    }, 
    {
        "content": "Mike, I say publish the addresses of any AIG exec who does not voluntarily return his bonus. Muwahhaha.", 
        "intTime": 20090321, 
        "postID": 3, 
        "quote": "", 
        "reply": "Mike, I say publish the addresses of any AIG exec who does not voluntarily return his bonus. Muwahhaha.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 08:47:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "AMEN!!! Still working on the Tiger Codes, but to date, I think I will find that I am obligated to put them back into computer format, because I do believe that they may have gons to the four winds in one of the few crashes I have had......SinLoi.........®", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "", 
        "reply": "AMEN!!! Still working on the Tiger Codes, but to date, I think I will find that I am obligated to put them back into computer format, because I do believe that they may have gons to the four winds in one of the few crashes I have had......SinLoi.........®", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 14:57:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }, 
    {
        "content": "quote: FAIRFIELD, Conn. (AP) -- A busload of activists -- outnumbered 2-to-1 by reporters and photographers -- are paying visits to the homes of American International Group Inc. executives in Connecticut to protest tens of millions in bonuses awarded by the company. About 40 protesters parked at a cul-de-sac Saturday afternoon and walked to the Fairfield home of Douglas Polling. They were met on the curb by two security guards, and one activist read a letter detailing the financial struggles that many Connecticut residents have faced. The group then left the note in Polling's mailbox. Polling already agreed to forfeit his bonus, but the protesters want AIG executives to do more to help working families. AIG has received more than $182 billion in federal aid. -http://biz.yahoo.com/ap/090321/aig_bonuses.html", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "FAIRFIELD, Conn. (AP) -- A busload of activists -- outnumbered 2-to-1 by reporters and photographers -- are paying visits to the homes of American International Group Inc. executives in Connecticut to protest tens of millions in bonuses awarded by the company. About 40 protesters parked at a cul-de-sac Saturday afternoon and walked to the Fairfield home of Douglas Polling. They were met on the curb by two security guards, and one activist read a letter detailing the financial struggles that many Connecticut residents have faced. The group then left the note in Polling's mailbox. Polling already agreed to forfeit his bonus, but the protesters want AIG executives to do more to help working families. AIG has received more than $182 billion in federal aid.", 
        "reply": " -http://biz.yahoo.com/ap/090321/aig_bonuses.html", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 15:07:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "floersh"
    }, 
    {
        "content": "\"I'M AS MAD AS HELL, AND I'M NOT GOING TO TAKE THIS ANYMORE!' I want you to get up right now, sit up, go to your windows, open them and stick your head out and yell - 'I'm as mad as hell and I'm not going to take this anymore!...\" ...Peter Finch (as Howard Beale) in Network.", 
        "intTime": 20090321, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"I'M AS MAD AS HELL, AND I'M NOT GOING TO TAKE THIS ANYMORE!' I want you to get up right now, sit up, go to your windows, open them and stick your head out and yell - 'I'm as mad as hell and I'm not going to take this anymore!...\" ...Peter Finch (as Howard Beale) in Network.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 15:53:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "What a bunch of BS, the villagers with torches after the monsters now?", 
        "intTime": 20090321, 
        "postID": 7, 
        "quote": "", 
        "reply": "What a bunch of BS, the villagers with torches after the monsters now?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 17:52:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "OldDoc"
    }, 
    {
        "content": "No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "intTime": 20090321, 
        "postID": 8, 
        "quote": "", 
        "reply": "No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 18:08:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"...", 
        "intTime": 20090321, 
        "postID": 9, 
        "quote": "Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "reply": " Now duster why are you enticing \"class warfare\"...", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 18:37:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "intTime": 20090321, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "reply": " You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 19:20:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "bounceandburst"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: What a bunch of BS, the villagers with torches after the monsters now? For whatever my two bits are worth I am going to offer a condolence for your liberalistic attitude. Don't get me wrong, I didn't agree with a lot that Bush did or didn't do, when it was or should have been done. Think back a little Lad, how many times have we been attacked since 9/11? The one positive thing Bush did, was to take means of keeping the country safe from any further attacks. I have made this statement before and will continue to do so. \"We haven't seen the last of attacks on the homeland we call America. Not by a long shot have we; and this is what we need to prepare for. Congress is the culprits of the \"Bail Out\" along with their 'buddies' in the oil cartels. Keep one thing in mind, the President of the united States is no more then a fighrheaed and cannot accmplish anything withou the approval of Congress. Granted some Presidents are capable of thinking outside the box, making sounde dicissions and doing what is good for Americal. while otheres tend to just flow along adn let others doe his bidding, In Name Only\"", 
        "intTime": 20090321, 
        "postID": 11, 
        "quote": "Originally posted by OldDoc: What a bunch of BS, the villagers with torches after the monsters now?", 
        "reply": " For whatever my two bits are worth I am going to offer a condolence for your liberalistic attitude. Don't get me wrong, I didn't agree with a lot that Bush did or didn't do, when it was or should have been done. Think back a little Lad, how many times have we been attacked since 9/11? The one positive thing Bush did, was to take means of keeping the country safe from any further attacks. I have made this statement before and will continue to do so. \"We haven't seen the last of attacks on the homeland we call America. Not by a long shot have we; and this is what we need to prepare for. Congress is the culprits of the \"Bail Out\" along with their 'buddies' in the oil cartels. Keep one thing in mind, the President of the united States is no more then a fighrheaed and cannot accmplish anything withou the approval of Congress. Granted some Presidents are capable of thinking outside the box, making sounde dicissions and doing what is good for Americal. while otheres tend to just flow along adn let others doe his bidding, In Name Only\"", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 22:30:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }, 
    {
        "content": "Should be more \"outrage\" at congress.JMHO", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "", 
        "reply": "Should be more \"outrage\" at congress.JMHO", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 02:53:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me.", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "", 
        "reply": "Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 04:50:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... It's going to kill you when you find out that Obama is really a Dick Cheney puppet...he will use his one term to increase the \"misery index\" ala Jimmy Carter, paving the way for 12 more years of glorious GOP rule. The attention over Obama's birth certificate (or lack thereof) was to give Cheney and Obama time to cover up the millions of KBR profits that was chaging hands.", 
        "intTime": 20090322, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "reply": " It's going to kill you when you find out that Obama is really a Dick Cheney puppet...he will use his one term to increase the \"misery index\" ala Jimmy Carter, paving the way for 12 more years of glorious GOP rule. The attention over Obama's birth certificate (or lack thereof) was to give Cheney and Obama time to cover up the millions of KBR profits that was chaging hands.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 08:04:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"... What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics?", 
        "intTime": 20090322, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"...", 
        "reply": " What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 11:33:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "quote: Originally posted by SinePariDonster: quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"... What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics? CLASS WARFARE, now there is a term not heard in a long time. (1960ish) Another thought that flowed across the desk today was the mass mailing of tea bags on the first of April with hope they start flowing into the White House on the 15th. i.e., a modern day Boston Tea Party. Remember the question if a man walked into the woods and shouted at his wife, could she hear him and raise cain whem he came home? New concept here; If, say on Memorial Day, everyone were to go into their yard and shout at the top of their lungs; \"STOP! WE WANT OUR COUNTRY BACK!!!STOP NOW!\" @ 1500EST, would the dear hearts in DC be able to hear them?.....®", 
        "intTime": 20090322, 
        "postID": 16, 
        "quote": "Originally posted by SinePariDonster: quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"... What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics?", 
        "reply": " CLASS WARFARE, now there is a term not heard in a long time. (1960ish) Another thought that flowed across the desk today was the mass mailing of tea bags on the first of April with hope they start flowing into the White House on the 15th. i.e., a modern day Boston Tea Party. Remember the question if a man walked into the woods and shouted at his wife, could she hear him and raise cain whem he came home? New concept here; If, say on Memorial Day, everyone were to go into their yard and shout at the top of their lungs; \"STOP! WE WANT OUR COUNTRY BACK!!!STOP NOW!\" @ 1500EST, would the dear hearts in DC be able to hear them?.....®", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 20:39:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }, 
    {
        "content": "Ringo: One of us is misunderstanding the other, my comment was to be sarcastic. The people should be going after those in congress who were complicit in getting us into this economic situation and are now backtracking and shifting blame, the Barney Franks, Chris Dodds, etc. They are the bad guys.", 
        "intTime": 20090322, 
        "postID": 17, 
        "quote": "", 
        "reply": "Ringo: One of us is misunderstanding the other, my comment was to be sarcastic. The people should be going after those in congress who were complicit in getting us into this economic situation and are now backtracking and shifting blame, the Barney Franks, Chris Dodds, etc. They are the bad guys.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 21:23:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "OldDoc"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me. You are talking a different tune now, at first you were sicking people on regular US citizens whose only fault was to write a contract with a company that included a bonus at the end. Tell me this, how long ago were those contracts written compared to when the bonus was received?", 
        "intTime": 20090323, 
        "postID": 18, 
        "quote": "Originally posted by Duster6: Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me.", 
        "reply": " You are talking a different tune now, at first you were sicking people on regular US citizens whose only fault was to write a contract with a company that included a bonus at the end. Tell me this, how long ago were those contracts written compared to when the bonus was received?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 13:38:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "transport1"
    }, 
    {
        "content": "It is funny seeing a bunch of so-called conservatives screaming out communists mantras of the working people bringing down the rich.", 
        "intTime": 20090323, 
        "postID": 19, 
        "quote": "", 
        "reply": "It is funny seeing a bunch of so-called conservatives screaming out communists mantras of the working people bringing down the rich.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 15:30:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party....", 
        "intTime": 20090323, 
        "postID": 20, 
        "quote": "", 
        "reply": "String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party....", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 15:46:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party.... Get all the rope in texas, hang'em high in a tree!", 
        "intTime": 20090323, 
        "postID": 21, 
        "quote": "Originally posted by ipw533: String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party....", 
        "reply": " Get all the rope in texas, hang'em high in a tree!", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 15:54:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "threerings"
    }, 
    {
        "content": "Libby brought up the kind of threats being mentioned here when he testified, I wouldn't be surprised if some of you got a knock on your door.", 
        "intTime": 20090323, 
        "postID": 22, 
        "quote": "", 
        "reply": "Libby brought up the kind of threats being mentioned here when he testified, I wouldn't be surprised if some of you got a knock on your door.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:11:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Even worse than the AIG folks who got bonuses, are those sitting on the Advisory board that are supposed to be watching to make certain the AIG folks were acting in an ethical, responsible way... it was on CNN last night. Each board member got $30,000.00 PER MEETING to the tune of several million dollars a year (I forget the exact millions of dollars) and THEY are the ones who let AIG CEO/Execs make poor decisions and run the company in the ground.", 
        "intTime": 20090323, 
        "postID": 23, 
        "quote": "", 
        "reply": "Even worse than the AIG folks who got bonuses, are those sitting on the Advisory board that are supposed to be watching to make certain the AIG folks were acting in an ethical, responsible way... it was on CNN last night. Each board member got $30,000.00 PER MEETING to the tune of several million dollars a year (I forget the exact millions of dollars) and THEY are the ones who let AIG CEO/Execs make poor decisions and run the company in the ground.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:20:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy....", 
        "intTime": 20090323, 
        "postID": 24, 
        "quote": "", 
        "reply": "I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy....", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:24:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy.... So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar.", 
        "intTime": 20090323, 
        "postID": 25, 
        "quote": "Originally posted by ipw533: I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy....", 
        "reply": " So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:52:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar. Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away...", 
        "intTime": 20090323, 
        "postID": 26, 
        "quote": "So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar.", 
        "reply": " Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away...", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 17:19:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: quote: So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar. Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away... If you despise it, why advocate stringing up executives. What did the founders think about summary executions? That idea doesn't go along with the 5th, 6th, or 8th Amendment. I am far from liberal, progressive, or any other label you can come up with. I have spent the last 14 years serving this country and everything it stands for, including going to war for it. What have you done?", 
        "intTime": 20090323, 
        "postID": 27, 
        "quote": "Originally posted by ipw533: quote: So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar. Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away...", 
        "reply": " If you despise it, why advocate stringing up executives. What did the founders think about summary executions? That idea doesn't go along with the 5th, 6th, or 8th Amendment. I am far from liberal, progressive, or any other label you can come up with. I have spent the last 14 years serving this country and everything it stands for, including going to war for it. What have you done?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 17:32:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "OK, I will accept the fact that I misunderstood you. You went to war for our country while I stood ready to be called during the Cold War. I salute you for that. I do not want business executives executed--far better to just simply fire them without \"golden parachutes\". I do buy into the idea of executing or at least prosecuting corrupt politicians, and I really want to see the ones who made this current nightmare pay. Yes, I can be pretty bloody-minded, but like you I will not act illegally on my own....", 
        "intTime": 20090323, 
        "postID": 28, 
        "quote": "", 
        "reply": "OK, I will accept the fact that I misunderstood you. You went to war for our country while I stood ready to be called during the Cold War. I salute you for that. I do not want business executives executed--far better to just simply fire them without \"golden parachutes\". I do buy into the idea of executing or at least prosecuting corrupt politicians, and I really want to see the ones who made this current nightmare pay. Yes, I can be pretty bloody-minded, but like you I will not act illegally on my own....", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 17:52:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. quote: Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "intTime": 20090324, 
        "postID": 29, 
        "quote": "Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "reply": "Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. ", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-24 08:31:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. quote: Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill. Well, I'll be horns waggled, I haven't seen such a pi*******contest in a long time. Reminds me of a group of kids on the playground in knee deep snow, trying to see who could pee the furthest into the wind, at that. How about if we drop back to the ten and regroup................now, how about IF; I think we all agree there is no one in this world of ours deserving of the exorbitant amount of money they call pay checks and bonuses, as these ****** bags in the auto industry and financial conglomerates demand, receive, and expect to receive for ........ever?...... Personally I have the same thoughts towards the professional athletes with the MFL and MLB In any case what might need to be accomplished to bring these fat cats to their knees, would be to create \"mass exodus days\", where no one purchases what ever products we are boycotting. Say, for example the population must come to an agreement in order to make it happen correctly, by avoiding certain products for a month of maybe even longer. Let's take the auto industry for example. A group decision is made to General Motors products for three months. Across the nation, what's happening? No one is buying and GM products, and for five or six months, this would be or almost be out on the streets. If the citizens as a whole can come together to give a business the cold shoulder effect I most sincerely suggest we will succeed with \"coercing\" with them to see things as we feel should be. That being no one receives more then 20 percent then the lowest man in the factory makes sweeping up the slag's. That bonuses are a thing of the past. Ether that or they will go out of business for lack of exchanging their product for cast to the masses. WE hear a lot of don't buy gas on Sundays. You know this is the best means we could control the sale of everything in this world. If the world took the stance that no one would buy a Chevy S-10 for example for a year. Do you realize what that would do to the markets? It would cause crippling effects that would be darn near permanent. How about an entire line of general motors products?......Ringo", 
        "intTime": 20090325, 
        "postID": 30, 
        "quote": "Originally posted by fishnfanatic: Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. quote: Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "reply": " Well, I'll be horns waggled, I haven't seen such a pi*******contest in a long time. Reminds me of a group of kids on the playground in knee deep snow, trying to see who could pee the furthest into the wind, at that. How about if we drop back to the ten and regroup................now, how about IF; I think we all agree there is no one in this world of ours deserving of the exorbitant amount of money they call pay checks and bonuses, as these ****** bags in the auto industry and financial conglomerates demand, receive, and expect to receive for ........ever?...... Personally I have the same thoughts towards the professional athletes with the MFL and MLB In any case what might need to be accomplished to bring these fat cats to their knees, would be to create \"mass exodus days\", where no one purchases what ever products we are boycotting. Say, for example the population must come to an agreement in order to make it happen correctly, by avoiding certain products for a month of maybe even longer. Let's take the auto industry for example. A group decision is made to General Motors products for three months. Across the nation, what's happening? No one is buying and GM products, and for five or six months, this would be or almost be out on the streets. If the citizens as a whole can come together to give a business the cold shoulder effect I most sincerely suggest we will succeed with \"coercing\" with them to see things as we feel should be. That being no one receives more then 20 percent then the lowest man in the factory makes sweeping up the slag's. That bonuses are a thing of the past. Ether that or they will go out of business for lack of exchanging their product for cast to the masses. WE hear a lot of don't buy gas on Sundays. You know this is the best means we could control the sale of everything in this world. If the world took the stance that no one would buy a Chevy S-10 for example for a year. Do you realize what that would do to the markets? It would cause crippling effects that would be darn near permanent. How about an entire line of general motors products?......Ringo", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-25 01:09:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }, 
    {
        "content": "Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "intTime": 20090321, 
        "postID": 31, 
        "quote": "", 
        "reply": "Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 03:58:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "intTime": 20090321, 
        "postID": 32, 
        "quote": "Originally posted by Duster6: Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "reply": "", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 05:00:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "blane"
    }, 
    {
        "content": "Mike, I say publish the addresses of any AIG exec who does not voluntarily return his bonus. Muwahhaha.", 
        "intTime": 20090321, 
        "postID": 33, 
        "quote": "", 
        "reply": "Mike, I say publish the addresses of any AIG exec who does not voluntarily return his bonus. Muwahhaha.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 08:47:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "AMEN!!! Still working on the Tiger Codes, but to date, I think I will find that I am obligated to put them back into computer format, because I do believe that they may have gons to the four winds in one of the few crashes I have had......SinLoi.........®", 
        "intTime": 20090321, 
        "postID": 34, 
        "quote": "", 
        "reply": "AMEN!!! Still working on the Tiger Codes, but to date, I think I will find that I am obligated to put them back into computer format, because I do believe that they may have gons to the four winds in one of the few crashes I have had......SinLoi.........®", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 14:57:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }, 
    {
        "content": "quote: FAIRFIELD, Conn. (AP) -- A busload of activists -- outnumbered 2-to-1 by reporters and photographers -- are paying visits to the homes of American International Group Inc. executives in Connecticut to protest tens of millions in bonuses awarded by the company. About 40 protesters parked at a cul-de-sac Saturday afternoon and walked to the Fairfield home of Douglas Polling. They were met on the curb by two security guards, and one activist read a letter detailing the financial struggles that many Connecticut residents have faced. The group then left the note in Polling's mailbox. Polling already agreed to forfeit his bonus, but the protesters want AIG executives to do more to help working families. AIG has received more than $182 billion in federal aid. -http://biz.yahoo.com/ap/090321/aig_bonuses.html", 
        "intTime": 20090321, 
        "postID": 35, 
        "quote": "FAIRFIELD, Conn. (AP) -- A busload of activists -- outnumbered 2-to-1 by reporters and photographers -- are paying visits to the homes of American International Group Inc. executives in Connecticut to protest tens of millions in bonuses awarded by the company. About 40 protesters parked at a cul-de-sac Saturday afternoon and walked to the Fairfield home of Douglas Polling. They were met on the curb by two security guards, and one activist read a letter detailing the financial struggles that many Connecticut residents have faced. The group then left the note in Polling's mailbox. Polling already agreed to forfeit his bonus, but the protesters want AIG executives to do more to help working families. AIG has received more than $182 billion in federal aid.", 
        "reply": " -http://biz.yahoo.com/ap/090321/aig_bonuses.html", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 15:07:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "floersh"
    }, 
    {
        "content": "\"I'M AS MAD AS HELL, AND I'M NOT GOING TO TAKE THIS ANYMORE!' I want you to get up right now, sit up, go to your windows, open them and stick your head out and yell - 'I'm as mad as hell and I'm not going to take this anymore!...\" ...Peter Finch (as Howard Beale) in Network.", 
        "intTime": 20090321, 
        "postID": 36, 
        "quote": "", 
        "reply": "\"I'M AS MAD AS HELL, AND I'M NOT GOING TO TAKE THIS ANYMORE!' I want you to get up right now, sit up, go to your windows, open them and stick your head out and yell - 'I'm as mad as hell and I'm not going to take this anymore!...\" ...Peter Finch (as Howard Beale) in Network.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 15:53:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "What a bunch of BS, the villagers with torches after the monsters now?", 
        "intTime": 20090321, 
        "postID": 37, 
        "quote": "", 
        "reply": "What a bunch of BS, the villagers with torches after the monsters now?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 17:52:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "OldDoc"
    }, 
    {
        "content": "No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "intTime": 20090321, 
        "postID": 38, 
        "quote": "", 
        "reply": "No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 18:08:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"...", 
        "intTime": 20090321, 
        "postID": 39, 
        "quote": "Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag.", 
        "reply": " Now duster why are you enticing \"class warfare\"...", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 18:37:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "intTime": 20090321, 
        "postID": 40, 
        "quote": "Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "reply": " You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 19:20:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "bounceandburst"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: What a bunch of BS, the villagers with torches after the monsters now? For whatever my two bits are worth I am going to offer a condolence for your liberalistic attitude. Don't get me wrong, I didn't agree with a lot that Bush did or didn't do, when it was or should have been done. Think back a little Lad, how many times have we been attacked since 9/11? The one positive thing Bush did, was to take means of keeping the country safe from any further attacks. I have made this statement before and will continue to do so. \"We haven't seen the last of attacks on the homeland we call America. Not by a long shot have we; and this is what we need to prepare for. Congress is the culprits of the \"Bail Out\" along with their 'buddies' in the oil cartels. Keep one thing in mind, the President of the united States is no more then a fighrheaed and cannot accmplish anything withou the approval of Congress. Granted some Presidents are capable of thinking outside the box, making sounde dicissions and doing what is good for Americal. while otheres tend to just flow along adn let others doe his bidding, In Name Only\"", 
        "intTime": 20090321, 
        "postID": 41, 
        "quote": "Originally posted by OldDoc: What a bunch of BS, the villagers with torches after the monsters now?", 
        "reply": " For whatever my two bits are worth I am going to offer a condolence for your liberalistic attitude. Don't get me wrong, I didn't agree with a lot that Bush did or didn't do, when it was or should have been done. Think back a little Lad, how many times have we been attacked since 9/11? The one positive thing Bush did, was to take means of keeping the country safe from any further attacks. I have made this statement before and will continue to do so. \"We haven't seen the last of attacks on the homeland we call America. Not by a long shot have we; and this is what we need to prepare for. Congress is the culprits of the \"Bail Out\" along with their 'buddies' in the oil cartels. Keep one thing in mind, the President of the united States is no more then a fighrheaed and cannot accmplish anything withou the approval of Congress. Granted some Presidents are capable of thinking outside the box, making sounde dicissions and doing what is good for Americal. while otheres tend to just flow along adn let others doe his bidding, In Name Only\"", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-21 22:30:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }, 
    {
        "content": "Should be more \"outrage\" at congress.JMHO", 
        "intTime": 20090322, 
        "postID": 42, 
        "quote": "", 
        "reply": "Should be more \"outrage\" at congress.JMHO", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 02:53:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me.", 
        "intTime": 20090322, 
        "postID": 43, 
        "quote": "", 
        "reply": "Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 04:50:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... It's going to kill you when you find out that Obama is really a Dick Cheney puppet...he will use his one term to increase the \"misery index\" ala Jimmy Carter, paving the way for 12 more years of glorious GOP rule. The attention over Obama's birth certificate (or lack thereof) was to give Cheney and Obama time to cover up the millions of KBR profits that was chaging hands.", 
        "intTime": 20090322, 
        "postID": 44, 
        "quote": "Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go...", 
        "reply": " It's going to kill you when you find out that Obama is really a Dick Cheney puppet...he will use his one term to increase the \"misery index\" ala Jimmy Carter, paving the way for 12 more years of glorious GOP rule. The attention over Obama's birth certificate (or lack thereof) was to give Cheney and Obama time to cover up the millions of KBR profits that was chaging hands.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 08:04:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"... What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics?", 
        "intTime": 20090322, 
        "postID": 45, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"...", 
        "reply": " What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 11:33:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "quote: Originally posted by SinePariDonster: quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"... What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics? CLASS WARFARE, now there is a term not heard in a long time. (1960ish) Another thought that flowed across the desk today was the mass mailing of tea bags on the first of April with hope they start flowing into the White House on the 15th. i.e., a modern day Boston Tea Party. Remember the question if a man walked into the woods and shouted at his wife, could she hear him and raise cain whem he came home? New concept here; If, say on Memorial Day, everyone were to go into their yard and shout at the top of their lungs; \"STOP! WE WANT OUR COUNTRY BACK!!!STOP NOW!\" @ 1500EST, would the dear hearts in DC be able to hear them?.....®", 
        "intTime": 20090322, 
        "postID": 46, 
        "quote": "Originally posted by SinePariDonster: quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Way to go main street. Go after them. Make them live in fear. AIG bonus outrage has employees living in fear. According to a news article in USA Today many of these fat cats are starting to run scared. There are not that many cops out there to protect them now. Much of that easy money they earned has to go to upgrade their security now. Who do you work for Sir? Oh you say AIG... Bam, slap, crash, take that you dirty scum bag. Now duster why are you enticing \"class warfare\"... What's wrong with a little \"Class Warfare\"? The Hyper-Rich/Ultra-Greedy/Mega Corporations have been engaging in \"Class Warfare\" for a long time and the working stiffs in this country have been getting slaughtered economically. Maybe we need a little Class Warfare from the bottom up for a change. How about Guerrilla Economics?", 
        "reply": " CLASS WARFARE, now there is a term not heard in a long time. (1960ish) Another thought that flowed across the desk today was the mass mailing of tea bags on the first of April with hope they start flowing into the White House on the 15th. i.e., a modern day Boston Tea Party. Remember the question if a man walked into the woods and shouted at his wife, could she hear him and raise cain whem he came home? New concept here; If, say on Memorial Day, everyone were to go into their yard and shout at the top of their lungs; \"STOP! WE WANT OUR COUNTRY BACK!!!STOP NOW!\" @ 1500EST, would the dear hearts in DC be able to hear them?.....®", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 20:39:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }, 
    {
        "content": "Ringo: One of us is misunderstanding the other, my comment was to be sarcastic. The people should be going after those in congress who were complicit in getting us into this economic situation and are now backtracking and shifting blame, the Barney Franks, Chris Dodds, etc. They are the bad guys.", 
        "intTime": 20090322, 
        "postID": 47, 
        "quote": "", 
        "reply": "Ringo: One of us is misunderstanding the other, my comment was to be sarcastic. The people should be going after those in congress who were complicit in getting us into this economic situation and are now backtracking and shifting blame, the Barney Franks, Chris Dodds, etc. They are the bad guys.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-22 21:23:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "OldDoc"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me. You are talking a different tune now, at first you were sicking people on regular US citizens whose only fault was to write a contract with a company that included a bonus at the end. Tell me this, how long ago were those contracts written compared to when the bonus was received?", 
        "intTime": 20090323, 
        "postID": 48, 
        "quote": "Originally posted by Duster6: Like Ringo said, blame Congress for this crisis we are in now not the President. Look at the track records of Dodd, Frank, Rangel, Pelosi, and a few on the other side as well. It seems to me that the American people need to wake up and start looking at the real issues here instead of just continuing to go with the flow. It seems like these dirty dozen representatives will continue to bust us until we vote them out. Seems kinda easy to me.", 
        "reply": " You are talking a different tune now, at first you were sicking people on regular US citizens whose only fault was to write a contract with a company that included a bonus at the end. Tell me this, how long ago were those contracts written compared to when the bonus was received?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 13:38:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "transport1"
    }, 
    {
        "content": "It is funny seeing a bunch of so-called conservatives screaming out communists mantras of the working people bringing down the rich.", 
        "intTime": 20090323, 
        "postID": 49, 
        "quote": "", 
        "reply": "It is funny seeing a bunch of so-called conservatives screaming out communists mantras of the working people bringing down the rich.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 15:30:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party....", 
        "intTime": 20090323, 
        "postID": 50, 
        "quote": "", 
        "reply": "String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party....", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 15:46:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party.... Get all the rope in texas, hang'em high in a tree!", 
        "intTime": 20090323, 
        "postID": 51, 
        "quote": "Originally posted by ipw533: String them up--every one of them. For the worst offenders make sure that the hangman is some fumble-fingered clumbsoid who can barely tie his shoes. These clowns deserve the most botched possible execution, and they deserve to have it carried out on live TV. Don't like that option? OK, they get a gun with a single bullet in a sealed room--the offer is good for ten minutes, after that it's the necktie party....", 
        "reply": " Get all the rope in texas, hang'em high in a tree!", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 15:54:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "threerings"
    }, 
    {
        "content": "Libby brought up the kind of threats being mentioned here when he testified, I wouldn't be surprised if some of you got a knock on your door.", 
        "intTime": 20090323, 
        "postID": 52, 
        "quote": "", 
        "reply": "Libby brought up the kind of threats being mentioned here when he testified, I wouldn't be surprised if some of you got a knock on your door.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:11:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Even worse than the AIG folks who got bonuses, are those sitting on the Advisory board that are supposed to be watching to make certain the AIG folks were acting in an ethical, responsible way... it was on CNN last night. Each board member got $30,000.00 PER MEETING to the tune of several million dollars a year (I forget the exact millions of dollars) and THEY are the ones who let AIG CEO/Execs make poor decisions and run the company in the ground.", 
        "intTime": 20090323, 
        "postID": 53, 
        "quote": "", 
        "reply": "Even worse than the AIG folks who got bonuses, are those sitting on the Advisory board that are supposed to be watching to make certain the AIG folks were acting in an ethical, responsible way... it was on CNN last night. Each board member got $30,000.00 PER MEETING to the tune of several million dollars a year (I forget the exact millions of dollars) and THEY are the ones who let AIG CEO/Execs make poor decisions and run the company in the ground.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:20:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy....", 
        "intTime": 20090323, 
        "postID": 54, 
        "quote": "", 
        "reply": "I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy....", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:24:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy.... So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar.", 
        "intTime": 20090323, 
        "postID": 55, 
        "quote": "Originally posted by ipw533: I'm already expecting a knock on my door. From my neighbors it will be because I'm the closest thing they have to a cat vet. For Obama's ACORN Brownshirts, I'll be a shotgun blast in the face. You want a fight? Suit yourself--you picked it with the wrong guy....", 
        "reply": " So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar.", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 16:52:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar. Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away...", 
        "intTime": 20090323, 
        "postID": 56, 
        "quote": "So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar.", 
        "reply": " Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away...", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 17:19:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: quote: So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar. Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away... If you despise it, why advocate stringing up executives. What did the founders think about summary executions? That idea doesn't go along with the 5th, 6th, or 8th Amendment. I am far from liberal, progressive, or any other label you can come up with. I have spent the last 14 years serving this country and everything it stands for, including going to war for it. What have you done?", 
        "intTime": 20090323, 
        "postID": 57, 
        "quote": "Originally posted by ipw533: quote: So you want a society where the working class rise up against the wealthy capitalists to redistribute the wealth. That sounds familiar. Thank you for your response. You not only put words in my mouth to serve a cause I despise but you completely and I suspect deliberately misinterpreted the words I did speak. So why on God's Green Earth would I thank you? Quite simply, I thank you because your misinterpretation of my comments shows what you so-called progressives want. You want me to agree with you--that's not going to happen. Y'see, I know you guys. I've studied what you've done in the last century. There is no way you can walk away from the mountains of innocent bodies your kind created. The Twentieth Century was pretty much a time of misery and war, and it was utopian fools like you that began the bloodbath. Now we're supposed to listen to you again. We're expected to forget the rotting heap of human corpses you left behind the first time. Guess again, you miserable piece of crap!!! If you want to burden yourself with the responsibility for the most murderous regimes the world has ever seen simply because you disagree with the limited ideology of our Founders then that, buddy, is on you. Do not even attempt to slime me with that crap. You wouldn't know a real communist until after he blew your useful idiot head away...", 
        "reply": " If you despise it, why advocate stringing up executives. What did the founders think about summary executions? That idea doesn't go along with the 5th, 6th, or 8th Amendment. I am far from liberal, progressive, or any other label you can come up with. I have spent the last 14 years serving this country and everything it stands for, including going to war for it. What have you done?", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 17:32:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "nspreitler"
    }, 
    {
        "content": "OK, I will accept the fact that I misunderstood you. You went to war for our country while I stood ready to be called during the Cold War. I salute you for that. I do not want business executives executed--far better to just simply fire them without \"golden parachutes\". I do buy into the idea of executing or at least prosecuting corrupt politicians, and I really want to see the ones who made this current nightmare pay. Yes, I can be pretty bloody-minded, but like you I will not act illegally on my own....", 
        "intTime": 20090323, 
        "postID": 58, 
        "quote": "", 
        "reply": "OK, I will accept the fact that I misunderstood you. You went to war for our country while I stood ready to be called during the Cold War. I salute you for that. I do not want business executives executed--far better to just simply fire them without \"golden parachutes\". I do buy into the idea of executing or at least prosecuting corrupt politicians, and I really want to see the ones who made this current nightmare pay. Yes, I can be pretty bloody-minded, but like you I will not act illegally on my own....", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-23 17:52:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "ipw533"
    }, 
    {
        "content": "Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. quote: Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "intTime": 20090324, 
        "postID": 59, 
        "quote": "Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "reply": "Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. ", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-24 08:31:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. quote: Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill. Well, I'll be horns waggled, I haven't seen such a pi*******contest in a long time. Reminds me of a group of kids on the playground in knee deep snow, trying to see who could pee the furthest into the wind, at that. How about if we drop back to the ten and regroup................now, how about IF; I think we all agree there is no one in this world of ours deserving of the exorbitant amount of money they call pay checks and bonuses, as these ****** bags in the auto industry and financial conglomerates demand, receive, and expect to receive for ........ever?...... Personally I have the same thoughts towards the professional athletes with the MFL and MLB In any case what might need to be accomplished to bring these fat cats to their knees, would be to create \"mass exodus days\", where no one purchases what ever products we are boycotting. Say, for example the population must come to an agreement in order to make it happen correctly, by avoiding certain products for a month of maybe even longer. Let's take the auto industry for example. A group decision is made to General Motors products for three months. Across the nation, what's happening? No one is buying and GM products, and for five or six months, this would be or almost be out on the streets. If the citizens as a whole can come together to give a business the cold shoulder effect I most sincerely suggest we will succeed with \"coercing\" with them to see things as we feel should be. That being no one receives more then 20 percent then the lowest man in the factory makes sweeping up the slag's. That bonuses are a thing of the past. Ether that or they will go out of business for lack of exchanging their product for cast to the masses. WE hear a lot of don't buy gas on Sundays. You know this is the best means we could control the sale of everything in this world. If the world took the stance that no one would buy a Chevy S-10 for example for a year. Do you realize what that would do to the markets? It would cause crippling effects that would be darn near permanent. How about an entire line of general motors products?......Ringo", 
        "intTime": 20090325, 
        "postID": 60, 
        "quote": "Originally posted by fishnfanatic: Your both wrong, mobs should go after politicians, democrat and republicans, as well as corporate fat cats. quote: Originally posted by bounceandburst: quote: Originally posted by Irwin_R_Schyster: No, the outrage is not directed at the real culprits: George W Bush/Dick Cheney.....There should be MOBS harrassing them everywhere they go... You're correct that the outrage is not directed at the real culprits.....it should be directed at Geithner, Sen. Dodd, etal., the authors of the AIG bailout and \"Porkulous\" bill.", 
        "reply": " Well, I'll be horns waggled, I haven't seen such a pi*******contest in a long time. Reminds me of a group of kids on the playground in knee deep snow, trying to see who could pee the furthest into the wind, at that. How about if we drop back to the ten and regroup................now, how about IF; I think we all agree there is no one in this world of ours deserving of the exorbitant amount of money they call pay checks and bonuses, as these ****** bags in the auto industry and financial conglomerates demand, receive, and expect to receive for ........ever?...... Personally I have the same thoughts towards the professional athletes with the MFL and MLB In any case what might need to be accomplished to bring these fat cats to their knees, would be to create \"mass exodus days\", where no one purchases what ever products we are boycotting. Say, for example the population must come to an agreement in order to make it happen correctly, by avoiding certain products for a month of maybe even longer. Let's take the auto industry for example. A group decision is made to General Motors products for three months. Across the nation, what's happening? No one is buying and GM products, and for five or six months, this would be or almost be out on the streets. If the citizens as a whole can come together to give a business the cold shoulder effect I most sincerely suggest we will succeed with \"coercing\" with them to see things as we feel should be. That being no one receives more then 20 percent then the lowest man in the factory makes sweeping up the slag's. That bonuses are a thing of the past. Ether that or they will go out of business for lack of exchanging their product for cast to the masses. WE hear a lot of don't buy gas on Sundays. You know this is the best means we could control the sale of everything in this world. If the world took the stance that no one would buy a Chevy S-10 for example for a year. Do you realize what that would do to the markets? It would cause crippling effects that would be darn near permanent. How about an entire line of general motors products?......Ringo", 
        "threadID": "409192893_4720094812001", 
        "time": "2009-03-25 01:09:00", 
        "title": "Main Street is waking up.  Finally.", 
        "userID": "RingosRule"
    }
]