[
    {
        "content": "\"http://www.dailymail.co.uk/news/article-1160958/Home-war--troops-greeted-abuse-Muslim-protesters.html\" Too long to copy the story. It has a lot of pictures of angry peace loving Muslim men voicing their \"earned\" right to criticize the British homecoming troops as baby killers and butchers. The Muslim women are out to show their support for the protest but in a different way. The Muslims are taking over Europe in a political/cultural /judicial manner. It is a matter of time before they are this bold here. In some areas they already are. They are past the point of needing to be PC in Britain but are not there yet in America. When they feel they are it will be kid gloves off. Course I will not be allowed to voice MY opinion on the matter.", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.dailymail.co.uk/news/article-1160958/Home-war--troops-greeted-abuse-Muslim-protesters.html\" Too long to copy the story. It has a lot of pictures of angry peace loving Muslim men voicing their \"earned\" right to criticize the British homecoming troops as baby killers and butchers. The Muslim women are out to show their support for the protest but in a different way. The Muslims are taking over Europe in a political/cultural /judicial manner. It is a matter of time before they are this bold here. In some areas they already are. They are past the point of needing to be PC in Britain but are not there yet in America. When they feel they are it will be kid gloves off. Course I will not be allowed to voice MY opinion on the matter.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 19:33:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Course I will not be allowed to voice MY opinion on the matter. It looks like you already did.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "Course I will not be allowed to voice MY opinion on the matter.", 
        "reply": " It looks like you already did.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 19:51:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Damn that democracy! That's how they'll do it, too. In Europe the white Christian population is falling short because, as the Pope points out, people are relying on reason and not faith (which means they use birth control and have abortions.) The Islamic folks do neither (officially.) So, it is a matter of time before the democratic principle of 51% of the majority will take over the minority. Look out France! They'll go first. Here it will take a little longer. Can you say Allah Akba?", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "Damn that democracy! That's how they'll do it, too. In Europe the white Christian population is falling short because, as the Pope points out, people are relying on reason and not faith (which means they use birth control and have abortions.) The Islamic folks do neither (officially.) So, it is a matter of time before the democratic principle of 51% of the majority will take over the minority. Look out France! They'll go first. Here it will take a little longer. Can you say Allah Akba?", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 19:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "reducetension"
    }, 
    {
        "content": "I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here?", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "", 
        "reply": "I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here?", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 20:13:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "Gee, the Muslims in the UK amount to 3% or less of their population. Some take over!", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "", 
        "reply": "Gee, the Muslims in the UK amount to 3% or less of their population. Some take over!", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 22:19:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "Little_Paul"
    }, 
    {
        "content": "quote: The Muslims are taking over Europe in a political/cultural /judicial manner. A handful of (rent a mini mob) protesters who want to get their faces on the BBC news hardly constitues a takeover. They only did so in the knowledge that the \"Old Bill\" would protect them from locals who wanted to \"discuss\" the merits of their case. It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "The Muslims are taking over Europe in a political/cultural /judicial manner.", 
        "reply": " A handful of (rent a mini mob) protesters who want to get their faces on the BBC news hardly constitues a takeover. They only did so in the knowledge that the \"Old Bill\" would protect them from locals who wanted to \"discuss\" the merits of their case. It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 01:51:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "My opinion:make more babies.", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "", 
        "reply": "My opinion:make more babies.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 01:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "The more the Muslims are accomodated, the more powerful they will get.", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "The more the Muslims are accomodated, the more powerful they will get.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 02:23:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "dhd123"
    }, 
    {
        "content": "quote: Gee, the Muslims in the UK amount to 3% or less of their population. Some take over It sure is. As small as the population % is the power they are gaining is undefinable. The money influx this radical element is bringing into Britain which is used to fight on a judicial/political level is huge. Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear. But again...shria law is trying to be wormed into the fabric of the EU. The population growth is growing but the laws being challenged and the protests calling out the government is a mechanism. I do not want shria law here. \"Gee your head is on fire\" \"Ahh, just 3%...nothing to worry about\" This message has been edited. Last edited by: ACR26, Wed 11 March 2009 05:56 AM", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Gee, the Muslims in the UK amount to 3% or less of their population. Some take over", 
        "reply": " It sure is. As small as the population % is the power they are gaining is undefinable. The money influx this radical element is bringing into Britain which is used to fight on a judicial/political level is huge. Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear. But again...shria law is trying to be wormed into the fabric of the EU. The population growth is growing but the laws being challenged and the protests calling out the government is a mechanism. I do not want shria law here. \"Gee your head is on fire\" \"Ahh, just 3%...nothing to worry about\" This message has been edited. Last edited by: ACR26, Wed 11 March 2009 05:56 AM", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:34:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days. Your right...now that I think of it there has never been an attack on the European community by Radical Muslims. Thank you for putting it into perspective for me.", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days.", 
        "reply": " Your right...now that I think of it there has never been an attack on the European community by Radical Muslims. Thank you for putting it into perspective for me.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:38:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here? What if there was a protest of pasty anglos in the streets saying muslims are terrorists, how would that freedom of speech thang go down for them? They'd be arrested....", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "Originally posted by ACR26: I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here?", 
        "reply": " What if there was a protest of pasty anglos in the streets saying muslims are terrorists, how would that freedom of speech thang go down for them? They'd be arrested....", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:52:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "", 
        "reply": "Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few True, But I am talking about if done in merry old England. Pip Pip Old Boy...", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "Originally posted by ACR26: Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few", 
        "reply": " True, But I am talking about if done in merry old England. Pip Pip Old Boy...", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 06:42:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear. You don't need to look around for an Islamic community to find anti semitism in France, or many other countries, including the USA. The KKK were'nt too keen on Jews, for example.", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear.", 
        "reply": " You don't need to look around for an Islamic community to find anti semitism in France, or many other countries, including the USA. The KKK were'nt too keen on Jews, for example.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 08:47:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill.", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "", 
        "reply": "Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 09:24:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "Back to the topic at hand - The latest from the news Flashback: Carville Wanted Bush to Fail The press never reported that Democratic strategist James Carville said he wanted President Bush to fail before the Sept. 11 terrorist attacks. But a feeding frenzy ensued when radio host Rush Limbaugh recently said he wanted President Obama to fail. \"http://www.foxnews.com/politics/2009/03/11/carville-wanted-bush-fail/\" ANY MORE QUESTIONS ABOUT HYPOCRISY ON THE LEFT?", 
        "intTime": 20090311, 
        "postID": 16, 
        "quote": "", 
        "reply": "Back to the topic at hand - The latest from the news Flashback: Carville Wanted Bush to Fail The press never reported that Democratic strategist James Carville said he wanted President Bush to fail before the Sept. 11 terrorist attacks. But a feeding frenzy ensued when radio host Rush Limbaugh recently said he wanted President Obama to fail. \"http://www.foxnews.com/politics/2009/03/11/carville-wanted-bush-fail/\" ANY MORE QUESTIONS ABOUT HYPOCRISY ON THE LEFT?", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 11:36:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill. I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill. MsG", 
        "intTime": 20090311, 
        "postID": 17, 
        "quote": "Originally posted by ACR26: Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill.", 
        "reply": " I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill. MsG", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 11:53:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "bugsy48"
    }, 
    {
        "content": "quote: I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill. EXACTLY!", 
        "intTime": 20090311, 
        "postID": 18, 
        "quote": "I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill.", 
        "reply": " EXACTLY!", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 15:45:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 19, 
        "quote": "", 
        "reply": "Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - Wandering and Wondering", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 15:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up.", 
        "intTime": 20090311, 
        "postID": 20, 
        "quote": "Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - -", 
        "reply": " those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 16:02:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up. The irony would be lost on them.. Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact.", 
        "intTime": 20090311, 
        "postID": 21, 
        "quote": "Originally posted by Elesso: quote: Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up.", 
        "reply": " The irony would be lost on them.. Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 16:37:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact. I would tend to disagree with that statement. The differences in cultures/religions is only the banner they hold up to justify themselves. In truth, it's just a good old-fashioned battle for supremacy. MsG", 
        "intTime": 20090311, 
        "postID": 22, 
        "quote": "Originally posted by threerings: Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact.", 
        "reply": " I would tend to disagree with that statement. The differences in cultures/religions is only the banner they hold up to justify themselves. In truth, it's just a good old-fashioned battle for supremacy. MsG", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 16:42:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "bugsy48"
    }, 
    {
        "content": "Has anyone ever driven through BC Canada? You'd swear you were back in Iraq. I was having anxiety problems when we drove through there. You never hear about this stuff until it's too late.", 
        "intTime": 20090311, 
        "postID": 23, 
        "quote": "", 
        "reply": "Has anyone ever driven through BC Canada? You'd swear you were back in Iraq. I was having anxiety problems when we drove through there. You never hear about this stuff until it's too late.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 17:08:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by dhd123: The more the Muslims are accomodated, the more powerful they will get. yup and the more they will demand more...", 
        "intTime": 20090311, 
        "postID": 24, 
        "quote": "Originally posted by dhd123: The more the Muslims are accomodated, the more powerful they will get.", 
        "reply": " yup and the more they will demand more...", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 18:15:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I wonder how Islamic personnel currently serving in the UK military feel about these protesters ? Especially the family of L/Cpl. Jabron Hashmi, the first Muslim KIA.", 
        "intTime": 20090312, 
        "postID": 25, 
        "quote": "", 
        "reply": "I wonder how Islamic personnel currently serving in the UK military feel about these protesters ? Especially the family of L/Cpl. Jabron Hashmi, the first Muslim KIA.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 02:26:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "Pobably the same way the rest of the soldiers feel. Words and context mean something", 
        "intTime": 20090312, 
        "postID": 26, 
        "quote": "", 
        "reply": "Pobably the same way the rest of the soldiers feel. Words and context mean something", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 06:43:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by TomGustafson: My opinion:make more babies. Well, since I can't I guess I'll just have to keep practicing", 
        "intTime": 20090312, 
        "postID": 27, 
        "quote": "Originally posted by TomGustafson: My opinion:make more babies.", 
        "reply": " Well, since I can't I guess I'll just have to keep practicing", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 08:40:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact I haven't heard that expression in years!!!!!!!!!!!!!!! Thanks for using it... Airborne!", 
        "intTime": 20090312, 
        "postID": 28, 
        "quote": "", 
        "reply": "Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact I haven't heard that expression in years!!!!!!!!!!!!!!! Thanks for using it... Airborne!", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 22:27:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: I wonder how Islamic personnel currently serving in the UK military feel about these protesters ? Probably the same way that American Christians currently serving feel about Fred Phelps.", 
        "intTime": 20090312, 
        "postID": 29, 
        "quote": "I wonder how Islamic personnel currently serving in the UK military feel about these protesters ?", 
        "reply": " Probably the same way that American Christians currently serving feel about Fred Phelps.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 22:47:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Fred Phelps means nothing on this side of the big pond. Time to 'Google' methinks.", 
        "intTime": 20090313, 
        "postID": 30, 
        "quote": "", 
        "reply": "Fred Phelps means nothing on this side of the big pond. Time to 'Google' methinks.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-13 04:52:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "\"http://www.dailymail.co.uk/news/article-1160958/Home-war--troops-greeted-abuse-Muslim-protesters.html\" Too long to copy the story. It has a lot of pictures of angry peace loving Muslim men voicing their \"earned\" right to criticize the British homecoming troops as baby killers and butchers. The Muslim women are out to show their support for the protest but in a different way. The Muslims are taking over Europe in a political/cultural /judicial manner. It is a matter of time before they are this bold here. In some areas they already are. They are past the point of needing to be PC in Britain but are not there yet in America. When they feel they are it will be kid gloves off. Course I will not be allowed to voice MY opinion on the matter.", 
        "intTime": 20090310, 
        "postID": 31, 
        "quote": "", 
        "reply": "\"http://www.dailymail.co.uk/news/article-1160958/Home-war--troops-greeted-abuse-Muslim-protesters.html\" Too long to copy the story. It has a lot of pictures of angry peace loving Muslim men voicing their \"earned\" right to criticize the British homecoming troops as baby killers and butchers. The Muslim women are out to show their support for the protest but in a different way. The Muslims are taking over Europe in a political/cultural /judicial manner. It is a matter of time before they are this bold here. In some areas they already are. They are past the point of needing to be PC in Britain but are not there yet in America. When they feel they are it will be kid gloves off. Course I will not be allowed to voice MY opinion on the matter.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 19:33:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Course I will not be allowed to voice MY opinion on the matter. It looks like you already did.", 
        "intTime": 20090310, 
        "postID": 32, 
        "quote": "Course I will not be allowed to voice MY opinion on the matter.", 
        "reply": " It looks like you already did.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 19:51:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Damn that democracy! That's how they'll do it, too. In Europe the white Christian population is falling short because, as the Pope points out, people are relying on reason and not faith (which means they use birth control and have abortions.) The Islamic folks do neither (officially.) So, it is a matter of time before the democratic principle of 51% of the majority will take over the minority. Look out France! They'll go first. Here it will take a little longer. Can you say Allah Akba?", 
        "intTime": 20090310, 
        "postID": 33, 
        "quote": "", 
        "reply": "Damn that democracy! That's how they'll do it, too. In Europe the white Christian population is falling short because, as the Pope points out, people are relying on reason and not faith (which means they use birth control and have abortions.) The Islamic folks do neither (officially.) So, it is a matter of time before the democratic principle of 51% of the majority will take over the minority. Look out France! They'll go first. Here it will take a little longer. Can you say Allah Akba?", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 19:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "reducetension"
    }, 
    {
        "content": "I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here?", 
        "intTime": 20090310, 
        "postID": 34, 
        "quote": "", 
        "reply": "I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here?", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 20:13:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "Gee, the Muslims in the UK amount to 3% or less of their population. Some take over!", 
        "intTime": 20090310, 
        "postID": 35, 
        "quote": "", 
        "reply": "Gee, the Muslims in the UK amount to 3% or less of their population. Some take over!", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-10 22:19:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "Little_Paul"
    }, 
    {
        "content": "quote: The Muslims are taking over Europe in a political/cultural /judicial manner. A handful of (rent a mini mob) protesters who want to get their faces on the BBC news hardly constitues a takeover. They only did so in the knowledge that the \"Old Bill\" would protect them from locals who wanted to \"discuss\" the merits of their case. It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days.", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "The Muslims are taking over Europe in a political/cultural /judicial manner.", 
        "reply": " A handful of (rent a mini mob) protesters who want to get their faces on the BBC news hardly constitues a takeover. They only did so in the knowledge that the \"Old Bill\" would protect them from locals who wanted to \"discuss\" the merits of their case. It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 01:51:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "My opinion:make more babies.", 
        "intTime": 20090311, 
        "postID": 37, 
        "quote": "", 
        "reply": "My opinion:make more babies.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 01:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "The more the Muslims are accomodated, the more powerful they will get.", 
        "intTime": 20090311, 
        "postID": 38, 
        "quote": "", 
        "reply": "The more the Muslims are accomodated, the more powerful they will get.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 02:23:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "dhd123"
    }, 
    {
        "content": "quote: Gee, the Muslims in the UK amount to 3% or less of their population. Some take over It sure is. As small as the population % is the power they are gaining is undefinable. The money influx this radical element is bringing into Britain which is used to fight on a judicial/political level is huge. Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear. But again...shria law is trying to be wormed into the fabric of the EU. The population growth is growing but the laws being challenged and the protests calling out the government is a mechanism. I do not want shria law here. \"Gee your head is on fire\" \"Ahh, just 3%...nothing to worry about\" This message has been edited. Last edited by: ACR26, Wed 11 March 2009 05:56 AM", 
        "intTime": 20090311, 
        "postID": 39, 
        "quote": "Gee, the Muslims in the UK amount to 3% or less of their population. Some take over", 
        "reply": " It sure is. As small as the population % is the power they are gaining is undefinable. The money influx this radical element is bringing into Britain which is used to fight on a judicial/political level is huge. Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear. But again...shria law is trying to be wormed into the fabric of the EU. The population growth is growing but the laws being challenged and the protests calling out the government is a mechanism. I do not want shria law here. \"Gee your head is on fire\" \"Ahh, just 3%...nothing to worry about\" This message has been edited. Last edited by: ACR26, Wed 11 March 2009 05:56 AM", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:34:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days. Your right...now that I think of it there has never been an attack on the European community by Radical Muslims. Thank you for putting it into perspective for me.", 
        "intTime": 20090311, 
        "postID": 40, 
        "quote": "It it was'nt Islamic protesters who shot dead 2 British soldiers and 1 policeman in the Six Counties over the last few days.", 
        "reply": " Your right...now that I think of it there has never been an attack on the European community by Radical Muslims. Thank you for putting it into perspective for me.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:38:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here? What if there was a protest of pasty anglos in the streets saying muslims are terrorists, how would that freedom of speech thang go down for them? They'd be arrested....", 
        "intTime": 20090311, 
        "postID": 41, 
        "quote": "Originally posted by ACR26: I know I know...just call me a Protectionist. But I take into account that Britain/Europe is having major issues with Muslim how to say PC...encroachment. And they state as such that they will have shria law. That is the goal. But to look at it objectively and say...gee do I want that here?", 
        "reply": " What if there was a protest of pasty anglos in the streets saying muslims are terrorists, how would that freedom of speech thang go down for them? They'd be arrested....", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:52:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few", 
        "intTime": 20090311, 
        "postID": 42, 
        "quote": "", 
        "reply": "Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 05:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few True, But I am talking about if done in merry old England. Pip Pip Old Boy...", 
        "intTime": 20090311, 
        "postID": 43, 
        "quote": "Originally posted by ACR26: Don't forget sued by CAIR Pepper sprayed Demonized by MSNBC and the rest Supported by VERY few", 
        "reply": " True, But I am talking about if done in merry old England. Pip Pip Old Boy...", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 06:42:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear. You don't need to look around for an Islamic community to find anti semitism in France, or many other countries, including the USA. The KKK were'nt too keen on Jews, for example.", 
        "intTime": 20090311, 
        "postID": 44, 
        "quote": "Looking at sectors of France, if you are Jewish you stay out of sectors because you will disappear.", 
        "reply": " You don't need to look around for an Islamic community to find anti semitism in France, or many other countries, including the USA. The KKK were'nt too keen on Jews, for example.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 08:47:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill.", 
        "intTime": 20090311, 
        "postID": 45, 
        "quote": "", 
        "reply": "Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 09:24:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "Back to the topic at hand - The latest from the news Flashback: Carville Wanted Bush to Fail The press never reported that Democratic strategist James Carville said he wanted President Bush to fail before the Sept. 11 terrorist attacks. But a feeding frenzy ensued when radio host Rush Limbaugh recently said he wanted President Obama to fail. \"http://www.foxnews.com/politics/2009/03/11/carville-wanted-bush-fail/\" ANY MORE QUESTIONS ABOUT HYPOCRISY ON THE LEFT?", 
        "intTime": 20090311, 
        "postID": 46, 
        "quote": "", 
        "reply": "Back to the topic at hand - The latest from the news Flashback: Carville Wanted Bush to Fail The press never reported that Democratic strategist James Carville said he wanted President Bush to fail before the Sept. 11 terrorist attacks. But a feeding frenzy ensued when radio host Rush Limbaugh recently said he wanted President Obama to fail. \"http://www.foxnews.com/politics/2009/03/11/carville-wanted-bush-fail/\" ANY MORE QUESTIONS ABOUT HYPOCRISY ON THE LEFT?", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 11:36:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill. I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill. MsG", 
        "intTime": 20090311, 
        "postID": 47, 
        "quote": "Originally posted by ACR26: Yep, they are not keen on anyone. However, if they were to try and set up a haven where anyone not a KKK member would have repeating\"disappearance\" they would be outgunned in short order, rousted out, brought up on charges and go before a judge. My main point is that there are more and more protests against the governments in Europe where the pot is \"trying\" to call the kettle black. Its culmination in my opinion was on display with these \"paid or whatever\" demonstrators calling the British troops baby killers. To me it is close (but not exact) to VC standing on our soil calling our returning Vietnam Vets baby killers. I take into context what these Muslim groups are trying to do…over power the European community through every means available including (and this may be the most important point) through terrorist activities. There are a lot of Muslims in Europe and here in the US that DO NOT want to do anything except live in peace. The ones I see in the pictures of the story does not seem to fit that bill.", 
        "reply": " I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill. MsG", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 11:53:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "bugsy48"
    }, 
    {
        "content": "quote: I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill. EXACTLY!", 
        "intTime": 20090311, 
        "postID": 48, 
        "quote": "I believe you may have a bit of a twisted picture there, buddy. Over 1500 folks turned out to welcome the Royal Anglians home - against 16 Muslim extremist loonies. The problem was that they were all over the press, while the good folks were hardly mentioned, especially those \"good folks\" who wanted a piece of the loonies and were stopped by the Old Bill.", 
        "reply": " EXACTLY!", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 15:45:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 49, 
        "quote": "", 
        "reply": "Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - Wandering and Wondering", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 15:55:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up.", 
        "intTime": 20090311, 
        "postID": 50, 
        "quote": "Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - -", 
        "reply": " those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 16:02:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up. The irony would be lost on them.. Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact.", 
        "intTime": 20090311, 
        "postID": 51, 
        "quote": "Originally posted by Elesso: quote: Originally posted by greywolfghost: Looks to me like the boys in uniform ought to do a \"Fix Bayonets!! Hostiles to the Right! CHARGE!!!\" if ya ask me - - those protester enjoy the freedoms they have to protest. if any of them tried that in, say Iran, or maybe saudi araia, they'd be spending the rest of their (shortened) lives in prison... at least till the hangman or headsman showed up.", 
        "reply": " The irony would be lost on them.. Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 16:37:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact. I would tend to disagree with that statement. The differences in cultures/religions is only the banner they hold up to justify themselves. In truth, it's just a good old-fashioned battle for supremacy. MsG", 
        "intTime": 20090311, 
        "postID": 52, 
        "quote": "Originally posted by threerings: Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact.", 
        "reply": " I would tend to disagree with that statement. The differences in cultures/religions is only the banner they hold up to justify themselves. In truth, it's just a good old-fashioned battle for supremacy. MsG", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 16:42:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "bugsy48"
    }, 
    {
        "content": "Has anyone ever driven through BC Canada? You'd swear you were back in Iraq. I was having anxiety problems when we drove through there. You never hear about this stuff until it's too late.", 
        "intTime": 20090311, 
        "postID": 53, 
        "quote": "", 
        "reply": "Has anyone ever driven through BC Canada? You'd swear you were back in Iraq. I was having anxiety problems when we drove through there. You never hear about this stuff until it's too late.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 17:08:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by dhd123: The more the Muslims are accomodated, the more powerful they will get. yup and the more they will demand more...", 
        "intTime": 20090311, 
        "postID": 54, 
        "quote": "Originally posted by dhd123: The more the Muslims are accomodated, the more powerful they will get.", 
        "reply": " yup and the more they will demand more...", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-11 18:15:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I wonder how Islamic personnel currently serving in the UK military feel about these protesters ? Especially the family of L/Cpl. Jabron Hashmi, the first Muslim KIA.", 
        "intTime": 20090312, 
        "postID": 55, 
        "quote": "", 
        "reply": "I wonder how Islamic personnel currently serving in the UK military feel about these protesters ? Especially the family of L/Cpl. Jabron Hashmi, the first Muslim KIA.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 02:26:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "Pobably the same way the rest of the soldiers feel. Words and context mean something", 
        "intTime": 20090312, 
        "postID": 56, 
        "quote": "", 
        "reply": "Pobably the same way the rest of the soldiers feel. Words and context mean something", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 06:43:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by TomGustafson: My opinion:make more babies. Well, since I can't I guess I'll just have to keep practicing", 
        "intTime": 20090312, 
        "postID": 57, 
        "quote": "Originally posted by TomGustafson: My opinion:make more babies.", 
        "reply": " Well, since I can't I guess I'll just have to keep practicing", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 08:40:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact I haven't heard that expression in years!!!!!!!!!!!!!!! Thanks for using it... Airborne!", 
        "intTime": 20090312, 
        "postID": 58, 
        "quote": "", 
        "reply": "Anyone that things we are not in a war of cultures better pull their head out their fourth point of contact I haven't heard that expression in years!!!!!!!!!!!!!!! Thanks for using it... Airborne!", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 22:27:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: I wonder how Islamic personnel currently serving in the UK military feel about these protesters ? Probably the same way that American Christians currently serving feel about Fred Phelps.", 
        "intTime": 20090312, 
        "postID": 59, 
        "quote": "I wonder how Islamic personnel currently serving in the UK military feel about these protesters ?", 
        "reply": " Probably the same way that American Christians currently serving feel about Fred Phelps.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-12 22:47:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Fred Phelps means nothing on this side of the big pond. Time to 'Google' methinks.", 
        "intTime": 20090313, 
        "postID": 60, 
        "quote": "", 
        "reply": "Fred Phelps means nothing on this side of the big pond. Time to 'Google' methinks.", 
        "threadID": "409192893_3850094712001", 
        "time": "2009-03-13 04:52:00", 
        "title": "Hypocrisy in its finest", 
        "userID": "ScotsVisitor"
    }
]