[
    {
        "content": "America’s economic decline By Loren Thompson The U.S. has possessed the most powerful economy in the world for so long that no one can remember a time when America was not No. 1. The armed forces have been a big beneficiary of the nation’s economic success. Although Pentagon planners frequently complain about having to operate in a “fiscally constrained” environment, the U.S. accounts for nearly half of global military outlays. It is a remarkable reflection of America’s economic strength that less than 5 percent of the world’s population can sustain such a high level of defense spending, using less than 5 percent of gross domestic product. How serious? Shortly before President Barack Obama took office, the U.S. intelligence community’s top analyst completed a major assessment of global trends through 2025. The analyst, Thomas Fingar, predicted that the international system would be “transformed” over the next 15 years in much the same way that it was remade after World War II. But unlike during the Cold War, when America rose to unrivaled supremacy, Fingar’s study predicted it would be China that had the most influence on global politics and economics in the years ahead. The U.S. would probably remain the single most powerful nation in the near term, Fingar concluded, but in relative terms, China would be rising fast, and America would de declining. Read the full article here >>> >http://www.armedforcesjournal.com/2009/03/3922551 If there was ever a time to stop all of this bickering and come together and work as one it is NOW. People have to face the facts that it's not going to be the way it's been in the past.", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "America’s economic decline By Loren Thompson The U.S. has possessed the most powerful economy in the world for so long that no one can remember a time when America was not No. 1. The armed forces have been a big beneficiary of the nation’s economic success. Although Pentagon planners frequently complain about having to operate in a “fiscally constrained” environment, the U.S. accounts for nearly half of global military outlays. It is a remarkable reflection of America’s economic strength that less than 5 percent of the world’s population can sustain such a high level of defense spending, using less than 5 percent of gross domestic product. How serious? Shortly before President Barack Obama took office, the U.S. intelligence community’s top analyst completed a major assessment of global trends through 2025. The analyst, Thomas Fingar, predicted that the international system would be “transformed” over the next 15 years in much the same way that it was remade after World War II. But unlike during the Cold War, when America rose to unrivaled supremacy, Fingar’s study predicted it would be China that had the most influence on global politics and economics in the years ahead. The U.S. would probably remain the single most powerful nation in the near term, Fingar concluded, but in relative terms, China would be rising fast, and America would de declining. Read the full article here >>> >http://www.armedforcesjournal.com/2009/03/3922551 If there was ever a time to stop all of this bickering and come together and work as one it is NOW. People have to face the facts that it's not going to be the way it's been in the past.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-23 23:19:00", 
        "title": "America’s economic decline", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives?", 
        "intTime": 20090324, 
        "postID": 2, 
        "quote": "", 
        "reply": "China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives?", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 09:18:00", 
        "title": "America’s economic decline", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "...but this is going to be a very tough one to pull out of. We can do it, but we won't be the same after it's over - and maybe that's good. The world lost a substantial portion of its collective wealth, and that wealth and its support systems will probably never come back.", 
        "intTime": 20090324, 
        "postID": 3, 
        "quote": "", 
        "reply": "...but this is going to be a very tough one to pull out of. We can do it, but we won't be the same after it's over - and maybe that's good. The world lost a substantial portion of its collective wealth, and that wealth and its support systems will probably never come back.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 09:37:00", 
        "title": "America’s economic decline", 
        "userID": "mcgreer"
    }, 
    {
        "content": "The wealth wasn't lost it was pocketed by the CEO's and executives of the major firms just like Enron.", 
        "intTime": 20090324, 
        "postID": 4, 
        "quote": "", 
        "reply": "The wealth wasn't lost it was pocketed by the CEO's and executives of the major firms just like Enron.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 09:39:00", 
        "title": "America’s economic decline", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: The case for China reaching superpower status is also questionable. The are on the verge of an ecological meltdown and it is only a matter of time before they pay a huge charge against their bottom line. That is the question: Does China's economic (and other) problem catch up with it before China can project force in a meaningful way.. Frankly, I dont want to bet it will. I'd rather have a military capable of dealing with the issue.", 
        "intTime": 20090324, 
        "postID": 5, 
        "quote": "Originally posted by dmuhler: The case for China reaching superpower status is also questionable. The are on the verge of an ecological meltdown and it is only a matter of time before they pay a huge charge against their bottom line.", 
        "reply": " That is the question: Does China's economic (and other) problem catch up with it before China can project force in a meaningful way.. Frankly, I dont want to bet it will. I'd rather have a military capable of dealing with the issue.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 09:58:00", 
        "title": "America’s economic decline", 
        "userID": "threerings"
    }, 
    {
        "content": "Not to worry. Obama will send the Chinese a video tape asking them to play nice.", 
        "intTime": 20090324, 
        "postID": 6, 
        "quote": "", 
        "reply": "Not to worry. Obama will send the Chinese a video tape asking them to play nice.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:07:00", 
        "title": "America’s economic decline", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: The wealth wasn't lost it was pocketed by the CEO's and executives of the major firms just like Enron. It was \"bubble wealth\" - it never really existed.", 
        "intTime": 20090324, 
        "postID": 7, 
        "quote": "Originally posted by dragonflyer04: The wealth wasn't lost it was pocketed by the CEO's and executives of the major firms just like Enron.", 
        "reply": " It was \"bubble wealth\" - it never really existed.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:12:00", 
        "title": "America’s economic decline", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Okay, tell that to the pension funds, and investors that saw it disappear due to poor investment grade instruments that came from the sub-prime housing market. Those that benefited from it were those who collected the bonuses for selling the sub-primes and appraising them for the market that then bundled them into the investment instruments for sale on Wall St. who rebundeled them and sold them for investments. It was a long daisy-chain effect as it collapsed. The money was invested and lost.", 
        "intTime": 20090324, 
        "postID": 8, 
        "quote": "", 
        "reply": "Okay, tell that to the pension funds, and investors that saw it disappear due to poor investment grade instruments that came from the sub-prime housing market. Those that benefited from it were those who collected the bonuses for selling the sub-primes and appraising them for the market that then bundled them into the investment instruments for sale on Wall St. who rebundeled them and sold them for investments. It was a long daisy-chain effect as it collapsed. The money was invested and lost.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:18:00", 
        "title": "America’s economic decline", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "dragonflyer04 you make a good case for prosecuting those CEOs, execs, and boards for fraud. They were as fraudulant as Bernie Madoff and deserve the same fate.", 
        "intTime": 20090324, 
        "postID": 9, 
        "quote": "", 
        "reply": "dragonflyer04 you make a good case for prosecuting those CEOs, execs, and boards for fraud. They were as fraudulant as Bernie Madoff and deserve the same fate.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:24:00", 
        "title": "America’s economic decline", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Okay, tell that to the pension funds, and investors that saw it disappear due to poor investment grade instruments that came from the sub-prime housing market. Those that benefited from it were those who collected the bonuses for selling the sub-primes and appraising them for the market that then bundled them into the investment instruments for sale on Wall St. who rebundeled them and sold them for investments. It was a long daisy-chain effect as it collapsed. The money was invested and lost. I prefer to call them institutional Ponzi schemes. I don't normally do this - but Rolling Stone's Matt Tabibbi gives his take on the whole scam, using AIG as the chief antagonist. It's a good read. Tabibbi can be pretty crude at times, but he does his homework. \"...What had brought us to the brink of collapse in the first place was this relentless instinct for building ever-larger megacompanies, passing deregulatory measures to gradually feed all the little fish in the sea to an ever-shrinking pool of Bigger Fish. To fix this problem, the government should have slowly liquidated these monster, too-big-to-fail firms and broken them down to smaller, more manageable companies. Instead, federal regulators closed ranks and used an almost completely secret bailout process to double down on the same faulty, merger-happy thinking that got us here in the first place, creating a constellation of megafirms under government control that are even bigger, more unwieldy and more crammed to the gills with systemic risk. In essence, Paulson and his cronies turned the federal government into one gigantic, half-opaque holding company, one whose balance sheet includes the world's most appallingly large and risky hedge fund, a controlling stake in a dying insurance giant, huge investments in a group of teetering megabanks, and shares here and there in various auto-finance companies, student loans, and other failing businesses. Like AIG, this new federal holding company is a firm that has no mechanism for auditing itself and is run by leaders who have very little grasp of the daily operations of its disparate subsidiary operations. In other words, it's AIG's rip-roaringly ****ty business model writ almost inconceivably massive — to echo Geithner, a huge, complex global company attached to a very complicated investment bank/hedge fund that's been allowed to build up without adult supervision. How much of what kinds of crap is actually on our balance sheet, and what did we pay for it? When exactly will the rent come due, when will the money run out? Does anyone know what the hell is going on? And on the linear spectrum of capitalism to socialism, where exactly are we now? Is there a dictionary word that even describes what we are now? It would be funny, if it weren't such a nightmare...\" \"http://www.rollingstone.com/politics/story/26793903/the_big_takeover/print\"", 
        "intTime": 20090324, 
        "postID": 10, 
        "quote": "Originally posted by dragonflyer04: Okay, tell that to the pension funds, and investors that saw it disappear due to poor investment grade instruments that came from the sub-prime housing market. Those that benefited from it were those who collected the bonuses for selling the sub-primes and appraising them for the market that then bundled them into the investment instruments for sale on Wall St. who rebundeled them and sold them for investments. It was a long daisy-chain effect as it collapsed. The money was invested and lost.", 
        "reply": " I prefer to call them institutional Ponzi schemes. I don't normally do this - but Rolling Stone's Matt Tabibbi gives his take on the whole scam, using AIG as the chief antagonist. It's a good read. Tabibbi can be pretty crude at times, but he does his homework. \"...What had brought us to the brink of collapse in the first place was this relentless instinct for building ever-larger megacompanies, passing deregulatory measures to gradually feed all the little fish in the sea to an ever-shrinking pool of Bigger Fish. To fix this problem, the government should have slowly liquidated these monster, too-big-to-fail firms and broken them down to smaller, more manageable companies. Instead, federal regulators closed ranks and used an almost completely secret bailout process to double down on the same faulty, merger-happy thinking that got us here in the first place, creating a constellation of megafirms under government control that are even bigger, more unwieldy and more crammed to the gills with systemic risk. In essence, Paulson and his cronies turned the federal government into one gigantic, half-opaque holding company, one whose balance sheet includes the world's most appallingly large and risky hedge fund, a controlling stake in a dying insurance giant, huge investments in a group of teetering megabanks, and shares here and there in various auto-finance companies, student loans, and other failing businesses. Like AIG, this new federal holding company is a firm that has no mechanism for auditing itself and is run by leaders who have very little grasp of the daily operations of its disparate subsidiary operations. In other words, it's AIG's rip-roaringly ****ty business model writ almost inconceivably massive — to echo Geithner, a huge, complex global company attached to a very complicated investment bank/hedge fund that's been allowed to build up without adult supervision. How much of what kinds of crap is actually on our balance sheet, and what did we pay for it? When exactly will the rent come due, when will the money run out? Does anyone know what the hell is going on? And on the linear spectrum of capitalism to socialism, where exactly are we now? Is there a dictionary word that even describes what we are now? It would be funny, if it weren't such a nightmare...\" \"http://www.rollingstone.com/politics/story/26793903/the_big_takeover/print\"", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:28:00", 
        "title": "America’s economic decline", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives? OMG, don't be a hypocrite. President Obama is BORROWING AND SPENDING MORE THE any Republican did. Don't throw stones in a glass house and stop being such a blind partisan. You do yourself no credit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090324, 
        "postID": 11, 
        "quote": "Originally posted by Irwin_R_Schyster: China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives?", 
        "reply": " OMG, don't be a hypocrite. President Obama is BORROWING AND SPENDING MORE THE any Republican did. Don't throw stones in a glass house and stop being such a blind partisan. You do yourself no credit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:35:00", 
        "title": "America’s economic decline", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives? OMG, don't be a hypocrite. President Obama is BORROWING AND SPENDING MORE THE any Republican did. Don't throw stones in a glass house and stop being such a blind partisan. You do yourself no credit. He is, indeed. It's too bad that someone can't offer a better alternative, as this will take a long time to come out of. Too many people are looking at our problem from a single angle. It has many angles, and the deficit is but one of them. From that angle, how will reducing the deficit in an environment of failing businesses and rising unemployment help us? Remember - 70% of our economy is consumer spending.", 
        "intTime": 20090324, 
        "postID": 12, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives? OMG, don't be a hypocrite. President Obama is BORROWING AND SPENDING MORE THE any Republican did. Don't throw stones in a glass house and stop being such a blind partisan. You do yourself no credit.", 
        "reply": " He is, indeed. It's too bad that someone can't offer a better alternative, as this will take a long time to come out of. Too many people are looking at our problem from a single angle. It has many angles, and the deficit is but one of them. From that angle, how will reducing the deficit in an environment of failing businesses and rising unemployment help us? Remember - 70% of our economy is consumer spending.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:40:00", 
        "title": "America’s economic decline", 
        "userID": "mcgreer"
    }, 
    {
        "content": "If you are not creating any wealth by producing goods to market how long can you keep spending? The only thing we got left is raw resources. A country that exports raw materials and imports finished goods is a third world country.", 
        "intTime": 20090324, 
        "postID": 13, 
        "quote": "", 
        "reply": "If you are not creating any wealth by producing goods to market how long can you keep spending? The only thing we got left is raw resources. A country that exports raw materials and imports finished goods is a third world country.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 10:48:00", 
        "title": "America’s economic decline", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Why does China have to use military force against us, and how would they do it? I don't understand that. What you're also missing is that, while China owns our debt, China also depends on the world's largest consumer (us). As our consumption drops, their production drops. So, they need our economy to succeed. As their economy stalls, they will become more dependent on outside assistance of some sort. What they actually need is a suitable substitute to our sick economy - it's probably why they're pushing for a single world currency, as that would be one of the few instruments that could replace the US dollar.", 
        "intTime": 20090324, 
        "postID": 14, 
        "quote": "", 
        "reply": "Why does China have to use military force against us, and how would they do it? I don't understand that. What you're also missing is that, while China owns our debt, China also depends on the world's largest consumer (us). As our consumption drops, their production drops. So, they need our economy to succeed. As their economy stalls, they will become more dependent on outside assistance of some sort. What they actually need is a suitable substitute to our sick economy - it's probably why they're pushing for a single world currency, as that would be one of the few instruments that could replace the US dollar.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 11:19:00", 
        "title": "America’s economic decline", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives? OMG, don't be a hypocrite. President Obama is BORROWING AND SPENDING MORE THE any Republican did. Don't throw stones in a glass house and stop being such a blind partisan. You do yourself no credit. He is, indeed. It's too bad that someone can't offer a better alternative, as this will take a long time to come out of. Too many people are looking at our problem from a single angle. It has many angles, and the deficit is but one of them. From that angle, how will reducing the deficit in an environment of failing businesses and rising unemployment help us? Remember - 70% of our economy is consumer spending. You are correct of course, however with the decline of our dollar because of this overwhelming spending will only deepen our problems. When Milk starts costing 10 bucks a gallon, I guess people will complain then. I am not expert so I don't have a solution, but neither Dems nor Republicans seem to have the answer either. I think we should let the market fix itself. If companies like AIG go under, so be it. There are plenty of smaller companies out there that can fill the gap. Yes jobs will be lost, but not forever because those same smaller companies that haven't been as corrupted as AIG and others will bring those jobs back. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090324, 
        "postID": 15, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: China will only be influential because of the idiotic Republican war cry \"Borrow and Spend\" China is like one big line of credit that is fueling the so-called \"American way of life.\" Its a fantasy....For a New World Order to emerge America must go down, right conservatives? OMG, don't be a hypocrite. President Obama is BORROWING AND SPENDING MORE THE any Republican did. Don't throw stones in a glass house and stop being such a blind partisan. You do yourself no credit. He is, indeed. It's too bad that someone can't offer a better alternative, as this will take a long time to come out of. Too many people are looking at our problem from a single angle. It has many angles, and the deficit is but one of them. From that angle, how will reducing the deficit in an environment of failing businesses and rising unemployment help us? Remember - 70% of our economy is consumer spending.", 
        "reply": " You are correct of course, however with the decline of our dollar because of this overwhelming spending will only deepen our problems. When Milk starts costing 10 bucks a gallon, I guess people will complain then. I am not expert so I don't have a solution, but neither Dems nor Republicans seem to have the answer either. I think we should let the market fix itself. If companies like AIG go under, so be it. There are plenty of smaller companies out there that can fill the gap. Yes jobs will be lost, but not forever because those same smaller companies that haven't been as corrupted as AIG and others will bring those jobs back. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 11:24:00", 
        "title": "America’s economic decline", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Why does China have to use military force against us, and how would they do it? I don't understand that. What you're also missing is that, while China owns our debt, China also depends on the world's largest consumer (us). As our consumption drops, their production drops. So, they need our economy to succeed. As their economy stalls, they will become more dependent on outside assistance of some sort. What they actually need is a suitable substitute to our sick economy - it's probably why they're pushing for a single world currency, as that would be one of the few instruments that could replace the US dollar. Again, you are correct in your point. Most do not understand that the US is a super power. not because of our Military alone, but because we are: 1. The Bread Basket of the world 2. The economy of the world. The US is responsible for over 25% of the entire worlds economy. If we tank, MANY OTHERS will as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090324, 
        "postID": 16, 
        "quote": "Originally posted by mcgreer: Why does China have to use military force against us, and how would they do it? I don't understand that. What you're also missing is that, while China owns our debt, China also depends on the world's largest consumer (us). As our consumption drops, their production drops. So, they need our economy to succeed. As their economy stalls, they will become more dependent on outside assistance of some sort. What they actually need is a suitable substitute to our sick economy - it's probably why they're pushing for a single world currency, as that would be one of the few instruments that could replace the US dollar.", 
        "reply": " Again, you are correct in your point. Most do not understand that the US is a super power. not because of our Military alone, but because we are: 1. The Bread Basket of the world 2. The economy of the world. The US is responsible for over 25% of the entire worlds economy. If we tank, MANY OTHERS will as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 11:26:00", 
        "title": "America’s economic decline", 
        "userID": "L0A1"
    }, 
    {
        "content": "The United States, at this point in history, is too big to fail. Look at how our mistakes have affected the entire planet.", 
        "intTime": 20090324, 
        "postID": 17, 
        "quote": "", 
        "reply": "The United States, at this point in history, is too big to fail. Look at how our mistakes have affected the entire planet.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 11:31:00", 
        "title": "America’s economic decline", 
        "userID": "mcgreer"
    }, 
    {
        "content": "China Takes Aim at Dollar March 24, 2009 BEIJING -- China called for the creation of a new currency to eventually replace the dollar as the world's standard, proposing a sweeping overhaul of global finance that reflects developing nations' growing unhappiness with the U.S. role in the world economy. The unusual proposal, made by central bank governor Zhou Xiaochuan in an essay released Monday in Beijing, is part of China's increasingly assertive approach to shaping the global response to the financial crisis. Mr. Zhou's proposal comes amid preparations for a summit of the world's industrial and developing nations, the Group of 20, in London next week. At past such meetings, developed nations have criticized China's economic and currency policies. This time, China is on the offensive, backed by other emerging economies such as Russia in making clear they want a global economic order less dominated by the U.S. and other wealthy nations. Full article at >> The Wall Street Journal >http://online.wsj.com/article/SB123780272456212885.html", 
        "intTime": 20090324, 
        "postID": 18, 
        "quote": "", 
        "reply": "China Takes Aim at Dollar March 24, 2009 BEIJING -- China called for the creation of a new currency to eventually replace the dollar as the world's standard, proposing a sweeping overhaul of global finance that reflects developing nations' growing unhappiness with the U.S. role in the world economy. The unusual proposal, made by central bank governor Zhou Xiaochuan in an essay released Monday in Beijing, is part of China's increasingly assertive approach to shaping the global response to the financial crisis. Mr. Zhou's proposal comes amid preparations for a summit of the world's industrial and developing nations, the Group of 20, in London next week. At past such meetings, developed nations have criticized China's economic and currency policies. This time, China is on the offensive, backed by other emerging economies such as Russia in making clear they want a global economic order less dominated by the U.S. and other wealthy nations. Full article at >> The Wall Street Journal >http://online.wsj.com/article/SB123780272456212885.html", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 12:40:00", 
        "title": "America’s economic decline", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: China Takes Aim at Dollar March 24, 2009 BEIJING -- China called for the creation of a new currency to eventually replace the dollar as the world's standard, proposing a sweeping overhaul of global finance that reflects developing nations' growing unhappiness with the U.S. role in the world economy. The unusual proposal, made by central bank governor Zhou Xiaochuan in an essay released Monday in Beijing, is part of China's increasingly assertive approach to shaping the global response to the financial crisis. Mr. Zhou's proposal comes amid preparations for a summit of the world's industrial and developing nations, the Group of 20, in London next week. At past such meetings, developed nations have criticized China's economic and currency policies. This time, China is on the offensive, backed by other emerging economies such as Russia in making clear they want a global economic order less dominated by the U.S. and other wealthy nations. Full article at >> The Wall Street Journal >http://online.wsj.com/article/SB123780272456212885.html We lost credibility in the economic world because we didn't properly regulate our financial activity. The world's exposure to us is huge - this global mess is our doing.", 
        "intTime": 20090324, 
        "postID": 19, 
        "quote": "Originally posted by IHAWKER: China Takes Aim at Dollar March 24, 2009 BEIJING -- China called for the creation of a new currency to eventually replace the dollar as the world's standard, proposing a sweeping overhaul of global finance that reflects developing nations' growing unhappiness with the U.S. role in the world economy. The unusual proposal, made by central bank governor Zhou Xiaochuan in an essay released Monday in Beijing, is part of China's increasingly assertive approach to shaping the global response to the financial crisis. Mr. Zhou's proposal comes amid preparations for a summit of the world's industrial and developing nations, the Group of 20, in London next week. At past such meetings, developed nations have criticized China's economic and currency policies. This time, China is on the offensive, backed by other emerging economies such as Russia in making clear they want a global economic order less dominated by the U.S. and other wealthy nations. Full article at >> The Wall Street Journal >http://online.wsj.com/article/SB123780272456212885.html", 
        "reply": " We lost credibility in the economic world because we didn't properly regulate our financial activity. The world's exposure to us is huge - this global mess is our doing.", 
        "threadID": "409192893_1530027812001", 
        "time": "2009-03-24 12:55:00", 
        "title": "America’s economic decline", 
        "userID": "mcgreer"
    }
]