[
    {
        "content": "\"... My theme is the intellectual decline of conservatism, and it is notable that the policies of the new conservatism are powered largely by emotion and religion and have for the most part weak intellectual groundings. That the policies are weak in conception, have largely failed in execution, and are political flops is therefore unsurprising. The major blows to conservatism, culminating in the election and programs of Obama, have been fourfold: the failure of military force to achieve U.S. foreign policy objectives; the inanity of trying to substitute will for intellect, as in the denial of global warming, the use of religious criteria in the selection of public officials, the neglect of management and expertise in government; a continued preoccupation with abortion; and fiscal incontinence in the form of massive budget deficits, the Medicare drug plan, excessive foreign borrowing, and asset-price inflation. By the fall of 2008, the face of the Republican Party had become Sarah Palin and Joe the Plumber. Conservative intellectuals had no party. ...\" \"http://www.becker-posner-blog.com/archives/2009/05/is_the_conserva.html\"", 
        "intTime": 20090518, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"... My theme is the intellectual decline of conservatism, and it is notable that the policies of the new conservatism are powered largely by emotion and religion and have for the most part weak intellectual groundings. That the policies are weak in conception, have largely failed in execution, and are political flops is therefore unsurprising. The major blows to conservatism, culminating in the election and programs of Obama, have been fourfold: the failure of military force to achieve U.S. foreign policy objectives; the inanity of trying to substitute will for intellect, as in the denial of global warming, the use of religious criteria in the selection of public officials, the neglect of management and expertise in government; a continued preoccupation with abortion; and fiscal incontinence in the form of massive budget deficits, the Medicare drug plan, excessive foreign borrowing, and asset-price inflation. By the fall of 2008, the face of the Republican Party had become Sarah Palin and Joe the Plumber. Conservative intellectuals had no party. ...\" \"http://www.becker-posner-blog.com/archives/2009/05/is_the_conserva.html\"", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 02:18:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 2, 
        "quote": "", 
        "reply": "No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 02:54:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it!", 
        "intTime": 20090518, 
        "postID": 3, 
        "quote": "", 
        "reply": "Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it!", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:14:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by 2494906: Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it! There, fixed it for you. Do you notice any familiar faces who are both conservative in ideology and are also GOPers? Conservatism and the GOP, have/will be indelibly linked together. Sorry, that's just the way it is. I can tell you're upset again. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 4, 
        "quote": "Originally posted by 2494906: Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it!", 
        "reply": " There, fixed it for you. Do you notice any familiar faces who are both conservative in ideology and are also GOPers? Conservatism and the GOP, have/will be indelibly linked together. Sorry, that's just the way it is. I can tell you're upset again. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:37:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Confusing conservatism with the Republican party. If they are not there, then where are they?", 
        "intTime": 20090518, 
        "postID": 5, 
        "quote": "Confusing conservatism with the Republican party.", 
        "reply": " If they are not there, then where are they?", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:39:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "", 
        "reply": "Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:40:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they? It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat.", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they?", 
        "reply": " It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:42:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! is this directed at me? Is citing an article/opinion/blog somehow wrong now?", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?!", 
        "reply": " is this directed at me? Is citing an article/opinion/blog somehow wrong now?", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:49:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "(Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...)", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "", 
        "reply": "(Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...)", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:53:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Whatever happened to making your own arguments? I've made the same argument over and over again on this site.", 
        "intTime": 20090518, 
        "postID": 10, 
        "quote": "Whatever happened to making your own arguments?", 
        "reply": " I've made the same argument over and over again on this site.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:56:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 11, 
        "quote": "Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "reply": " Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:03:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them!", 
        "intTime": 20090518, 
        "postID": 12, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption.", 
        "reply": " Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them!", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:17:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by 2494906: (Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...) I could make the very same arguement when people on these boards cut and paste pictures of President Obama, with either a swasitka or a hammer and sickle over his photo. It cuts both ways. It has nothing to do with anyone's intellect, regardless of what side of the isle they are on. Sometimes, at least IMHO, cut-n-pastes break up the monotony on this site. But mind you, that's just a humble opinion. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 13, 
        "quote": "Originally posted by 2494906: (Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...)", 
        "reply": " I could make the very same arguement when people on these boards cut and paste pictures of President Obama, with either a swasitka or a hammer and sickle over his photo. It cuts both ways. It has nothing to do with anyone's intellect, regardless of what side of the isle they are on. Sometimes, at least IMHO, cut-n-pastes break up the monotony on this site. But mind you, that's just a humble opinion. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:20:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by 2494906: quote: Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them! What stand by? Change what results and facts? Word game playing are we, or is that just you? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 14, 
        "quote": "Originally posted by 2494906: quote: Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them!", 
        "reply": " What stand by? Change what results and facts? Word game playing are we, or is that just you? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:24:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by 2494906: Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. A war of \"choice\" rather than a war of \"necessity\" is indeed a trademark of totalitarianism, hence \"national socialism,\" hence Iraq-2003. No, Nazism was not a far left leaning (liberal) ideology. It was modeled on the Right Wing extremist movements [Frei-Korps] that existed in Germany immediately after their defeat in WWI. You must know alot about my personal life suggesting I have all this free time you claim I have. I am lucky to make a post every day of the week. But why am I arguing my case? You seem to have all the answers. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 15, 
        "quote": "Originally posted by 2494906: Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "reply": " A war of \"choice\" rather than a war of \"necessity\" is indeed a trademark of totalitarianism, hence \"national socialism,\" hence Iraq-2003. No, Nazism was not a far left leaning (liberal) ideology. It was modeled on the Right Wing extremist movements [Frei-Korps] that existed in Germany immediately after their defeat in WWI. You must know alot about my personal life suggesting I have all this free time you claim I have. I am lucky to make a post every day of the week. But why am I arguing my case? You seem to have all the answers. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:43:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Please define \"conservatism\". Is a conservationist a conservative? Most conservationists I know would object at being labelled conservative. And of what brand of conservatism do you refer? Social conservatism? Fiscal? Paleo? Neo? Social conservatism is not a new concept, and has been supported by some of the greatest thinkers in history. Aquinas, Augustine, Lewis, Tolkien, Schaeffer, etc. Undoubtedly, it has also been challenged by some great minds too. Fiscal conservatism has as its modern champion Milton Friedman, who is the yang to Keynes' yin. There is just too much to get into between which model of fiscal philosophy is \"right\". Me...I prefer Friedman's model. It allows for far more individual autonomy regulated by the market and individual responsibility (i.e. moral and ethical restraint). I don't find as much support for neo-conservatism these days. But Paleo-conservatism is starting to gain in popularity. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 16, 
        "quote": "", 
        "reply": "Please define \"conservatism\". Is a conservationist a conservative? Most conservationists I know would object at being labelled conservative. And of what brand of conservatism do you refer? Social conservatism? Fiscal? Paleo? Neo? Social conservatism is not a new concept, and has been supported by some of the greatest thinkers in history. Aquinas, Augustine, Lewis, Tolkien, Schaeffer, etc. Undoubtedly, it has also been challenged by some great minds too. Fiscal conservatism has as its modern champion Milton Friedman, who is the yang to Keynes' yin. There is just too much to get into between which model of fiscal philosophy is \"right\". Me...I prefer Friedman's model. It allows for far more individual autonomy regulated by the market and individual responsibility (i.e. moral and ethical restraint). I don't find as much support for neo-conservatism these days. But Paleo-conservatism is starting to gain in popularity. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:24:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by 2494906: quote: Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they? It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat. Let me be clear, I am not posting on this topic because I agree with some of the earlier posts or to bash conservatives/Republicans. That being said, you seem like the minority of conservatives. Just look at these boards. Anyone who is percieved to be a Democrat, or anything less than a hard core conservative is automatically labeled a \"liberal facist socialist democrat progressive\". Rush Limbaugh, Ann Coulter, and others have pushed people who have some conservative leanings away from the GOP. The hard liners have created a hostile environment for young people and minorities. They refuse to admit that they lost in 2006 and 2008 because the Bush version of conservatism was failing. They blaimed it on everything else. I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms, bottom line. In theory, I am also for lower taxes, a strong military, strong national defense, and good foreign policy. But I haven't seen that happen with today's conservatives/Republicans. They've talked a great game, shouted really, but haven't done much but weaken the economy and mismanage two wars. That's why I came within a hair's breadth of voting for Obama and if I had it to do all over again, today I might actually choose him over John McCain (who is one of my all time favorite politicians). That's because John McCain was forced to appeal to Bush/Cheney-era conservatives, neocons, and was undercut every step of the way by the hard-line \"conservatives\". I wish to hell John McCain had gotten the nomination he rightfully deserved in 2000 and 2004. We'd be a lot better off right now.", 
        "intTime": 20090518, 
        "postID": 17, 
        "quote": "Originally posted by 2494906: quote: Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they? It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat.", 
        "reply": " Let me be clear, I am not posting on this topic because I agree with some of the earlier posts or to bash conservatives/Republicans. That being said, you seem like the minority of conservatives. Just look at these boards. Anyone who is percieved to be a Democrat, or anything less than a hard core conservative is automatically labeled a \"liberal facist socialist democrat progressive\". Rush Limbaugh, Ann Coulter, and others have pushed people who have some conservative leanings away from the GOP. The hard liners have created a hostile environment for young people and minorities. They refuse to admit that they lost in 2006 and 2008 because the Bush version of conservatism was failing. They blaimed it on everything else. I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms, bottom line. In theory, I am also for lower taxes, a strong military, strong national defense, and good foreign policy. But I haven't seen that happen with today's conservatives/Republicans. They've talked a great game, shouted really, but haven't done much but weaken the economy and mismanage two wars. That's why I came within a hair's breadth of voting for Obama and if I had it to do all over again, today I might actually choose him over John McCain (who is one of my all time favorite politicians). That's because John McCain was forced to appeal to Bush/Cheney-era conservatives, neocons, and was undercut every step of the way by the hard-line \"conservatives\". I wish to hell John McCain had gotten the nomination he rightfully deserved in 2000 and 2004. We'd be a lot better off right now.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:47:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "Originally posted by foxred03: I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms", 
        "reply": " \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:51:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "LOL", 
        "intTime": 20090518, 
        "postID": 19, 
        "quote": "", 
        "reply": "LOL", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:57:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Whatever happened to making your own arguments? I've made the same argument over and over again on this site. Ya....we know. Don", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "Originally posted by karlhungusjr: quote: Whatever happened to making your own arguments? I've made the same argument over and over again on this site.", 
        "reply": " Ya....we know. Don", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 08:05:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "DON'T MESS WITH THEM THAR (PUBS) CONSERVATIVES!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 21, 
        "quote": "", 
        "reply": "DON'T MESS WITH THEM THAR (PUBS) CONSERVATIVES!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 08:09:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "The saying goes \"the Party of Ideas has become the Party of Stupid\" and it's absolutely true. There is no room for intellectuals in the conservative or Republican camps. They're considered \"elitists\" in this modern era. When it comes to the fixing the economy, somehow the modern conservative has been convinced to dismiss nobel prize winning economist while embracing phoney \"everyday\" plumbers. When it comes to the analyzing foreign policy, somehow the modern conservative has been convinced to dismiss diplomats and statesmen while while embracing the policies of Foxnews and talk radio pundits who've never lived outside the United States and don't speak other languages.", 
        "intTime": 20090518, 
        "postID": 22, 
        "quote": "", 
        "reply": "The saying goes \"the Party of Ideas has become the Party of Stupid\" and it's absolutely true. There is no room for intellectuals in the conservative or Republican camps. They're considered \"elitists\" in this modern era. When it comes to the fixing the economy, somehow the modern conservative has been convinced to dismiss nobel prize winning economist while embracing phoney \"everyday\" plumbers. When it comes to the analyzing foreign policy, somehow the modern conservative has been convinced to dismiss diplomats and statesmen while while embracing the policies of Foxnews and talk radio pundits who've never lived outside the United States and don't speak other languages.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 10:05:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "Boots_"
    }, 
    {
        "content": "You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "intTime": 20090518, 
        "postID": 23, 
        "quote": "", 
        "reply": "You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 11:17:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess. Not trying to argue, but his Official College records have never been released and so no one can claim what you just did. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 24, 
        "quote": "Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "reply": " Not trying to argue, but his Official College records have never been released and so no one can claim what you just did. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 11:41:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week!", 
        "intTime": 20090518, 
        "postID": 25, 
        "quote": "", 
        "reply": "Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week!", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 19:34:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess. Not trying to argue, but his Official College records have never been released and so no one can claim what you just did.[/QUOTE]", 
        "intTime": 20090518, 
        "postID": 26, 
        "quote": "Originally posted by L0A1: quote: Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "reply": " Not trying to argue, but his Official College records have never been released and so no one can claim what you just did.[/QUOTE]", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 19:56:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week! George W. finished in higher in his graduating class at Yale than Kerry did. If that makes W a \"Beavis\" or a \"Butthead\", then what does that make Kerry? We don't even know how president Obama did in school, he won't release his records. Geez, the left won the last election, why all of the hate? Isn't the left supposed to be more tollerant? Obviously, it onl applies if you agree with them, if not, you're open to insult... Democrat=", 
        "intTime": 20090518, 
        "postID": 27, 
        "quote": "Originally posted by Boots_: Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week!", 
        "reply": " George W. finished in higher in his graduating class at Yale than Kerry did. If that makes W a \"Beavis\" or a \"Butthead\", then what does that make Kerry? We don't even know how president Obama did in school, he won't release his records. Geez, the left won the last election, why all of the hate? Isn't the left supposed to be more tollerant? Obviously, it onl applies if you agree with them, if not, you're open to insult... Democrat=", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 20:04:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Wee's the list of leading Democratic presidential contenders: Algore, John F. Kerry, Tom F. Daschle, Joe F. Lieberman, John F. Edwards, Dick F. Gephardt, and Hillary F. R. Clinton. Now ask yourself: What do they all have in common? Answer: Not one of them has any serious business experience. Not one! They're either lawyers or career politicians. None of them has ever served as a governor - which is the chief executive officer of the state. None of them has a Harvard MBA like President Bush. The buck has never stopped at one of their desks. They've never had to attract businesses or jobs to their states by creating a healthy investment and business environment. Yet they're writing laws out there on accounting, and CEOs and corporations, and people applauding! This helps explain their constant disparagement and antipathy toward capitalism, business enterprise, private property, tax cuts and limited government. It helps explain their \"them against us\" rhetoric and their contempt for Bush and Cheney. Neither the president nor the vice president are lawyers or career pols, but both have succeeded in the business world. Compare that to these Democrats, who believe that rights are not natural or God-given, but rather come from government. These Democrats claim to be civil libertarians, yet they oppose free speech in so-called campaign finance reform. They oppose the free exercise of religion. They oppose freedom of association. They oppose gun ownership. They oppose individual rights and states' rights - all of which are explicitly protected in the Bill of Rights, and I mean the Bill of Rights. I don't mean Daschle's stupid investors' bill of rights or the patients' bill of rights or whatever else these clowns come up with to corrupt our language and dilute the real Bill of Rights. These Democrats attack Bush and Cheney, and seek to punish all businesses in the name of rooting out corruption. For all these reasons, they must be stopped. \"Don't go back,\" as I write in Capitalism Does Not Lead to Corruption, Lack of Character Does. Do not allow this little blip in our market to turn you against capitalism. Don't fall for this notion that the pursuit of profit is what leads to corruption. People with no integrity or character are the ones who end up being corrupt. ===================== This was in 2004... but still made some good points. no. not good points at all. The topic is \"the intellectual decline of conservatism\". Not \"Did these cherry picked democrats run a company?\".", 
        "intTime": 20090518, 
        "postID": 28, 
        "quote": "Wee's the list of leading Democratic presidential contenders: Algore, John F. Kerry, Tom F. Daschle, Joe F. Lieberman, John F. Edwards, Dick F. Gephardt, and Hillary F. R. Clinton. Now ask yourself: What do they all have in common? Answer: Not one of them has any serious business experience. Not one! They're either lawyers or career politicians. None of them has ever served as a governor - which is the chief executive officer of the state. None of them has a Harvard MBA like President Bush. The buck has never stopped at one of their desks. They've never had to attract businesses or jobs to their states by creating a healthy investment and business environment. Yet they're writing laws out there on accounting, and CEOs and corporations, and people applauding! This helps explain their constant disparagement and antipathy toward capitalism, business enterprise, private property, tax cuts and limited government. It helps explain their \"them against us\" rhetoric and their contempt for Bush and Cheney. Neither the president nor the vice president are lawyers or career pols, but both have succeeded in the business world. Compare that to these Democrats, who believe that rights are not natural or God-given, but rather come from government. These Democrats claim to be civil libertarians, yet they oppose free speech in so-called campaign finance reform. They oppose the free exercise of religion. They oppose freedom of association. They oppose gun ownership. They oppose individual rights and states' rights - all of which are explicitly protected in the Bill of Rights, and I mean the Bill of Rights. I don't mean Daschle's stupid investors' bill of rights or the patients' bill of rights or whatever else these clowns come up with to corrupt our language and dilute the real Bill of Rights. These Democrats attack Bush and Cheney, and seek to punish all businesses in the name of rooting out corruption. For all these reasons, they must be stopped. \"Don't go back,\" as I write in Capitalism Does Not Lead to Corruption, Lack of Character Does. Do not allow this little blip in our market to turn you against capitalism. Don't fall for this notion that the pursuit of profit is what leads to corruption. People with no integrity or character are the ones who end up being corrupt. ===================== This was in 2004... but still made some good points.", 
        "reply": " no. not good points at all. The topic is \"the intellectual decline of conservatism\". Not \"Did these cherry picked democrats run a company?\".", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 20:21:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"... My theme is the intellectual decline of conservatism, and it is notable that the policies of the new conservatism are powered largely by emotion and religion and have for the most part weak intellectual groundings. That the policies are weak in conception, have largely failed in execution, and are political flops is therefore unsurprising. The major blows to conservatism, culminating in the election and programs of Obama, have been fourfold: the failure of military force to achieve U.S. foreign policy objectives; the inanity of trying to substitute will for intellect, as in the denial of global warming, the use of religious criteria in the selection of public officials, the neglect of management and expertise in government; a continued preoccupation with abortion; and fiscal incontinence in the form of massive budget deficits, the Medicare drug plan, excessive foreign borrowing, and asset-price inflation. By the fall of 2008, the face of the Republican Party had become Sarah Palin and Joe the Plumber. Conservative intellectuals had no party. ...\" \"http://www.becker-posner-blog.com/archives/2009/05/is_the_conserva.html\"", 
        "intTime": 20090518, 
        "postID": 29, 
        "quote": "", 
        "reply": "\"... My theme is the intellectual decline of conservatism, and it is notable that the policies of the new conservatism are powered largely by emotion and religion and have for the most part weak intellectual groundings. That the policies are weak in conception, have largely failed in execution, and are political flops is therefore unsurprising. The major blows to conservatism, culminating in the election and programs of Obama, have been fourfold: the failure of military force to achieve U.S. foreign policy objectives; the inanity of trying to substitute will for intellect, as in the denial of global warming, the use of religious criteria in the selection of public officials, the neglect of management and expertise in government; a continued preoccupation with abortion; and fiscal incontinence in the form of massive budget deficits, the Medicare drug plan, excessive foreign borrowing, and asset-price inflation. By the fall of 2008, the face of the Republican Party had become Sarah Palin and Joe the Plumber. Conservative intellectuals had no party. ...\" \"http://www.becker-posner-blog.com/archives/2009/05/is_the_conserva.html\"", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 02:18:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 30, 
        "quote": "", 
        "reply": "No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 02:54:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it!", 
        "intTime": 20090518, 
        "postID": 31, 
        "quote": "", 
        "reply": "Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it!", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:14:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by 2494906: Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it! There, fixed it for you. Do you notice any familiar faces who are both conservative in ideology and are also GOPers? Conservatism and the GOP, have/will be indelibly linked together. Sorry, that's just the way it is. I can tell you're upset again. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 32, 
        "quote": "Originally posted by 2494906: Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! Hint: Mistake Number One: Confusing conservatism with the Republican party. Conservatism is not a political party; it is political thought that has been around for thousands of years and generally wins the day in the long run. I somehow doubt that your wishful thinking, no matter how good you feel about it, will dispense with it!", 
        "reply": " There, fixed it for you. Do you notice any familiar faces who are both conservative in ideology and are also GOPers? Conservatism and the GOP, have/will be indelibly linked together. Sorry, that's just the way it is. I can tell you're upset again. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:37:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Confusing conservatism with the Republican party. If they are not there, then where are they?", 
        "intTime": 20090518, 
        "postID": 33, 
        "quote": "Confusing conservatism with the Republican party.", 
        "reply": " If they are not there, then where are they?", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:39:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "intTime": 20090518, 
        "postID": 34, 
        "quote": "", 
        "reply": "Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:40:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they? It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat.", 
        "intTime": 20090518, 
        "postID": 35, 
        "quote": "Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they?", 
        "reply": " It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:42:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?! is this directed at me? Is citing an article/opinion/blog somehow wrong now?", 
        "intTime": 20090518, 
        "postID": 36, 
        "quote": "Don't you just love it when some person who already has their mind made up about something which they know nothing about uses someone's else work via cut-n-paste to make a decision which they have already concluded is correct?!", 
        "reply": " is this directed at me? Is citing an article/opinion/blog somehow wrong now?", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:49:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "(Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...)", 
        "intTime": 20090518, 
        "postID": 37, 
        "quote": "", 
        "reply": "(Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...)", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:53:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Whatever happened to making your own arguments? I've made the same argument over and over again on this site.", 
        "intTime": 20090518, 
        "postID": 38, 
        "quote": "Whatever happened to making your own arguments?", 
        "reply": " I've made the same argument over and over again on this site.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 04:56:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 39, 
        "quote": "Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "reply": " Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:03:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them!", 
        "intTime": 20090518, 
        "postID": 40, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption.", 
        "reply": " Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them!", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:17:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by 2494906: (Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...) I could make the very same arguement when people on these boards cut and paste pictures of President Obama, with either a swasitka or a hammer and sickle over his photo. It cuts both ways. It has nothing to do with anyone's intellect, regardless of what side of the isle they are on. Sometimes, at least IMHO, cut-n-pastes break up the monotony on this site. But mind you, that's just a humble opinion. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 41, 
        "quote": "Originally posted by 2494906: (Me shaking my head sadly...) It is pointed at anyone who depends on other people who purport themselves to be some sort of pseudo intellectual to make their point for them. Whatever happened to making your own arguments? Whatever happened to deciding for yourself what you believe? Why do we have to rely on someone else via cut-n-paste? I'm not suggesting that this is always bad. But it should at best support your argument; not attempt to make it for you. It is just so sad when people depends on other people's intellect to make points rather than make it themselves. I just think it's sad when we have reached the point where cut-n-paste and Adobe Photoshop is substituted for intellect (not that I am suggesting that I am the smartest guy in the room! Not at all...)", 
        "reply": " I could make the very same arguement when people on these boards cut and paste pictures of President Obama, with either a swasitka or a hammer and sickle over his photo. It cuts both ways. It has nothing to do with anyone's intellect, regardless of what side of the isle they are on. Sometimes, at least IMHO, cut-n-pastes break up the monotony on this site. But mind you, that's just a humble opinion. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:20:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by 2494906: quote: Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them! What stand by? Change what results and facts? Word game playing are we, or is that just you? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 42, 
        "quote": "Originally posted by 2494906: quote: Originally posted by ProgMod: quote: Originally posted by 2494906: Wow... You must have a LOT of free time! But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. Since you claim I know nothing about this subject I'll still play. 150 years ago, when Abraham Lincoln was president, the political stance he took back then, would have him pegged as a Democrat today. That's a pretty simple deduction if you look back upon the two different parties and their political platforms back then, as compared to now. When Reagan made his famous speech at the Berlin Wall in 1987, and asked the Soviet Premier \"to tear down this wall,\" he also used the term \"liberalism.\" He was refering of course to Soviet totalitarianism, and was suggesting the Soviets take a more \"liberal\" approach to opening up - East-West relations. I had no problem with that premise, and still don't. Your problem is, and you've done this before with me; you peg me as a party loyalist while offering no different points of view. You are wrong in that assumption. Ah... Yes. The good old stand by. Don't like the results or the facts? No problem. Just change them!", 
        "reply": " What stand by? Change what results and facts? Word game playing are we, or is that just you? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:24:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by 2494906: Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well. A war of \"choice\" rather than a war of \"necessity\" is indeed a trademark of totalitarianism, hence \"national socialism,\" hence Iraq-2003. No, Nazism was not a far left leaning (liberal) ideology. It was modeled on the Right Wing extremist movements [Frei-Korps] that existed in Germany immediately after their defeat in WWI. You must know alot about my personal life suggesting I have all this free time you claim I have. I am lucky to make a post every day of the week. But why am I arguing my case? You seem to have all the answers. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 43, 
        "quote": "Originally posted by 2494906: Wow... You must have a LOT of free time! I can always tell when someone is on the last leg of their argument when they start connecting completely unrelated issues (Nazi Germany and some modern conservative which has ABSOLUTELY nothing in common!). Also... This has been debated before and I'll not rehash here; but the Nazi party really was an enigma (no pun!). One can make as strong an argument that they were liberal as they can argue otherwise. But with all of that free time... You managed to miss a couple. Now it is awfully early here, so you'll have to pardon me. But one would include Abraham Lincoln and Ronald Reagan (Opps! I said the RR word!) in that group as well.", 
        "reply": " A war of \"choice\" rather than a war of \"necessity\" is indeed a trademark of totalitarianism, hence \"national socialism,\" hence Iraq-2003. No, Nazism was not a far left leaning (liberal) ideology. It was modeled on the Right Wing extremist movements [Frei-Korps] that existed in Germany immediately after their defeat in WWI. You must know alot about my personal life suggesting I have all this free time you claim I have. I am lucky to make a post every day of the week. But why am I arguing my case? You seem to have all the answers. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 05:43:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Please define \"conservatism\". Is a conservationist a conservative? Most conservationists I know would object at being labelled conservative. And of what brand of conservatism do you refer? Social conservatism? Fiscal? Paleo? Neo? Social conservatism is not a new concept, and has been supported by some of the greatest thinkers in history. Aquinas, Augustine, Lewis, Tolkien, Schaeffer, etc. Undoubtedly, it has also been challenged by some great minds too. Fiscal conservatism has as its modern champion Milton Friedman, who is the yang to Keynes' yin. There is just too much to get into between which model of fiscal philosophy is \"right\". Me...I prefer Friedman's model. It allows for far more individual autonomy regulated by the market and individual responsibility (i.e. moral and ethical restraint). I don't find as much support for neo-conservatism these days. But Paleo-conservatism is starting to gain in popularity. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 44, 
        "quote": "", 
        "reply": "Please define \"conservatism\". Is a conservationist a conservative? Most conservationists I know would object at being labelled conservative. And of what brand of conservatism do you refer? Social conservatism? Fiscal? Paleo? Neo? Social conservatism is not a new concept, and has been supported by some of the greatest thinkers in history. Aquinas, Augustine, Lewis, Tolkien, Schaeffer, etc. Undoubtedly, it has also been challenged by some great minds too. Fiscal conservatism has as its modern champion Milton Friedman, who is the yang to Keynes' yin. There is just too much to get into between which model of fiscal philosophy is \"right\". Me...I prefer Friedman's model. It allows for far more individual autonomy regulated by the market and individual responsibility (i.e. moral and ethical restraint). I don't find as much support for neo-conservatism these days. But Paleo-conservatism is starting to gain in popularity. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:24:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by 2494906: quote: Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they? It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat. Let me be clear, I am not posting on this topic because I agree with some of the earlier posts or to bash conservatives/Republicans. That being said, you seem like the minority of conservatives. Just look at these boards. Anyone who is percieved to be a Democrat, or anything less than a hard core conservative is automatically labeled a \"liberal facist socialist democrat progressive\". Rush Limbaugh, Ann Coulter, and others have pushed people who have some conservative leanings away from the GOP. The hard liners have created a hostile environment for young people and minorities. They refuse to admit that they lost in 2006 and 2008 because the Bush version of conservatism was failing. They blaimed it on everything else. I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms, bottom line. In theory, I am also for lower taxes, a strong military, strong national defense, and good foreign policy. But I haven't seen that happen with today's conservatives/Republicans. They've talked a great game, shouted really, but haven't done much but weaken the economy and mismanage two wars. That's why I came within a hair's breadth of voting for Obama and if I had it to do all over again, today I might actually choose him over John McCain (who is one of my all time favorite politicians). That's because John McCain was forced to appeal to Bush/Cheney-era conservatives, neocons, and was undercut every step of the way by the hard-line \"conservatives\". I wish to hell John McCain had gotten the nomination he rightfully deserved in 2000 and 2004. We'd be a lot better off right now.", 
        "intTime": 20090518, 
        "postID": 45, 
        "quote": "Originally posted by 2494906: quote: Originally posted by SenClaghorn: quote: Confusing conservatism with the Republican party. If they are not there, then where are they? It's really quiet simple... Conservatives will vote their conscience; not a party. Now... Right now in America, that most lines up with the Republican party. But Conservatives have left political parties before. Don't confuse the two. There are democrats that are more conservative than some republicans. I'd vote for them in a heartbeat.", 
        "reply": " Let me be clear, I am not posting on this topic because I agree with some of the earlier posts or to bash conservatives/Republicans. That being said, you seem like the minority of conservatives. Just look at these boards. Anyone who is percieved to be a Democrat, or anything less than a hard core conservative is automatically labeled a \"liberal facist socialist democrat progressive\". Rush Limbaugh, Ann Coulter, and others have pushed people who have some conservative leanings away from the GOP. The hard liners have created a hostile environment for young people and minorities. They refuse to admit that they lost in 2006 and 2008 because the Bush version of conservatism was failing. They blaimed it on everything else. I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms, bottom line. In theory, I am also for lower taxes, a strong military, strong national defense, and good foreign policy. But I haven't seen that happen with today's conservatives/Republicans. They've talked a great game, shouted really, but haven't done much but weaken the economy and mismanage two wars. That's why I came within a hair's breadth of voting for Obama and if I had it to do all over again, today I might actually choose him over John McCain (who is one of my all time favorite politicians). That's because John McCain was forced to appeal to Bush/Cheney-era conservatives, neocons, and was undercut every step of the way by the hard-line \"conservatives\". I wish to hell John McCain had gotten the nomination he rightfully deserved in 2000 and 2004. We'd be a lot better off right now.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:47:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 46, 
        "quote": "Originally posted by foxred03: I am for a strict interpretation of the 2nd Amendment. It gives us the right to bare arms", 
        "reply": " \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:51:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "LOL", 
        "intTime": 20090518, 
        "postID": 47, 
        "quote": "", 
        "reply": "LOL", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 07:57:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Whatever happened to making your own arguments? I've made the same argument over and over again on this site. Ya....we know. Don", 
        "intTime": 20090518, 
        "postID": 48, 
        "quote": "Originally posted by karlhungusjr: quote: Whatever happened to making your own arguments? I've made the same argument over and over again on this site.", 
        "reply": " Ya....we know. Don", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 08:05:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "DON'T MESS WITH THEM THAR (PUBS) CONSERVATIVES!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 49, 
        "quote": "", 
        "reply": "DON'T MESS WITH THEM THAR (PUBS) CONSERVATIVES!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 08:09:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "ProgMod"
    }, 
    {
        "content": "The saying goes \"the Party of Ideas has become the Party of Stupid\" and it's absolutely true. There is no room for intellectuals in the conservative or Republican camps. They're considered \"elitists\" in this modern era. When it comes to the fixing the economy, somehow the modern conservative has been convinced to dismiss nobel prize winning economist while embracing phoney \"everyday\" plumbers. When it comes to the analyzing foreign policy, somehow the modern conservative has been convinced to dismiss diplomats and statesmen while while embracing the policies of Foxnews and talk radio pundits who've never lived outside the United States and don't speak other languages.", 
        "intTime": 20090518, 
        "postID": 50, 
        "quote": "", 
        "reply": "The saying goes \"the Party of Ideas has become the Party of Stupid\" and it's absolutely true. There is no room for intellectuals in the conservative or Republican camps. They're considered \"elitists\" in this modern era. When it comes to the fixing the economy, somehow the modern conservative has been convinced to dismiss nobel prize winning economist while embracing phoney \"everyday\" plumbers. When it comes to the analyzing foreign policy, somehow the modern conservative has been convinced to dismiss diplomats and statesmen while while embracing the policies of Foxnews and talk radio pundits who've never lived outside the United States and don't speak other languages.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 10:05:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "Boots_"
    }, 
    {
        "content": "You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "intTime": 20090518, 
        "postID": 51, 
        "quote": "", 
        "reply": "You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 11:17:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess. Not trying to argue, but his Official College records have never been released and so no one can claim what you just did. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 52, 
        "quote": "Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "reply": " Not trying to argue, but his Official College records have never been released and so no one can claim what you just did. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 11:41:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week!", 
        "intTime": 20090518, 
        "postID": 53, 
        "quote": "", 
        "reply": "Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week!", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 19:34:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess. Not trying to argue, but his Official College records have never been released and so no one can claim what you just did.[/QUOTE]", 
        "intTime": 20090518, 
        "postID": 54, 
        "quote": "Originally posted by L0A1: quote: Originally posted by foxred03: You are sort of picking and choosing as you see fit. McCain never served as governor. Obama if I'm not mistaken graduated Magna Cum Laude from Harvard Law School. The GOP has its fair share of lawyers as well. I dunno, your whole post is a mess.", 
        "reply": " Not trying to argue, but his Official College records have never been released and so no one can claim what you just did.[/QUOTE]", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 19:56:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week! George W. finished in higher in his graduating class at Yale than Kerry did. If that makes W a \"Beavis\" or a \"Butthead\", then what does that make Kerry? We don't even know how president Obama did in school, he won't release his records. Geez, the left won the last election, why all of the hate? Isn't the left supposed to be more tollerant? Obviously, it onl applies if you agree with them, if not, you're open to insult... Democrat=", 
        "intTime": 20090518, 
        "postID": 55, 
        "quote": "Originally posted by Boots_: Anyone else feel that so called \"conservatives\" get a free pass time and time again when it comes to the dumbing down of American politics? If Glenn Beck, Sarah Palin, Rush Limbaugh, Sean Hannity, George W. Bush, Joe the Plumber, Dick Cheney, Ann Coulter, and Michelle Bachmann are true conservatives............. and if John McCain, Colin Powell, Tom Ridge, Arnold Schwarzenegger, Christie Todd Whitman, and Arlen Specter (before 2009) are just Republicans.......... I will take REPUBLICANS over the armada of Beavis and Butthead conservatives any day of the week!", 
        "reply": " George W. finished in higher in his graduating class at Yale than Kerry did. If that makes W a \"Beavis\" or a \"Butthead\", then what does that make Kerry? We don't even know how president Obama did in school, he won't release his records. Geez, the left won the last election, why all of the hate? Isn't the left supposed to be more tollerant? Obviously, it onl applies if you agree with them, if not, you're open to insult... Democrat=", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 20:04:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Wee's the list of leading Democratic presidential contenders: Algore, John F. Kerry, Tom F. Daschle, Joe F. Lieberman, John F. Edwards, Dick F. Gephardt, and Hillary F. R. Clinton. Now ask yourself: What do they all have in common? Answer: Not one of them has any serious business experience. Not one! They're either lawyers or career politicians. None of them has ever served as a governor - which is the chief executive officer of the state. None of them has a Harvard MBA like President Bush. The buck has never stopped at one of their desks. They've never had to attract businesses or jobs to their states by creating a healthy investment and business environment. Yet they're writing laws out there on accounting, and CEOs and corporations, and people applauding! This helps explain their constant disparagement and antipathy toward capitalism, business enterprise, private property, tax cuts and limited government. It helps explain their \"them against us\" rhetoric and their contempt for Bush and Cheney. Neither the president nor the vice president are lawyers or career pols, but both have succeeded in the business world. Compare that to these Democrats, who believe that rights are not natural or God-given, but rather come from government. These Democrats claim to be civil libertarians, yet they oppose free speech in so-called campaign finance reform. They oppose the free exercise of religion. They oppose freedom of association. They oppose gun ownership. They oppose individual rights and states' rights - all of which are explicitly protected in the Bill of Rights, and I mean the Bill of Rights. I don't mean Daschle's stupid investors' bill of rights or the patients' bill of rights or whatever else these clowns come up with to corrupt our language and dilute the real Bill of Rights. These Democrats attack Bush and Cheney, and seek to punish all businesses in the name of rooting out corruption. For all these reasons, they must be stopped. \"Don't go back,\" as I write in Capitalism Does Not Lead to Corruption, Lack of Character Does. Do not allow this little blip in our market to turn you against capitalism. Don't fall for this notion that the pursuit of profit is what leads to corruption. People with no integrity or character are the ones who end up being corrupt. ===================== This was in 2004... but still made some good points. no. not good points at all. The topic is \"the intellectual decline of conservatism\". Not \"Did these cherry picked democrats run a company?\".", 
        "intTime": 20090518, 
        "postID": 56, 
        "quote": "Wee's the list of leading Democratic presidential contenders: Algore, John F. Kerry, Tom F. Daschle, Joe F. Lieberman, John F. Edwards, Dick F. Gephardt, and Hillary F. R. Clinton. Now ask yourself: What do they all have in common? Answer: Not one of them has any serious business experience. Not one! They're either lawyers or career politicians. None of them has ever served as a governor - which is the chief executive officer of the state. None of them has a Harvard MBA like President Bush. The buck has never stopped at one of their desks. They've never had to attract businesses or jobs to their states by creating a healthy investment and business environment. Yet they're writing laws out there on accounting, and CEOs and corporations, and people applauding! This helps explain their constant disparagement and antipathy toward capitalism, business enterprise, private property, tax cuts and limited government. It helps explain their \"them against us\" rhetoric and their contempt for Bush and Cheney. Neither the president nor the vice president are lawyers or career pols, but both have succeeded in the business world. Compare that to these Democrats, who believe that rights are not natural or God-given, but rather come from government. These Democrats claim to be civil libertarians, yet they oppose free speech in so-called campaign finance reform. They oppose the free exercise of religion. They oppose freedom of association. They oppose gun ownership. They oppose individual rights and states' rights - all of which are explicitly protected in the Bill of Rights, and I mean the Bill of Rights. I don't mean Daschle's stupid investors' bill of rights or the patients' bill of rights or whatever else these clowns come up with to corrupt our language and dilute the real Bill of Rights. These Democrats attack Bush and Cheney, and seek to punish all businesses in the name of rooting out corruption. For all these reasons, they must be stopped. \"Don't go back,\" as I write in Capitalism Does Not Lead to Corruption, Lack of Character Does. Do not allow this little blip in our market to turn you against capitalism. Don't fall for this notion that the pursuit of profit is what leads to corruption. People with no integrity or character are the ones who end up being corrupt. ===================== This was in 2004... but still made some good points.", 
        "reply": " no. not good points at all. The topic is \"the intellectual decline of conservatism\". Not \"Did these cherry picked democrats run a company?\".", 
        "threadID": "409192893_4350055322001", 
        "time": "2009-05-18 20:21:00", 
        "title": "\"the intellectual decline of conservatism\"", 
        "userID": "karlhungusjr"
    }
]