[
    {
        "content": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "intTime": 20090519, 
        "postID": 1, 
        "quote": "", 
        "reply": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:40:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 2, 
        "quote": "", 
        "reply": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:41:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "intTime": 20090519, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:47:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest. \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 4, 
        "quote": "Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "reply": " \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:55:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "intTime": 20090519, 
        "postID": 5, 
        "quote": "Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do.", 
        "reply": " I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:02:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "intTime": 20090519, 
        "postID": 6, 
        "quote": "", 
        "reply": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:04:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "intTime": 20090519, 
        "postID": 7, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly. I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "intTime": 20090519, 
        "postID": 8, 
        "quote": "Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "reply": " I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 9, 
        "quote": "", 
        "reply": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:09:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change. Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 10, 
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "reply": " Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:12:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "intTime": 20090519, 
        "postID": 11, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power.", 
        "reply": " 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:29:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it. That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 12, 
        "quote": "Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "reply": " That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:35:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "intTime": 20090519, 
        "postID": 13, 
        "quote": "", 
        "reply": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:59:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "intTime": 20090519, 
        "postID": 14, 
        "quote": "", 
        "reply": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:00:00", 
        "title": "obama's new auto plan", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "intTime": 20090519, 
        "postID": 15, 
        "quote": "", 
        "reply": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:21:00", 
        "title": "obama's new auto plan", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Producing more economical vehicles is not going to keep the price of gas from going up. quote: Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary. I agree.", 
        "intTime": 20090519, 
        "postID": 16, 
        "quote": "Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "reply": "Producing more economical vehicles is not going to keep the price of gas from going up.  I agree.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:16:00", 
        "title": "obama's new auto plan", 
        "userID": "chipsmom"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "intTime": 20090519, 
        "postID": 17, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-.", 
        "reply": " because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:33:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "intTime": 20090519, 
        "postID": 18, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "reply": " Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:57:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "intTime": 20090519, 
        "postID": 19, 
        "quote": "", 
        "reply": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "intTime": 20090519, 
        "postID": 20, 
        "quote": "It is all Bush's fault.", 
        "reply": " Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:41:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "intTime": 20090519, 
        "postID": 21, 
        "quote": "", 
        "reply": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:47:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "intTime": 20090519, 
        "postID": 22, 
        "quote": "Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!!", 
        "reply": " LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "intTime": 20090519, 
        "postID": 23, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "reply": " She hot?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in... Wonder why we don't have enough refineries?", 
        "intTime": 20090519, 
        "postID": 24, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "reply": " Wonder why we don't have enough refineries?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:14:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot? Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "intTime": 20090519, 
        "postID": 25, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "reply": " Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:06:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "intTime": 20090519, 
        "postID": 26, 
        "quote": "", 
        "reply": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:12:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "intTime": 20090519, 
        "postID": 27, 
        "quote": "", 
        "reply": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:44:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved. I am in favor of population control.", 
        "intTime": 20090519, 
        "postID": 28, 
        "quote": "Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "reply": " I am in favor of population control.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "intTime": 20090519, 
        "postID": 29, 
        "quote": "", 
        "reply": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:40:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 30, 
        "quote": "", 
        "reply": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:41:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "intTime": 20090519, 
        "postID": 31, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:47:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest. \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 32, 
        "quote": "Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "reply": " \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:55:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "intTime": 20090519, 
        "postID": 33, 
        "quote": "Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do.", 
        "reply": " I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:02:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "intTime": 20090519, 
        "postID": 34, 
        "quote": "", 
        "reply": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:04:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "intTime": 20090519, 
        "postID": 35, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly. I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "intTime": 20090519, 
        "postID": 36, 
        "quote": "Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "reply": " I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 37, 
        "quote": "", 
        "reply": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:09:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change. Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 38, 
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "reply": " Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:12:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "intTime": 20090519, 
        "postID": 39, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power.", 
        "reply": " 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:29:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it. That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 40, 
        "quote": "Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "reply": " That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:35:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "intTime": 20090519, 
        "postID": 41, 
        "quote": "", 
        "reply": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:59:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "intTime": 20090519, 
        "postID": 42, 
        "quote": "", 
        "reply": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:00:00", 
        "title": "obama's new auto plan", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "intTime": 20090519, 
        "postID": 43, 
        "quote": "", 
        "reply": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:21:00", 
        "title": "obama's new auto plan", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Producing more economical vehicles is not going to keep the price of gas from going up. quote: Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary. I agree.", 
        "intTime": 20090519, 
        "postID": 44, 
        "quote": "Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "reply": "Producing more economical vehicles is not going to keep the price of gas from going up.  I agree.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:16:00", 
        "title": "obama's new auto plan", 
        "userID": "chipsmom"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "intTime": 20090519, 
        "postID": 45, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-.", 
        "reply": " because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:33:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "intTime": 20090519, 
        "postID": 46, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "reply": " Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:57:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "intTime": 20090519, 
        "postID": 47, 
        "quote": "", 
        "reply": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "intTime": 20090519, 
        "postID": 48, 
        "quote": "It is all Bush's fault.", 
        "reply": " Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:41:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "intTime": 20090519, 
        "postID": 49, 
        "quote": "", 
        "reply": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:47:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "intTime": 20090519, 
        "postID": 50, 
        "quote": "Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!!", 
        "reply": " LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "intTime": 20090519, 
        "postID": 51, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "reply": " She hot?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in... Wonder why we don't have enough refineries?", 
        "intTime": 20090519, 
        "postID": 52, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "reply": " Wonder why we don't have enough refineries?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:14:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot? Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "intTime": 20090519, 
        "postID": 53, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "reply": " Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:06:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "intTime": 20090519, 
        "postID": 54, 
        "quote": "", 
        "reply": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:12:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "intTime": 20090519, 
        "postID": 55, 
        "quote": "", 
        "reply": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:44:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved. I am in favor of population control.", 
        "intTime": 20090519, 
        "postID": 56, 
        "quote": "Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "reply": " I am in favor of population control.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "intTime": 20090519, 
        "postID": 57, 
        "quote": "", 
        "reply": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:40:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 58, 
        "quote": "", 
        "reply": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:41:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "intTime": 20090519, 
        "postID": 59, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:47:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest. \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 60, 
        "quote": "Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "reply": " \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:55:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "intTime": 20090519, 
        "postID": 61, 
        "quote": "Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do.", 
        "reply": " I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:02:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "intTime": 20090519, 
        "postID": 62, 
        "quote": "", 
        "reply": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:04:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "intTime": 20090519, 
        "postID": 63, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly. I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "intTime": 20090519, 
        "postID": 64, 
        "quote": "Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "reply": " I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 65, 
        "quote": "", 
        "reply": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:09:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change. Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 66, 
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "reply": " Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:12:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "intTime": 20090519, 
        "postID": 67, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power.", 
        "reply": " 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:29:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it. That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 68, 
        "quote": "Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "reply": " That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:35:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "intTime": 20090519, 
        "postID": 69, 
        "quote": "", 
        "reply": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:59:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "intTime": 20090519, 
        "postID": 70, 
        "quote": "", 
        "reply": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:00:00", 
        "title": "obama's new auto plan", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "intTime": 20090519, 
        "postID": 71, 
        "quote": "", 
        "reply": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:21:00", 
        "title": "obama's new auto plan", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Producing more economical vehicles is not going to keep the price of gas from going up. quote: Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary. I agree.", 
        "intTime": 20090519, 
        "postID": 72, 
        "quote": "Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "reply": "Producing more economical vehicles is not going to keep the price of gas from going up.  I agree.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:16:00", 
        "title": "obama's new auto plan", 
        "userID": "chipsmom"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "intTime": 20090519, 
        "postID": 73, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-.", 
        "reply": " because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:33:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "intTime": 20090519, 
        "postID": 74, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "reply": " Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:57:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "intTime": 20090519, 
        "postID": 75, 
        "quote": "", 
        "reply": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "intTime": 20090519, 
        "postID": 76, 
        "quote": "It is all Bush's fault.", 
        "reply": " Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:41:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "intTime": 20090519, 
        "postID": 77, 
        "quote": "", 
        "reply": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:47:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "intTime": 20090519, 
        "postID": 78, 
        "quote": "Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!!", 
        "reply": " LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "intTime": 20090519, 
        "postID": 79, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "reply": " She hot?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in... Wonder why we don't have enough refineries?", 
        "intTime": 20090519, 
        "postID": 80, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "reply": " Wonder why we don't have enough refineries?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:14:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot? Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "intTime": 20090519, 
        "postID": 81, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "reply": " Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:06:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "intTime": 20090519, 
        "postID": 82, 
        "quote": "", 
        "reply": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:12:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "intTime": 20090519, 
        "postID": 83, 
        "quote": "", 
        "reply": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:44:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved. I am in favor of population control.", 
        "intTime": 20090519, 
        "postID": 84, 
        "quote": "Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "reply": " I am in favor of population control.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "intTime": 20090519, 
        "postID": 85, 
        "quote": "", 
        "reply": "I was just reading in the news that the obama administration has just signed into effect for the auto makers to produce cars and light trucks to have 30% better fuel mileage by the year 2016. It would save about 1 and a half million barrels of oil and cut emission greatly. Now I have to say, that I agree with this plan. No, I have not converted to the dark side, because I do not agree with all of the other government control that obama seeks. And I do not beleive in \"sharing the wealth\". I do beleive if the GOP wants to survive, then they should implement policies such as these, so the American people aren't strangled by big business (mainly big oil). However, I do not believe in taking away from a hard working family and giving to the welfare of someone who is just too sorry to work. Anyhow, what are you guys take on this plan?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:40:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 86, 
        "quote": "", 
        "reply": "Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:41:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "intTime": 20090519, 
        "postID": 87, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:47:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest. \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 88, 
        "quote": "Originally posted by mnoble1066: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. How do you figure that? The reason that they went bankrupt before is because they continued to produce gas guzzling cars and trucks and didn't develope any fuel effecient vehicles when gas prices rose to $5.00 a gallon. Note that gas prices are on the rise again, if they sell fuel efficient vehicles, people will be more willing to invest.", 
        "reply": " \\Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 09:55:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do. I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "intTime": 20090519, 
        "postID": 89, 
        "quote": "Because I don't think they can make those standards. That simple. If they could, I believe they would have already, after all, that's why other companies have excelled, they get better MPG then most american automakers do.", 
        "reply": " I'm not agreeing or disagreeing with you, We'll just have to see how this unfolds. You may be right. Notice that the date is 2016, obama will not be in office then, but while he's in, he'll thump his chest on how he put this policy into effect and reap the popularity of it, and when he's gone either nothing will happen or the price of cars and trucks will go up or both.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:02:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "intTime": 20090519, 
        "postID": 90, 
        "quote": "", 
        "reply": "The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:04:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "intTime": 20090519, 
        "postID": 91, 
        "quote": "Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade.", 
        "reply": " Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly. I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "intTime": 20090519, 
        "postID": 92, 
        "quote": "Originally posted by psychoABN: The president just said that, although the cars will cost more, the savings in mileage will cover the increase in price over three years. I'd like to see the math. Is he using current gas prices to calculate, or has a potential increase in the price per gallon been figured in. During the election, he said that he was okay with $4.00 per gallon prices, even higher, at the pump, but that the increase at the time had happened too suddenly.", 
        "reply": " I can assure you that the American people are NOT OK with $4.00 a gallon gas prices.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:06:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 93, 
        "quote": "", 
        "reply": "Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:09:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change. Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 94, 
        "quote": "Originally posted by rayld2: quote: Originally posted by L0A1: Can you say more BANKRUPTCY!!. If they can keep up with these new cafe standards, I'll be shocked. Then comes Cap and Trade. Amazing, I thought you believed in states rights. 12 or 13 states have been trying to put these standards in place for years and the REPUBLICANS have stopped them. The main industry complaint has aways been they did not want 50 different standards so they actually signed off on this change.", 
        "reply": " Whats my belief in states rights got to do with the fact that I doubt they can meet the standards in time. Not without industrial espionage or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:12:00", 
        "title": "obama's new auto plan", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power. 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "intTime": 20090519, 
        "postID": 95, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? So now the government is going to take away our right to choose what type of vehicle we want to drive by imposing these outrageous cafe standards on the auto industry just to keep the earth first PETA idiots happy. Why stop at 42 mpg? How about 52 mpg, or 62 mpg? The government isn't interested in how much oil we use, or \"gullible warming\" as much as they are interested in confiscating our hard-earned dollars so they can grow government and increase their power.", 
        "reply": " 62 mpg doesn't sound bad. But I'm now not believing this will help us out any, just drive the price of cars and trucks up with no improvement in mileage. And as you say, more government control. BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:29:00", 
        "title": "obama's new auto plan", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it. That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 96, 
        "quote": "Originally posted by mnoble1066: BUT, if they can improve mileage by 30% or better, then I'm all for it.", 
        "reply": " That sounds good, until the state and federal government starts losing money on gas taxes and have to raise the gas tax to keep their coffers full. \"The World's Finest\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:35:00", 
        "title": "obama's new auto plan", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "intTime": 20090519, 
        "postID": 97, 
        "quote": "", 
        "reply": "I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 10:59:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "intTime": 20090519, 
        "postID": 98, 
        "quote": "", 
        "reply": "cAN YOU SAY \"Law of Diminishing returns.\" Can you say\" Captian, ye canna' change the Laws of Physics!!!!\" Can you listen? \"\"http://www.youtube.com/watch?v=pz2eCFoafXk", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:00:00", 
        "title": "obama's new auto plan", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "intTime": 20090519, 
        "postID": 99, 
        "quote": "", 
        "reply": "Welcome to the new Socialcratic Party... In five yrs we'll be driving 50hp junk-buckets like they do in Russia... Why do we even have trucks. The gov should build them and simply rent them to us when we need them. That way they can monitor Gores bank account - I mean carbon Dollars... Once the housing situation calms down the gov should simply build affordable housing. This way they could strategically place the houses close to the gov designed commerce centers where everyone works together as a community. Don't have much need for money - no need for fancy clothes, ipods, cell phones can be leased from the gov. this way they can keep track of usage. Did you hear about the tax plan...? Obama is creating a Health-Care tax plan to TAX our benefits...? The snack tax, soda tax, another cigarette tax hike, gas tax, and a WHOPPING energy tax for electric, yep, he gave 95% of Americans 13-bucks - and is putting his hand in our pockets for a FEW THOUSAND... Nice to be middle clase isn't it... no new taxes - middle class will NOT pay a DIME... right, the soda tax is 7-cents PER BOTTLE - anyone drink more than ONE soda per year...? Let's not forget about the Luxury tax - and the good ole DEATH TAX... didn't it say somewhere in the constitution that congress is not allowed to collect taxes... I wonder why?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 11:21:00", 
        "title": "obama's new auto plan", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Producing more economical vehicles is not going to keep the price of gas from going up. quote: Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary. I agree.", 
        "intTime": 20090519, 
        "postID": 100, 
        "quote": "Originally posted by psychoABN: I just heard an interview with one of the editors of Car and Driver. He said that this plan isn't practical. He was emphasizing the safety issues with the smaller cars, pretty scary.", 
        "reply": "Producing more economical vehicles is not going to keep the price of gas from going up.  I agree.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:16:00", 
        "title": "obama's new auto plan", 
        "userID": "chipsmom"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "intTime": 20090519, 
        "postID": 101, 
        "quote": "Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-.", 
        "reply": " because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:33:00", 
        "title": "obama's new auto plan", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "intTime": 20090519, 
        "postID": 102, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives.", 
        "reply": " Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 13:57:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "intTime": 20090519, 
        "postID": 103, 
        "quote": "", 
        "reply": "I've got my eye on China. Their new car company called BYD is looking mighty good. I saw a few of their cars on NBC news last night and I was impressed. They are already ahead of us in electric cars and most of their cars on the road in China today get great miles per gallon. I'm just so glad Obama is doing something about our auto crisis now. It is all Bush's fault.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "intTime": 20090519, 
        "postID": 104, 
        "quote": "It is all Bush's fault.", 
        "reply": " Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! Sorry, I couldn't resist....", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:41:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "intTime": 20090519, 
        "postID": 105, 
        "quote": "", 
        "reply": "Oil is a finite substance, we've got to let it go. We need to find a way to lower the cost of Nuclear Power plants, we are going to need alot more electricity to power our new cars... Clean coal is a pipe dream, but wind turbines will be significant players...", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:47:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "intTime": 20090519, 
        "postID": 106, 
        "quote": "Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!!", 
        "reply": " LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 14:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "intTime": 20090519, 
        "postID": 107, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\"", 
        "reply": " She hot?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:13:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in... Wonder why we don't have enough refineries?", 
        "intTime": 20090519, 
        "postID": 108, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by rayld2: quote: Originally posted by Kegler300: Why not just drill here, drill now, and pay less? -snap-. because the CLAIMS that we could actually have much effect on the price by doing that are FALSE. They are based on way beyond best case estimates of what is available and on using hydrocarbons in areas were the tech to get at it is just being developed and/or would create MORE problems at higher expense than many alternatives. Oh really??? Here in Texas, they're drilling where they are allowed to, and hitting oil. It's there, we just need to drill about ten times more than we are. We could be energy independent, if only the Democrat/Greens would get out of the way. Increased drilling, build a few more refineries, now that would be job creation, all across the board. And the money it would bring in...", 
        "reply": " Wonder why we don't have enough refineries?", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 15:14:00", 
        "title": "obama's new auto plan", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot? Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "intTime": 20090519, 
        "postID": 109, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by psychoABN: quote: It is all Bush's fault. Yes, he is responsible for all EVIL in the world. Everytime his name is spoken, a puppy dies....BUSH, BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH,BUSH, BUSH, BUSH, BUSH, BUSH, BUSH....Dang, I guess I'm EVIL, too! MOOOOOWAAAAHAAHAAHAAHAA!!!!!!!!! LOL...This swedish girl in one of my courses looked at me as if though I were a Nazi SS guard when I said, \"Bush might not have made the best decisions, but he proved America is not weak and won't be pushed around.\" She hot?", 
        "reply": " Hell ya About 4 months ago she told me, \"I'm really not sure how the American way works...\" and recently she said, \"Well i'm not going back to sweden to finish my law degree, I'm having too much fun here..\" I told her, \"You're now an American, you're making decisions with everything except your head.\" LOL....She laughed too. This message has been edited. Last edited by: Irwin_R_Schyster, Tue 19 May 2009 04:30 PM", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:06:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "intTime": 20090519, 
        "postID": 110, 
        "quote": "", 
        "reply": "The one thing that all of America should keep in mind when they look at this new auto plan is who was the first state that pushed for this plan? California. Now look at the situation California is in. They are bankrupt. It sounds like a good idea but anything coming out of that state is a red flag in my book.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:12:00", 
        "title": "obama's new auto plan", 
        "userID": "Duster6"
    }, 
    {
        "content": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "intTime": 20090519, 
        "postID": 111, 
        "quote": "", 
        "reply": "I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:44:00", 
        "title": "obama's new auto plan", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved. I am in favor of population control.", 
        "intTime": 20090519, 
        "postID": 112, 
        "quote": "Originally posted by psychoABN: I just saw the crash tests of the Smart Car on TV, all I can say is HOLY $#IT!!!!!!! I swear that the plan is population control. Infanticide is being promoted, as Nancy Pelosi put it, to help the economy...Rationed health care so that old folks die sooner from lack of medical treatment, and now, the rest of us will be covered with all of the fatalities that will result from these new, fuel efficient, much smaller and lighter death traps. Well, at least the Earth will be saved.", 
        "reply": " I am in favor of population control.", 
        "threadID": "409192893_1380056322001", 
        "time": "2009-05-19 16:49:00", 
        "title": "obama's new auto plan", 
        "userID": "Irwin_R_Schyster"
    }
]