[
    {
        "content": "As Americans forces draw down, the lid that has been on the violence in Iraq that was never really dealt with by the Bush Administration will start to loosen. Reuters, March 28, 2009 “Baghdad security spokesman Qassim al-Moussawi said the firefight with the guards, who have been sponsored by the U.S. military to fight al Qaeda, started after Iraqi forces arrested their leader, Adil al-Mashhadani, and at least one of his men, on terrorism charges in the central district of al-Fadhil. \"They had a judicial warrant,\" Moussawi said, adding that seven Iraqi soldiers had been wounded in the clashes. “A Reuters reporter heard heavy gunfire near the scene and saw Iraqi army snipers on roofs all around the neighbourhood. He said Iraqi forces had ringed the area but the streets were largely controlled by the Sunni Arab fighters. A police source said they had also captured five Iraqi soldiers in the area's narrow alleyways during the clashes. \"One of them is an officer. Negotiations are now going on between the military forces and the Majalis al-Sahwa,\" the source said, referring to Arabic name for \"Awakening Councils,\" the units led mostly by Sunni Arab sheikhs and including many former insurgents who rose up against al Qaeda in 2006.” “\"What happened to Mashhadani was just revenge. Now it is obvious to us that the government is insincere in its talk of reconciliation,\" said a guard who witnessed the battle. The guard declined to be named, saying: \"After this, we can't trust anyone anymore.\" An Iraqi interior ministry source said U.S. forces were on the parameter of the area for back-up. The U.S. military did not immediately respond to requests for confirmation of this.” Both Shia dominated government forces and Sunni Awakening militia have been trained by American troops. When they start fighting each other, who do the American’s fight against?", 
        "intTime": 20090329, 
        "postID": 1, 
        "quote": "", 
        "reply": "As Americans forces draw down, the lid that has been on the violence in Iraq that was never really dealt with by the Bush Administration will start to loosen. Reuters, March 28, 2009 “Baghdad security spokesman Qassim al-Moussawi said the firefight with the guards, who have been sponsored by the U.S. military to fight al Qaeda, started after Iraqi forces arrested their leader, Adil al-Mashhadani, and at least one of his men, on terrorism charges in the central district of al-Fadhil. \"They had a judicial warrant,\" Moussawi said, adding that seven Iraqi soldiers had been wounded in the clashes. “A Reuters reporter heard heavy gunfire near the scene and saw Iraqi army snipers on roofs all around the neighbourhood. He said Iraqi forces had ringed the area but the streets were largely controlled by the Sunni Arab fighters. A police source said they had also captured five Iraqi soldiers in the area's narrow alleyways during the clashes. \"One of them is an officer. Negotiations are now going on between the military forces and the Majalis al-Sahwa,\" the source said, referring to Arabic name for \"Awakening Councils,\" the units led mostly by Sunni Arab sheikhs and including many former insurgents who rose up against al Qaeda in 2006.” “\"What happened to Mashhadani was just revenge. Now it is obvious to us that the government is insincere in its talk of reconciliation,\" said a guard who witnessed the battle. The guard declined to be named, saying: \"After this, we can't trust anyone anymore.\" An Iraqi interior ministry source said U.S. forces were on the parameter of the area for back-up. The U.S. military did not immediately respond to requests for confirmation of this.” Both Shia dominated government forces and Sunni Awakening militia have been trained by American troops. When they start fighting each other, who do the American’s fight against?", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-29 06:59:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "xerello"
    }, 
    {
        "content": "American troops stand back and should not get involved in this type of conflict...it is their country let them work it out, or die doing it. Either way it will be worked out. We have extended our hands out there for sometime now it is going to be up to the locals.", 
        "intTime": 20090329, 
        "postID": 2, 
        "quote": "", 
        "reply": "American troops stand back and should not get involved in this type of conflict...it is their country let them work it out, or die doing it. Either way it will be worked out. We have extended our hands out there for sometime now it is going to be up to the locals.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-29 09:43:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: American troops stand back and should not get involved in this type of conflict...it is their country let them work it out, or die doing it. Either way it will be worked out. We have extended our hands out there for sometime now it is going to be up to the locals. What he said. Taking sides would not be smart at this juncture. They're fairly evenly matched. The Sunnis have a long history of control of Iraq, including the experienced administrators, financiers, and bureaucrats from the Baathist days. The Shias have them by sheer numbers. Let it be.", 
        "intTime": 20090329, 
        "postID": 3, 
        "quote": "Originally posted by dragonflyer04: American troops stand back and should not get involved in this type of conflict...it is their country let them work it out, or die doing it. Either way it will be worked out. We have extended our hands out there for sometime now it is going to be up to the locals.", 
        "reply": " What he said. Taking sides would not be smart at this juncture. They're fairly evenly matched. The Sunnis have a long history of control of Iraq, including the experienced administrators, financiers, and bureaucrats from the Baathist days. The Shias have them by sheer numbers. Let it be.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-29 10:17:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "Ruanne"
    }, 
    {
        "content": "This is a conundrum and quite a sticky wicket. If civil war breaks out in Iraq again, which it very well may, and we stand aside and do nothing, what's been gained in the past several years? How will the outcome be any different than had we walked away from it when they were fighting before? What's the justification for the American lives lost? On the other hand, if we take sides, which is also a real possibility, whose side do we take and how deeply do we become involved in fighting other Iraqi's? What would be the effects in the region if we side with the Shia government? (which would be our only choice) Wouldn't that essentially make us fighting for Iranian dominance and pizz of the Saudi's? Remember, the Saudi's have already promised to send aid to the Sunni if it comes to that. This is bad, really bad. The deep divisions in Iraq which have been swept under the rug since the \"surge,\" may now be surfacing again, threatening everything we may have achieved since the day we marched into Baghdad.", 
        "intTime": 20090329, 
        "postID": 4, 
        "quote": "", 
        "reply": "This is a conundrum and quite a sticky wicket. If civil war breaks out in Iraq again, which it very well may, and we stand aside and do nothing, what's been gained in the past several years? How will the outcome be any different than had we walked away from it when they were fighting before? What's the justification for the American lives lost? On the other hand, if we take sides, which is also a real possibility, whose side do we take and how deeply do we become involved in fighting other Iraqi's? What would be the effects in the region if we side with the Shia government? (which would be our only choice) Wouldn't that essentially make us fighting for Iranian dominance and pizz of the Saudi's? Remember, the Saudi's have already promised to send aid to the Sunni if it comes to that. This is bad, really bad. The deep divisions in Iraq which have been swept under the rug since the \"surge,\" may now be surfacing again, threatening everything we may have achieved since the day we marched into Baghdad.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-29 10:38:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "stillkit"
    }, 
    {
        "content": "http://forums.military.com/eve/forums/a/tpc/f/672198221...551001#8130003551001 Posted Mon 12 November 2007 07:06 AM by Xerello >http://www.guardian.co.uk/print/0,,331225411-110878,00.html “A senior Sunni sheikh, whose tribe is joining the new alliance with the Americans against al-Qaida, told me in Beirut that it was a simple equation for him. \"It's just a way to get arms, and to be a legalised security force to be able to stand against Shia militias and to prevent the Iraqi army and police from entering their areas,\" he said. \"The Americans lost hope with an Iraqi government that is both sectarian and dominated by militias, so they are paying for locals to fight al-Qaida. It will create a series of warlords. ‘ It's like someone who brought cats to fight rats, found himself with too many cats and brought dogs to fight the cats. Now they need elephants. ’\" “Back at Abu Abed's HQ, the men were put into cells. Men in US-supplied blue uniforms were being jailed by men in US-supplied green uniforms.” Americans are training “former insurgents” Sunni to be trustworthy policemen. The Shia dominated central government does not support this new police force because the Shia Iraqi leaders know that you can’t trust people who have killed American and Shia Iraqis. An enemy trained or just motivated enough to fight against American/Iraqi forces once, could easily be ordered or motivated to do so again. The next attack may be five or ten years in the future when we really have overstayed our welcome in Iraq. Training and arming people who have great potential to fight you in the future is really not a forward thinking plan. It is a political plan with short term, election gain and long term disaster. In time, training and arming the Sunni will be seen as a bigger mistake than the de-Baathification decision made by the White House in 2003.", 
        "intTime": 20090329, 
        "postID": 5, 
        "quote": "", 
        "reply": "http://forums.military.com/eve/forums/a/tpc/f/672198221...551001#8130003551001 Posted Mon 12 November 2007 07:06 AM by Xerello >http://www.guardian.co.uk/print/0,,331225411-110878,00.html “A senior Sunni sheikh, whose tribe is joining the new alliance with the Americans against al-Qaida, told me in Beirut that it was a simple equation for him. \"It's just a way to get arms, and to be a legalised security force to be able to stand against Shia militias and to prevent the Iraqi army and police from entering their areas,\" he said. \"The Americans lost hope with an Iraqi government that is both sectarian and dominated by militias, so they are paying for locals to fight al-Qaida. It will create a series of warlords. ‘ It's like someone who brought cats to fight rats, found himself with too many cats and brought dogs to fight the cats. Now they need elephants. ’\" “Back at Abu Abed's HQ, the men were put into cells. Men in US-supplied blue uniforms were being jailed by men in US-supplied green uniforms.” Americans are training “former insurgents” Sunni to be trustworthy policemen. The Shia dominated central government does not support this new police force because the Shia Iraqi leaders know that you can’t trust people who have killed American and Shia Iraqis. An enemy trained or just motivated enough to fight against American/Iraqi forces once, could easily be ordered or motivated to do so again. The next attack may be five or ten years in the future when we really have overstayed our welcome in Iraq. Training and arming people who have great potential to fight you in the future is really not a forward thinking plan. It is a political plan with short term, election gain and long term disaster. In time, training and arming the Sunni will be seen as a bigger mistake than the de-Baathification decision made by the White House in 2003.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-29 12:53:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "xerello"
    }, 
    {
        "content": "Ya'll are making the assumption that those that control America's foreign policy (the cfr) didn't intend for this situation: (divide and conquer)", 
        "intTime": 20090329, 
        "postID": 6, 
        "quote": "", 
        "reply": "Ya'll are making the assumption that those that control America's foreign policy (the cfr) didn't intend for this situation: (divide and conquer)", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-29 13:17:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Ya'll are making the assumption that those that control America's foreign policy (the cfr) didn't intend for this situation: (divide and conquer) the cfr? I have my own conspiracy theories on who got us into this mess in the first place. Namely, the Iranians. But then again, I really have spent too much time in the past few years with Iraqis, with whom that is a popular conspiracy theory.", 
        "intTime": 20090329, 
        "postID": 7, 
        "quote": "Originally posted by soscorpio: Ya'll are making the assumption that those that control America's foreign policy (the cfr) didn't intend for this situation: (divide and conquer)", 
        "reply": " the cfr? I have my own conspiracy theories on who got us into this mess in the first place. Namely, the Iranians. But then again, I really have spent too much time in the past few years with Iraqis, with whom that is a popular conspiracy theory.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-29 19:39:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "Ruanne"
    }, 
    {
        "content": "So the Americans had to back up the Shia dominated government troops and fight against the Sunni \"Awakening\" who were trained, armed and paid by American forces. So not that training and those weapons are being used to fight against American forces. Shoulda seen that coming. \"BAGHDAD, March 29 -- A new and potentially worrisome fight for power and control has broken out in Baghdad as the United States prepares to pull combat troops out of Iraq next year. The struggle, which played out in fierce weekend clashes, pits two vital American allies against each other. On Sunday, Iraqi soldiers backed by U.S. combat helicopters and American troops swept into a central Baghdad neighborhood, arresting U.S.-backed Sunni fighters in an effort to clamp down on a two-day uprising that challenged the Iraqi government's authority and its efforts to pacify the capital. \"Many leaders of the Awakening, mostly former Sunni insurgents who joined hands with U.S. forces to fight the insurgent group al-Qaeda in Iraq, have long had a contentious relationship with Iraq's Shiite-led government. But the weekend battles have sparked fresh frustration and mistrust of both the U.S. military and Iraq's mostly Shiite security forces, according to interviews with Awakening leaders across the country. \"The situation is now very fragile, and no Awakening member would remain silent over this injustice,\" said Saad Abbas al-Luhaibi, leader of an Awakening group in Anbar province. The tensions raise concerns that uprisings could erupt in other Awakening-controlled areas -- or that many Awakening fighters could return to the insurgency, allowing al-Qaeda in Iraq to fill the vacuum in Sunni areas. The clashes also opened a window onto the new military relationship emerging between the United States and Iraq, as well as the struggles Iraq's government will probably face as it takes more control over security.\"", 
        "intTime": 20090330, 
        "postID": 8, 
        "quote": "", 
        "reply": "So the Americans had to back up the Shia dominated government troops and fight against the Sunni \"Awakening\" who were trained, armed and paid by American forces. So not that training and those weapons are being used to fight against American forces. Shoulda seen that coming. \"BAGHDAD, March 29 -- A new and potentially worrisome fight for power and control has broken out in Baghdad as the United States prepares to pull combat troops out of Iraq next year. The struggle, which played out in fierce weekend clashes, pits two vital American allies against each other. On Sunday, Iraqi soldiers backed by U.S. combat helicopters and American troops swept into a central Baghdad neighborhood, arresting U.S.-backed Sunni fighters in an effort to clamp down on a two-day uprising that challenged the Iraqi government's authority and its efforts to pacify the capital. \"Many leaders of the Awakening, mostly former Sunni insurgents who joined hands with U.S. forces to fight the insurgent group al-Qaeda in Iraq, have long had a contentious relationship with Iraq's Shiite-led government. But the weekend battles have sparked fresh frustration and mistrust of both the U.S. military and Iraq's mostly Shiite security forces, according to interviews with Awakening leaders across the country. \"The situation is now very fragile, and no Awakening member would remain silent over this injustice,\" said Saad Abbas al-Luhaibi, leader of an Awakening group in Anbar province. The tensions raise concerns that uprisings could erupt in other Awakening-controlled areas -- or that many Awakening fighters could return to the insurgency, allowing al-Qaeda in Iraq to fill the vacuum in Sunni areas. The clashes also opened a window onto the new military relationship emerging between the United States and Iraq, as well as the struggles Iraq's government will probably face as it takes more control over security.\"", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-03-30 10:44:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: “Reporting from Baghdad and Samarra, Iraq -- Iraqi police have arrested a senior member of the U.S.-allied Awakening movement in Salahuddin province, the American military said Sunday, continuing a crackdown that has left many of the Sunni Muslim paramilitary fighters seething with anger.” “Iraqi authorities have said Jibouri is a former senior Al Qaeda in Iraq leader who is being held in connection with \"terrorism\" committed before he joined the Awakening. But movement leaders complain that, under the terms of the deal they reached when they agreed to team up with the Americans against the insurgency, they are supposed to be immune from prosecution for earlier actions.” \"We made an agreement with the Americans, before the formation of the Awakening, to give immunity to all the fighters who have participated in the resistance,\" said Sheik Khalid Filayah, the Awakening leader in Samarra. \"Therefore they don't have the right to arrest anybody who may have been involved in operations against the Americans before the cease-fire.\" The Iraqi government, however, has given no such promise of immunity. The U.S. military has not always been informed by the Iraqis about the arrests of its allies. In this instance, U.S. military advisors were present when Iraqi police officers served the arrest warrant, but they do not know why Jibouri was arrested, said Maj. Derrick Cheng, a spokesman for U.S. forces in northern Iraq.” The Sunni have allied themselves with the American military, never with the Iraqi government. Now the Shia dominated Iraqi government is breaking the agreements that the Americans made. The Shia and Sunni may just work things out politically. Or The Shia and Sunni will go back to killing each other.", 
        "intTime": 20090505, 
        "postID": 9, 
        "quote": "“Reporting from Baghdad and Samarra, Iraq -- Iraqi police have arrested a senior member of the U.S.-allied Awakening movement in Salahuddin province, the American military said Sunday, continuing a crackdown that has left many of the Sunni Muslim paramilitary fighters seething with anger.” “Iraqi authorities have said Jibouri is a former senior Al Qaeda in Iraq leader who is being held in connection with \"terrorism\" committed before he joined the Awakening. But movement leaders complain that, under the terms of the deal they reached when they agreed to team up with the Americans against the insurgency, they are supposed to be immune from prosecution for earlier actions.” \"We made an agreement with the Americans, before the formation of the Awakening, to give immunity to all the fighters who have participated in the resistance,\" said Sheik Khalid Filayah, the Awakening leader in Samarra. \"Therefore they don't have the right to arrest anybody who may have been involved in operations against the Americans before the cease-fire.\" The Iraqi government, however, has given no such promise of immunity. The U.S. military has not always been informed by the Iraqis about the arrests of its allies. In this instance, U.S. military advisors were present when Iraqi police officers served the arrest warrant, but they do not know why Jibouri was arrested, said Maj. Derrick Cheng, a spokesman for U.S. forces in northern Iraq.”", 
        "reply": " The Sunni have allied themselves with the American military, never with the Iraqi government. Now the Shia dominated Iraqi government is breaking the agreements that the Americans made. The Shia and Sunni may just work things out politically. Or The Shia and Sunni will go back to killing each other.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-05-05 09:20:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "xerello"
    }, 
    {
        "content": "Blame Bush for Sunnia Shia violence...ya that makes sense. Dont allow 2000 years of history to influnce your partisan, party line, views... There is no \"dealing\" with Sunni, Shia violence. What, we're going to mediate 2000 years of hate and blood? Ya, lets all sit down and sing songs around the camp fire.. oh wait thats O's plan.", 
        "intTime": 20090505, 
        "postID": 10, 
        "quote": "", 
        "reply": "Blame Bush for Sunnia Shia violence...ya that makes sense. Dont allow 2000 years of history to influnce your partisan, party line, views... There is no \"dealing\" with Sunni, Shia violence. What, we're going to mediate 2000 years of hate and blood? Ya, lets all sit down and sing songs around the camp fire.. oh wait thats O's plan.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-05-05 15:14:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "threerings"
    }, 
    {
        "content": "If you are going to deal with it, regardless of what contemporary personalities were involved, you'll probably have to do it like the Brits in the 1920s and later Sadam did... with out and out brutal violence... and it will never end. Time to get out of the way and let the Iraqis duke it out among themselves. You can't save people from themselves and a long tradition of finding excuses to kill each other 'in the name of a god'. This message has been edited. Last edited by: reducetension, Tue 05 May 2009 04:43 PM", 
        "intTime": 20090505, 
        "postID": 11, 
        "quote": "", 
        "reply": "If you are going to deal with it, regardless of what contemporary personalities were involved, you'll probably have to do it like the Brits in the 1920s and later Sadam did... with out and out brutal violence... and it will never end. Time to get out of the way and let the Iraqis duke it out among themselves. You can't save people from themselves and a long tradition of finding excuses to kill each other 'in the name of a god'. This message has been edited. Last edited by: reducetension, Tue 05 May 2009 04:43 PM", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-05-05 16:22:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "reducetension"
    }, 
    {
        "content": "How's about we let the country divide into 3 seperate regions as it should have done all along??? Thank you Great Britain and others for creating a \"country\" out of 3 seperate tribes that hate one another.", 
        "intTime": 20090505, 
        "postID": 12, 
        "quote": "", 
        "reply": "How's about we let the country divide into 3 seperate regions as it should have done all along??? Thank you Great Britain and others for creating a \"country\" out of 3 seperate tribes that hate one another.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-05-05 23:53:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: Originally posted by threerings: Blame Bush for Sunnia Shia violence...ya that makes sense. Dont allow 2000 years of history to influnce your partisan, party line, views... There is no \"dealing\" with Sunni, Shia violence. What, we're going to mediate 2000 years of hate and blood? Ya, lets all sit down and sing songs around the camp fire.. oh wait thats O's plan. Don’t see where anyone blamed President Bush for the Sunni-Shia violence. It is true that he never dealt with the causes of the violence in Iraq. The “surge” plan was just to bring down the violence from when it was out of control in 2006. The “surge” allowed bushies to say “we are succeeding in Iraq” while ignoring the real problems that caused the violence to go out of control in the first place. I know that the there is nothing the United States can do to deal with the 1,350 year split between the Sunni and Shia. Then there is the Kurd-Arab feud. You know these people are going to keep killing each other no matter what Americans do. I know that these generational feuds will not stop unless there is someone like Saddam to oppress them. How come a smart guy like G.W. Bush, who got elected President, didn’t know what we know about the Iraqi people?", 
        "intTime": 20090506, 
        "postID": 13, 
        "quote": "Originally posted by threerings: Blame Bush for Sunnia Shia violence...ya that makes sense. Dont allow 2000 years of history to influnce your partisan, party line, views... There is no \"dealing\" with Sunni, Shia violence. What, we're going to mediate 2000 years of hate and blood? Ya, lets all sit down and sing songs around the camp fire.. oh wait thats O's plan.", 
        "reply": " Don’t see where anyone blamed President Bush for the Sunni-Shia violence. It is true that he never dealt with the causes of the violence in Iraq. The “surge” plan was just to bring down the violence from when it was out of control in 2006. The “surge” allowed bushies to say “we are succeeding in Iraq” while ignoring the real problems that caused the violence to go out of control in the first place. I know that the there is nothing the United States can do to deal with the 1,350 year split between the Sunni and Shia. Then there is the Kurd-Arab feud. You know these people are going to keep killing each other no matter what Americans do. I know that these generational feuds will not stop unless there is someone like Saddam to oppress them. How come a smart guy like G.W. Bush, who got elected President, didn’t know what we know about the Iraqi people?", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-05-06 13:15:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by ronald45: How's about we let the country divide into 3 seperate regions as it should have done all along??? Thank you Great Britain and others for creating a \"country\" out of 3 seperate tribes that hate one another. The oil distribution among other things makes that very difficult.", 
        "intTime": 20090506, 
        "postID": 14, 
        "quote": "Originally posted by ronald45: How's about we let the country divide into 3 seperate regions as it should have done all along??? Thank you Great Britain and others for creating a \"country\" out of 3 seperate tribes that hate one another.", 
        "reply": " The oil distribution among other things makes that very difficult.", 
        "threadID": "409192893_7730042912001", 
        "time": "2009-05-06 13:58:00", 
        "title": "American forces on both sides in Iraq", 
        "userID": "foxred03"
    }
]