[
    {
        "content": "Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism.", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "", 
        "reply": "Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 12:17:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism. Why not? Those same corporations and banks have been dictating to the government for at least the past 30 years. Maybe it's time the shoe went onto the other foot for awhile. A lot of us here talk about the control big business has over our government and how they short-circuit and circumvent the will of The People, so maybe this is one way to break that control. If it is, it's change I can believe in.", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "Originally posted by navy8086: Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism.", 
        "reply": " Why not? Those same corporations and banks have been dictating to the government for at least the past 30 years. Maybe it's time the shoe went onto the other foot for awhile. A lot of us here talk about the control big business has over our government and how they short-circuit and circumvent the will of The People, so maybe this is one way to break that control. If it is, it's change I can believe in.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 12:38:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: de facto nationalization Nah. You are making **** up. If it makes you feel any better consider the money a tax credit.", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "de facto nationalization", 
        "reply": " Nah. You are making **** up. If it makes you feel any better consider the money a tax credit.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 12:41:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by navy8086: Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism. Why not? Those same corporations and banks have been dictating to the government for at least the past 30 years. Maybe it's time the shoe went onto the other foot for awhile. A lot of us here talk about the control big business has over our government and how they short-circuit and circumvent the will of The People, so maybe this is one way to break that control. If it is, it's change I can believe in. That's already been tries, remember a alittle country call the USSR? That worked real well didn't it. Huge differernce betwen REGULATING and industry and CONTROLLING it.", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "Originally posted by stillkit: quote: Originally posted by navy8086: Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism. Why not? Those same corporations and banks have been dictating to the government for at least the past 30 years. Maybe it's time the shoe went onto the other foot for awhile. A lot of us here talk about the control big business has over our government and how they short-circuit and circumvent the will of The People, so maybe this is one way to break that control. If it is, it's change I can believe in.", 
        "reply": " That's already been tries, remember a alittle country call the USSR? That worked real well didn't it. Huge differernce betwen REGULATING and industry and CONTROLLING it.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 12:58:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: de facto nationalization Nah. You are making **** up. If it makes you feel any better consider the money a tax credit. 1> At least the **** I \"make up\" makes sense and 2> as opposed to this shoveling of money into a huge dark pit that will only benefit a select few.", 
        "intTime": 20090304, 
        "postID": 5, 
        "quote": "Originally posted by FrJohn1123: quote: de facto nationalization Nah. You are making **** up. If it makes you feel any better consider the money a tax credit.", 
        "reply": " 1> At least the **** I \"make up\" makes sense and 2> as opposed to this shoveling of money into a huge dark pit that will only benefit a select few.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:01:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }, 
    {
        "content": "What ever floats your boat there navy.", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "", 
        "reply": "What ever floats your boat there navy.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:02:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What ever floats your boat there navy. The sad part is that you (and the rest of the counrty) have been screwed, blued and tattooed by Obama and his crew but you O-bots are blind to it.", 
        "intTime": 20090304, 
        "postID": 7, 
        "quote": "Originally posted by FrJohn1123: What ever floats your boat there navy.", 
        "reply": " The sad part is that you (and the rest of the counrty) have been screwed, blued and tattooed by Obama and his crew but you O-bots are blind to it.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:09:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: What ever floats your boat there navy. The sad part is that you (and the rest of the counrty) have been screwed, blued and tattooed by Obama and his crew but you O-bots are blind to it. And we felt the same about the shrub. Fact is the only thing you can do now is whine.", 
        "intTime": 20090304, 
        "postID": 8, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: What ever floats your boat there navy. The sad part is that you (and the rest of the counrty) have been screwed, blued and tattooed by Obama and his crew but you O-bots are blind to it.", 
        "reply": " And we felt the same about the shrub. Fact is the only thing you can do now is whine.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:15:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. There's one very simple way to get out from under the \"conditions\" ... pay back the bailout (w/interest thank you very much). I don't see the same problems with the conditions that have been imposed as you do ... though I do, for the most part, disagree with the bailouts in the first place. Perhaps you might compare what the government is doing to the banks to what the banks do unto you when you take out a loan or a credit card. A little bit of \"turnaround is fair play\" is good for the soul.", 
        "intTime": 20090304, 
        "postID": 9, 
        "quote": "With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money.", 
        "reply": " There's one very simple way to get out from under the \"conditions\" ... pay back the bailout (w/interest thank you very much). I don't see the same problems with the conditions that have been imposed as you do ... though I do, for the most part, disagree with the bailouts in the first place. Perhaps you might compare what the government is doing to the banks to what the banks do unto you when you take out a loan or a credit card. A little bit of \"turnaround is fair play\" is good for the soul.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:24:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: What ever floats your boat there navy. The sad part is that you (and the rest of the counrty) have been screwed, blued and tattooed by Obama and his crew but you O-bots are blind to it. And we felt the same about the shrub. Fact is the only thing you can do now is whine. Can do ALOT more than that, especially in 2010 and 2012 ...", 
        "intTime": 20090304, 
        "postID": 10, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: What ever floats your boat there navy. The sad part is that you (and the rest of the counrty) have been screwed, blued and tattooed by Obama and his crew but you O-bots are blind to it. And we felt the same about the shrub. Fact is the only thing you can do now is whine.", 
        "reply": " Can do ALOT more than that, especially in 2010 and 2012 ...", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:42:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. There's one very simple way to get out from under the \"conditions\" ... pay back the bailout (w/interest thank you very much). I don't see the same problems with the conditions that have been imposed as you do ... though I do, for the most part, disagree with the bailouts in the first place. Perhaps you might compare what the government is doing to the banks to what the banks do unto you when you take out a loan or a credit card. A little bit of \"turnaround is fair play\" is good for the soul. Look at the examples I put in my original post. In other words, what if the govt forces changes or condition that hurt a business. While that sounds counter productive, remember WHO we're dealing with.", 
        "intTime": 20090304, 
        "postID": 11, 
        "quote": "Originally posted by I_M_Qwerty: quote: With all the bailouts being handed out, the govt can (and has) started handing out conditions for getting the money. There's one very simple way to get out from under the \"conditions\" ... pay back the bailout (w/interest thank you very much). I don't see the same problems with the conditions that have been imposed as you do ... though I do, for the most part, disagree with the bailouts in the first place. Perhaps you might compare what the government is doing to the banks to what the banks do unto you when you take out a loan or a credit card. A little bit of \"turnaround is fair play\" is good for the soul.", 
        "reply": " Look at the examples I put in my original post. In other words, what if the govt forces changes or condition that hurt a business. While that sounds counter productive, remember WHO we're dealing with.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:45:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }, 
    {
        "content": "I'm feeling a little better quality regulation in banking is a good thing. The fuxx who've been screwing with Joe sixpack and his wife buying a modest home need to be outed--they and their 9 figure bonus. That's why a ton a folks don't give a rats azz about the banks and mortgage imbeciles taking one up the patoot. It feels rigged...because it is and has been rigged by freeloaders and self important snobs--doesn't matter what party or their affiliation--crooks are crooks. I don't see De Facto Nationalization--only a little better handle on the books and some oversight on the ***** who have been in charge of the wealth. \"You'd better be able to sandpaper a Bobcat's butt in a phone booth if you want some of this.", 
        "intTime": 20090304, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'm feeling a little better quality regulation in banking is a good thing. The fuxx who've been screwing with Joe sixpack and his wife buying a modest home need to be outed--they and their 9 figure bonus. That's why a ton a folks don't give a rats azz about the banks and mortgage imbeciles taking one up the patoot. It feels rigged...because it is and has been rigged by freeloaders and self important snobs--doesn't matter what party or their affiliation--crooks are crooks. I don't see De Facto Nationalization--only a little better handle on the books and some oversight on the ***** who have been in charge of the wealth. \"You'd better be able to sandpaper a Bobcat's butt in a phone booth if you want some of this.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 13:53:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "pickerfromhell"
    }, 
    {
        "content": "quote: It feels rigged...because it is and has been rigged by freeloaders and self important snobs--doesn't matter what party or their affiliation--crooks are crooks. I don't see De Facto Nationalization--only a little better handle on the books and some oversight on the ***** who have been in charge of the wealth. If its rigged (it is), how is \"a little better handle on the books and some oversight on the ***** who have been in charge of the wealth\" going to come into fruition? When you got two foxes and a hen watching over the farm, which one is SOL?", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "It feels rigged...because it is and has been rigged by freeloaders and self important snobs--doesn't matter what party or their affiliation--crooks are crooks. I don't see De Facto Nationalization--only a little better handle on the books and some oversight on the ***** who have been in charge of the wealth.", 
        "reply": " If its rigged (it is), how is \"a little better handle on the books and some oversight on the ***** who have been in charge of the wealth\" going to come into fruition? When you got two foxes and a hen watching over the farm, which one is SOL?", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 14:04:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: A little bit of \"turnaround is fair play\" is good for the soul. I agree, as long as that's the extent of it. The distance it can go is what worries me.", 
        "intTime": 20090304, 
        "postID": 14, 
        "quote": "Originally posted by I_M_Qwerty: A little bit of \"turnaround is fair play\" is good for the soul.", 
        "reply": " I agree, as long as that's the extent of it. The distance it can go is what worries me.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 14:07:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Maybe I'm not explaining my concerns very well. The, thru these bailouts the govt (run by a SOCIALIST bunch) can interfere and impose an agenda that can destroy the free market. For instance, forcing any contruction company working on infrastructure projects to ONLY ise unionized labor. Dictate wages across the board, not just CEO. I'm not saying any PARTICULAR sector but ANYONE sucking at this trough.", 
        "intTime": 20090304, 
        "postID": 15, 
        "quote": "", 
        "reply": "Maybe I'm not explaining my concerns very well. The, thru these bailouts the govt (run by a SOCIALIST bunch) can interfere and impose an agenda that can destroy the free market. For instance, forcing any contruction company working on infrastructure projects to ONLY ise unionized labor. Dictate wages across the board, not just CEO. I'm not saying any PARTICULAR sector but ANYONE sucking at this trough.", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 14:15:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by I_M_Qwerty: A little bit of \"turnaround is fair play\" is good for the soul. I agree, as long as that's the extent of it. The distance it can go is what worries me. BINGO !!! THANK-YOU !!! There is the HEART of my point", 
        "intTime": 20090304, 
        "postID": 16, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by I_M_Qwerty: A little bit of \"turnaround is fair play\" is good for the soul. I agree, as long as that's the extent of it. The distance it can go is what worries me.", 
        "reply": " BINGO !!! THANK-YOU !!! There is the HEART of my point", 
        "threadID": "409192893_4050009612001", 
        "time": "2009-03-04 14:16:00", 
        "title": "The De facto Nationaliztion of American Industries ....", 
        "userID": "navy8086"
    }
]