[
    {
        "content": "Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:01:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I don't watch faux for obvious reasons. But to see him do this, YUP I'll watch! And yes, he will need a new Stahlhelm afterwards...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "", 
        "reply": "I don't watch faux for obvious reasons. But to see him do this, YUP I'll watch! And yes, he will need a new Stahlhelm afterwards...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:34:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it? Apparently, he's already backpedaled! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "Originally posted by SeaWitch1220: Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "reply": " Apparently, he's already backpedaled! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:34:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "Originally posted by KJ1110: Apparently, he's already backpedaled!", 
        "reply": " Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:40:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:46:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime. He wasn't risking much scratch...", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "Originally posted by Thud357L: Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "reply": " He wasn't risking much scratch...", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:50:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "", 
        "reply": "This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:54:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. That's an experience you can live without, trust me.", 
        "intTime": 20090425, 
        "postID": 8, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " That's an experience you can live without, trust me.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:57:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "intTime": 20090425, 
        "postID": 9, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " Ya gotta have a safe word right?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:05:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? Shame on you Sea. Meanwhile, I'd donate $2000 a sec to the Retirement Home for Disgruntled Wingnuts if Beck would do it.", 
        "intTime": 20090425, 
        "postID": 10, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " Shame on you Sea. Meanwhile, I'd donate $2000 a sec to the Retirement Home for Disgruntled Wingnuts if Beck would do it.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:06:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\"", 
        "intTime": 20090425, 
        "postID": 11, 
        "quote": "Originally posted by SeaWitch1220: Ya gotta have a safe word right?", 
        "reply": " I recommend \"yarrgggarbllptthhhpt\"", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:15:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\" Oh dang...you made my sides hurt.", 
        "intTime": 20090425, 
        "postID": 12, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\"", 
        "reply": " Oh dang...you made my sides hurt.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:22:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: I don't watch faux for obvious reasons. Give a balanced report a try once ........ The prime news hr. 6:00 to 7:00 EST", 
        "intTime": 20090425, 
        "postID": 13, 
        "quote": "I don't watch faux for obvious reasons.", 
        "reply": " Give a balanced report a try once ........ The prime news hr. 6:00 to 7:00 EST", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:53:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scwestusmc"
    }, 
    {
        "content": "Hannity will wind up chickening out. The chickenhawks always do.", 
        "intTime": 20090425, 
        "postID": 14, 
        "quote": "", 
        "reply": "Hannity will wind up chickening out. The chickenhawks always do.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:07:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\" I wis h he would, so he can know how it feels. And not like us folks that went through SERE training, a real session. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 15, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "reply": " I wis h he would, so he can know how it feels. And not like us folks that went through SERE training, a real session. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:10:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? I think that only goes with BDSM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 16, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " I think that only goes with BDSM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:11:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. I had it done, it's not fun, even when you know it's for training. Worse part of my training. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 17, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " I had it done, it's not fun, even when you know it's for training. Worse part of my training. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:12:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: And you made it. I hope he does too. To be honest, the only reason I made it is because I knew it was training. I don' t know what would have happened if I had been in real enemy hands. They don't tend to stop after 5 minutes. I am not saying I would talk, I am saying that IMHO, SERE waterboarding is not the same as enhanced waterboarding. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 18, 
        "quote": "Originally posted by klassylady25: And you made it. I hope he does too.", 
        "reply": " To be honest, the only reason I made it is because I knew it was training. I don' t know what would have happened if I had been in real enemy hands. They don't tend to stop after 5 minutes. I am not saying I would talk, I am saying that IMHO, SERE waterboarding is not the same as enhanced waterboarding. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:13:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Goebbels Hannity should try the punishment dished out to John McCain", 
        "intTime": 20090425, 
        "postID": 19, 
        "quote": "", 
        "reply": "Goebbels Hannity should try the punishment dished out to John McCain", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:32:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? You better believe there will be a safe word. I just might have to grab a hold of my torturers, you know what's just in case he gets carried away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090425, 
        "postID": 20, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " You better believe there will be a safe word. I just might have to grab a hold of my torturers, you know what's just in case he gets carried away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:54:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "\"http://www.hannity.com/goout.asp?u=http://www.americasupportsyou.mil\" Hannity supports our US Troops! Give credit where credit is due. IMHO! This is from Hannity's web page. \"Thank our Troops\"! \"Support Our Troops\" There is a slide show on this page. \"THE UNIT\" - \"Actors Robert Patrick and Max Martini, cast members from the television series \"The Unit,\" pose for a photo with a soldier during a USO Spring Troop visit to Forward Operating Base Fenty, Afghanistan, April 23, 2009. Staff Sgt. Adora Medina\" Some \"actors\" have various views. But, thank God, a lot of them Support our Troops! Grodin has a different project. All worthy. But please understand that US Citizens support our Troops and the Vets too. It is not yet Sunday. Give Hannity a chance. Thank you...Agent 99!", 
        "intTime": 20090425, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.hannity.com/goout.asp?u=http://www.americasupportsyou.mil\" Hannity supports our US Troops! Give credit where credit is due. IMHO! This is from Hannity's web page. \"Thank our Troops\"! \"Support Our Troops\" There is a slide show on this page. \"THE UNIT\" - \"Actors Robert Patrick and Max Martini, cast members from the television series \"The Unit,\" pose for a photo with a soldier during a USO Spring Troop visit to Forward Operating Base Fenty, Afghanistan, April 23, 2009. Staff Sgt. Adora Medina\" Some \"actors\" have various views. But, thank God, a lot of them Support our Troops! Grodin has a different project. All worthy. But please understand that US Citizens support our Troops and the Vets too. It is not yet Sunday. Give Hannity a chance. Thank you...Agent 99!", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:03:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it. Well join up", 
        "intTime": 20090425, 
        "postID": 22, 
        "quote": "Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it.", 
        "reply": " Well join up", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:07:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it. I've never met anyone who was waterboarded say it was big fun and they want to do it again. To anybody that was waterboarded, I'd like to know if you thought it was torture. I was halfway sure the SF guys weren't actually gonna kill me but it was damn sure torture.", 
        "intTime": 20090425, 
        "postID": 23, 
        "quote": "Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it.", 
        "reply": " I've never met anyone who was waterboarded say it was big fun and they want to do it again. To anybody that was waterboarded, I'd like to know if you thought it was torture. I was halfway sure the SF guys weren't actually gonna kill me but it was damn sure torture.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:23:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "When it is being done to you it is torture, like Cindy Lauper's \"singing\", when you are doing it, it is enhansed interogation. What we call \"water boarding\" , using legaleese, is not torture. The method where they fill your stomach until you are in great pain, in danger of death, is. I have no doubt that Hannity will submit himself if the \"pot\" gets large enough. $1,000 won't do it, I'm guessing that some \"event\" where the \"pot\" exceeds $100,000 total might do it. But who will put up the \"green\"?", 
        "intTime": 20090425, 
        "postID": 24, 
        "quote": "", 
        "reply": "When it is being done to you it is torture, like Cindy Lauper's \"singing\", when you are doing it, it is enhansed interogation. What we call \"water boarding\" , using legaleese, is not torture. The method where they fill your stomach until you are in great pain, in danger of death, is. I have no doubt that Hannity will submit himself if the \"pot\" gets large enough. $1,000 won't do it, I'm guessing that some \"event\" where the \"pot\" exceeds $100,000 total might do it. But who will put up the \"green\"?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:23:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "peter3_1"
    }, 
    {
        "content": "I teach SCUBA for a living. Any qualified, certified SCUBA diver knows how to establish \"airway control.\" In fact, I can breathe off a SCUBA tank without a regulator attached....I would volunteer to be waterboarded just to show that once a person establishes airway control, waterboarding is NOT TORTURE....And although it's a wet breath, a person can still breathe....Anyone who has done the bailout in the NAUI Divemaster course can successfully resist waterboarding. Duane A. Brinson Lahaina, HI. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 25, 
        "quote": "", 
        "reply": "I teach SCUBA for a living. Any qualified, certified SCUBA diver knows how to establish \"airway control.\" In fact, I can breathe off a SCUBA tank without a regulator attached....I would volunteer to be waterboarded just to show that once a person establishes airway control, waterboarding is NOT TORTURE....And although it's a wet breath, a person can still breathe....Anyone who has done the bailout in the NAUI Divemaster course can successfully resist waterboarding. Duane A. Brinson Lahaina, HI. U.S.M.C. 1985-1989", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:27:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: Goebbels Hannity should try the punishment dished out to John McCain Maybe you should if you think what Senator Mccain went thru is something to put a smiley face next to...God you are a truly pathetic individual..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 26, 
        "quote": "Originally posted by scottrj50: Goebbels Hannity should try the punishment dished out to John McCain", 
        "reply": " Maybe you should if you think what Senator Mccain went thru is something to put a smiley face next to...God you are a truly pathetic individual..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:44:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "intTime": 20090425, 
        "postID": 27, 
        "quote": "", 
        "reply": "Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:01:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I don't watch faux for obvious reasons. But to see him do this, YUP I'll watch! And yes, he will need a new Stahlhelm afterwards...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 28, 
        "quote": "", 
        "reply": "I don't watch faux for obvious reasons. But to see him do this, YUP I'll watch! And yes, he will need a new Stahlhelm afterwards...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:34:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it? Apparently, he's already backpedaled! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090425, 
        "postID": 29, 
        "quote": "Originally posted by SeaWitch1220: Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "reply": " Apparently, he's already backpedaled! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:34:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "intTime": 20090425, 
        "postID": 30, 
        "quote": "Originally posted by KJ1110: Apparently, he's already backpedaled!", 
        "reply": " Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:40:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "intTime": 20090425, 
        "postID": 31, 
        "quote": "", 
        "reply": "Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:46:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime. He wasn't risking much scratch...", 
        "intTime": 20090425, 
        "postID": 32, 
        "quote": "Originally posted by Thud357L: Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "reply": " He wasn't risking much scratch...", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:50:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090425, 
        "postID": 33, 
        "quote": "", 
        "reply": "This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:54:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. That's an experience you can live without, trust me.", 
        "intTime": 20090425, 
        "postID": 34, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " That's an experience you can live without, trust me.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:57:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "intTime": 20090425, 
        "postID": 35, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " Ya gotta have a safe word right?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:05:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? Shame on you Sea. Meanwhile, I'd donate $2000 a sec to the Retirement Home for Disgruntled Wingnuts if Beck would do it.", 
        "intTime": 20090425, 
        "postID": 36, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " Shame on you Sea. Meanwhile, I'd donate $2000 a sec to the Retirement Home for Disgruntled Wingnuts if Beck would do it.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:06:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\"", 
        "intTime": 20090425, 
        "postID": 37, 
        "quote": "Originally posted by SeaWitch1220: Ya gotta have a safe word right?", 
        "reply": " I recommend \"yarrgggarbllptthhhpt\"", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:15:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\" Oh dang...you made my sides hurt.", 
        "intTime": 20090425, 
        "postID": 38, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\"", 
        "reply": " Oh dang...you made my sides hurt.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:22:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: I don't watch faux for obvious reasons. Give a balanced report a try once ........ The prime news hr. 6:00 to 7:00 EST", 
        "intTime": 20090425, 
        "postID": 39, 
        "quote": "I don't watch faux for obvious reasons.", 
        "reply": " Give a balanced report a try once ........ The prime news hr. 6:00 to 7:00 EST", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:53:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scwestusmc"
    }, 
    {
        "content": "Hannity will wind up chickening out. The chickenhawks always do.", 
        "intTime": 20090425, 
        "postID": 40, 
        "quote": "", 
        "reply": "Hannity will wind up chickening out. The chickenhawks always do.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:07:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\" I wis h he would, so he can know how it feels. And not like us folks that went through SERE training, a real session. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 41, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "reply": " I wis h he would, so he can know how it feels. And not like us folks that went through SERE training, a real session. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:10:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? I think that only goes with BDSM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 42, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " I think that only goes with BDSM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:11:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. I had it done, it's not fun, even when you know it's for training. Worse part of my training. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 43, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " I had it done, it's not fun, even when you know it's for training. Worse part of my training. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:12:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: And you made it. I hope he does too. To be honest, the only reason I made it is because I knew it was training. I don' t know what would have happened if I had been in real enemy hands. They don't tend to stop after 5 minutes. I am not saying I would talk, I am saying that IMHO, SERE waterboarding is not the same as enhanced waterboarding. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 44, 
        "quote": "Originally posted by klassylady25: And you made it. I hope he does too.", 
        "reply": " To be honest, the only reason I made it is because I knew it was training. I don' t know what would have happened if I had been in real enemy hands. They don't tend to stop after 5 minutes. I am not saying I would talk, I am saying that IMHO, SERE waterboarding is not the same as enhanced waterboarding. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:13:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Goebbels Hannity should try the punishment dished out to John McCain", 
        "intTime": 20090425, 
        "postID": 45, 
        "quote": "", 
        "reply": "Goebbels Hannity should try the punishment dished out to John McCain", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:32:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? You better believe there will be a safe word. I just might have to grab a hold of my torturers, you know what's just in case he gets carried away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090425, 
        "postID": 46, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " You better believe there will be a safe word. I just might have to grab a hold of my torturers, you know what's just in case he gets carried away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:54:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "\"http://www.hannity.com/goout.asp?u=http://www.americasupportsyou.mil\" Hannity supports our US Troops! Give credit where credit is due. IMHO! This is from Hannity's web page. \"Thank our Troops\"! \"Support Our Troops\" There is a slide show on this page. \"THE UNIT\" - \"Actors Robert Patrick and Max Martini, cast members from the television series \"The Unit,\" pose for a photo with a soldier during a USO Spring Troop visit to Forward Operating Base Fenty, Afghanistan, April 23, 2009. Staff Sgt. Adora Medina\" Some \"actors\" have various views. But, thank God, a lot of them Support our Troops! Grodin has a different project. All worthy. But please understand that US Citizens support our Troops and the Vets too. It is not yet Sunday. Give Hannity a chance. Thank you...Agent 99!", 
        "intTime": 20090425, 
        "postID": 47, 
        "quote": "", 
        "reply": "\"http://www.hannity.com/goout.asp?u=http://www.americasupportsyou.mil\" Hannity supports our US Troops! Give credit where credit is due. IMHO! This is from Hannity's web page. \"Thank our Troops\"! \"Support Our Troops\" There is a slide show on this page. \"THE UNIT\" - \"Actors Robert Patrick and Max Martini, cast members from the television series \"The Unit,\" pose for a photo with a soldier during a USO Spring Troop visit to Forward Operating Base Fenty, Afghanistan, April 23, 2009. Staff Sgt. Adora Medina\" Some \"actors\" have various views. But, thank God, a lot of them Support our Troops! Grodin has a different project. All worthy. But please understand that US Citizens support our Troops and the Vets too. It is not yet Sunday. Give Hannity a chance. Thank you...Agent 99!", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:03:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it. Well join up", 
        "intTime": 20090425, 
        "postID": 48, 
        "quote": "Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it.", 
        "reply": " Well join up", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:07:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it. I've never met anyone who was waterboarded say it was big fun and they want to do it again. To anybody that was waterboarded, I'd like to know if you thought it was torture. I was halfway sure the SF guys weren't actually gonna kill me but it was damn sure torture.", 
        "intTime": 20090425, 
        "postID": 49, 
        "quote": "Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it.", 
        "reply": " I've never met anyone who was waterboarded say it was big fun and they want to do it again. To anybody that was waterboarded, I'd like to know if you thought it was torture. I was halfway sure the SF guys weren't actually gonna kill me but it was damn sure torture.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:23:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "When it is being done to you it is torture, like Cindy Lauper's \"singing\", when you are doing it, it is enhansed interogation. What we call \"water boarding\" , using legaleese, is not torture. The method where they fill your stomach until you are in great pain, in danger of death, is. I have no doubt that Hannity will submit himself if the \"pot\" gets large enough. $1,000 won't do it, I'm guessing that some \"event\" where the \"pot\" exceeds $100,000 total might do it. But who will put up the \"green\"?", 
        "intTime": 20090425, 
        "postID": 50, 
        "quote": "", 
        "reply": "When it is being done to you it is torture, like Cindy Lauper's \"singing\", when you are doing it, it is enhansed interogation. What we call \"water boarding\" , using legaleese, is not torture. The method where they fill your stomach until you are in great pain, in danger of death, is. I have no doubt that Hannity will submit himself if the \"pot\" gets large enough. $1,000 won't do it, I'm guessing that some \"event\" where the \"pot\" exceeds $100,000 total might do it. But who will put up the \"green\"?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:23:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "peter3_1"
    }, 
    {
        "content": "I teach SCUBA for a living. Any qualified, certified SCUBA diver knows how to establish \"airway control.\" In fact, I can breathe off a SCUBA tank without a regulator attached....I would volunteer to be waterboarded just to show that once a person establishes airway control, waterboarding is NOT TORTURE....And although it's a wet breath, a person can still breathe....Anyone who has done the bailout in the NAUI Divemaster course can successfully resist waterboarding. Duane A. Brinson Lahaina, HI. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 51, 
        "quote": "", 
        "reply": "I teach SCUBA for a living. Any qualified, certified SCUBA diver knows how to establish \"airway control.\" In fact, I can breathe off a SCUBA tank without a regulator attached....I would volunteer to be waterboarded just to show that once a person establishes airway control, waterboarding is NOT TORTURE....And although it's a wet breath, a person can still breathe....Anyone who has done the bailout in the NAUI Divemaster course can successfully resist waterboarding. Duane A. Brinson Lahaina, HI. U.S.M.C. 1985-1989", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:27:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: Goebbels Hannity should try the punishment dished out to John McCain Maybe you should if you think what Senator Mccain went thru is something to put a smiley face next to...God you are a truly pathetic individual..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 52, 
        "quote": "Originally posted by scottrj50: Goebbels Hannity should try the punishment dished out to John McCain", 
        "reply": " Maybe you should if you think what Senator Mccain went thru is something to put a smiley face next to...God you are a truly pathetic individual..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:44:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "intTime": 20090425, 
        "postID": 53, 
        "quote": "", 
        "reply": "Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:01:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I don't watch faux for obvious reasons. But to see him do this, YUP I'll watch! And yes, he will need a new Stahlhelm afterwards...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 54, 
        "quote": "", 
        "reply": "I don't watch faux for obvious reasons. But to see him do this, YUP I'll watch! And yes, he will need a new Stahlhelm afterwards...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:34:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it? Apparently, he's already backpedaled! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090425, 
        "postID": 55, 
        "quote": "Originally posted by SeaWitch1220: Sean Hannity offered to have himself waterboarded. Hannity offers to be Waterboarded by Charles Grodin Oh, well. This is, I believe, a \"golden moment\" in the history of televised media. Sean Hannity had actor Charles Grodin on his show tonight, and the two men actually had some genuinely good natured sparring with each other over the news of the week. Hannity asked Grodin if he'd ever accept a book from Hugo Chavez or listen to a speech by a \"brutal thug murdering dictator like Daniel Ortega.\" Grodin's respective ripostes were \"I'd hand him my book!\" and \"I'd listen to anybody. I'm listening to you.\" Grodin then went on to ask Hannity if he was wearing mascara and if he had any plans to marry Ann Coulter. But that's not the fun part! This is the fun part: GRODIN: You're for torture. HANNITY: I am for enhanced interrogation. GRODIN: You don't believe it's torture. Have you ever been waterboarded? HANNITY: No, but Ollie North has. GRODIN: Would you consent to be waterboarded? We can waterboard you? HANNITY: Sure. GRODIN: Are you busy on Sunday? HANNITY: I'll do it for charity. I'll let you do it. I'll do it for the troops' families. \"http://www.huffingtonpost.com/2009/04/22/hannity-offers-to-be-wate_n_190354.html\" Will he do it? Should he do it? Will he risk messing up that hair helmet? Will you watch it?", 
        "reply": " Apparently, he's already backpedaled! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:34:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "intTime": 20090425, 
        "postID": 56, 
        "quote": "Originally posted by KJ1110: Apparently, he's already backpedaled!", 
        "reply": " Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:40:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "intTime": 20090425, 
        "postID": 57, 
        "quote": "", 
        "reply": "Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:46:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime. He wasn't risking much scratch...", 
        "intTime": 20090425, 
        "postID": 58, 
        "quote": "Originally posted by Thud357L: Olbermann said he would donate $1000 a second if Hannity does it. He won't have to pay a dime.", 
        "reply": " He wasn't risking much scratch...", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:50:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090425, 
        "postID": 59, 
        "quote": "", 
        "reply": "This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:54:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. That's an experience you can live without, trust me.", 
        "intTime": 20090425, 
        "postID": 60, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " That's an experience you can live without, trust me.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 06:57:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "intTime": 20090425, 
        "postID": 61, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " Ya gotta have a safe word right?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:05:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? Shame on you Sea. Meanwhile, I'd donate $2000 a sec to the Retirement Home for Disgruntled Wingnuts if Beck would do it.", 
        "intTime": 20090425, 
        "postID": 62, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " Shame on you Sea. Meanwhile, I'd donate $2000 a sec to the Retirement Home for Disgruntled Wingnuts if Beck would do it.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:06:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\"", 
        "intTime": 20090425, 
        "postID": 63, 
        "quote": "Originally posted by SeaWitch1220: Ya gotta have a safe word right?", 
        "reply": " I recommend \"yarrgggarbllptthhhpt\"", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:15:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\" Oh dang...you made my sides hurt.", 
        "intTime": 20090425, 
        "postID": 64, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by SeaWitch1220: Ya gotta have a safe word right? I recommend \"yarrgggarbllptthhhpt\"", 
        "reply": " Oh dang...you made my sides hurt.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:22:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: I don't watch faux for obvious reasons. Give a balanced report a try once ........ The prime news hr. 6:00 to 7:00 EST", 
        "intTime": 20090425, 
        "postID": 65, 
        "quote": "I don't watch faux for obvious reasons.", 
        "reply": " Give a balanced report a try once ........ The prime news hr. 6:00 to 7:00 EST", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 07:53:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scwestusmc"
    }, 
    {
        "content": "Hannity will wind up chickening out. The chickenhawks always do.", 
        "intTime": 20090425, 
        "postID": 66, 
        "quote": "", 
        "reply": "Hannity will wind up chickening out. The chickenhawks always do.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:07:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\" I wis h he would, so he can know how it feels. And not like us folks that went through SERE training, a real session. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 67, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by KJ1110: Apparently, he's already backpedaled! Wow...twice in one day I get to say \"Who'd a thunk?\"", 
        "reply": " I wis h he would, so he can know how it feels. And not like us folks that went through SERE training, a real session. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:10:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? I think that only goes with BDSM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 68, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " I think that only goes with BDSM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:11:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. I had it done, it's not fun, even when you know it's for training. Worse part of my training. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 69, 
        "quote": "Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop.", 
        "reply": " I had it done, it's not fun, even when you know it's for training. Worse part of my training. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 08:12:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: And you made it. I hope he does too. To be honest, the only reason I made it is because I knew it was training. I don' t know what would have happened if I had been in real enemy hands. They don't tend to stop after 5 minutes. I am not saying I would talk, I am saying that IMHO, SERE waterboarding is not the same as enhanced waterboarding. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 70, 
        "quote": "Originally posted by klassylady25: And you made it. I hope he does too.", 
        "reply": " To be honest, the only reason I made it is because I knew it was training. I don' t know what would have happened if I had been in real enemy hands. They don't tend to stop after 5 minutes. I am not saying I would talk, I am saying that IMHO, SERE waterboarding is not the same as enhanced waterboarding. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:13:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Goebbels Hannity should try the punishment dished out to John McCain", 
        "intTime": 20090425, 
        "postID": 71, 
        "quote": "", 
        "reply": "Goebbels Hannity should try the punishment dished out to John McCain", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:32:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right? You better believe there will be a safe word. I just might have to grab a hold of my torturers, you know what's just in case he gets carried away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090425, 
        "postID": 72, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Vicdude: This may sound goofy but I think I might try it for a few seconds just to see what it's all about. Naturally I'll have someone totally trustworthy doing it. Like stop means stop. Ya gotta have a safe word right?", 
        "reply": " You better believe there will be a safe word. I just might have to grab a hold of my torturers, you know what's just in case he gets carried away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 09:54:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "\"http://www.hannity.com/goout.asp?u=http://www.americasupportsyou.mil\" Hannity supports our US Troops! Give credit where credit is due. IMHO! This is from Hannity's web page. \"Thank our Troops\"! \"Support Our Troops\" There is a slide show on this page. \"THE UNIT\" - \"Actors Robert Patrick and Max Martini, cast members from the television series \"The Unit,\" pose for a photo with a soldier during a USO Spring Troop visit to Forward Operating Base Fenty, Afghanistan, April 23, 2009. Staff Sgt. Adora Medina\" Some \"actors\" have various views. But, thank God, a lot of them Support our Troops! Grodin has a different project. All worthy. But please understand that US Citizens support our Troops and the Vets too. It is not yet Sunday. Give Hannity a chance. Thank you...Agent 99!", 
        "intTime": 20090425, 
        "postID": 73, 
        "quote": "", 
        "reply": "\"http://www.hannity.com/goout.asp?u=http://www.americasupportsyou.mil\" Hannity supports our US Troops! Give credit where credit is due. IMHO! This is from Hannity's web page. \"Thank our Troops\"! \"Support Our Troops\" There is a slide show on this page. \"THE UNIT\" - \"Actors Robert Patrick and Max Martini, cast members from the television series \"The Unit,\" pose for a photo with a soldier during a USO Spring Troop visit to Forward Operating Base Fenty, Afghanistan, April 23, 2009. Staff Sgt. Adora Medina\" Some \"actors\" have various views. But, thank God, a lot of them Support our Troops! Grodin has a different project. All worthy. But please understand that US Citizens support our Troops and the Vets too. It is not yet Sunday. Give Hannity a chance. Thank you...Agent 99!", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:03:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it. Well join up", 
        "intTime": 20090425, 
        "postID": 74, 
        "quote": "Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it.", 
        "reply": " Well join up", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:07:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it. I've never met anyone who was waterboarded say it was big fun and they want to do it again. To anybody that was waterboarded, I'd like to know if you thought it was torture. I was halfway sure the SF guys weren't actually gonna kill me but it was damn sure torture.", 
        "intTime": 20090425, 
        "postID": 75, 
        "quote": "Originally posted by klassylady25: So should we all. It would bring an understanding and appreciation in being an American again and not just spoiled brats. You never know what you miss until you've lost it.", 
        "reply": " I've never met anyone who was waterboarded say it was big fun and they want to do it again. To anybody that was waterboarded, I'd like to know if you thought it was torture. I was halfway sure the SF guys weren't actually gonna kill me but it was damn sure torture.", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 10:23:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "When it is being done to you it is torture, like Cindy Lauper's \"singing\", when you are doing it, it is enhansed interogation. What we call \"water boarding\" , using legaleese, is not torture. The method where they fill your stomach until you are in great pain, in danger of death, is. I have no doubt that Hannity will submit himself if the \"pot\" gets large enough. $1,000 won't do it, I'm guessing that some \"event\" where the \"pot\" exceeds $100,000 total might do it. But who will put up the \"green\"?", 
        "intTime": 20090425, 
        "postID": 76, 
        "quote": "", 
        "reply": "When it is being done to you it is torture, like Cindy Lauper's \"singing\", when you are doing it, it is enhansed interogation. What we call \"water boarding\" , using legaleese, is not torture. The method where they fill your stomach until you are in great pain, in danger of death, is. I have no doubt that Hannity will submit himself if the \"pot\" gets large enough. $1,000 won't do it, I'm guessing that some \"event\" where the \"pot\" exceeds $100,000 total might do it. But who will put up the \"green\"?", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:23:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "peter3_1"
    }, 
    {
        "content": "I teach SCUBA for a living. Any qualified, certified SCUBA diver knows how to establish \"airway control.\" In fact, I can breathe off a SCUBA tank without a regulator attached....I would volunteer to be waterboarded just to show that once a person establishes airway control, waterboarding is NOT TORTURE....And although it's a wet breath, a person can still breathe....Anyone who has done the bailout in the NAUI Divemaster course can successfully resist waterboarding. Duane A. Brinson Lahaina, HI. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 77, 
        "quote": "", 
        "reply": "I teach SCUBA for a living. Any qualified, certified SCUBA diver knows how to establish \"airway control.\" In fact, I can breathe off a SCUBA tank without a regulator attached....I would volunteer to be waterboarded just to show that once a person establishes airway control, waterboarding is NOT TORTURE....And although it's a wet breath, a person can still breathe....Anyone who has done the bailout in the NAUI Divemaster course can successfully resist waterboarding. Duane A. Brinson Lahaina, HI. U.S.M.C. 1985-1989", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:27:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: Goebbels Hannity should try the punishment dished out to John McCain Maybe you should if you think what Senator Mccain went thru is something to put a smiley face next to...God you are a truly pathetic individual..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 78, 
        "quote": "Originally posted by scottrj50: Goebbels Hannity should try the punishment dished out to John McCain", 
        "reply": " Maybe you should if you think what Senator Mccain went thru is something to put a smiley face next to...God you are a truly pathetic individual..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_8760037122001", 
        "time": "2009-04-25 11:44:00", 
        "title": "Will He Do It? Sean Hannity Says He Will be Waterboarded for Charity!", 
        "userID": "Proudformermarine"
    }
]