[
    {
        "content": "Bill had a man named William F. Black on his program. This guy basically says that the whole banking industry did this all on purpose in order to line their own pockets. That it was essentially a ponzi scheme that makes Madoff look like a chump. He also goes on to point out that there are laws that require these banks to go into receivership, but that those who are running this whole debacle in our government (mainly Summers, Geithner, Paulson, etc) did not and are not doing so because they do not want the public to know what really happened and just how bad of a state the banks are really in. He goes into so much stuff that I cannot even get into all of it. I recommend watching it. It is about 30 minutes long, but quite interesting. Here it is: ---http://www.pbs.org/moyers/journal/04032009/watch.html And, here is a bio of William F. Black: ---http://www.law.umkc.edu/faculty/black.htm", 
        "intTime": 20090405, 
        "postID": 1, 
        "quote": "", 
        "reply": "Bill had a man named William F. Black on his program. This guy basically says that the whole banking industry did this all on purpose in order to line their own pockets. That it was essentially a ponzi scheme that makes Madoff look like a chump. He also goes on to point out that there are laws that require these banks to go into receivership, but that those who are running this whole debacle in our government (mainly Summers, Geithner, Paulson, etc) did not and are not doing so because they do not want the public to know what really happened and just how bad of a state the banks are really in. He goes into so much stuff that I cannot even get into all of it. I recommend watching it. It is about 30 minutes long, but quite interesting. Here it is: ---http://www.pbs.org/moyers/journal/04032009/watch.html And, here is a bio of William F. Black: ---http://www.law.umkc.edu/faculty/black.htm", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:14:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Banks are doing all they can to make a quick buck, and our federal flunkies who rotate between private and public jobs don't strictly enforce regulations. Why is this news? Stating the obvious is what Bill Moyers does best. He is the best reason to defund PBS.", 
        "intTime": 20090405, 
        "postID": 2, 
        "quote": "", 
        "reply": "Banks are doing all they can to make a quick buck, and our federal flunkies who rotate between private and public jobs don't strictly enforce regulations. Why is this news? Stating the obvious is what Bill Moyers does best. He is the best reason to defund PBS.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:22:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "RBruce"
    }, 
    {
        "content": "I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent. Revelation of this could cause a run on the banks, and Paulson and Geithner are trying to prevent that by withholding the facts. I agree one hundred percent with the Ponzi scheme analogy. Do you know what a credit default swap is? I know you understand what \"bubbles\" are and how the wealth created around them is artificial. Consider the implication of the bursting of several bubbles. The world has lost roughly 40% (so far) of its wealth. Think about all that has built around that 40%. It's gone, and never coming back. Now, what does that do for, say, jobs? And how the consumption based on those employed people is so vital to a consumer-based economy? This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it.", 
        "intTime": 20090405, 
        "postID": 3, 
        "quote": "", 
        "reply": "I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent. Revelation of this could cause a run on the banks, and Paulson and Geithner are trying to prevent that by withholding the facts. I agree one hundred percent with the Ponzi scheme analogy. Do you know what a credit default swap is? I know you understand what \"bubbles\" are and how the wealth created around them is artificial. Consider the implication of the bursting of several bubbles. The world has lost roughly 40% (so far) of its wealth. Think about all that has built around that 40%. It's gone, and never coming back. Now, what does that do for, say, jobs? And how the consumption based on those employed people is so vital to a consumer-based economy? This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:37:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by RBruce: Banks are doing all they can to make a quick buck, and our federal flunkies who rotate between private and public jobs don't strictly enforce regulations. Why is this news? Stating the obvious is what Bill Moyers does best. He is the best reason to defund PBS. Defund PBS? Why? So we can be left with Fox, CNN US, and MSNBC as our only choices?", 
        "intTime": 20090405, 
        "postID": 4, 
        "quote": "Originally posted by RBruce: Banks are doing all they can to make a quick buck, and our federal flunkies who rotate between private and public jobs don't strictly enforce regulations. Why is this news? Stating the obvious is what Bill Moyers does best. He is the best reason to defund PBS.", 
        "reply": " Defund PBS? Why? So we can be left with Fox, CNN US, and MSNBC as our only choices?", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:42:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent. Revelation of this could cause a run on the banks, and Paulson and Geithner are trying to prevent that by withholding the facts. I agree one hundred percent with the Ponzi scheme analogy. Do you know what a credit default swap is? I know you understand what \"bubbles\" are and how the wealth created around them is artificial. Consider the implication of the bursting of several bubbles. The world has lost roughly 40% (so far) of its wealth. Think about all that has built around that 40%. It's gone, and never coming back. Now, what does that do for, say, jobs? And how the consumption based on those employed people is so vital to a consumer-based economy? This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it. heard this also, and concur... has even been mentioned on the news today... yepper, greed is a terrible thing. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 5, 
        "quote": "Originally posted by mcgreer: I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent. Revelation of this could cause a run on the banks, and Paulson and Geithner are trying to prevent that by withholding the facts. I agree one hundred percent with the Ponzi scheme analogy. Do you know what a credit default swap is? I know you understand what \"bubbles\" are and how the wealth created around them is artificial. Consider the implication of the bursting of several bubbles. The world has lost roughly 40% (so far) of its wealth. Think about all that has built around that 40%. It's gone, and never coming back. Now, what does that do for, say, jobs? And how the consumption based on those employed people is so vital to a consumer-based economy? This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it.", 
        "reply": " heard this also, and concur... has even been mentioned on the news today... yepper, greed is a terrible thing. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:43:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Indeed. And while Madoff deserves everything that's coming to him, he is merely a scapegoat. He ripped off the rich, and he's paying the price for that. What about all those other less well-moneyed persons who have lost everything because of unchecked greed? Who speaks for them?", 
        "intTime": 20090405, 
        "postID": 6, 
        "quote": "", 
        "reply": "Indeed. And while Madoff deserves everything that's coming to him, he is merely a scapegoat. He ripped off the rich, and he's paying the price for that. What about all those other less well-moneyed persons who have lost everything because of unchecked greed? Who speaks for them?", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:48:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Yikes! I do believe I would rather not be left with those propaganda factories (the cable news channels). I don't usually watch Bill Moyers unless he has a good guest on. Shoot, to be honest, I hardly ever watch TV and I don't even have cable (good 'ol antenna and digital converter). But, to get rid of PBS would be a great disservice to those that like educational programming. Not to mention that The Nightly Business Report is probably the best 30 minutes on TV to any investor and that Newshour is about the only no flashy-lights and crazy-crawlers news program left on TV. Sure, it is a boring newscast. But, last I checked, news isn't supposed to be entertaining, it is supposed to be news.", 
        "intTime": 20090405, 
        "postID": 7, 
        "quote": "", 
        "reply": "Yikes! I do believe I would rather not be left with those propaganda factories (the cable news channels). I don't usually watch Bill Moyers unless he has a good guest on. Shoot, to be honest, I hardly ever watch TV and I don't even have cable (good 'ol antenna and digital converter). But, to get rid of PBS would be a great disservice to those that like educational programming. Not to mention that The Nightly Business Report is probably the best 30 minutes on TV to any investor and that Newshour is about the only no flashy-lights and crazy-crawlers news program left on TV. Sure, it is a boring newscast. But, last I checked, news isn't supposed to be entertaining, it is supposed to be news.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:49:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Yikes! I do believe I would rather not be left with those propaganda factories (the cable news channels). I don't usually watch Bill Moyers unless he has a good guest on. Shoot, to be honest, I hardly ever watch TV and I don't even have cable (good 'ol antenna and digital converter). But, to get rid of PBS would be a great disservice to those that like educational programming. Not to mention that The Nightly Business Report is probably the best 30 minutes on TV to any investor and that Newshour is about the only no flashy-lights and crazy-crawlers news program left on TV. Sure, it is a boring newscast. But, last I checked, news isn't supposed to be entertaining, it is supposed to be news. I only watch Moyers online. I'll watch the NCAA Final tomorrow night, and that will be my monthly dose of television. Since returning to America, it's absolutely impossible, both from a perspective of time and interest, to watch TV. There's nothing I want to see on a regular basis. One thing I am glad of is my cable provider carries a sports channel that will broadcast every stage of the Tour de France. I really miss that...sorry for going off topic.", 
        "intTime": 20090405, 
        "postID": 8, 
        "quote": "Originally posted by 10tenths: Yikes! I do believe I would rather not be left with those propaganda factories (the cable news channels). I don't usually watch Bill Moyers unless he has a good guest on. Shoot, to be honest, I hardly ever watch TV and I don't even have cable (good 'ol antenna and digital converter). But, to get rid of PBS would be a great disservice to those that like educational programming. Not to mention that The Nightly Business Report is probably the best 30 minutes on TV to any investor and that Newshour is about the only no flashy-lights and crazy-crawlers news program left on TV. Sure, it is a boring newscast. But, last I checked, news isn't supposed to be entertaining, it is supposed to be news.", 
        "reply": " I only watch Moyers online. I'll watch the NCAA Final tomorrow night, and that will be my monthly dose of television. Since returning to America, it's absolutely impossible, both from a perspective of time and interest, to watch TV. There's nothing I want to see on a regular basis. One thing I am glad of is my cable provider carries a sports channel that will broadcast every stage of the Tour de France. I really miss that...sorry for going off topic.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:57:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it. The biggest problem that I have with that is the fact that the size that the economy was before this whole thing happened was artificial. It was bloated and as real as a $3 bill. The economy wants to contract to where it should naturally be. Stimulus only serves to keep this artificial, bloated economy. Stimulus only serves to stave off what the economy naturally want to do. Prices want to come down, but we aren't letting them (the banks would lose too much). When prices come down, wages will drop in direct relation (which isn't exactly a bad thing). When prices/wages come down and find equilibrium, the businesses will see demand for goods come back around and will thus need to hire more workers. Basically, it would be like a giant reset button on the whole economy. But, instead, we are trying to prop it up. I believe that by propping it up the only thing we will see is a long and grueling recession with the greater possibility of yet another crisis in it's wake. The thing is that real growth happens through innovation. The problem is that there has been no real innovation in any other market other than the tech/gadget market. Most of the growth we saw was based on things that had been here all along, we just found new ways to sell them. That is not a sustainable prospect.", 
        "intTime": 20090405, 
        "postID": 9, 
        "quote": "Originally posted by mcgreer: This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it.", 
        "reply": " The biggest problem that I have with that is the fact that the size that the economy was before this whole thing happened was artificial. It was bloated and as real as a $3 bill. The economy wants to contract to where it should naturally be. Stimulus only serves to keep this artificial, bloated economy. Stimulus only serves to stave off what the economy naturally want to do. Prices want to come down, but we aren't letting them (the banks would lose too much). When prices come down, wages will drop in direct relation (which isn't exactly a bad thing). When prices/wages come down and find equilibrium, the businesses will see demand for goods come back around and will thus need to hire more workers. Basically, it would be like a giant reset button on the whole economy. But, instead, we are trying to prop it up. I believe that by propping it up the only thing we will see is a long and grueling recession with the greater possibility of yet another crisis in it's wake. The thing is that real growth happens through innovation. The problem is that there has been no real innovation in any other market other than the tech/gadget market. Most of the growth we saw was based on things that had been here all along, we just found new ways to sell them. That is not a sustainable prospect.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 20:59:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: I only watch Moyers online. I'll watch the NCAA Final tomorrow night, and that will be my monthly dose of television. Since returning to America, it's absolutely impossible, both from a perspective of time and interest, to watch TV. There's nothing I want to see on a regular basis. One thing I am glad of is my cable provider carries a sports channel that will broadcast every stage of the Tour de France. I really miss that...sorry for going off topic. Yeah, I watch most everything online. It is much more convenient to just watch what I want to when I want to. I stick mostly to current events and educational stuff. I just do not have time to sit in front of a TV all day long. Most of my work is done on a computer, so in between projects it is nice to watch a 30 minute clip of something online and then go right back into work mode again.", 
        "intTime": 20090405, 
        "postID": 10, 
        "quote": "Originally posted by mcgreer: I only watch Moyers online. I'll watch the NCAA Final tomorrow night, and that will be my monthly dose of television. Since returning to America, it's absolutely impossible, both from a perspective of time and interest, to watch TV. There's nothing I want to see on a regular basis. One thing I am glad of is my cable provider carries a sports channel that will broadcast every stage of the Tour de France. I really miss that...sorry for going off topic.", 
        "reply": " Yeah, I watch most everything online. It is much more convenient to just watch what I want to when I want to. I stick mostly to current events and educational stuff. I just do not have time to sit in front of a TV all day long. Most of my work is done on a computer, so in between projects it is nice to watch a 30 minute clip of something online and then go right back into work mode again.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 21:03:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by mcgreer: I only watch Moyers online. I'll watch the NCAA Final tomorrow night, and that will be my monthly dose of television. Since returning to America, it's absolutely impossible, both from a perspective of time and interest, to watch TV. There's nothing I want to see on a regular basis. One thing I am glad of is my cable provider carries a sports channel that will broadcast every stage of the Tour de France. I really miss that...sorry for going off topic. Yeah, I watch most everything online. It is much more convenient to just watch what I want to when I want to. I stick mostly to current events and educational stuff. I just do not have time to sit in front of a TV all day long. Most of my work is done on a computer, so in between projects it is nice to watch a 30 minute clip of something online and then go right back into work mode again. Ever watch CNN Pipeline online? It's a mix of CNN International and CNN US (minus the US television personalities).", 
        "intTime": 20090405, 
        "postID": 11, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by mcgreer: I only watch Moyers online. I'll watch the NCAA Final tomorrow night, and that will be my monthly dose of television. Since returning to America, it's absolutely impossible, both from a perspective of time and interest, to watch TV. There's nothing I want to see on a regular basis. One thing I am glad of is my cable provider carries a sports channel that will broadcast every stage of the Tour de France. I really miss that...sorry for going off topic. Yeah, I watch most everything online. It is much more convenient to just watch what I want to when I want to. I stick mostly to current events and educational stuff. I just do not have time to sit in front of a TV all day long. Most of my work is done on a computer, so in between projects it is nice to watch a 30 minute clip of something online and then go right back into work mode again.", 
        "reply": " Ever watch CNN Pipeline online? It's a mix of CNN International and CNN US (minus the US television personalities).", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-05 21:15:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent. I'm inclined to believe it was actually much worse than that. I think those banks deliberately made those bad loans with an understanding that their friends in Congress would shift the liability to we taxpayers when the time came, just as with the Savings and Loan debacle several years ago. The money trail from global corporations to Congress, to most Presidential administrations and government regulators runs both ways and it's wide and deep. They have virtually unlimited control of OUR checkbook and can write themselves checks out of our account whenever they please. And, I think that's just what we're seeing happen. Now, assuming that to be true, the question arises as to why now? Timing is everything, so why did they create this crisis just before the last election?", 
        "intTime": 20090406, 
        "postID": 12, 
        "quote": "Originally posted by mcgreer: I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent.", 
        "reply": " I'm inclined to believe it was actually much worse than that. I think those banks deliberately made those bad loans with an understanding that their friends in Congress would shift the liability to we taxpayers when the time came, just as with the Savings and Loan debacle several years ago. The money trail from global corporations to Congress, to most Presidential administrations and government regulators runs both ways and it's wide and deep. They have virtually unlimited control of OUR checkbook and can write themselves checks out of our account whenever they please. And, I think that's just what we're seeing happen. Now, assuming that to be true, the question arises as to why now? Timing is everything, so why did they create this crisis just before the last election?", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-06 03:58:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "stillkit"
    }, 
    {
        "content": "Shock Doctrine...", 
        "intTime": 20090406, 
        "postID": 13, 
        "quote": "", 
        "reply": "Shock Doctrine...", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-06 05:14:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Reply Unless we have laws like the Muslims and the Chinese, Death to cheaters, there is nothing we can do to stop this.", 
        "intTime": 20090406, 
        "postID": 14, 
        "quote": "Reply", 
        "reply": " Unless we have laws like the Muslims and the Chinese, Death to cheaters, there is nothing we can do to stop this.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-06 06:30:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by mcgreer: This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it. The biggest problem that I have with that is the fact that the size that the economy was before this whole thing happened was artificial. It was bloated and as real as a $3 bill. The economy wants to contract to where it should naturally be. Stimulus only serves to keep this artificial, bloated economy. Stimulus only serves to stave off what the economy naturally want to do. Prices want to come down, but we aren't letting them (the banks would lose too much). When prices come down, wages will drop in direct relation (which isn't exactly a bad thing). When prices/wages come down and find equilibrium, the businesses will see demand for goods come back around and will thus need to hire more workers. Basically, it would be like a giant reset button on the whole economy. But, instead, we are trying to prop it up. I believe that by propping it up the only thing we will see is a long and grueling recession with the greater possibility of yet another crisis in it's wake. The thing is that real growth happens through innovation. The problem is that there has been no real innovation in any other market other than the tech/gadget market. Most of the growth we saw was based on things that had been here all along, we just found new ways to sell them. That is not a sustainable prospect. That's right - but remember that 70% of our economy is based on consumer spending. How do we fix that?", 
        "intTime": 20090406, 
        "postID": 15, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by mcgreer: This is why I understand the importance of this stimulus. It's bad, bad, bad in terms of deficits, but what else do we have left? If 40% of the private sector disappeared, how do we make up for that? The private sector sure can't do it. The biggest problem that I have with that is the fact that the size that the economy was before this whole thing happened was artificial. It was bloated and as real as a $3 bill. The economy wants to contract to where it should naturally be. Stimulus only serves to keep this artificial, bloated economy. Stimulus only serves to stave off what the economy naturally want to do. Prices want to come down, but we aren't letting them (the banks would lose too much). When prices come down, wages will drop in direct relation (which isn't exactly a bad thing). When prices/wages come down and find equilibrium, the businesses will see demand for goods come back around and will thus need to hire more workers. Basically, it would be like a giant reset button on the whole economy. But, instead, we are trying to prop it up. I believe that by propping it up the only thing we will see is a long and grueling recession with the greater possibility of yet another crisis in it's wake. The thing is that real growth happens through innovation. The problem is that there has been no real innovation in any other market other than the tech/gadget market. Most of the growth we saw was based on things that had been here all along, we just found new ways to sell them. That is not a sustainable prospect.", 
        "reply": " That's right - but remember that 70% of our economy is based on consumer spending. How do we fix that?", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-06 21:01:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by mcgreer: I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent. I'm inclined to believe it was actually much worse than that. I think those banks deliberately made those bad loans with an understanding that their friends in Congress would shift the liability to we taxpayers when the time came, just as with the Savings and Loan debacle several years ago. The money trail from global corporations to Congress, to most Presidential administrations and government regulators runs both ways and it's wide and deep. They have virtually unlimited control of OUR checkbook and can write themselves checks out of our account whenever they please. And, I think that's just what we're seeing happen. Now, assuming that to be true, the question arises as to why now? Timing is everything, so why did they create this crisis just before the last election? It simply blew up before the last election. This was a long time coming...", 
        "intTime": 20090406, 
        "postID": 16, 
        "quote": "Originally posted by stillkit: quote: Originally posted by mcgreer: I've heard this before. It's perfectly plausible. Black's angle is that these guys deliberately made bad loans because, as he puts it, they make lots of money in the short term, which was the whole intent. He also says that Paulson and Geithner are afraid to expose the fact (according to Black) that the banks got all this money because they are essentially insolvent. I'm inclined to believe it was actually much worse than that. I think those banks deliberately made those bad loans with an understanding that their friends in Congress would shift the liability to we taxpayers when the time came, just as with the Savings and Loan debacle several years ago. The money trail from global corporations to Congress, to most Presidential administrations and government regulators runs both ways and it's wide and deep. They have virtually unlimited control of OUR checkbook and can write themselves checks out of our account whenever they please. And, I think that's just what we're seeing happen. Now, assuming that to be true, the question arises as to why now? Timing is everything, so why did they create this crisis just before the last election?", 
        "reply": " It simply blew up before the last election. This was a long time coming...", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-06 21:03:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Everyone needs to watch the video, and send it to their friends and family.", 
        "intTime": 20090407, 
        "postID": 17, 
        "quote": "", 
        "reply": "Everyone needs to watch the video, and send it to their friends and family.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-07 06:34:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I've enjoyed reading this thread it agrees with a lot of what I think but more than that some of you guys definitely have me shaded in the financial knowledge market and I'm learnin' stuff!!! THANKS!! T", 
        "intTime": 20090407, 
        "postID": 18, 
        "quote": "", 
        "reply": "I've enjoyed reading this thread it agrees with a lot of what I think but more than that some of you guys definitely have me shaded in the financial knowledge market and I'm learnin' stuff!!! THANKS!! T", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-07 09:31:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "tawodi"
    }, 
    {
        "content": "I just wish I had lost ONLY 40% of my \"wealth.\"", 
        "intTime": 20090407, 
        "postID": 19, 
        "quote": "", 
        "reply": "I just wish I had lost ONLY 40% of my \"wealth.\"", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-07 10:22:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "That's an aggregate total. Many lost all their wealth, and the means to recover it.", 
        "intTime": 20090407, 
        "postID": 20, 
        "quote": "", 
        "reply": "That's an aggregate total. Many lost all their wealth, and the means to recover it.", 
        "threadID": "409192893_3070039912001", 
        "time": "2009-04-07 11:55:00", 
        "title": "Bill Moyers Journal...  Holy crap!", 
        "userID": "mcgreer"
    }
]