[
    {
        "content": "\"http://www.boston.com/sports/baseball/articles/2009/04/16/yankees_fan_says_civil_rights_violated/\" Reuters News Service: quote: A man ejected from Yankee Stadium during the playing of a patriotic song has sued the baseball team and New York City, saying his civil rights were violated when police barred him from going to the bathroom. The lawsuit says a New York City police officer told the man, Bradford Campeau-Laurion, not to leave his seat section during \"God Bless America,\" which the Yankees play over loudspeakers during a break in the game. The incident took place Aug. 26 during a Red Sox game. The suit seeks compensatory damages and a ruling that stops the Yankees from requiring people to participate in religious or political activities. Police said the resident of Queens was unruly and reeked of alcohol. Should people be forced to remain in their seats and not be allowed to go to the restrooms at a public venue (athletic stadium, movie theater, NASCAR race track, etc?) when a patriotic song (that is not the National Anthem) is being played? And, for those who will justify the police officer's actions on the reported fact that he said the person was \"unruly and reeked of alcohol\", who sold him the alcohol? The New York Yankees concession stands! Seems to me that the New York Yankees management would want to have the ticket holder use the restroom, even during the playing of \"God Bless America\", rather than urinate on his seat.", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "A man ejected from Yankee Stadium during the playing of a patriotic song has sued the baseball team and New York City, saying his civil rights were violated when police barred him from going to the bathroom. The lawsuit says a New York City police officer told the man, Bradford Campeau-Laurion, not to leave his seat section during \"God Bless America,\" which the Yankees play over loudspeakers during a break in the game. The incident took place Aug. 26 during a Red Sox game. The suit seeks compensatory damages and a ruling that stops the Yankees from requiring people to participate in religious or political activities. Police said the resident of Queens was unruly and reeked of alcohol.", 
        "reply": "\"http://www.boston.com/sports/baseball/articles/2009/04/16/yankees_fan_says_civil_rights_violated/\" Reuters News Service:  Should people be forced to remain in their seats and not be allowed to go to the restrooms at a public venue (athletic stadium, movie theater, NASCAR race track, etc?) when a patriotic song (that is not the National Anthem) is being played? And, for those who will justify the police officer's actions on the reported fact that he said the person was \"unruly and reeked of alcohol\", who sold him the alcohol? The New York Yankees concession stands! Seems to me that the New York Yankees management would want to have the ticket holder use the restroom, even during the playing of \"God Bless America\", rather than urinate on his seat.", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 06:11:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Carrying enforced patriotism a little too far? Yes!", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "Carrying enforced patriotism a little too far?", 
        "reply": " Yes!", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 06:27:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I have a feeling there is more to this story, but if not...then \"no\". Someone should not be forced to stay in their seat for ANY song, even the National Anthem. Let public opinion rule, not police enforcement. Someone walking away during the National Anthem should get some stern looks from people around them, not the police throwing them out of the park.", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "I have a feeling there is more to this story, but if not...then \"no\". Someone should not be forced to stay in their seat for ANY song, even the National Anthem. Let public opinion rule, not police enforcement. Someone walking away during the National Anthem should get some stern looks from people around them, not the police throwing them out of the park.", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 06:28:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: I have a feeling there is more to this story, but if not...then \"no\". Someone should not be forced to stay in their seat for ANY song, even the National Anthem. Let public opinion rule, not police enforcement. Someone walking away during the National Anthem should get some stern looks from people around them, not the police throwing them out of the park. I agree. But to the poster who said that Yankee stadium sold him the alcohol that he got drunk with, that would be a lot of alcohol, for the game not even being started yet. If he was that drunk, he probably came that way.", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by SeaWitch1220: I have a feeling there is more to this story, but if not...then \"no\". Someone should not be forced to stay in their seat for ANY song, even the National Anthem. Let public opinion rule, not police enforcement. Someone walking away during the National Anthem should get some stern looks from people around them, not the police throwing them out of the park.", 
        "reply": " I agree. But to the poster who said that Yankee stadium sold him the alcohol that he got drunk with, that would be a lot of alcohol, for the game not even being started yet. If he was that drunk, he probably came that way.", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 06:53:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: I agree. But to the poster who said that Yankee stadium sold him the alcohol that he got drunk with, that would be a lot of alcohol, for the game not even being started yet. If he was that drunk, he probably came that way. I believe they play \"God Bless America\" between the 6th and 7th inning (the \"seventh-inning stretch\"). So if the concessionaires weren't doing their job properly, a person could get pretty blasted by that time, if he had been drinking earlier but was legally sober when he arrived at the stadium. Seems to me that a better solution would have been to cut the ticket holder off - or let him use the restroom during \"God Bless America\". Personaly, from my experience with law enforcement officers in Philadelphia, New York City and various cities and towns in the Deep South over my 50+ years, I suspect it was probably some over-zealous cop impressed with his own authority. You know, the kind that takes the position: \"I'm a cop. The law is what I say it is.\"", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "Originally posted by billdawg24: I agree. But to the poster who said that Yankee stadium sold him the alcohol that he got drunk with, that would be a lot of alcohol, for the game not even being started yet. If he was that drunk, he probably came that way.", 
        "reply": " I believe they play \"God Bless America\" between the 6th and 7th inning (the \"seventh-inning stretch\"). So if the concessionaires weren't doing their job properly, a person could get pretty blasted by that time, if he had been drinking earlier but was legally sober when he arrived at the stadium. Seems to me that a better solution would have been to cut the ticket holder off - or let him use the restroom during \"God Bless America\". Personaly, from my experience with law enforcement officers in Philadelphia, New York City and various cities and towns in the Deep South over my 50+ years, I suspect it was probably some over-zealous cop impressed with his own authority. You know, the kind that takes the position: \"I'm a cop. The law is what I say it is.\"", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 07:24:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Police said the resident of Queens was unruly and reeked of alcohol. Alcohol should be baned from all sporting events. Problem solved.", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "Police said the resident of Queens was unruly and reeked of alcohol.", 
        "reply": " Alcohol should be baned from all sporting events. Problem solved.", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 07:38:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Sure. That'll work. Ever been to a college football game in the SEC? There is no alcohol served. ....Not that it makes a bit of difference. I've seen (and drank from) one of three kegs in the student section, and every alumni in the place has a hip flask...or two. War Eagle! Sullivan013", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "", 
        "reply": "Sure. That'll work. Ever been to a college football game in the SEC? There is no alcohol served. ....Not that it makes a bit of difference. I've seen (and drank from) one of three kegs in the student section, and every alumni in the place has a hip flask...or two. War Eagle! Sullivan013", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 08:07:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by billdawg24: I agree. But to the poster who said that Yankee stadium sold him the alcohol that he got drunk with, that would be a lot of alcohol, for the game not even being started yet. If he was that drunk, he probably came that way. I believe they play \"God Bless America\" between the 6th and 7th inning (the \"seventh-inning stretch\"). So if the concessionaires weren't doing their job properly, a person could get pretty blasted by that time, if he had been drinking earlier but was legally sober when he arrived at the stadium. Seems to me that a better solution would have been to cut the ticket holder off - or let him use the restroom during \"God Bless America\". Personaly, from my experience with law enforcement officers in Philadelphia, New York City and various cities and towns in the Deep South over my 50+ years, I suspect it was probably some over-zealous cop impressed with his own authority. You know, the kind that takes the position: \"I'm a cop. The law is what I say it is.\" OK, thanks, I didn't realize that about the song. I assumed it was played before the game like the National Anthem. Yeah, if that's the case, adn he was that lit, teh vendors weren't monitoring properly.", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by billdawg24: I agree. But to the poster who said that Yankee stadium sold him the alcohol that he got drunk with, that would be a lot of alcohol, for the game not even being started yet. If he was that drunk, he probably came that way. I believe they play \"God Bless America\" between the 6th and 7th inning (the \"seventh-inning stretch\"). So if the concessionaires weren't doing their job properly, a person could get pretty blasted by that time, if he had been drinking earlier but was legally sober when he arrived at the stadium. Seems to me that a better solution would have been to cut the ticket holder off - or let him use the restroom during \"God Bless America\". Personaly, from my experience with law enforcement officers in Philadelphia, New York City and various cities and towns in the Deep South over my 50+ years, I suspect it was probably some over-zealous cop impressed with his own authority. You know, the kind that takes the position: \"I'm a cop. The law is what I say it is.\"", 
        "reply": " OK, thanks, I didn't realize that about the song. I assumed it was played before the game like the National Anthem. Yeah, if that's the case, adn he was that lit, teh vendors weren't monitoring properly.", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 10:45:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: I suspect it was probably some over-zealous cop impressed with his own authority. You know, the kind that takes the position: \"I'm a cop. The law is what I say it is.\" That would be my guess as well.", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "Originally posted by Fightdirector: I suspect it was probably some over-zealous cop impressed with his own authority. You know, the kind that takes the position: \"I'm a cop. The law is what I say it is.\"", 
        "reply": " That would be my guess as well.", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 10:46:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: Sure. That'll work. Ever been to a college football game in the SEC? There is no alcohol served. ....Not that it makes a bit of difference. I've seen (and drank from) one of three kegs in the student section, and every alumni in the place has a hip flask...or two. War Eagle! Sullivan013 Yeah, go to 'The World's Largest Cocktail Party' in Jacksonville every year, and nobody is drunk......for more than 4 days,lol. GO DAWGS.....Beat the Plainsmen,Tigers,War Eagle, whatever the hell you're calling yourself this week,", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "Originally posted by sullivan013: Sure. That'll work. Ever been to a college football game in the SEC? There is no alcohol served. ....Not that it makes a bit of difference. I've seen (and drank from) one of three kegs in the student section, and every alumni in the place has a hip flask...or two. War Eagle! Sullivan013", 
        "reply": " Yeah, go to 'The World's Largest Cocktail Party' in Jacksonville every year, and nobody is drunk......for more than 4 days,lol. GO DAWGS.....Beat the Plainsmen,Tigers,War Eagle, whatever the hell you're calling yourself this week,", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 10:48:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: I have a feeling there is more to this story, but if not...then \"no\". Someone should not be forced to stay in their seat for ANY song, even the National Anthem. Let public opinion rule, not police enforcement. Someone walking away during the National Anthem should get some stern looks from people around them, not the police throwing them out of the park. Good for you Seawitch! From the same article, \"Police said the resident of Queens was unruly and reeked of alcohol.\" This article is a lot better: ++http://nbcsports.msnbc.com/id/30230537/ It includes, \"...Police spokesman Paul J. Browne said the officers, who were being paid by the Yankees to work at the Bronx stadium, ejected Campeau-Laurion, 30, after they “observed a male cursing, using inappropriate language and acting in a disorderly manner while reeking of alcohol.”", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "Originally posted by SeaWitch1220: I have a feeling there is more to this story, but if not...then \"no\". Someone should not be forced to stay in their seat for ANY song, even the National Anthem. Let public opinion rule, not police enforcement. Someone walking away during the National Anthem should get some stern looks from people around them, not the police throwing them out of the park.", 
        "reply": " Good for you Seawitch! From the same article, \"Police said the resident of Queens was unruly and reeked of alcohol.\" This article is a lot better: ++http://nbcsports.msnbc.com/id/30230537/ It includes, \"...Police spokesman Paul J. Browne said the officers, who were being paid by the Yankees to work at the Bronx stadium, ejected Campeau-Laurion, 30, after they “observed a male cursing, using inappropriate language and acting in a disorderly manner while reeking of alcohol.”", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 10:52:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "foxred03"
    }, 
    {
        "content": "I wonder how much money this guy is sueing for. I reserve judgement till we know more but if this guy was after justice he would just be asking for a refund and an apology from Steinbrenner junior. ----------------------------------------------- But last summer, WCBS-TV quoted the police as defending the treatment of Campeau-Laurion by saying, “The officers observed a male standing on his seat, cursing, using inappropriate language and acting in a disorderly manner while reeking of alcohol, and decided to eject him rather than subject others to his offensive behavior.” The department reissued the same statement when asked for a response to the suit yesterday. \"http://www3.signonsandiego.com/stories/2009/apr/16/1s16digest002516/?sports&zIndex=83213\"", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "", 
        "reply": "I wonder how much money this guy is sueing for. I reserve judgement till we know more but if this guy was after justice he would just be asking for a refund and an apology from Steinbrenner junior. ----------------------------------------------- But last summer, WCBS-TV quoted the police as defending the treatment of Campeau-Laurion by saying, “The officers observed a male standing on his seat, cursing, using inappropriate language and acting in a disorderly manner while reeking of alcohol, and decided to eject him rather than subject others to his offensive behavior.” The department reissued the same statement when asked for a response to the suit yesterday. \"http://www3.signonsandiego.com/stories/2009/apr/16/1s16digest002516/?sports&zIndex=83213\"", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 18:05:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Yankees can do no wrong - well, except for A-roid... Wandering and Wondering", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "", 
        "reply": "Yankees can do no wrong - well, except for A-roid... Wandering and Wondering", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 18:18:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Yankees can do no wrong - well, except for A-roid... Yankee Stadium: 1.3billion Pay-Roll: 209 million CC Sabathia\"AKA: CC Madoff\" throwing 120 pitches in 7 innings: 180million Yankees getting blown out during their first home game in new stadium, 10-2: Priceless", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "Originally posted by greywolfghost: Yankees can do no wrong - well, except for A-roid...", 
        "reply": " Yankee Stadium: 1.3billion Pay-Roll: 209 million CC Sabathia\"AKA: CC Madoff\" throwing 120 pitches in 7 innings: 180million Yankees getting blown out during their first home game in new stadium, 10-2: Priceless", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 19:04:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "No, someone should not be required to stand still for any song, even if it's the National Anthem. I wouldn't even give a person who was walking during the Anthem a dirty glare as someone else suggested. I would rather someone run during the Anthem than get diarrhea in their pants and on the ground around me. Or what if the person is deaf? What if the person has a prostate problem? What if, what if, what if? None of anyone else's business.", 
        "intTime": 20090416, 
        "postID": 15, 
        "quote": "", 
        "reply": "No, someone should not be required to stand still for any song, even if it's the National Anthem. I wouldn't even give a person who was walking during the Anthem a dirty glare as someone else suggested. I would rather someone run during the Anthem than get diarrhea in their pants and on the ground around me. Or what if the person is deaf? What if the person has a prostate problem? What if, what if, what if? None of anyone else's business.", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 19:16:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "Philhelm"
    }, 
    {
        "content": "yeah there's no real reason to treat \"The Star-Spangled Banner\" as sacred especially considering the tune is a drinking song there's no good reason to force people to stay seated or standing or anything during any song", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "", 
        "reply": "yeah there's no real reason to treat \"The Star-Spangled Banner\" as sacred especially considering the tune is a drinking song there's no good reason to force people to stay seated or standing or anything during any song", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 20:42:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah there's no real reason to treat \"The Star-Spangled Banner\" as sacred especially considering the tune is a drinking song there's no good reason to force people to stay seated or standing or anything during any song And it wasn't even the National Anthem, \"The Star Spangled Banner\" - it was \"God Bless America\". Imagine what Mr. Supercop would have done to the ticket-holder if they had been playing Lee Hazelwood's \"I'm Proud To Be An American\" or Melre Haggard's \"Okie From Muskogee\" - he probably would have pulled his service pistol out and shot him for not standing at attention!", 
        "intTime": 20090416, 
        "postID": 17, 
        "quote": "Originally posted by liberal90: yeah there's no real reason to treat \"The Star-Spangled Banner\" as sacred especially considering the tune is a drinking song there's no good reason to force people to stay seated or standing or anything during any song", 
        "reply": " And it wasn't even the National Anthem, \"The Star Spangled Banner\" - it was \"God Bless America\". Imagine what Mr. Supercop would have done to the ticket-holder if they had been playing Lee Hazelwood's \"I'm Proud To Be An American\" or Melre Haggard's \"Okie From Muskogee\" - he probably would have pulled his service pistol out and shot him for not standing at attention!", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-16 20:48:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: No, someone should not be required to stand still for any song, even if it's the National Anthem. I wouldn't even give a person who was walking during the Anthem a dirty glare as someone else suggested. I would rather someone run during the Anthem than get diarrhea in their pants and on the ground around me. Or what if the person is deaf? What if the person has a prostate problem? What if, what if, what if? None of anyone else's business. Isn't that what they make Flomax for,", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "Originally posted by Philhelm: No, someone should not be required to stand still for any song, even if it's the National Anthem. I wouldn't even give a person who was walking during the Anthem a dirty glare as someone else suggested. I would rather someone run during the Anthem than get diarrhea in their pants and on the ground around me. Or what if the person is deaf? What if the person has a prostate problem? What if, what if, what if? None of anyone else's business.", 
        "reply": " Isn't that what they make Flomax for,", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-17 09:04:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "well we are such hardcore patriots down here in ft myers it just rubbed off on the red socks during spring training./... hehehe", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "", 
        "reply": "well we are such hardcore patriots down here in ft myers it just rubbed off on the red socks during spring training./... hehehe", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-17 09:11:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I'm willing to bet his getting tossed had NOTHING to do with the song, but more to the fact he was a drunk and disorderly azzhat", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "", 
        "reply": "I'm willing to bet his getting tossed had NOTHING to do with the song, but more to the fact he was a drunk and disorderly azzhat", 
        "threadID": "409192893_9500009022001", 
        "time": "2009-04-17 09:49:00", 
        "title": "Carrying enforced patriotism a little too far?", 
        "userID": "navy8086"
    }
]