[
    {
        "content": "WASHINGTON – The economy is fundamentally sound despite the temporary \"mess\" it's in, the White House said Sunday in the kind of upbeat assessment that Barack Obama had mocked as a presidential candidate. Obama's Democratic allies pleaded for patience with an administration hitting the two-month mark this week, while Republicans said the White House's plans ignore small business and the immediate need to fix what ails the economy. After weeks projecting a dismal outlook on the economy, administration officials — led by the president himself in recent days — swung their rhetoric toward optimism in what became Wall Street's best stretch since November. seem to remember someone getting blasted for almost the very same words what a crock", 
        "intTime": 20090315, 
        "postID": 1, 
        "quote": "", 
        "reply": "WASHINGTON – The economy is fundamentally sound despite the temporary \"mess\" it's in, the White House said Sunday in the kind of upbeat assessment that Barack Obama had mocked as a presidential candidate. Obama's Democratic allies pleaded for patience with an administration hitting the two-month mark this week, while Republicans said the White House's plans ignore small business and the immediate need to fix what ails the economy. After weeks projecting a dismal outlook on the economy, administration officials — led by the president himself in recent days — swung their rhetoric toward optimism in what became Wall Street's best stretch since November. seem to remember someone getting blasted for almost the very same words what a crock", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-15 15:41:00", 
        "title": "PBHO, what a crock", 
        "userID": "Ira1945"
    }, 
    {
        "content": "This is what is known as partisan politics. Been goin' on since Hector was a pup.", 
        "intTime": 20090315, 
        "postID": 2, 
        "quote": "", 
        "reply": "This is what is known as partisan politics. Been goin' on since Hector was a pup.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-15 23:54:00", 
        "title": "PBHO, what a crock", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Something tells me there will be some nay sayer's to this Ira.", 
        "intTime": 20090315, 
        "postID": 3, 
        "quote": "", 
        "reply": "Something tells me there will be some nay sayer's to this Ira.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-15 23:58:00", 
        "title": "PBHO, what a crock", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Didn't McCain get hammered for saying the same thing?", 
        "intTime": 20090316, 
        "postID": 4, 
        "quote": "", 
        "reply": "Didn't McCain get hammered for saying the same thing?", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 03:19:00", 
        "title": "PBHO, what a crock", 
        "userID": "threerings"
    }, 
    {
        "content": "Obama and his minions in congress were using fear mongering in order to push their liberal spending wish-list through congress and convince Americans that the United States would collapse within weeks if they didn't. And as usual, liberals and weak-kneed republicans bought off on the ploy. \"The World's Finest\"", 
        "intTime": 20090316, 
        "postID": 5, 
        "quote": "", 
        "reply": "Obama and his minions in congress were using fear mongering in order to push their liberal spending wish-list through congress and convince Americans that the United States would collapse within weeks if they didn't. And as usual, liberals and weak-kneed republicans bought off on the ploy. \"The World's Finest\"", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 04:07:00", 
        "title": "PBHO, what a crock", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: WASHINGTON – The economy is fundamentally sound despite the temporary \"mess\" it's in, the White House said Sunday in the kind of upbeat assessment that Barack Obama had mocked as a presidential candidate. Obama's Democratic allies pleaded for patience with an administration hitting the two-month mark this week, while Republicans said the White House's plans ignore small business and the immediate need to fix what ails the economy. After weeks projecting a dismal outlook on the economy, administration officials — led by the president himself in recent days — swung their rhetoric toward optimism in what became Wall Street's best stretch since November. seem to remember someone getting blasted for almost the very same words what a crock COMMENT: Okay, there's a very plausible reality that unemployment may eclipse 10% before the economy stabilizes; that more families may lose their homes to foreclosure with an attendant further decrease in home values before that market stabilizes; and that energy prices may well peak again in driving up consumer costs for all basic commodities to lengthen the time of economic recovery before we can exploit alternative energies and efficiencies. Perhaps all of this \"cracks that crock\" and is more encouraging for the \"doom and gloom\" set.", 
        "intTime": 20090316, 
        "postID": 6, 
        "quote": "Originally posted by Ira1945: WASHINGTON – The economy is fundamentally sound despite the temporary \"mess\" it's in, the White House said Sunday in the kind of upbeat assessment that Barack Obama had mocked as a presidential candidate. Obama's Democratic allies pleaded for patience with an administration hitting the two-month mark this week, while Republicans said the White House's plans ignore small business and the immediate need to fix what ails the economy. After weeks projecting a dismal outlook on the economy, administration officials — led by the president himself in recent days — swung their rhetoric toward optimism in what became Wall Street's best stretch since November. seem to remember someone getting blasted for almost the very same words what a crock", 
        "reply": " COMMENT: Okay, there's a very plausible reality that unemployment may eclipse 10% before the economy stabilizes; that more families may lose their homes to foreclosure with an attendant further decrease in home values before that market stabilizes; and that energy prices may well peak again in driving up consumer costs for all basic commodities to lengthen the time of economic recovery before we can exploit alternative energies and efficiencies. Perhaps all of this \"cracks that crock\" and is more encouraging for the \"doom and gloom\" set.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 04:30:00", 
        "title": "PBHO, what a crock", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: COMMENT: Okay, there's a very plausible reality that unemployment may eclipse 10% before the economy stabilizes; that more families may lose their homes to foreclosure with an attendant further decrease in home values before that market stabilizes; and that energy prices may well peak again in driving up consumer costs for all basic commodities to lengthen the time of economic recovery before we can exploit alternative energies and efficiencies. Perhaps all of this \"cracks that crock\" and is more encouraging for the \"doom and gloom\" set. more crocl", 
        "intTime": 20090316, 
        "postID": 7, 
        "quote": "COMMENT: Okay, there's a very plausible reality that unemployment may eclipse 10% before the economy stabilizes; that more families may lose their homes to foreclosure with an attendant further decrease in home values before that market stabilizes; and that energy prices may well peak again in driving up consumer costs for all basic commodities to lengthen the time of economic recovery before we can exploit alternative energies and efficiencies. Perhaps all of this \"cracks that crock\" and is more encouraging for the \"doom and gloom\" set.", 
        "reply": " more crocl", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 04:35:00", 
        "title": "PBHO, what a crock", 
        "userID": "Ira1945"
    }, 
    {
        "content": "McCain said the EXACT same thing! Only when he said it, the economy was actually better than it is now. Nova, jeejaydee,... someone please tell me how this is different? Tell me why President Obama shouldn't be roundly criticized at every turn for this.", 
        "intTime": 20090316, 
        "postID": 8, 
        "quote": "", 
        "reply": "McCain said the EXACT same thing! Only when he said it, the economy was actually better than it is now. Nova, jeejaydee,... someone please tell me how this is different? Tell me why President Obama shouldn't be roundly criticized at every turn for this.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 05:19:00", 
        "title": "PBHO, what a crock", 
        "userID": "2494906"
    }, 
    {
        "content": "The \"doom and gloom\" set? How about the reality set. Are the people who are newely homeless due to the economic crisis, forced to live in Obamavilles because they have no where else to go, \"doom and gloomers\" or part of the new reality set? Are college students who are not able to complete their education due to the economic meltdown \"doom and gloomers\" or part of the new reality set? Are the AIG execs using taxpayer money for huge bonuses \"doom and gloomers\" or part of the new reality set? Reality says we can not spend our way out of this depression. Reality says if debt caused the economic depression then adding to that debt will not end the economic depression. There is no HOPE the spendulus legislation will CHANGE our current economic depression.", 
        "intTime": 20090316, 
        "postID": 9, 
        "quote": "", 
        "reply": "The \"doom and gloom\" set? How about the reality set. Are the people who are newely homeless due to the economic crisis, forced to live in Obamavilles because they have no where else to go, \"doom and gloomers\" or part of the new reality set? Are college students who are not able to complete their education due to the economic meltdown \"doom and gloomers\" or part of the new reality set? Are the AIG execs using taxpayer money for huge bonuses \"doom and gloomers\" or part of the new reality set? Reality says we can not spend our way out of this depression. Reality says if debt caused the economic depression then adding to that debt will not end the economic depression. There is no HOPE the spendulus legislation will CHANGE our current economic depression.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 06:19:00", 
        "title": "PBHO, what a crock", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "To use PBHO's own line from his stump speeches \"Just words, just speeches\". It appears that is all he is. He couldnt lead his way out of a cul de sac. GRAYMAN", 
        "intTime": 20090316, 
        "postID": 10, 
        "quote": "", 
        "reply": "To use PBHO's own line from his stump speeches \"Just words, just speeches\". It appears that is all he is. He couldnt lead his way out of a cul de sac. GRAYMAN", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 06:41:00", 
        "title": "PBHO, what a crock", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "I've been saying that the economic fundamentals are just as sound as they were before the election and everybody is \"OMG, NO! There's a recession, I saw it on TV! We're all gonna starve! Propaganda works well in America, this whole thing proves that we have an inherent desire to deceive ourselves and each other and get led down the primrose path by anyone in a nice suit and haircut. Scammed again, think we'd learn to seperate the beans from the bull.", 
        "intTime": 20090316, 
        "postID": 11, 
        "quote": "", 
        "reply": "I've been saying that the economic fundamentals are just as sound as they were before the election and everybody is \"OMG, NO! There's a recession, I saw it on TV! We're all gonna starve! Propaganda works well in America, this whole thing proves that we have an inherent desire to deceive ourselves and each other and get led down the primrose path by anyone in a nice suit and haircut. Scammed again, think we'd learn to seperate the beans from the bull.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 08:31:00", 
        "title": "PBHO, what a crock", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: To use PBHO's own line from his stump speeches \"Just words, just speeches\". It appears that is all he is. He couldnt lead his way out of a cul de sac. GRAYMAN Wet paper bag.....", 
        "intTime": 20090316, 
        "postID": 12, 
        "quote": "Originally posted by GRAYMAN: To use PBHO's own line from his stump speeches \"Just words, just speeches\". It appears that is all he is. He couldnt lead his way out of a cul de sac. GRAYMAN", 
        "reply": " Wet paper bag.....", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 08:32:00", 
        "title": "PBHO, what a crock", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by Ira1945: WASHINGTON – The economy is fundamentally sound despite the temporary \"mess\" it's in, the White House said Sunday in the kind of upbeat assessment that Barack Obama had mocked as a presidential candidate. Obama's Democratic allies pleaded for patience with an administration hitting the two-month mark this week, while Republicans said the White House's plans ignore small business and the immediate need to fix what ails the economy. After weeks projecting a dismal outlook on the economy, administration officials — led by the president himself in recent days — swung their rhetoric toward optimism in what became Wall Street's best stretch since November. seem to remember someone getting blasted for almost the very same words what a crock COMMENT: Okay, there's a very plausible reality that unemployment may eclipse 10% before the economy stabilizes; that more families may lose their homes to foreclosure with an attendant further decrease in home values before that market stabilizes; and that energy prices may well peak again in driving up consumer costs for all basic commodities to lengthen the time of economic recovery before we can exploit alternative energies and efficiencies. Perhaps all of this \"cracks that crock\" and is more encouraging for the \"doom and gloom\" set. So when Senator McCain said it, he was wrong & it was used against him to show he was out of touch. But if the President says the same thing he's right. If only George Orwell was still alive to sort out this truth-speak.", 
        "intTime": 20090316, 
        "postID": 13, 
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by Ira1945: WASHINGTON – The economy is fundamentally sound despite the temporary \"mess\" it's in, the White House said Sunday in the kind of upbeat assessment that Barack Obama had mocked as a presidential candidate. Obama's Democratic allies pleaded for patience with an administration hitting the two-month mark this week, while Republicans said the White House's plans ignore small business and the immediate need to fix what ails the economy. After weeks projecting a dismal outlook on the economy, administration officials — led by the president himself in recent days — swung their rhetoric toward optimism in what became Wall Street's best stretch since November. seem to remember someone getting blasted for almost the very same words what a crock COMMENT: Okay, there's a very plausible reality that unemployment may eclipse 10% before the economy stabilizes; that more families may lose their homes to foreclosure with an attendant further decrease in home values before that market stabilizes; and that energy prices may well peak again in driving up consumer costs for all basic commodities to lengthen the time of economic recovery before we can exploit alternative energies and efficiencies. Perhaps all of this \"cracks that crock\" and is more encouraging for the \"doom and gloom\" set.", 
        "reply": " So when Senator McCain said it, he was wrong & it was used against him to show he was out of touch. But if the President says the same thing he's right. If only George Orwell was still alive to sort out this truth-speak.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 09:00:00", 
        "title": "PBHO, what a crock", 
        "userID": "67NOV"
    }, 
    {
        "content": "Even more news. Barney Frank was blaming the Bush Admin for failing to prevent the big bonuses for AIG. Nothing new there. However, he failed to note that the lead man on the AIG bailout was our new Sec. of the Treasury.. Geithner!!!!!!!!!!!!!!!!!!!! Not Paulson, not Bush, not McCain! Guess who Geithner was working for at the time?", 
        "intTime": 20090316, 
        "postID": 14, 
        "quote": "", 
        "reply": "Even more news. Barney Frank was blaming the Bush Admin for failing to prevent the big bonuses for AIG. Nothing new there. However, he failed to note that the lead man on the AIG bailout was our new Sec. of the Treasury.. Geithner!!!!!!!!!!!!!!!!!!!! Not Paulson, not Bush, not McCain! Guess who Geithner was working for at the time?", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 18:42:00", 
        "title": "PBHO, what a crock", 
        "userID": "herd173"
    }, 
    {
        "content": "The One is a bull*******, just like too many other polytishuns. Change we can believe in! Yowzah! As long as he's \"in charge,\" whatever he says or does somehow, miraculously, supposedly smells like roses and asphidia despite its unadulterated fecal nature--just ask him and the lemming mouthpieces who spout the shibboleths of the obamanation.", 
        "intTime": 20090316, 
        "postID": 15, 
        "quote": "", 
        "reply": "The One is a bull*******, just like too many other polytishuns. Change we can believe in! Yowzah! As long as he's \"in charge,\" whatever he says or does somehow, miraculously, supposedly smells like roses and asphidia despite its unadulterated fecal nature--just ask him and the lemming mouthpieces who spout the shibboleths of the obamanation.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 18:50:00", 
        "title": "PBHO, what a crock", 
        "userID": "RRR52"
    }, 
    {
        "content": "Well, the author of the article did say that. However, in that same article, the author directly quotes Obama - and he misquoted the President somewhat. Here's what Obama actually said: \"If we are keeping focused on all the fundamentally sound aspects of our economy, all the outstanding companies, workers, all the innovation and dynamism in this economy, then we're going to get through this...\" Unfortunately, one of his aides tried to interpret that, and did a pretty lousy job. From the same article: \"...(T)hat optimistic message came from economic adviser Christina Romer. When asked during an appearance on NBC's \"Meet the Press\" if the fundamentals of the economy were sound, she replied: 'Of course they are sound. The fundamentals are sound in the sense that the American workers are sound, we have a good capital stock, we have good technology...We know that -- that temporarily we're in a mess, right? We've seen huge job loss, we've seen very large falls in GDP. So certainly in the short run we're in a -- in a bad situation.' \"http://finance.yahoo.com/news/White-House-says-economy-is-apf-14643833.html\" LOL She talked herself into a circle on that one. The previous week, OMB Director Peter Orszag said, \"Well, I think fundamentally, the economy is weak. Job losses began in January of 2008. The stock market started declining October 2007. This has been, you know, eight years in the making, and again, it's going to take some time to work our way out of it.\" \"http://www.boston.com/news/nation/washington/articles/2009/03/09/economy_is_weak_white_house_budget_director_orszag_says/\" Maybe those two need to be in the same meetings at the same time. They are obviously not reading from the same page. But the author of this article needs to be careful of how he shapes a story.", 
        "intTime": 20090316, 
        "postID": 16, 
        "quote": "", 
        "reply": "Well, the author of the article did say that. However, in that same article, the author directly quotes Obama - and he misquoted the President somewhat. Here's what Obama actually said: \"If we are keeping focused on all the fundamentally sound aspects of our economy, all the outstanding companies, workers, all the innovation and dynamism in this economy, then we're going to get through this...\" Unfortunately, one of his aides tried to interpret that, and did a pretty lousy job. From the same article: \"...(T)hat optimistic message came from economic adviser Christina Romer. When asked during an appearance on NBC's \"Meet the Press\" if the fundamentals of the economy were sound, she replied: 'Of course they are sound. The fundamentals are sound in the sense that the American workers are sound, we have a good capital stock, we have good technology...We know that -- that temporarily we're in a mess, right? We've seen huge job loss, we've seen very large falls in GDP. So certainly in the short run we're in a -- in a bad situation.' \"http://finance.yahoo.com/news/White-House-says-economy-is-apf-14643833.html\" LOL She talked herself into a circle on that one. The previous week, OMB Director Peter Orszag said, \"Well, I think fundamentally, the economy is weak. Job losses began in January of 2008. The stock market started declining October 2007. This has been, you know, eight years in the making, and again, it's going to take some time to work our way out of it.\" \"http://www.boston.com/news/nation/washington/articles/2009/03/09/economy_is_weak_white_house_budget_director_orszag_says/\" Maybe those two need to be in the same meetings at the same time. They are obviously not reading from the same page. But the author of this article needs to be careful of how he shapes a story.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 20:11:00", 
        "title": "PBHO, what a crock", 
        "userID": "mcgreer"
    }, 
    {
        "content": "maybe the Dems should have only tried to convince people the economy was a disaster for 4 years instead of 8. Normal Wall Street would have been pouncing on many of these losing stocks before this. The Dems have people convinced that things have been so bad they are refusing to invest. That's why the criticism that people are saving too much. How many times did Obama use \"crisis\" in just one speech. Well, he's the savior, people believed him. Maybe too late to be upbeat about the economy. Now we have Barney Frank blaming Bush for the AIG bonuses... It was Geithner who was the lead man on the whole bailout of AIG. Maybe he just forgot to include it, but a legal contract is still a legal contract.", 
        "intTime": 20090316, 
        "postID": 17, 
        "quote": "", 
        "reply": "maybe the Dems should have only tried to convince people the economy was a disaster for 4 years instead of 8. Normal Wall Street would have been pouncing on many of these losing stocks before this. The Dems have people convinced that things have been so bad they are refusing to invest. That's why the criticism that people are saving too much. How many times did Obama use \"crisis\" in just one speech. Well, he's the savior, people believed him. Maybe too late to be upbeat about the economy. Now we have Barney Frank blaming Bush for the AIG bonuses... It was Geithner who was the lead man on the whole bailout of AIG. Maybe he just forgot to include it, but a legal contract is still a legal contract.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-16 21:55:00", 
        "title": "PBHO, what a crock", 
        "userID": "herd173"
    }, 
    {
        "content": "the one reason aig got bailed out is because they insure congresses retirement funds. the other is they are kbr's insurance company for contractors in iraq and a-stan. the gubmint cant let them fail, even if they should go to jail. when the savings and loan debacle happened people went to jail. when are the crooks in this crime going? dont hold your breath, because some of them happen to be in congress. the others are their partners.", 
        "intTime": 20090317, 
        "postID": 18, 
        "quote": "", 
        "reply": "the one reason aig got bailed out is because they insure congresses retirement funds. the other is they are kbr's insurance company for contractors in iraq and a-stan. the gubmint cant let them fail, even if they should go to jail. when the savings and loan debacle happened people went to jail. when are the crooks in this crime going? dont hold your breath, because some of them happen to be in congress. the others are their partners.", 
        "threadID": "409192893_6280049712001", 
        "time": "2009-03-17 01:12:00", 
        "title": "PBHO, what a crock", 
        "userID": "backtoiraq"
    }
]