[
    {
        "content": "\"http://www.google.com/hostednews/ap/article/ALeqM5jSnHdALg23pNqEeutIy0eicw1oHgD98A8HT01\" quote: Republicans on Wednesday abandoned an effort to label their opponents the \"Democrat Socialist Party,\" ending a fight within the GOP ranks that reflected the divide between those who want a more centrist message and those seeking a more aggressive, conservative voice. Supporters of the resolution asking the Democratic Party to change its name instead agreed to accept language urging Democrats to \"stop pushing our country towards socialism and government control.\" The initial name-changing resolution had drawn criticism from Republican National Committee Chairman Michael Steele. Florida GOP Chairman James Greer called the idea \"stupid\" and Colorado Chairman Dick Wadhams called it \"absurd.\" They said it made Republicans look petty during a troubling time for the nation... At one point during informal discussions of the name change, some attending the meeting of state party leaders and other party officials said the proposed name might also include the label \"nationalist.\" [as in \"Nationalist Socialist Democrat Party\", similar to \"National Socialist German Worker's Party\" or \"Nazi Party\"] But Bopp said including \"nationalist\" was never proposed. The majority of those at the meeting, I believe, realized that this \"name-calling\" idea was both a waste of time and effort and also that this \"name-calling\" idea just continued the image of \"sore loser\" that the dyed-in-the-wool GOPers now seem to have.", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "Republicans on Wednesday abandoned an effort to label their opponents the \"Democrat Socialist Party,\" ending a fight within the GOP ranks that reflected the divide between those who want a more centrist message and those seeking a more aggressive, conservative voice. Supporters of the resolution asking the Democratic Party to change its name instead agreed to accept language urging Democrats to \"stop pushing our country towards socialism and government control.\" The initial name-changing resolution had drawn criticism from Republican National Committee Chairman Michael Steele. Florida GOP Chairman James Greer called the idea \"stupid\" and Colorado Chairman Dick Wadhams called it \"absurd.\" They said it made Republicans look petty during a troubling time for the nation... At one point during informal discussions of the name change, some attending the meeting of state party leaders and other party officials said the proposed name might also include the label \"nationalist.\" [as in \"Nationalist Socialist Democrat Party\", similar to \"National Socialist German Worker's Party\" or \"Nazi Party\"] But Bopp said including \"nationalist\" was never proposed.", 
        "reply": "\"http://www.google.com/hostednews/ap/article/ALeqM5jSnHdALg23pNqEeutIy0eicw1oHgD98A8HT01\"  The majority of those at the meeting, I believe, realized that this \"name-calling\" idea was both a waste of time and effort and also that this \"name-calling\" idea just continued the image of \"sore loser\" that the dyed-in-the-wool GOPers now seem to have.", 
        "threadID": "409192893_1350078322001", 
        "time": "2009-05-21 09:13:00", 
        "title": "The GOP's Wingnuts don't always win - even in their own Party", 
        "userID": "Fightdirector"
    }
]