[
    {
        "content": "This was included in HR 1388, which was passed by the House and sent to the Senate. Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free? Is that just another boondoggle? A waste of our money? Or is it justified? Why, or why not? VETERANS CORPS: The Generations Invigorating Volunteerism and Education Act or the \"GIVE Act passed by the House was read twice and placed on the Senate calendar 19 MAR 09. It is an Act to amend the national service laws which were enacted by the National And Community Service Act (NSCA) of 1990 and the Domestic Volunteer Service Act of 1973 (DVSA) and reauthorize appropriations through FY2014. If enacted it would establish a Veterans' Corps that identifies unmet needs of veterans through the following activities: • Promote community-based efforts to meet the unique needs of military families while a family member is deployed and upon that family member's return home; • Recruit veterans, particularly returning veterans, into service opportunities, including such opportunities that reflect their military experience; • Work to assist veterans in developing their educational opportunities, including opportunities for professional certification, licensure, and credentials. This would include coordinating with and assisting State and local agencies administering veterans education benefits and programs for internships and fellowships that could lead to employment in the private and public sector; • Promote efforts within the community to serve the needs of veterans and members of the Armed Forces serving on active duty, including such efforts to help veterans file benefits claims and assist Federal agencies in providing services to veterans; • Assist veterans in developing mentoring relationships with economically disadvantaged students; • Develop projects to assist disabled, rural, unemployed, and older veterans, including such projects that assist such veterans with transportation; and • Support other activities addressing unmet veterans' needs as may be designated. [Source: GQ.com 21 Mar 09 ++]", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "This was included in HR 1388, which was passed by the House and sent to the Senate. Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free? Is that just another boondoggle? A waste of our money? Or is it justified? Why, or why not? VETERANS CORPS: The Generations Invigorating Volunteerism and Education Act or the \"GIVE Act passed by the House was read twice and placed on the Senate calendar 19 MAR 09. It is an Act to amend the national service laws which were enacted by the National And Community Service Act (NSCA) of 1990 and the Domestic Volunteer Service Act of 1973 (DVSA) and reauthorize appropriations through FY2014. If enacted it would establish a Veterans' Corps that identifies unmet needs of veterans through the following activities: • Promote community-based efforts to meet the unique needs of military families while a family member is deployed and upon that family member's return home; • Recruit veterans, particularly returning veterans, into service opportunities, including such opportunities that reflect their military experience; • Work to assist veterans in developing their educational opportunities, including opportunities for professional certification, licensure, and credentials. This would include coordinating with and assisting State and local agencies administering veterans education benefits and programs for internships and fellowships that could lead to employment in the private and public sector; • Promote efforts within the community to serve the needs of veterans and members of the Armed Forces serving on active duty, including such efforts to help veterans file benefits claims and assist Federal agencies in providing services to veterans; • Assist veterans in developing mentoring relationships with economically disadvantaged students; • Develop projects to assist disabled, rural, unemployed, and older veterans, including such projects that assist such veterans with transportation; and • Support other activities addressing unmet veterans' needs as may be designated. [Source: GQ.com 21 Mar 09 ++]", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 18:17:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "And how much more money is the VA getting?", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "And how much more money is the VA getting?", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 19:43:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by _cash_: Kit, You know how hard the various Veteran's Clubs work to raise money for their Veteran help programs and to help in the communities? They can probably do much more for Veteran's if they are helped with the funding. I have no details but hopefully this is a positive way to get things done. But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "Originally posted by _cash_: Kit, You know how hard the various Veteran's Clubs work to raise money for their Veteran help programs and to help in the communities? They can probably do much more for Veteran's if they are helped with the funding. I have no details but hopefully this is a positive way to get things done.", 
        "reply": " But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 19:51:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Exactly............", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "reply": " Exactly............", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 19:54:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Exactly............ And then controlling \"what they are doing.\" Increase the funds for the VA, and old soldiers' homes. Give veterans a permanent, substantial tax cut or even an outright total exemption for wounded/disabled veterans. We'll handle the rest.", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Exactly............", 
        "reply": " And then controlling \"what they are doing.\" Increase the funds for the VA, and old soldiers' homes. Give veterans a permanent, substantial tax cut or even an outright total exemption for wounded/disabled veterans. We'll handle the rest.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 21:27:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Which is a good thing to do during a time of high unemployment is it not?", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "reply": " Which is a good thing to do during a time of high unemployment is it not?", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 22:00:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: And then controlling \"what they are doing.\" http://forums.military.com/eve/forums/a/frm/f/4960045241001", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "And then controlling \"what they are doing.\"", 
        "reply": " http://forums.military.com/eve/forums/a/frm/f/4960045241001", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 22:01:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Since I joined the VFW Post in Marmet West Virginia January 8, 1966, I have been active in veterans service organizations. The VFW offered many things to me then, as a 25 year old veteran, who was told nothing of VA elgibility when I was separated from active duty. I went into the Navy Reserve and still was not told about VA benefits. The VFW informed me and guided me through the various traps laid out for veterans to fall into. The veterans orgainzation was active in making sure I used the GI Bill for my education and GI Loan Guaranty. My original VFW post did not have a canteen and it was not until I moved to Ohio did that ever become a choice. I later joined the AMVETS which offered more to more veterans, then joined the Legion and DAV when they made me elgible by changing their dates of service. As an AMVETS Department of Ohio Service Officer (SSO), it is my privilage to serve my fellow veterans, their dependents and survivors. I have been a veterans service officer since November 1977 with the VFW, as a CVSO and finally as an AMVETS SSO. While it is true you can find those people in every organization who do not meet your personal expectations, over all our service is exceptional. Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090405, 
        "postID": 8, 
        "quote": "", 
        "reply": "Since I joined the VFW Post in Marmet West Virginia January 8, 1966, I have been active in veterans service organizations. The VFW offered many things to me then, as a 25 year old veteran, who was told nothing of VA elgibility when I was separated from active duty. I went into the Navy Reserve and still was not told about VA benefits. The VFW informed me and guided me through the various traps laid out for veterans to fall into. The veterans orgainzation was active in making sure I used the GI Bill for my education and GI Loan Guaranty. My original VFW post did not have a canteen and it was not until I moved to Ohio did that ever become a choice. I later joined the AMVETS which offered more to more veterans, then joined the Legion and DAV when they made me elgible by changing their dates of service. As an AMVETS Department of Ohio Service Officer (SSO), it is my privilage to serve my fellow veterans, their dependents and survivors. I have been a veterans service officer since November 1977 with the VFW, as a CVSO and finally as an AMVETS SSO. While it is true you can find those people in every organization who do not meet your personal expectations, over all our service is exceptional. Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 04:08:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "I honestly think instead of duplicating, they should be helping in the funding of existing orgs. I also like the idea of helping the VA and Old Soldier homes.", 
        "intTime": 20090405, 
        "postID": 9, 
        "quote": "", 
        "reply": "I honestly think instead of duplicating, they should be helping in the funding of existing orgs. I also like the idea of helping the VA and Old Soldier homes.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 05:07:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained. Because this is not and never has been about actually helping veterans. This is about propping up some poor disabled veteran as cheap cover for Chicago-style payola at best....", 
        "intTime": 20090405, 
        "postID": 10, 
        "quote": "Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained.", 
        "reply": " Because this is not and never has been about actually helping veterans. This is about propping up some poor disabled veteran as cheap cover for Chicago-style payola at best....", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 10:43:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Because this is not and never has been about actually helping veterans You got that right I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090405, 
        "postID": 11, 
        "quote": "Because this is not and never has been about actually helping veterans", 
        "reply": " You got that right I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 12:23:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T", 
        "intTime": 20090405, 
        "postID": 12, 
        "quote": "", 
        "reply": "If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 12:29:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "tawodi"
    }, 
    {
        "content": "I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields. The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets. It's a tough time for new vets right now. There is the general readjustment issue, and the issue of trying to convince civilians that not only are you not some kind of an alien or a psycho, but that you are capable of and accustomed to dealing with more responsibility and with a higher level of attention to detail than any other candidate they could consider hiring. Even if your military job skill does not seem to directly correspond to what they are hiring for, most folks who spent any amount of time in the military are used to learning a job on the fly, often with lives depending on their learning it well and fast. We make dedicated and disciplined workers, we don't look out for our interests first, but the interests of our workplace and coworkers. Naturally, any of us who've been there and done that KNOW all this. But it's hard to convince a population with fewer and fewer ties to the military, people who assume that only people with no ability or prospects wind up in the military. I've gotten two more application rejections, and another notice that the job I had applied for was eliminated due to budgetary constraints. Fortunately, my Guard unit cut me orders for two months of Active time. That takes some pressure off, gives me some breathing room. Now applying for emergency dispatcher. This sort of reminds me of that Navy commercial came out a few years ago, the background visuals were all these guys with weapons in a swamp running around on an operation. \"Someday you'll go to a job interview and the interviewer will ask if you work well under pressure. Try not to laugh.\"", 
        "intTime": 20090405, 
        "postID": 13, 
        "quote": "", 
        "reply": "I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields. The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets. It's a tough time for new vets right now. There is the general readjustment issue, and the issue of trying to convince civilians that not only are you not some kind of an alien or a psycho, but that you are capable of and accustomed to dealing with more responsibility and with a higher level of attention to detail than any other candidate they could consider hiring. Even if your military job skill does not seem to directly correspond to what they are hiring for, most folks who spent any amount of time in the military are used to learning a job on the fly, often with lives depending on their learning it well and fast. We make dedicated and disciplined workers, we don't look out for our interests first, but the interests of our workplace and coworkers. Naturally, any of us who've been there and done that KNOW all this. But it's hard to convince a population with fewer and fewer ties to the military, people who assume that only people with no ability or prospects wind up in the military. I've gotten two more application rejections, and another notice that the job I had applied for was eliminated due to budgetary constraints. Fortunately, my Guard unit cut me orders for two months of Active time. That takes some pressure off, gives me some breathing room. Now applying for emergency dispatcher. This sort of reminds me of that Navy commercial came out a few years ago, the background visuals were all these guys with weapons in a swamp running around on an operation. \"Someday you'll go to a job interview and the interviewer will ask if you work well under pressure. Try not to laugh.\"", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 13:37:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Which is a good thing to do during a time of high unemployment is it not? No, since it sends scarcer wealth into realms of unessential activity. Stupid economics.", 
        "intTime": 20090405, 
        "postID": 14, 
        "quote": "Originally posted by karlhungusjr: quote: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Which is a good thing to do during a time of high unemployment is it not?", 
        "reply": " No, since it sends scarcer wealth into realms of unessential activity. Stupid economics.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 15:39:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by tawodi: If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T I agree 101%!", 
        "intTime": 20090405, 
        "postID": 15, 
        "quote": "Originally posted by tawodi: If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T", 
        "reply": " I agree 101%!", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 16:47:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Ruanne said: \"I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields.\" Albeit many find fault in the veterans service organizations or VSO's for many reasons (not saying you do, just an example), the VSO's do an excellent job of assisting veterans. Helping veterans file claims, finding evidence to proscecute the claim and getting them into education programs, as well as assisting on employment seeking. We have well trained veterans assisting returnees in finding a job. I totally agree with Ruanne on this comment \"The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets.\" In my office several times each week OEF and OIF veterans come in for help and they get it! Even though I do not have all the answers I know where to find them. We are already trained to serve our fellow veteran. Many VSO's like AMVETS, DAV, the Legion, MOPH, PVA, and the VFW depend on donations for their budget. Donations have been down since the 911 disaster. For a considerable time the overwheming amount of donated funds went to the American Red Cross and the veterans donations dropped. Some of our organizations had to close offices and lay off some of their veterans service officers and staff. Again, not to argue, but to simply give an opinion. The funding should go to the proven method of assisting veterans rather than another government beaureaucracy. Important note: Recently Military.com changed their policy on profiles. When you click on a profile you can send a message to that member, but only if you have them added as a friend. If you want more communication with one another, please add that member as a friend. Even though I am the Sound Off Discussion Boards Lead Moderator, your profile is not available to me unless you are added on my list. Many times I have wanted to e-mail a member to give more advice, or to ask additional questions and could not, because they chose Private Profile. With this new system, you should put in the data needed for us to help you. It will only be available to \"Friends\" you added. There is another bulky method of my going into the data base to get your e-mail, however I do not do that. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090406, 
        "postID": 16, 
        "quote": "", 
        "reply": "Ruanne said: \"I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields.\" Albeit many find fault in the veterans service organizations or VSO's for many reasons (not saying you do, just an example), the VSO's do an excellent job of assisting veterans. Helping veterans file claims, finding evidence to proscecute the claim and getting them into education programs, as well as assisting on employment seeking. We have well trained veterans assisting returnees in finding a job. I totally agree with Ruanne on this comment \"The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets.\" In my office several times each week OEF and OIF veterans come in for help and they get it! Even though I do not have all the answers I know where to find them. We are already trained to serve our fellow veteran. Many VSO's like AMVETS, DAV, the Legion, MOPH, PVA, and the VFW depend on donations for their budget. Donations have been down since the 911 disaster. For a considerable time the overwheming amount of donated funds went to the American Red Cross and the veterans donations dropped. Some of our organizations had to close offices and lay off some of their veterans service officers and staff. Again, not to argue, but to simply give an opinion. The funding should go to the proven method of assisting veterans rather than another government beaureaucracy. Important note: Recently Military.com changed their policy on profiles. When you click on a profile you can send a message to that member, but only if you have them added as a friend. If you want more communication with one another, please add that member as a friend. Even though I am the Sound Off Discussion Boards Lead Moderator, your profile is not available to me unless you are added on my list. Many times I have wanted to e-mail a member to give more advice, or to ask additional questions and could not, because they chose Private Profile. With this new system, you should put in the data needed for us to help you. It will only be available to \"Friends\" you added. There is another bulky method of my going into the data base to get your e-mail, however I do not do that. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 01:31:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped.", 
        "intTime": 20090406, 
        "postID": 17, 
        "quote": "", 
        "reply": "This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 03:45:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped. I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "intTime": 20090406, 
        "postID": 18, 
        "quote": "Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped.", 
        "reply": " I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 05:22:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "From one of my VFW service officer associates: This is why we need to make sure that the Disabled Veterans’ Outreach Program (DVOP) and Local Veterans Employment Representative (LVER) grants are returned to a staffing grant. We need to get OIF/OEF veterans into the WSA offices and provide employment services to veterans and veterans who need assistance. We need to ensure that the USDOL/VETS which was originally created as an advocacy agency becomes the veterans’ advocacy agency it should be. We need to make sure that USERRA is given the teeth it should have in the reemployment and employment arena. We need to make sure that Chapter 42 is followed and that there is “Affirmative Action” for veterans. We need to make sure that there is legislation passed that will give veterans preference in advancement opportunities within the Federal Government when the veterans are qualified. These are issues that we need to address (as we addressed them in the late 70’s with the creation of the DVOP in 1977) and USDOL/VETS as an Agency in the 80’s. >http://www.suntimes.com/business/1509190,CST-FIN-military03.article 'Everybody's fighting for positions' Ruben Medina, who will exit the military in June, was among more than 340 veterans who attended a job fair in Chicago on Thursday, presented by RecruitMilitary. (Al Podgorski/Sun-Times) Telling their stories: Veterans talk about the job market from their perspective. Go to suntimes.com. VIDEO ONLINE After fighting for his country in Iraq, 26-year-old Marine Ruben Medina will soon face another battle--landing a civilian job in a recessionary economy. Ruben, who will exit the military in June, was among more than 340 Veterans who attended a job fair here Thursday, presented by RecruitMilitary that was designed to help connect job seekers with military backgrounds to employers. Despite the 9 percent unemployment rate in the Chicago metropolitan area, Ruben, who has worked as a military mechanic, said he's optimistic he'll find work. \"I know there are jobs out there that I'm highly qualified for,\" he said. But other job fair attendees expressed concern. Among them 24-year-old Scott Meder of Orland Park, who said he's next in line to be laid off from his job as a diesel mechanic. The Veteran expects to be cut in June. \"It's a reality check coming from the military where the jobs are secure to getting back out in the civilian world, with the economic crisis we're going through right now,\" said Meder, who left the military last May. \"The reality hits more so when you're out on your own and you don't have that stable paycheck from the government. It's a pretty tough market.\" Indeed, USA Today reported last month that the jobless rate for Veterans who served in Iraq and Afghanistan was 11.2 percent in February. The Labor Department said the 2008 unemployment rate for those who have served in the U.S. Armed Forces since September 2001 was 7.3 percent. Veterans sometimes face biases from employers when seeking work, job fair attendees said. Combat veterans are sometimes unfairly perceived as having a short fuse, said 39-year-old Rico Johnson, who served in Operation Desert Storm. He said he was laid off in December from the city of Chicago's Streets and Sanitation department and has applied for some 300 jobs. \"It's rough,\" he said of the job market. \"There's been a lot of promises. But nobody's calling.\" Some employers question whether Veterans can adjust to the civilian sector, \"coming from a very regimented way of life into a little bit more of a relaxed atmosphere,\" said John Lundberg, RecruitMilitary's national career fair representative. He and other attendees said Veterans can adjust and bring to the table transferrable skills, reliability and a great work ethic. \"You think that because you're a Veteran, you have military experience it's' a lot easier to get hired, but sometimes employers don't even care,\" said 26-year-old Gina Horvath. The Chicagoan served in the Army from 2000 to 2004 and is a member of the National Guard. The former bank teller has been out of work since last August. \"Being a Veteran isn't going to give you any cool points,\" she said. Forty-one-year old Charles Hollister, also unemployed, echoed those sentiments. \"You'd ordinarily think that the people that sacrificed themselves for the freedom of the country would get first consideration, but that's just not always the case,\" he said. \"In fact, a lot of times it's outright hostility, and you'd think it would be the other way around.\" These are challenging times for Veterans and non-Veterans alike, said 23-year-old Veteran Leon Leak, who has a part-time job. The Hyde Park resident got out of the Marines in February. He's currently working on his MBA and working part-time. He said he worked in network operations and as a senior communications person. He's looking for an information technology, Web technology or communications position. \"Veterans as well as people who haven't served in the military are having the same problem,\" he said. \"Right now it's a limited job market and everybody's fighting for positions. So everybody needs to make themselves marketable and try their best to make it work. That's all we can do--and pray.\" I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090406, 
        "postID": 19, 
        "quote": "", 
        "reply": "From one of my VFW service officer associates: This is why we need to make sure that the Disabled Veterans’ Outreach Program (DVOP) and Local Veterans Employment Representative (LVER) grants are returned to a staffing grant. We need to get OIF/OEF veterans into the WSA offices and provide employment services to veterans and veterans who need assistance. We need to ensure that the USDOL/VETS which was originally created as an advocacy agency becomes the veterans’ advocacy agency it should be. We need to make sure that USERRA is given the teeth it should have in the reemployment and employment arena. We need to make sure that Chapter 42 is followed and that there is “Affirmative Action” for veterans. We need to make sure that there is legislation passed that will give veterans preference in advancement opportunities within the Federal Government when the veterans are qualified. These are issues that we need to address (as we addressed them in the late 70’s with the creation of the DVOP in 1977) and USDOL/VETS as an Agency in the 80’s. >http://www.suntimes.com/business/1509190,CST-FIN-military03.article 'Everybody's fighting for positions' Ruben Medina, who will exit the military in June, was among more than 340 veterans who attended a job fair in Chicago on Thursday, presented by RecruitMilitary. (Al Podgorski/Sun-Times) Telling their stories: Veterans talk about the job market from their perspective. Go to suntimes.com. VIDEO ONLINE After fighting for his country in Iraq, 26-year-old Marine Ruben Medina will soon face another battle--landing a civilian job in a recessionary economy. Ruben, who will exit the military in June, was among more than 340 Veterans who attended a job fair here Thursday, presented by RecruitMilitary that was designed to help connect job seekers with military backgrounds to employers. Despite the 9 percent unemployment rate in the Chicago metropolitan area, Ruben, who has worked as a military mechanic, said he's optimistic he'll find work. \"I know there are jobs out there that I'm highly qualified for,\" he said. But other job fair attendees expressed concern. Among them 24-year-old Scott Meder of Orland Park, who said he's next in line to be laid off from his job as a diesel mechanic. The Veteran expects to be cut in June. \"It's a reality check coming from the military where the jobs are secure to getting back out in the civilian world, with the economic crisis we're going through right now,\" said Meder, who left the military last May. \"The reality hits more so when you're out on your own and you don't have that stable paycheck from the government. It's a pretty tough market.\" Indeed, USA Today reported last month that the jobless rate for Veterans who served in Iraq and Afghanistan was 11.2 percent in February. The Labor Department said the 2008 unemployment rate for those who have served in the U.S. Armed Forces since September 2001 was 7.3 percent. Veterans sometimes face biases from employers when seeking work, job fair attendees said. Combat veterans are sometimes unfairly perceived as having a short fuse, said 39-year-old Rico Johnson, who served in Operation Desert Storm. He said he was laid off in December from the city of Chicago's Streets and Sanitation department and has applied for some 300 jobs. \"It's rough,\" he said of the job market. \"There's been a lot of promises. But nobody's calling.\" Some employers question whether Veterans can adjust to the civilian sector, \"coming from a very regimented way of life into a little bit more of a relaxed atmosphere,\" said John Lundberg, RecruitMilitary's national career fair representative. He and other attendees said Veterans can adjust and bring to the table transferrable skills, reliability and a great work ethic. \"You think that because you're a Veteran, you have military experience it's' a lot easier to get hired, but sometimes employers don't even care,\" said 26-year-old Gina Horvath. The Chicagoan served in the Army from 2000 to 2004 and is a member of the National Guard. The former bank teller has been out of work since last August. \"Being a Veteran isn't going to give you any cool points,\" she said. Forty-one-year old Charles Hollister, also unemployed, echoed those sentiments. \"You'd ordinarily think that the people that sacrificed themselves for the freedom of the country would get first consideration, but that's just not always the case,\" he said. \"In fact, a lot of times it's outright hostility, and you'd think it would be the other way around.\" These are challenging times for Veterans and non-Veterans alike, said 23-year-old Veteran Leon Leak, who has a part-time job. The Hyde Park resident got out of the Marines in February. He's currently working on his MBA and working part-time. He said he worked in network operations and as a senior communications person. He's looking for an information technology, Web technology or communications position. \"Veterans as well as people who haven't served in the military are having the same problem,\" he said. \"Right now it's a limited job market and everybody's fighting for positions. So everybody needs to make themselves marketable and try their best to make it work. That's all we can do--and pray.\" I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 05:35:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free? and AMVETS. Legion, PVA, MOPH and on and on... Good topic stillkit, thanks! I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090406, 
        "postID": 20, 
        "quote": "Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free?", 
        "reply": " and AMVETS. Legion, PVA, MOPH and on and on... Good topic stillkit, thanks! I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 05:54:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Woody_in_La: I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds. It's called earmarks... At the state level it's member items. That's why the call to outright ban all earmarks or member items is misplaced.", 
        "intTime": 20090406, 
        "postID": 21, 
        "quote": "Woody_in_La: I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "reply": " It's called earmarks... At the state level it's member items. That's why the call to outright ban all earmarks or member items is misplaced.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 06:05:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped. I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds. Actually, I think you're right and I'm wrong. The government can, and does, give money to charitable organizations under the Faith-based Charity initiative, so why not to VSO's? Additionally, it would be an easy matter to allocate the millions proposed for this new program to the VA and let THEM disperse it to VSO's by VA regions. They know who's working and who aren't!", 
        "intTime": 20090406, 
        "postID": 22, 
        "quote": "Originally posted by Woody_in_La: quote: Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped. I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "reply": " Actually, I think you're right and I'm wrong. The government can, and does, give money to charitable organizations under the Faith-based Charity initiative, so why not to VSO's? Additionally, it would be an easy matter to allocate the millions proposed for this new program to the VA and let THEM disperse it to VSO's by VA regions. They know who's working and who aren't!", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 06:18:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "I just sent the following e-mail to both of my Senators and would urge you all to do the same. HR 1388 is currently in the Senate for action and it includes a provision creating something called a Veteran's Corp. This proposes to hire Veterans to do the very same things Veteran's Service Organizations, such as the VFW or DAV, are already doing for free. It would PAY people to duplicate the services of our VSO's! Instead of doing that, why not allocate the monies proposed to the Veteran's Adminstration and let them disburse it to the VSO's by VA districts? They know who's doing what and who is efficiently meeting the needs of Veterans. If the federal government can give money to faith-based charities to advance their efforts, why not VSO's as well? It's a far better solution than hiring more government employees to do what's already being done, don't you think? Gary Capshaw VFW, DAV, VVA, American Legion", 
        "intTime": 20090406, 
        "postID": 23, 
        "quote": "", 
        "reply": "I just sent the following e-mail to both of my Senators and would urge you all to do the same. HR 1388 is currently in the Senate for action and it includes a provision creating something called a Veteran's Corp. This proposes to hire Veterans to do the very same things Veteran's Service Organizations, such as the VFW or DAV, are already doing for free. It would PAY people to duplicate the services of our VSO's! Instead of doing that, why not allocate the monies proposed to the Veteran's Adminstration and let them disburse it to the VSO's by VA districts? They know who's doing what and who is efficiently meeting the needs of Veterans. If the federal government can give money to faith-based charities to advance their efforts, why not VSO's as well? It's a far better solution than hiring more government employees to do what's already being done, don't you think? Gary Capshaw VFW, DAV, VVA, American Legion", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 06:31:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "President Hoover signed the executive order establishing the VA on July 21, 1930. If that government agency is incapable of identifying veteran's needs in 79 years what makes you think another government agency will do any better? Words to fear: \"I'm from the government and I'm here to help you.\"", 
        "intTime": 20090406, 
        "postID": 24, 
        "quote": "", 
        "reply": "President Hoover signed the executive order establishing the VA on July 21, 1930. If that government agency is incapable of identifying veteran's needs in 79 years what makes you think another government agency will do any better? Words to fear: \"I'm from the government and I'm here to help you.\"", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 08:31:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: Bill VA has been underfunded forever, and vets have very special needs. It is about time the government keeps it's promises to vets. Agreed, but creating another ineffective government bureauocracy isn't addressing the problem. Increase funding and staffing for the VA to increase effectiveness. No need to add another level of administrators and bureauocrats. Add more case workers to the VA.", 
        "intTime": 20090406, 
        "postID": 25, 
        "quote": "dmuhler: Bill VA has been underfunded forever, and vets have very special needs. It is about time the government keeps it's promises to vets.", 
        "reply": " Agreed, but creating another ineffective government bureauocracy isn't addressing the problem. Increase funding and staffing for the VA to increase effectiveness. No need to add another level of administrators and bureauocrats. Add more case workers to the VA.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 11:00:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "If it never starts up it will never be a fialure. Zero details is a good indication of a money pit. BTW, the military is quite ineffective in many areas. Remember the 400 hammer? And an inspection of the camps in Iraq has shown that every one has serious electrical problems. Some soldiers have died from electricution. Make the VA better. Don't start up a new failure.", 
        "intTime": 20090406, 
        "postID": 26, 
        "quote": "", 
        "reply": "If it never starts up it will never be a fialure. Zero details is a good indication of a money pit. BTW, the military is quite ineffective in many areas. Remember the 400 hammer? And an inspection of the camps in Iraq has shown that every one has serious electrical problems. Some soldiers have died from electricution. Make the VA better. Don't start up a new failure.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 12:57:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "This was included in HR 1388, which was passed by the House and sent to the Senate. Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free? Is that just another boondoggle? A waste of our money? Or is it justified? Why, or why not? VETERANS CORPS: The Generations Invigorating Volunteerism and Education Act or the \"GIVE Act passed by the House was read twice and placed on the Senate calendar 19 MAR 09. It is an Act to amend the national service laws which were enacted by the National And Community Service Act (NSCA) of 1990 and the Domestic Volunteer Service Act of 1973 (DVSA) and reauthorize appropriations through FY2014. If enacted it would establish a Veterans' Corps that identifies unmet needs of veterans through the following activities: • Promote community-based efforts to meet the unique needs of military families while a family member is deployed and upon that family member's return home; • Recruit veterans, particularly returning veterans, into service opportunities, including such opportunities that reflect their military experience; • Work to assist veterans in developing their educational opportunities, including opportunities for professional certification, licensure, and credentials. This would include coordinating with and assisting State and local agencies administering veterans education benefits and programs for internships and fellowships that could lead to employment in the private and public sector; • Promote efforts within the community to serve the needs of veterans and members of the Armed Forces serving on active duty, including such efforts to help veterans file benefits claims and assist Federal agencies in providing services to veterans; • Assist veterans in developing mentoring relationships with economically disadvantaged students; • Develop projects to assist disabled, rural, unemployed, and older veterans, including such projects that assist such veterans with transportation; and • Support other activities addressing unmet veterans' needs as may be designated. [Source: GQ.com 21 Mar 09 ++]", 
        "intTime": 20090401, 
        "postID": 27, 
        "quote": "", 
        "reply": "This was included in HR 1388, which was passed by the House and sent to the Senate. Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free? Is that just another boondoggle? A waste of our money? Or is it justified? Why, or why not? VETERANS CORPS: The Generations Invigorating Volunteerism and Education Act or the \"GIVE Act passed by the House was read twice and placed on the Senate calendar 19 MAR 09. It is an Act to amend the national service laws which were enacted by the National And Community Service Act (NSCA) of 1990 and the Domestic Volunteer Service Act of 1973 (DVSA) and reauthorize appropriations through FY2014. If enacted it would establish a Veterans' Corps that identifies unmet needs of veterans through the following activities: • Promote community-based efforts to meet the unique needs of military families while a family member is deployed and upon that family member's return home; • Recruit veterans, particularly returning veterans, into service opportunities, including such opportunities that reflect their military experience; • Work to assist veterans in developing their educational opportunities, including opportunities for professional certification, licensure, and credentials. This would include coordinating with and assisting State and local agencies administering veterans education benefits and programs for internships and fellowships that could lead to employment in the private and public sector; • Promote efforts within the community to serve the needs of veterans and members of the Armed Forces serving on active duty, including such efforts to help veterans file benefits claims and assist Federal agencies in providing services to veterans; • Assist veterans in developing mentoring relationships with economically disadvantaged students; • Develop projects to assist disabled, rural, unemployed, and older veterans, including such projects that assist such veterans with transportation; and • Support other activities addressing unmet veterans' needs as may be designated. [Source: GQ.com 21 Mar 09 ++]", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 18:17:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "And how much more money is the VA getting?", 
        "intTime": 20090401, 
        "postID": 28, 
        "quote": "", 
        "reply": "And how much more money is the VA getting?", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 19:43:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by _cash_: Kit, You know how hard the various Veteran's Clubs work to raise money for their Veteran help programs and to help in the communities? They can probably do much more for Veteran's if they are helped with the funding. I have no details but hopefully this is a positive way to get things done. But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "intTime": 20090401, 
        "postID": 29, 
        "quote": "Originally posted by _cash_: Kit, You know how hard the various Veteran's Clubs work to raise money for their Veteran help programs and to help in the communities? They can probably do much more for Veteran's if they are helped with the funding. I have no details but hopefully this is a positive way to get things done.", 
        "reply": " But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 19:51:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Exactly............", 
        "intTime": 20090401, 
        "postID": 30, 
        "quote": "Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "reply": " Exactly............", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 19:54:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Exactly............ And then controlling \"what they are doing.\" Increase the funds for the VA, and old soldiers' homes. Give veterans a permanent, substantial tax cut or even an outright total exemption for wounded/disabled veterans. We'll handle the rest.", 
        "intTime": 20090401, 
        "postID": 31, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Exactly............", 
        "reply": " And then controlling \"what they are doing.\" Increase the funds for the VA, and old soldiers' homes. Give veterans a permanent, substantial tax cut or even an outright total exemption for wounded/disabled veterans. We'll handle the rest.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 21:27:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Which is a good thing to do during a time of high unemployment is it not?", 
        "intTime": 20090401, 
        "postID": 32, 
        "quote": "But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing.", 
        "reply": " Which is a good thing to do during a time of high unemployment is it not?", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 22:00:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: And then controlling \"what they are doing.\" http://forums.military.com/eve/forums/a/frm/f/4960045241001", 
        "intTime": 20090401, 
        "postID": 33, 
        "quote": "And then controlling \"what they are doing.\"", 
        "reply": " http://forums.military.com/eve/forums/a/frm/f/4960045241001", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-01 22:01:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Since I joined the VFW Post in Marmet West Virginia January 8, 1966, I have been active in veterans service organizations. The VFW offered many things to me then, as a 25 year old veteran, who was told nothing of VA elgibility when I was separated from active duty. I went into the Navy Reserve and still was not told about VA benefits. The VFW informed me and guided me through the various traps laid out for veterans to fall into. The veterans orgainzation was active in making sure I used the GI Bill for my education and GI Loan Guaranty. My original VFW post did not have a canteen and it was not until I moved to Ohio did that ever become a choice. I later joined the AMVETS which offered more to more veterans, then joined the Legion and DAV when they made me elgible by changing their dates of service. As an AMVETS Department of Ohio Service Officer (SSO), it is my privilage to serve my fellow veterans, their dependents and survivors. I have been a veterans service officer since November 1977 with the VFW, as a CVSO and finally as an AMVETS SSO. While it is true you can find those people in every organization who do not meet your personal expectations, over all our service is exceptional. Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090405, 
        "postID": 34, 
        "quote": "", 
        "reply": "Since I joined the VFW Post in Marmet West Virginia January 8, 1966, I have been active in veterans service organizations. The VFW offered many things to me then, as a 25 year old veteran, who was told nothing of VA elgibility when I was separated from active duty. I went into the Navy Reserve and still was not told about VA benefits. The VFW informed me and guided me through the various traps laid out for veterans to fall into. The veterans orgainzation was active in making sure I used the GI Bill for my education and GI Loan Guaranty. My original VFW post did not have a canteen and it was not until I moved to Ohio did that ever become a choice. I later joined the AMVETS which offered more to more veterans, then joined the Legion and DAV when they made me elgible by changing their dates of service. As an AMVETS Department of Ohio Service Officer (SSO), it is my privilage to serve my fellow veterans, their dependents and survivors. I have been a veterans service officer since November 1977 with the VFW, as a CVSO and finally as an AMVETS SSO. While it is true you can find those people in every organization who do not meet your personal expectations, over all our service is exceptional. Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 04:08:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "I honestly think instead of duplicating, they should be helping in the funding of existing orgs. I also like the idea of helping the VA and Old Soldier homes.", 
        "intTime": 20090405, 
        "postID": 35, 
        "quote": "", 
        "reply": "I honestly think instead of duplicating, they should be helping in the funding of existing orgs. I also like the idea of helping the VA and Old Soldier homes.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 05:07:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained. Because this is not and never has been about actually helping veterans. This is about propping up some poor disabled veteran as cheap cover for Chicago-style payola at best....", 
        "intTime": 20090405, 
        "postID": 36, 
        "quote": "Why duplicate what has worked so well, when the program instead could offer funding to the existing Veterans Service Organization's to get more done, with those already well trained.", 
        "reply": " Because this is not and never has been about actually helping veterans. This is about propping up some poor disabled veteran as cheap cover for Chicago-style payola at best....", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 10:43:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Because this is not and never has been about actually helping veterans You got that right I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090405, 
        "postID": 37, 
        "quote": "Because this is not and never has been about actually helping veterans", 
        "reply": " You got that right I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 12:23:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T", 
        "intTime": 20090405, 
        "postID": 38, 
        "quote": "", 
        "reply": "If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 12:29:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "tawodi"
    }, 
    {
        "content": "I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields. The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets. It's a tough time for new vets right now. There is the general readjustment issue, and the issue of trying to convince civilians that not only are you not some kind of an alien or a psycho, but that you are capable of and accustomed to dealing with more responsibility and with a higher level of attention to detail than any other candidate they could consider hiring. Even if your military job skill does not seem to directly correspond to what they are hiring for, most folks who spent any amount of time in the military are used to learning a job on the fly, often with lives depending on their learning it well and fast. We make dedicated and disciplined workers, we don't look out for our interests first, but the interests of our workplace and coworkers. Naturally, any of us who've been there and done that KNOW all this. But it's hard to convince a population with fewer and fewer ties to the military, people who assume that only people with no ability or prospects wind up in the military. I've gotten two more application rejections, and another notice that the job I had applied for was eliminated due to budgetary constraints. Fortunately, my Guard unit cut me orders for two months of Active time. That takes some pressure off, gives me some breathing room. Now applying for emergency dispatcher. This sort of reminds me of that Navy commercial came out a few years ago, the background visuals were all these guys with weapons in a swamp running around on an operation. \"Someday you'll go to a job interview and the interviewer will ask if you work well under pressure. Try not to laugh.\"", 
        "intTime": 20090405, 
        "postID": 39, 
        "quote": "", 
        "reply": "I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields. The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets. It's a tough time for new vets right now. There is the general readjustment issue, and the issue of trying to convince civilians that not only are you not some kind of an alien or a psycho, but that you are capable of and accustomed to dealing with more responsibility and with a higher level of attention to detail than any other candidate they could consider hiring. Even if your military job skill does not seem to directly correspond to what they are hiring for, most folks who spent any amount of time in the military are used to learning a job on the fly, often with lives depending on their learning it well and fast. We make dedicated and disciplined workers, we don't look out for our interests first, but the interests of our workplace and coworkers. Naturally, any of us who've been there and done that KNOW all this. But it's hard to convince a population with fewer and fewer ties to the military, people who assume that only people with no ability or prospects wind up in the military. I've gotten two more application rejections, and another notice that the job I had applied for was eliminated due to budgetary constraints. Fortunately, my Guard unit cut me orders for two months of Active time. That takes some pressure off, gives me some breathing room. Now applying for emergency dispatcher. This sort of reminds me of that Navy commercial came out a few years ago, the background visuals were all these guys with weapons in a swamp running around on an operation. \"Someday you'll go to a job interview and the interviewer will ask if you work well under pressure. Try not to laugh.\"", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 13:37:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Which is a good thing to do during a time of high unemployment is it not? No, since it sends scarcer wealth into realms of unessential activity. Stupid economics.", 
        "intTime": 20090405, 
        "postID": 40, 
        "quote": "Originally posted by karlhungusjr: quote: But, this isn't about giving money to the VSO's. It's about hiring someone to duplicate what they're already doing. Which is a good thing to do during a time of high unemployment is it not?", 
        "reply": " No, since it sends scarcer wealth into realms of unessential activity. Stupid economics.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 15:39:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by tawodi: If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T I agree 101%!", 
        "intTime": 20090405, 
        "postID": 41, 
        "quote": "Originally posted by tawodi: If there is anybody on this planet that knows about V.S.O.'s it's Dave Barker!! If he says it, TAKE IT TO THE BANK!!! As a long time volunteer, in a different area, I can usually see a rat under the carpet as well, and my gut tells me, this IS one!! Fill them in on the real details Dave!! Thanks buddy!! T", 
        "reply": " I agree 101%!", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-05 16:47:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Ruanne said: \"I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields.\" Albeit many find fault in the veterans service organizations or VSO's for many reasons (not saying you do, just an example), the VSO's do an excellent job of assisting veterans. Helping veterans file claims, finding evidence to proscecute the claim and getting them into education programs, as well as assisting on employment seeking. We have well trained veterans assisting returnees in finding a job. I totally agree with Ruanne on this comment \"The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets.\" In my office several times each week OEF and OIF veterans come in for help and they get it! Even though I do not have all the answers I know where to find them. We are already trained to serve our fellow veteran. Many VSO's like AMVETS, DAV, the Legion, MOPH, PVA, and the VFW depend on donations for their budget. Donations have been down since the 911 disaster. For a considerable time the overwheming amount of donated funds went to the American Red Cross and the veterans donations dropped. Some of our organizations had to close offices and lay off some of their veterans service officers and staff. Again, not to argue, but to simply give an opinion. The funding should go to the proven method of assisting veterans rather than another government beaureaucracy. Important note: Recently Military.com changed their policy on profiles. When you click on a profile you can send a message to that member, but only if you have them added as a friend. If you want more communication with one another, please add that member as a friend. Even though I am the Sound Off Discussion Boards Lead Moderator, your profile is not available to me unless you are added on my list. Many times I have wanted to e-mail a member to give more advice, or to ask additional questions and could not, because they chose Private Profile. With this new system, you should put in the data needed for us to help you. It will only be available to \"Friends\" you added. There is another bulky method of my going into the data base to get your e-mail, however I do not do that. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090406, 
        "postID": 42, 
        "quote": "", 
        "reply": "Ruanne said: \"I think the idea is to keep veterans employed, or at least productive. They need to expand beyond Veteran's Service organizations, and get vets training and experience (and preferably a paycheck) in a variety of fields.\" Albeit many find fault in the veterans service organizations or VSO's for many reasons (not saying you do, just an example), the VSO's do an excellent job of assisting veterans. Helping veterans file claims, finding evidence to proscecute the claim and getting them into education programs, as well as assisting on employment seeking. We have well trained veterans assisting returnees in finding a job. I totally agree with Ruanne on this comment \"The unemployment and homeless rate for recent Iraq and Afghanistan veterans is (rightly) embarrassing people who supported the troops and swore the same thing would not happen to new vets as did to Vietnam vets.\" In my office several times each week OEF and OIF veterans come in for help and they get it! Even though I do not have all the answers I know where to find them. We are already trained to serve our fellow veteran. Many VSO's like AMVETS, DAV, the Legion, MOPH, PVA, and the VFW depend on donations for their budget. Donations have been down since the 911 disaster. For a considerable time the overwheming amount of donated funds went to the American Red Cross and the veterans donations dropped. Some of our organizations had to close offices and lay off some of their veterans service officers and staff. Again, not to argue, but to simply give an opinion. The funding should go to the proven method of assisting veterans rather than another government beaureaucracy. Important note: Recently Military.com changed their policy on profiles. When you click on a profile you can send a message to that member, but only if you have them added as a friend. If you want more communication with one another, please add that member as a friend. Even though I am the Sound Off Discussion Boards Lead Moderator, your profile is not available to me unless you are added on my list. Many times I have wanted to e-mail a member to give more advice, or to ask additional questions and could not, because they chose Private Profile. With this new system, you should put in the data needed for us to help you. It will only be available to \"Friends\" you added. There is another bulky method of my going into the data base to get your e-mail, however I do not do that. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 01:31:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped.", 
        "intTime": 20090406, 
        "postID": 43, 
        "quote": "", 
        "reply": "This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 03:45:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped. I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "intTime": 20090406, 
        "postID": 44, 
        "quote": "Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped.", 
        "reply": " I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 05:22:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "From one of my VFW service officer associates: This is why we need to make sure that the Disabled Veterans’ Outreach Program (DVOP) and Local Veterans Employment Representative (LVER) grants are returned to a staffing grant. We need to get OIF/OEF veterans into the WSA offices and provide employment services to veterans and veterans who need assistance. We need to ensure that the USDOL/VETS which was originally created as an advocacy agency becomes the veterans’ advocacy agency it should be. We need to make sure that USERRA is given the teeth it should have in the reemployment and employment arena. We need to make sure that Chapter 42 is followed and that there is “Affirmative Action” for veterans. We need to make sure that there is legislation passed that will give veterans preference in advancement opportunities within the Federal Government when the veterans are qualified. These are issues that we need to address (as we addressed them in the late 70’s with the creation of the DVOP in 1977) and USDOL/VETS as an Agency in the 80’s. >http://www.suntimes.com/business/1509190,CST-FIN-military03.article 'Everybody's fighting for positions' Ruben Medina, who will exit the military in June, was among more than 340 veterans who attended a job fair in Chicago on Thursday, presented by RecruitMilitary. (Al Podgorski/Sun-Times) Telling their stories: Veterans talk about the job market from their perspective. Go to suntimes.com. VIDEO ONLINE After fighting for his country in Iraq, 26-year-old Marine Ruben Medina will soon face another battle--landing a civilian job in a recessionary economy. Ruben, who will exit the military in June, was among more than 340 Veterans who attended a job fair here Thursday, presented by RecruitMilitary that was designed to help connect job seekers with military backgrounds to employers. Despite the 9 percent unemployment rate in the Chicago metropolitan area, Ruben, who has worked as a military mechanic, said he's optimistic he'll find work. \"I know there are jobs out there that I'm highly qualified for,\" he said. But other job fair attendees expressed concern. Among them 24-year-old Scott Meder of Orland Park, who said he's next in line to be laid off from his job as a diesel mechanic. The Veteran expects to be cut in June. \"It's a reality check coming from the military where the jobs are secure to getting back out in the civilian world, with the economic crisis we're going through right now,\" said Meder, who left the military last May. \"The reality hits more so when you're out on your own and you don't have that stable paycheck from the government. It's a pretty tough market.\" Indeed, USA Today reported last month that the jobless rate for Veterans who served in Iraq and Afghanistan was 11.2 percent in February. The Labor Department said the 2008 unemployment rate for those who have served in the U.S. Armed Forces since September 2001 was 7.3 percent. Veterans sometimes face biases from employers when seeking work, job fair attendees said. Combat veterans are sometimes unfairly perceived as having a short fuse, said 39-year-old Rico Johnson, who served in Operation Desert Storm. He said he was laid off in December from the city of Chicago's Streets and Sanitation department and has applied for some 300 jobs. \"It's rough,\" he said of the job market. \"There's been a lot of promises. But nobody's calling.\" Some employers question whether Veterans can adjust to the civilian sector, \"coming from a very regimented way of life into a little bit more of a relaxed atmosphere,\" said John Lundberg, RecruitMilitary's national career fair representative. He and other attendees said Veterans can adjust and bring to the table transferrable skills, reliability and a great work ethic. \"You think that because you're a Veteran, you have military experience it's' a lot easier to get hired, but sometimes employers don't even care,\" said 26-year-old Gina Horvath. The Chicagoan served in the Army from 2000 to 2004 and is a member of the National Guard. The former bank teller has been out of work since last August. \"Being a Veteran isn't going to give you any cool points,\" she said. Forty-one-year old Charles Hollister, also unemployed, echoed those sentiments. \"You'd ordinarily think that the people that sacrificed themselves for the freedom of the country would get first consideration, but that's just not always the case,\" he said. \"In fact, a lot of times it's outright hostility, and you'd think it would be the other way around.\" These are challenging times for Veterans and non-Veterans alike, said 23-year-old Veteran Leon Leak, who has a part-time job. The Hyde Park resident got out of the Marines in February. He's currently working on his MBA and working part-time. He said he worked in network operations and as a senior communications person. He's looking for an information technology, Web technology or communications position. \"Veterans as well as people who haven't served in the military are having the same problem,\" he said. \"Right now it's a limited job market and everybody's fighting for positions. So everybody needs to make themselves marketable and try their best to make it work. That's all we can do--and pray.\" I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090406, 
        "postID": 45, 
        "quote": "", 
        "reply": "From one of my VFW service officer associates: This is why we need to make sure that the Disabled Veterans’ Outreach Program (DVOP) and Local Veterans Employment Representative (LVER) grants are returned to a staffing grant. We need to get OIF/OEF veterans into the WSA offices and provide employment services to veterans and veterans who need assistance. We need to ensure that the USDOL/VETS which was originally created as an advocacy agency becomes the veterans’ advocacy agency it should be. We need to make sure that USERRA is given the teeth it should have in the reemployment and employment arena. We need to make sure that Chapter 42 is followed and that there is “Affirmative Action” for veterans. We need to make sure that there is legislation passed that will give veterans preference in advancement opportunities within the Federal Government when the veterans are qualified. These are issues that we need to address (as we addressed them in the late 70’s with the creation of the DVOP in 1977) and USDOL/VETS as an Agency in the 80’s. >http://www.suntimes.com/business/1509190,CST-FIN-military03.article 'Everybody's fighting for positions' Ruben Medina, who will exit the military in June, was among more than 340 veterans who attended a job fair in Chicago on Thursday, presented by RecruitMilitary. (Al Podgorski/Sun-Times) Telling their stories: Veterans talk about the job market from their perspective. Go to suntimes.com. VIDEO ONLINE After fighting for his country in Iraq, 26-year-old Marine Ruben Medina will soon face another battle--landing a civilian job in a recessionary economy. Ruben, who will exit the military in June, was among more than 340 Veterans who attended a job fair here Thursday, presented by RecruitMilitary that was designed to help connect job seekers with military backgrounds to employers. Despite the 9 percent unemployment rate in the Chicago metropolitan area, Ruben, who has worked as a military mechanic, said he's optimistic he'll find work. \"I know there are jobs out there that I'm highly qualified for,\" he said. But other job fair attendees expressed concern. Among them 24-year-old Scott Meder of Orland Park, who said he's next in line to be laid off from his job as a diesel mechanic. The Veteran expects to be cut in June. \"It's a reality check coming from the military where the jobs are secure to getting back out in the civilian world, with the economic crisis we're going through right now,\" said Meder, who left the military last May. \"The reality hits more so when you're out on your own and you don't have that stable paycheck from the government. It's a pretty tough market.\" Indeed, USA Today reported last month that the jobless rate for Veterans who served in Iraq and Afghanistan was 11.2 percent in February. The Labor Department said the 2008 unemployment rate for those who have served in the U.S. Armed Forces since September 2001 was 7.3 percent. Veterans sometimes face biases from employers when seeking work, job fair attendees said. Combat veterans are sometimes unfairly perceived as having a short fuse, said 39-year-old Rico Johnson, who served in Operation Desert Storm. He said he was laid off in December from the city of Chicago's Streets and Sanitation department and has applied for some 300 jobs. \"It's rough,\" he said of the job market. \"There's been a lot of promises. But nobody's calling.\" Some employers question whether Veterans can adjust to the civilian sector, \"coming from a very regimented way of life into a little bit more of a relaxed atmosphere,\" said John Lundberg, RecruitMilitary's national career fair representative. He and other attendees said Veterans can adjust and bring to the table transferrable skills, reliability and a great work ethic. \"You think that because you're a Veteran, you have military experience it's' a lot easier to get hired, but sometimes employers don't even care,\" said 26-year-old Gina Horvath. The Chicagoan served in the Army from 2000 to 2004 and is a member of the National Guard. The former bank teller has been out of work since last August. \"Being a Veteran isn't going to give you any cool points,\" she said. Forty-one-year old Charles Hollister, also unemployed, echoed those sentiments. \"You'd ordinarily think that the people that sacrificed themselves for the freedom of the country would get first consideration, but that's just not always the case,\" he said. \"In fact, a lot of times it's outright hostility, and you'd think it would be the other way around.\" These are challenging times for Veterans and non-Veterans alike, said 23-year-old Veteran Leon Leak, who has a part-time job. The Hyde Park resident got out of the Marines in February. He's currently working on his MBA and working part-time. He said he worked in network operations and as a senior communications person. He's looking for an information technology, Web technology or communications position. \"Veterans as well as people who haven't served in the military are having the same problem,\" he said. \"Right now it's a limited job market and everybody's fighting for positions. So everybody needs to make themselves marketable and try their best to make it work. That's all we can do--and pray.\" I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 05:35:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free? and AMVETS. Legion, PVA, MOPH and on and on... Good topic stillkit, thanks! I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090406, 
        "postID": 46, 
        "quote": "Why do we need Veteran's to be paid for what Veteran's Service Organizations such as the VFW and DAV already do for free?", 
        "reply": " and AMVETS. Legion, PVA, MOPH and on and on... Good topic stillkit, thanks! I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 05:54:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Woody_in_La: I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds. It's called earmarks... At the state level it's member items. That's why the call to outright ban all earmarks or member items is misplaced.", 
        "intTime": 20090406, 
        "postID": 47, 
        "quote": "Woody_in_La: I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "reply": " It's called earmarks... At the state level it's member items. That's why the call to outright ban all earmarks or member items is misplaced.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 06:05:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped. I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds. Actually, I think you're right and I'm wrong. The government can, and does, give money to charitable organizations under the Faith-based Charity initiative, so why not to VSO's? Additionally, it would be an easy matter to allocate the millions proposed for this new program to the VA and let THEM disperse it to VSO's by VA regions. They know who's working and who aren't!", 
        "intTime": 20090406, 
        "postID": 48, 
        "quote": "Originally posted by Woody_in_La: quote: Originally posted by stillkit: This whole idea sounds like an excuse to find government jobs for somebody's friend. It's a waste of the taxpayers money and, like Dave said, that money could be better spent by helping fund VSO programs already up and running. Since it's probably illegal for the government to donate to a charitable organization, the whole idea ought to be dropped. I may be wrong, but I think they can give grants to some extent. If not, they should change the law involving a VSO instead of \"waisting/duplicating\" with these funds.", 
        "reply": " Actually, I think you're right and I'm wrong. The government can, and does, give money to charitable organizations under the Faith-based Charity initiative, so why not to VSO's? Additionally, it would be an easy matter to allocate the millions proposed for this new program to the VA and let THEM disperse it to VSO's by VA regions. They know who's working and who aren't!", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 06:18:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "I just sent the following e-mail to both of my Senators and would urge you all to do the same. HR 1388 is currently in the Senate for action and it includes a provision creating something called a Veteran's Corp. This proposes to hire Veterans to do the very same things Veteran's Service Organizations, such as the VFW or DAV, are already doing for free. It would PAY people to duplicate the services of our VSO's! Instead of doing that, why not allocate the monies proposed to the Veteran's Adminstration and let them disburse it to the VSO's by VA districts? They know who's doing what and who is efficiently meeting the needs of Veterans. If the federal government can give money to faith-based charities to advance their efforts, why not VSO's as well? It's a far better solution than hiring more government employees to do what's already being done, don't you think? Gary Capshaw VFW, DAV, VVA, American Legion", 
        "intTime": 20090406, 
        "postID": 49, 
        "quote": "", 
        "reply": "I just sent the following e-mail to both of my Senators and would urge you all to do the same. HR 1388 is currently in the Senate for action and it includes a provision creating something called a Veteran's Corp. This proposes to hire Veterans to do the very same things Veteran's Service Organizations, such as the VFW or DAV, are already doing for free. It would PAY people to duplicate the services of our VSO's! Instead of doing that, why not allocate the monies proposed to the Veteran's Adminstration and let them disburse it to the VSO's by VA districts? They know who's doing what and who is efficiently meeting the needs of Veterans. If the federal government can give money to faith-based charities to advance their efforts, why not VSO's as well? It's a far better solution than hiring more government employees to do what's already being done, don't you think? Gary Capshaw VFW, DAV, VVA, American Legion", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 06:31:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "stillkit"
    }, 
    {
        "content": "President Hoover signed the executive order establishing the VA on July 21, 1930. If that government agency is incapable of identifying veteran's needs in 79 years what makes you think another government agency will do any better? Words to fear: \"I'm from the government and I'm here to help you.\"", 
        "intTime": 20090406, 
        "postID": 50, 
        "quote": "", 
        "reply": "President Hoover signed the executive order establishing the VA on July 21, 1930. If that government agency is incapable of identifying veteran's needs in 79 years what makes you think another government agency will do any better? Words to fear: \"I'm from the government and I'm here to help you.\"", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 08:31:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: Bill VA has been underfunded forever, and vets have very special needs. It is about time the government keeps it's promises to vets. Agreed, but creating another ineffective government bureauocracy isn't addressing the problem. Increase funding and staffing for the VA to increase effectiveness. No need to add another level of administrators and bureauocrats. Add more case workers to the VA.", 
        "intTime": 20090406, 
        "postID": 51, 
        "quote": "dmuhler: Bill VA has been underfunded forever, and vets have very special needs. It is about time the government keeps it's promises to vets.", 
        "reply": " Agreed, but creating another ineffective government bureauocracy isn't addressing the problem. Increase funding and staffing for the VA to increase effectiveness. No need to add another level of administrators and bureauocrats. Add more case workers to the VA.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 11:00:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "If it never starts up it will never be a fialure. Zero details is a good indication of a money pit. BTW, the military is quite ineffective in many areas. Remember the 400 hammer? And an inspection of the camps in Iraq has shown that every one has serious electrical problems. Some soldiers have died from electricution. Make the VA better. Don't start up a new failure.", 
        "intTime": 20090406, 
        "postID": 52, 
        "quote": "", 
        "reply": "If it never starts up it will never be a fialure. Zero details is a good indication of a money pit. BTW, the military is quite ineffective in many areas. Remember the 400 hammer? And an inspection of the camps in Iraq has shown that every one has serious electrical problems. Some soldiers have died from electricution. Make the VA better. Don't start up a new failure.", 
        "threadID": "409192893_1940085912001", 
        "time": "2009-04-06 12:57:00", 
        "title": "Veteran's Corp:  Is this a waste of taxpayer money?", 
        "userID": "bill_kananen"
    }
]