[
    {
        "content": "This is the 2nd time she has done something like this. Senator's husband cashes in on crisis <edit> <edit> 'http://washingtontimes.com/news/2009/apr/21/senate-husbands-firm-cashes-in-on-crisis/print/' On the day the new Congress convened this year, Sen. Dianne Feinstein introduced legislation to route $25 billion in taxpayer money to a government agency that had just awarded her husband's real estate firm a lucrative contract to sell foreclosed properties at compensation rates higher than the industry norms. Mrs. Feinstein's intervention on behalf of the Federal Deposit Insurance Corp. was unusual: the California Democrat isn't a member of the Senate Committee on Banking, Housing and Urban Affairs with jurisdiction over FDIC; and the agency is supposed to operate from money it raises from bank-paid insurance payments - not direct federal dollars. Documents reviewed by The Washington Times show Mrs. Feinstein first offered Oct. 30 to help the FDIC secure money for its effort to stem the rise of home foreclosures. Her letter was sent just days before the agency determined that CB Richard Ellis Group (CBRE) - the commercial real estate firm that her husband Richard Blum heads as board chairman - had won the competitive bidding for a contract to sell foreclosed properties that FDIC had inherited from failed banks. About the same time of the contract award, Mr. Blum's private investment firm reported to the Securities and Exchange Commission that it and related affiliates had purchased more than 10 million new shares in CBRE. The shares were purchased for the going price of $3.77; CBRE's stock closed Monday at $5.14. Spokesmen for the FDIC, Mrs. Feinstein and Mr. Blum's firm told The Times that there was no connection between the legislation and the contract signed Nov. 13, and that the couple didn't even know about CBRE's business with FDIC until after it was awarded. Yeh, another big Koinkydink <edit> Senate ethics rules state that members must avoid conflicts of interest as well as \"even the appearance of a conflict of interest.\" Some ethics analysts question whether Mrs. Feinstein ran afoul of the latter provision, creating the appearance that she was rewarding the agency that had just hired her husband's firm. \"This clearly gives the appearance of a conflict of interest,\" said Kent Cooper, a former federal regulator who specializes in government ethics and disclosures. \"To maintain the people's trust in government, it is incumbent on a legislator to take the extra steps necessary to ensure that when she introduces any legislation that it does not cause people to question her motives or the business activities of her spouse.\" <edit> The FDIC contract \"highlights the problem of a senator with a spouse who has extensive business interests that intersect frequently with the federal government,\" said Melanie Sloan, executive director of the watchdog group Citizens for Responsibility and Ethics in Washington (CREW). \"Even if there is no actual conflict of interest, it often has the appearance of a conflict.\" A 'very sweet deal'? Real estate specialists also question the government's generosity in the CBRE contract. The firm, known for its commercial real estate services, is to be paid monthly maintenance fees for each foreclosed property it handles, as well as commissions and incentives. The total compensation can range from 8 percent of the sales price on many residential properties to 30 percent for properties worth $25,000 or less. A smaller firm also won a slice of the work with similar terms, records show. Most real estate agents earn no more than 6 percent on residential, even on foreclosed properties, and CBRE doesn't have as much experience in foreclosure sales as other firms, the experts said. \"From everything I know about it, it is a very sweet deal and went to somebody who is less than qualified in dealing with foreclosed residential properties. Their expertise is in commercial real estate,\" said Cynthia Kenner, a Colorado real estate agent who specializes in selling bank-owned residential properties and last year helped sell more than 600 foreclosed properties. \"There are companies that are more experienced in selling such properties than CB Richard Ellis,\" she added. FDIC and Feinstein respond The FDIC said politics was not involved in its decision, noting the contract was awarded after a six-month competition run by career staff who determined that CBRE was \"deemed to be technically qualified and their fee structure fair and reasonable.\" That means the competition did not mandate the contract go to the lowest bidder necessarily, officials said. The agency said the above-market incentives were designed to encourage quick sales of the growing number of foreclosed properties the FDIC has inherited during the recession. \"The longer the asset is held, the more costly it is for the FDIC, and more expenses are incurred for the assets,\" the agency said in a statement to The Times. Feinstein spokesman Gil Duran said there was no conflict of interest between Mr. Blum's firm getting the contract and the senator's legislation. He said she introduced the legislation because it would help prevent home mortgage foreclosures at a time when many Californians were in danger of losing their homes. \"She was not aware of the contract before she introduced the legislation,\" Mr. Duran said. \"There is no evidence of any relationship or conflict between this foreclosure relief bill and the contract. Senator Feinstein complies with the rules and guidelines of the Ethics Committee.\" Mr. Duran also said Mr. Blum \"is not involved in the day-to-day operations of the company, nor does he have any involvement in the company's contracting.\" Mr. Blum declined through a spokesman to comment. CBRE spokesman Robert McGrath said the firm had $5 billion in revenues last year and was \"well positioned\" to help the FDIC as the nation's largest commercial real estate services company. Its pricing was at market rates after a highly competitive bid process, he said. \"We believe the FDIC will realize significant value from all the work we perform on their behalf,\" he said. The contract process In May, the FDIC began the formal process of looking for help to manage and market its growing portfolio of foreclosed real estate acquired from failed financial institutions nationwide. It sent letters to 33 real estate firms and received proposals from 18. In November, the FDIC signed a contract with CBRE that could be worth tens of millions of dollars or more at a time when real estate firms are scrambling for business in the distressed economy. CBRE said it was hired to act \"as a primary adviser\" to the FDIC for its real estate portfolio nationwide, according to a press release announcing the contract. The firm called the FDIC a \"major account.\" Mr. Blum became chairman of CBRE in 2001 and has played a major role in its corporate business strategies. He led a buyout of the company, first taking it private and then a few years later taking it public again. He runs an investment management firm called Blum Capital Partners, which controls the second largest block of publicly traded CBRE stock - 38 million shares or 14.4 percent. Mr. Blum, whose position as chairman of CBRE is not full time, sets up partnerships through Blum Capital Partners that invests money for its clients and its owners. He reported owning more than $3 million in CBRE stock through various partnerships at the end of 2007, according to Mrs. Feinstein's personal financial disclosure statement. CBRE's initial contract is for three years. The FDIC has the option to extend it for three two-year periods, records show. The contract calls for the real estate firm to be used \"as needed.\" In March, the FDIC said it had assigned CBRE 507 properties for disposal, valued at $221.7 million. In March, the company already had 23 FDIC properties valued at $11 million under contract to be sold. Over the past 16 months, 50 banks have failed and more are expected to close. As a result, nobody knows how much CBRE will be able to earn over the life of the FDIC contract. Blum and the stock offering The FDIC contract came at a good time for CBRE. Even though it remains the world's largest commercial real estate services firm, it was hit hard by the economic downturn. The company saw its revenues and income slide in 2008 and its stock price tumbled from $24.50 in May to below $4 in November. \"Our third quarter results reflected the extremely challenging market conditions, which continued to deteriorate globally,\" Brett White, president and chief executive officer of CBRE, said in early November. A few days later, CBRE raised $207 million through a stock offering that sold for $3.77 a share. Mr. Blum's investment partnerships bought 10.6 million shares at the market price of $3.77. The stock offering was announced a couple of days before the signing of the FDIC contract. In its November prospectus for the stock sale, CBRE warned potential investors that the company could be hurt by the money problems of its clients, noting that federal regulators had recently taken over one of its \"significant\" clients, Washington Mutual, the nation's largest savings and loan. The terms of the contract CBRE won a highly favorable contract, according to real estate experts who reviewed the terms at the request of The Times. CBRE is to be paid under a three-tiered system with sliding rates, according to a rate proposal provided to The Times under a Freedom of Information Act (FOIA) request. For starters, CBRE gets to charge a setup fee of $450 for each residential property and $600 for each commercial property it takes over from the FDIC. \"That is highly unusual,\" said Ms. Kenner, the Colorado-based foreclosure expert. She said she does not collect a separate setup fee and was expected to do such work as part of her commission. The FDIC said: \"The setup fee is for setting up the assets in the contractor's database and the FDIC database. In the private sector, a similar fee is usually charged as an administrative fee, document preparation fee, or asset handling fee.\" Milt Shaw, senior vice president of LPS Asset Management Solutions, which manages nearly 20,000 foreclosed properties for banks and other clients, said his firm did not charge setup fees. Others in the industry also called the fee unusual. CBRE also gets to collect a monthly administrative management fee of at least $200 for each residential and $1,600 for each commercial property in its inventory. Ms. Kenner and Mr. Shaw said fees for management services often come out of the sales commissions at closing. But the biggest fees for CBRE will come from the sales. CBRE charges commissions of 6 percent of the sales price on residential and 7 percent on commercial properties worth up to $1 million. It also is entitled to an incentive fee of as much as 2 percent of the sales price for properties it sells within six months. The incentives start at two percent for residential properties worth between $25,001 and $500,000 and for commercial properties worth between $25,001 and $1 million before dropping to 1.5 percent. The percentages for both the commissions and incentives become smaller as prices get higher. Six percent commission is a standard rate for residential property in the private sector, but some experts said many buyers negotiate a lower fee. Ms. Kenner, who deals in foreclosed residential properties, said she charges 5 percent to 6 percent, depending on the market, adding that she shares the fee with the buyer's agent and often with the asset management company. Mr. Shaw said incentive fees are not that frequent in the private sector, but when he sees them they are usually smaller than 2 percent and pegged for a specific market. The FDIC defended the fees, saying they were \"intended to incentivize the contractors to sell the assets as quickly as possible for the benefit of the FDIC and to protect the insurance fund.\" \"The private sector normally does not have an urgency to sell assets quickly and thus do not normally have any incentive to do so,\" the agency said. Mr. Shaw disagreed and said his private sector clients - banks and loan servicers - also wanted their properties sold quickly. CBRE has the chance to collect the largest percentage of the sales price for properties worth $25,000 or less, under a flat fee agreement far more generous than the private sector. Under the FDIC contract, CBRE charges a $5,000 sales commission for each property and can collect an additional $2,500 incentive fee if they sell it in under six months. In other words, they can collect as much as $7,500 on the sale of a property worth $25,000 or less - which works out to a sales commission of 30 percent or more. Ms. Kenner said she charges $2,000 to $2,500 to sell properties worth $25,000 or less. Another firm, Prescient Inc., which won a similar FDIC contract at the same time as CBRE, charges a $1,948 commission and a $485 incentive fee. \"I think it is a little egregious,\" Mr. Shaw said of the CBRE compensation deal for small properties. CBRE said its rates were market and commission money would be shared with other agents who co-listed the properties or represented the buyers. Feinstein and the legislation Mrs. Feinstein introduced her bill Jan. 6, seeking $25 billion from the government's bailout fund know as the Troubled Asset Relief Program to help bankroll an FDIC proposal to systematically prevent home mortgage foreclosures by expediting loan workouts and expanding federal loan guarantees. The proposal was a pet project of FDIC Chairman Sheila C. Bair, who wanted expand a program the agency had used successfully with borrowers of the failed IndyMac bank to help reduce foreclosures. Records show Mrs. Feinstein's public support for the Bair proposal surfaced Oct. 30 in letter to Mrs. Bair as CBRE was still competing for the FDIC contract. Mrs. Bair responded in late November pointing out that she had not been able to get the Treasury Department to adopt her program and authorize bailout funds for it, according to the correspondence released under FOIA. Mrs. Feinstein's legislation would have required the government to finance Mrs. Bair's foreclosure plan. \"The FDIC estimates that roughly 2.2 million home loans, worth $444 billion, could be modified under this plan, with 1.5 million foreclosures avoided,\" she said in her statement on the bill. Her spokesman said she introduced the foreclosure relief bill not at Mrs. Bair's request but after becoming aware from news accounts of the effect of the mortgage crisis, especially on California homeowners. \"California has one-third of all foreclosures in the nation, and the need to provide relief to struggling American families is the sole motivation for this bill,\" Mr. Duran said. FDIC spokesman Andrew Gray said the agency's proposal got bipartisan backing. Rep. Maxine Waters, California Democrat, twice introduced a similar bill in the House. Both bills by Mrs. Feinstein and Mrs. Waters have been superceded by Mr. Obama's economic stimulus plan to aid homeowners, which adopts parts of the FDIC concept. Mr. Gray said none of the FDIC board members such as Mrs. Bair played a role in the selection of CBRE because there is a fire wall between them and contracting decisions. He said Mrs. Bair first learned of the contract by reading the newspaper. A question of ethics As for Mrs. Feinstein, Mr. Duran said she did not learn of the contract until The Times asked her office about it in late January, even though the contract was publicly announced by the company and had been mentioned in an article in the Los Angeles Times in late November. Her spokesman said her office was not aware of the article. Ethics analysts question whether Mrs. Feinstein had an obligation to track her husband's business dealings with the government to avoid any appearance of a conflict of interest. \"I find it amazing that they did not know that CB Richard Ellis had gotten the FDIC contract,\" said Mr. Cooper, the ethics expert and former regulator. \"Why wasn't she or a staff person regularly watching for possible conflicts?\" Other experts said they do not think that the Senate Ethics Committee will take any action because Mrs. Feinstein's legislation did not directly financially benefit her husband and was aimed at solving a problem affecting a broad section of America. Robert L. Walker, a former chief Senate Ethics Committee counsel, said the Senate conflict rule is so narrow that it \"almost requires a senator's sponsorship of a private bill resulting in some personal or family benefit before a violation of the rule would be found.\" Mr. Walker added that the Senate usually relies on the senator to police against improper appearances, but the policy \"assumes that a senator and his or her staff will know about and remain alert to investments and other financial ties, including family financial ties, that could be the basis of such appearance concerns.\" Mr. Duran said Mrs. Feinstein and Mr. Blum make \"an intensive effort\" to maintain a wall between their financial interests. \"Her staff carefully reviews all votes,\" he said. \"Senator Feinstein complies with all required congressional disclosure requirements. She follows the guidance of the ethics committee and its requirements.\" Mrs. Feinstein, who declined to answer detailed question about the steps she takes to avoid conflicts, is one of the wealthiest members of Congress, mainly from Mr. Blum's holdings. Together, they are worth at least $52.3 million, according to her 2007 personal financial disclosure forms filed with the Senate and analyzed by the nonpartisan Center for Responsive Politics, which monitors money and politics. \"When a spouse has so many business interests, it will always raise questions about how contracts are acquired or decisions made,\" said Ms. Sloan, CREW's executive director. This message has been edited. Last edited by: GunnyRet03, Wed 22 April 2009 07:11 PM", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "", 
        "reply": "This is the 2nd time she has done something like this. Senator's husband cashes in on crisis <edit> <edit> 'http://washingtontimes.com/news/2009/apr/21/senate-husbands-firm-cashes-in-on-crisis/print/' On the day the new Congress convened this year, Sen. Dianne Feinstein introduced legislation to route $25 billion in taxpayer money to a government agency that had just awarded her husband's real estate firm a lucrative contract to sell foreclosed properties at compensation rates higher than the industry norms. Mrs. Feinstein's intervention on behalf of the Federal Deposit Insurance Corp. was unusual: the California Democrat isn't a member of the Senate Committee on Banking, Housing and Urban Affairs with jurisdiction over FDIC; and the agency is supposed to operate from money it raises from bank-paid insurance payments - not direct federal dollars. Documents reviewed by The Washington Times show Mrs. Feinstein first offered Oct. 30 to help the FDIC secure money for its effort to stem the rise of home foreclosures. Her letter was sent just days before the agency determined that CB Richard Ellis Group (CBRE) - the commercial real estate firm that her husband Richard Blum heads as board chairman - had won the competitive bidding for a contract to sell foreclosed properties that FDIC had inherited from failed banks. About the same time of the contract award, Mr. Blum's private investment firm reported to the Securities and Exchange Commission that it and related affiliates had purchased more than 10 million new shares in CBRE. The shares were purchased for the going price of $3.77; CBRE's stock closed Monday at $5.14. Spokesmen for the FDIC, Mrs. Feinstein and Mr. Blum's firm told The Times that there was no connection between the legislation and the contract signed Nov. 13, and that the couple didn't even know about CBRE's business with FDIC until after it was awarded. Yeh, another big Koinkydink <edit> Senate ethics rules state that members must avoid conflicts of interest as well as \"even the appearance of a conflict of interest.\" Some ethics analysts question whether Mrs. Feinstein ran afoul of the latter provision, creating the appearance that she was rewarding the agency that had just hired her husband's firm. \"This clearly gives the appearance of a conflict of interest,\" said Kent Cooper, a former federal regulator who specializes in government ethics and disclosures. \"To maintain the people's trust in government, it is incumbent on a legislator to take the extra steps necessary to ensure that when she introduces any legislation that it does not cause people to question her motives or the business activities of her spouse.\" <edit> The FDIC contract \"highlights the problem of a senator with a spouse who has extensive business interests that intersect frequently with the federal government,\" said Melanie Sloan, executive director of the watchdog group Citizens for Responsibility and Ethics in Washington (CREW). \"Even if there is no actual conflict of interest, it often has the appearance of a conflict.\" A 'very sweet deal'? Real estate specialists also question the government's generosity in the CBRE contract. The firm, known for its commercial real estate services, is to be paid monthly maintenance fees for each foreclosed property it handles, as well as commissions and incentives. The total compensation can range from 8 percent of the sales price on many residential properties to 30 percent for properties worth $25,000 or less. A smaller firm also won a slice of the work with similar terms, records show. Most real estate agents earn no more than 6 percent on residential, even on foreclosed properties, and CBRE doesn't have as much experience in foreclosure sales as other firms, the experts said. \"From everything I know about it, it is a very sweet deal and went to somebody who is less than qualified in dealing with foreclosed residential properties. Their expertise is in commercial real estate,\" said Cynthia Kenner, a Colorado real estate agent who specializes in selling bank-owned residential properties and last year helped sell more than 600 foreclosed properties. \"There are companies that are more experienced in selling such properties than CB Richard Ellis,\" she added. FDIC and Feinstein respond The FDIC said politics was not involved in its decision, noting the contract was awarded after a six-month competition run by career staff who determined that CBRE was \"deemed to be technically qualified and their fee structure fair and reasonable.\" That means the competition did not mandate the contract go to the lowest bidder necessarily, officials said. The agency said the above-market incentives were designed to encourage quick sales of the growing number of foreclosed properties the FDIC has inherited during the recession. \"The longer the asset is held, the more costly it is for the FDIC, and more expenses are incurred for the assets,\" the agency said in a statement to The Times. Feinstein spokesman Gil Duran said there was no conflict of interest between Mr. Blum's firm getting the contract and the senator's legislation. He said she introduced the legislation because it would help prevent home mortgage foreclosures at a time when many Californians were in danger of losing their homes. \"She was not aware of the contract before she introduced the legislation,\" Mr. Duran said. \"There is no evidence of any relationship or conflict between this foreclosure relief bill and the contract. Senator Feinstein complies with the rules and guidelines of the Ethics Committee.\" Mr. Duran also said Mr. Blum \"is not involved in the day-to-day operations of the company, nor does he have any involvement in the company's contracting.\" Mr. Blum declined through a spokesman to comment. CBRE spokesman Robert McGrath said the firm had $5 billion in revenues last year and was \"well positioned\" to help the FDIC as the nation's largest commercial real estate services company. Its pricing was at market rates after a highly competitive bid process, he said. \"We believe the FDIC will realize significant value from all the work we perform on their behalf,\" he said. The contract process In May, the FDIC began the formal process of looking for help to manage and market its growing portfolio of foreclosed real estate acquired from failed financial institutions nationwide. It sent letters to 33 real estate firms and received proposals from 18. In November, the FDIC signed a contract with CBRE that could be worth tens of millions of dollars or more at a time when real estate firms are scrambling for business in the distressed economy. CBRE said it was hired to act \"as a primary adviser\" to the FDIC for its real estate portfolio nationwide, according to a press release announcing the contract. The firm called the FDIC a \"major account.\" Mr. Blum became chairman of CBRE in 2001 and has played a major role in its corporate business strategies. He led a buyout of the company, first taking it private and then a few years later taking it public again. He runs an investment management firm called Blum Capital Partners, which controls the second largest block of publicly traded CBRE stock - 38 million shares or 14.4 percent. Mr. Blum, whose position as chairman of CBRE is not full time, sets up partnerships through Blum Capital Partners that invests money for its clients and its owners. He reported owning more than $3 million in CBRE stock through various partnerships at the end of 2007, according to Mrs. Feinstein's personal financial disclosure statement. CBRE's initial contract is for three years. The FDIC has the option to extend it for three two-year periods, records show. The contract calls for the real estate firm to be used \"as needed.\" In March, the FDIC said it had assigned CBRE 507 properties for disposal, valued at $221.7 million. In March, the company already had 23 FDIC properties valued at $11 million under contract to be sold. Over the past 16 months, 50 banks have failed and more are expected to close. As a result, nobody knows how much CBRE will be able to earn over the life of the FDIC contract. Blum and the stock offering The FDIC contract came at a good time for CBRE. Even though it remains the world's largest commercial real estate services firm, it was hit hard by the economic downturn. The company saw its revenues and income slide in 2008 and its stock price tumbled from $24.50 in May to below $4 in November. \"Our third quarter results reflected the extremely challenging market conditions, which continued to deteriorate globally,\" Brett White, president and chief executive officer of CBRE, said in early November. A few days later, CBRE raised $207 million through a stock offering that sold for $3.77 a share. Mr. Blum's investment partnerships bought 10.6 million shares at the market price of $3.77. The stock offering was announced a couple of days before the signing of the FDIC contract. In its November prospectus for the stock sale, CBRE warned potential investors that the company could be hurt by the money problems of its clients, noting that federal regulators had recently taken over one of its \"significant\" clients, Washington Mutual, the nation's largest savings and loan. The terms of the contract CBRE won a highly favorable contract, according to real estate experts who reviewed the terms at the request of The Times. CBRE is to be paid under a three-tiered system with sliding rates, according to a rate proposal provided to The Times under a Freedom of Information Act (FOIA) request. For starters, CBRE gets to charge a setup fee of $450 for each residential property and $600 for each commercial property it takes over from the FDIC. \"That is highly unusual,\" said Ms. Kenner, the Colorado-based foreclosure expert. She said she does not collect a separate setup fee and was expected to do such work as part of her commission. The FDIC said: \"The setup fee is for setting up the assets in the contractor's database and the FDIC database. In the private sector, a similar fee is usually charged as an administrative fee, document preparation fee, or asset handling fee.\" Milt Shaw, senior vice president of LPS Asset Management Solutions, which manages nearly 20,000 foreclosed properties for banks and other clients, said his firm did not charge setup fees. Others in the industry also called the fee unusual. CBRE also gets to collect a monthly administrative management fee of at least $200 for each residential and $1,600 for each commercial property in its inventory. Ms. Kenner and Mr. Shaw said fees for management services often come out of the sales commissions at closing. But the biggest fees for CBRE will come from the sales. CBRE charges commissions of 6 percent of the sales price on residential and 7 percent on commercial properties worth up to $1 million. It also is entitled to an incentive fee of as much as 2 percent of the sales price for properties it sells within six months. The incentives start at two percent for residential properties worth between $25,001 and $500,000 and for commercial properties worth between $25,001 and $1 million before dropping to 1.5 percent. The percentages for both the commissions and incentives become smaller as prices get higher. Six percent commission is a standard rate for residential property in the private sector, but some experts said many buyers negotiate a lower fee. Ms. Kenner, who deals in foreclosed residential properties, said she charges 5 percent to 6 percent, depending on the market, adding that she shares the fee with the buyer's agent and often with the asset management company. Mr. Shaw said incentive fees are not that frequent in the private sector, but when he sees them they are usually smaller than 2 percent and pegged for a specific market. The FDIC defended the fees, saying they were \"intended to incentivize the contractors to sell the assets as quickly as possible for the benefit of the FDIC and to protect the insurance fund.\" \"The private sector normally does not have an urgency to sell assets quickly and thus do not normally have any incentive to do so,\" the agency said. Mr. Shaw disagreed and said his private sector clients - banks and loan servicers - also wanted their properties sold quickly. CBRE has the chance to collect the largest percentage of the sales price for properties worth $25,000 or less, under a flat fee agreement far more generous than the private sector. Under the FDIC contract, CBRE charges a $5,000 sales commission for each property and can collect an additional $2,500 incentive fee if they sell it in under six months. In other words, they can collect as much as $7,500 on the sale of a property worth $25,000 or less - which works out to a sales commission of 30 percent or more. Ms. Kenner said she charges $2,000 to $2,500 to sell properties worth $25,000 or less. Another firm, Prescient Inc., which won a similar FDIC contract at the same time as CBRE, charges a $1,948 commission and a $485 incentive fee. \"I think it is a little egregious,\" Mr. Shaw said of the CBRE compensation deal for small properties. CBRE said its rates were market and commission money would be shared with other agents who co-listed the properties or represented the buyers. Feinstein and the legislation Mrs. Feinstein introduced her bill Jan. 6, seeking $25 billion from the government's bailout fund know as the Troubled Asset Relief Program to help bankroll an FDIC proposal to systematically prevent home mortgage foreclosures by expediting loan workouts and expanding federal loan guarantees. The proposal was a pet project of FDIC Chairman Sheila C. Bair, who wanted expand a program the agency had used successfully with borrowers of the failed IndyMac bank to help reduce foreclosures. Records show Mrs. Feinstein's public support for the Bair proposal surfaced Oct. 30 in letter to Mrs. Bair as CBRE was still competing for the FDIC contract. Mrs. Bair responded in late November pointing out that she had not been able to get the Treasury Department to adopt her program and authorize bailout funds for it, according to the correspondence released under FOIA. Mrs. Feinstein's legislation would have required the government to finance Mrs. Bair's foreclosure plan. \"The FDIC estimates that roughly 2.2 million home loans, worth $444 billion, could be modified under this plan, with 1.5 million foreclosures avoided,\" she said in her statement on the bill. Her spokesman said she introduced the foreclosure relief bill not at Mrs. Bair's request but after becoming aware from news accounts of the effect of the mortgage crisis, especially on California homeowners. \"California has one-third of all foreclosures in the nation, and the need to provide relief to struggling American families is the sole motivation for this bill,\" Mr. Duran said. FDIC spokesman Andrew Gray said the agency's proposal got bipartisan backing. Rep. Maxine Waters, California Democrat, twice introduced a similar bill in the House. Both bills by Mrs. Feinstein and Mrs. Waters have been superceded by Mr. Obama's economic stimulus plan to aid homeowners, which adopts parts of the FDIC concept. Mr. Gray said none of the FDIC board members such as Mrs. Bair played a role in the selection of CBRE because there is a fire wall between them and contracting decisions. He said Mrs. Bair first learned of the contract by reading the newspaper. A question of ethics As for Mrs. Feinstein, Mr. Duran said she did not learn of the contract until The Times asked her office about it in late January, even though the contract was publicly announced by the company and had been mentioned in an article in the Los Angeles Times in late November. Her spokesman said her office was not aware of the article. Ethics analysts question whether Mrs. Feinstein had an obligation to track her husband's business dealings with the government to avoid any appearance of a conflict of interest. \"I find it amazing that they did not know that CB Richard Ellis had gotten the FDIC contract,\" said Mr. Cooper, the ethics expert and former regulator. \"Why wasn't she or a staff person regularly watching for possible conflicts?\" Other experts said they do not think that the Senate Ethics Committee will take any action because Mrs. Feinstein's legislation did not directly financially benefit her husband and was aimed at solving a problem affecting a broad section of America. Robert L. Walker, a former chief Senate Ethics Committee counsel, said the Senate conflict rule is so narrow that it \"almost requires a senator's sponsorship of a private bill resulting in some personal or family benefit before a violation of the rule would be found.\" Mr. Walker added that the Senate usually relies on the senator to police against improper appearances, but the policy \"assumes that a senator and his or her staff will know about and remain alert to investments and other financial ties, including family financial ties, that could be the basis of such appearance concerns.\" Mr. Duran said Mrs. Feinstein and Mr. Blum make \"an intensive effort\" to maintain a wall between their financial interests. \"Her staff carefully reviews all votes,\" he said. \"Senator Feinstein complies with all required congressional disclosure requirements. She follows the guidance of the ethics committee and its requirements.\" Mrs. Feinstein, who declined to answer detailed question about the steps she takes to avoid conflicts, is one of the wealthiest members of Congress, mainly from Mr. Blum's holdings. Together, they are worth at least $52.3 million, according to her 2007 personal financial disclosure forms filed with the Senate and analyzed by the nonpartisan Center for Responsive Politics, which monitors money and politics. \"When a spouse has so many business interests, it will always raise questions about how contracts are acquired or decisions made,\" said Ms. Sloan, CREW's executive director. This message has been edited. Last edited by: GunnyRet03, Wed 22 April 2009 07:11 PM", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 10:29:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Funny thing I don't see any liberals or democrats jumping all over this..Hmmmmmmmmm..Just goes to show you what is what and who is who.", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "Funny thing I don't see any liberals or democrats jumping all over this..Hmmmmmmmmm..Just goes to show you what is what and who is who.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 11:00:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "dman1948"
    }, 
    {
        "content": "What part of \"we won, we can do anything we want\" don't you get? I hope you sold your Haliburton stock before the administation change.", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "", 
        "reply": "What part of \"we won, we can do anything we want\" don't you get? I hope you sold your Haliburton stock before the administation change.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 11:06:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Compare this to that repb from TX, cant remember his name.", 
        "intTime": 20090421, 
        "postID": 4, 
        "quote": "", 
        "reply": "Compare this to that repb from TX, cant remember his name.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 11:19:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Compare this to that repb from TX, cant remember his name. No you can't compare anything with the Texas repub...Texas left the Union 6 days ago...So its a mute point", 
        "intTime": 20090421, 
        "postID": 5, 
        "quote": "Originally posted by GunnyRet03: Compare this to that repb from TX, cant remember his name.", 
        "reply": " No you can't compare anything with the Texas repub...Texas left the Union 6 days ago...So its a mute point", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 11:42:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "scottrj50"
    }, 
    {
        "content": "Texas left the union, wow I didn't see that. Hard to miss something that big in the news. Of course, could be just more pipe dreams from one of the, um, um, well we all know what she is.", 
        "intTime": 20090421, 
        "postID": 6, 
        "quote": "", 
        "reply": "Texas left the union, wow I didn't see that. Hard to miss something that big in the news. Of course, could be just more pipe dreams from one of the, um, um, well we all know what she is.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 11:52:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: Texas left the union, wow I didn't see that. Hard to miss something that big in the news. Of course, could be just more pipe dreams from one of the, um, um, well we all know what she is. Its not that big of a thing.Texas is lucky now...It won't have to play Florida", 
        "intTime": 20090421, 
        "postID": 7, 
        "quote": "Originally posted by transport1: Texas left the union, wow I didn't see that. Hard to miss something that big in the news. Of course, could be just more pipe dreams from one of the, um, um, well we all know what she is.", 
        "reply": " Its not that big of a thing.Texas is lucky now...It won't have to play Florida", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 12:03:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: What part of \"we won, we can do anything we want\" don't you get? I hope you sold your Haliburton stock before the administation change. No, since Halliburton moved its HQ overseas. They have more international than US business. More good-paying jobs could have stayed in the US, but demand elsewhere and stupid US policies drive such business away. The rest of the world will not behave stupidly, as this administration compels Americans to suffer ecoonomically to assuage their self-imposed, anti-freedom guilt trips. Barring a major catastrophe throughout the world that sends us all back to the economies of 100+ years ago, Halliburton's services will be in demand in years ahead. They know how to add value to processes and EARN a profit on the basis of high ethical standards, unique expertise, and dedication. Lots of the enforced collectivists posting on this forum do not really understand such concepts.", 
        "intTime": 20090421, 
        "postID": 8, 
        "quote": "Originally posted by bill_kananen: What part of \"we won, we can do anything we want\" don't you get? I hope you sold your Haliburton stock before the administation change.", 
        "reply": " No, since Halliburton moved its HQ overseas. They have more international than US business. More good-paying jobs could have stayed in the US, but demand elsewhere and stupid US policies drive such business away. The rest of the world will not behave stupidly, as this administration compels Americans to suffer ecoonomically to assuage their self-imposed, anti-freedom guilt trips. Barring a major catastrophe throughout the world that sends us all back to the economies of 100+ years ago, Halliburton's services will be in demand in years ahead. They know how to add value to processes and EARN a profit on the basis of high ethical standards, unique expertise, and dedication. Lots of the enforced collectivists posting on this forum do not really understand such concepts.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 12:21:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Compare this to that repb from TX, cant remember his name. Aw...C'mon there Gunny \"Do as I say, Not as I do...\" - any DEM", 
        "intTime": 20090421, 
        "postID": 9, 
        "quote": "Originally posted by GunnyRet03: Compare this to that repb from TX, cant remember his name.", 
        "reply": " Aw...C'mon there Gunny \"Do as I say, Not as I do...\" - any DEM", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 12:26:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: RRR52: No, since Halliburton moved its HQ overseas. Well that's OK too. It will be more for us to redistribute.", 
        "intTime": 20090421, 
        "postID": 10, 
        "quote": "RRR52: No, since Halliburton moved its HQ overseas.", 
        "reply": " Well that's OK too. It will be more for us to redistribute.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 12:31:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by scottrj50: quote: Originally posted by GunnyRet03: Compare this to that repb from TX, cant remember his name. No you can't compare anything with the Texas repub...Texas left the Union 6 days ago...So its a mute point \"mute\"? How much was your tuition? He's an illegal it was free.", 
        "intTime": 20090421, 
        "postID": 11, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by scottrj50: quote: Originally posted by GunnyRet03: Compare this to that repb from TX, cant remember his name. No you can't compare anything with the Texas repub...Texas left the Union 6 days ago...So its a mute point \"mute\"? How much was your tuition?", 
        "reply": " He's an illegal it was free.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 21:17:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Her first run-in with defense contracts being awarded to her husband in new builds was another I didnt know anything about this.", 
        "intTime": 20090421, 
        "postID": 12, 
        "quote": "", 
        "reply": "Her first run-in with defense contracts being awarded to her husband in new builds was another I didnt know anything about this.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-21 21:18:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Here was the last scam: <edit> 'http://www.metronews.com/feinstein.html' January 24, 2007 — Sen. Dianne Feinstein's husband was a major beneficiary of military appropriations blessed by a subcommittee that she headed, Metro Newspapers reports this week. Feinstein (D-Calif.) acted in apparent conflict of interest while approving billions of dollars in military construction expenditures, according to an investigative story by award-winning journalist Peter Byrne. The story was published jointly in the North Bay Bohemian and Metro Silicon Valley weekly newspapers this week. Following Feinstein's participation at the legislative level, large contracts were awarded to two firms — URS Corporation and Perini Corporation — that were controlled by an investment group headed by the senator's spouse, financier Richard C. Blum. Byrne's investigation reveals the following details about Feinstein's service as a member of the United States Senate's Military Construction Appropriations subcommittee (MILCON): * From 1997 through the end of 2005, with Feinstein's knowledge, her husband's group held a majority interest in two defense contractors active in Iraq and U.S. military bases. * While setting MILCON agendas, Feinstein supervised her own staff of military construction experts and lobbied Pentagon officials in public hearings. * From 2001 to 2005, URS earned $792 million from military construction and environmental cleanup projects approved by MILCON; Perini secured $759 million from MILCON projects. * Attorney Michael R. Klein, a Feinstein legal adviser and long-time Blum business partner, also served as vice-chairman of Perini's board of directors. In an interview with Byrne in September, Klein stated that, beginning in 1997, he routinely informed Feinstein about specific federal projects coming before her in which Perini had a stake. The insider information, Klein said, was intended to help the senator avoid conflicts of interest. Although Klein's admission was intended to defuse the issue of Feinstein's conflict of interest, it instead exacerbated it, and Sen. Feinstein did in fact vote on legislation that affected Perini and URS. The story published in Metro Silicon Valley and the North Bay Bohemian examines the many ways in which Sen. Feinstein committed repeated breaches of ethics as MILCON's chairperson from 2001-2005. quote: 'http://www.sfgate.com/cgi-bin/article.cgi?file=/chronicle/archive/2003/04/27/BA284459.DTL' When it comes to scoring mega-military-related contracts, Sen. Dianne Feinstein's multimillionaire husband, Richard Blum, is right in the thick of things. First up: a contract announced last week between the Army and URS Corp., the San Francisco planning and engineering company that specializes in defense work -- and that happens to be partly owned by Blum's investment firm.", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "'http://www.sfgate.com/cgi-bin/article.cgi?file=/chronicle/archive/2003/04/27/BA284459.DTL' When it comes to scoring mega-military-related contracts, Sen. Dianne Feinstein's multimillionaire husband, Richard Blum, is right in the thick of things. First up: a contract announced last week between the Army and URS Corp., the San Francisco planning and engineering company that specializes in defense work -- and that happens to be partly owned by Blum's investment firm.", 
        "reply": "Here was the last scam: <edit> 'http://www.metronews.com/feinstein.html' January 24, 2007 — Sen. Dianne Feinstein's husband was a major beneficiary of military appropriations blessed by a subcommittee that she headed, Metro Newspapers reports this week. Feinstein (D-Calif.) acted in apparent conflict of interest while approving billions of dollars in military construction expenditures, according to an investigative story by award-winning journalist Peter Byrne. The story was published jointly in the North Bay Bohemian and Metro Silicon Valley weekly newspapers this week. Following Feinstein's participation at the legislative level, large contracts were awarded to two firms — URS Corporation and Perini Corporation — that were controlled by an investment group headed by the senator's spouse, financier Richard C. Blum. Byrne's investigation reveals the following details about Feinstein's service as a member of the United States Senate's Military Construction Appropriations subcommittee (MILCON): * From 1997 through the end of 2005, with Feinstein's knowledge, her husband's group held a majority interest in two defense contractors active in Iraq and U.S. military bases. * While setting MILCON agendas, Feinstein supervised her own staff of military construction experts and lobbied Pentagon officials in public hearings. * From 2001 to 2005, URS earned $792 million from military construction and environmental cleanup projects approved by MILCON; Perini secured $759 million from MILCON projects. * Attorney Michael R. Klein, a Feinstein legal adviser and long-time Blum business partner, also served as vice-chairman of Perini's board of directors. In an interview with Byrne in September, Klein stated that, beginning in 1997, he routinely informed Feinstein about specific federal projects coming before her in which Perini had a stake. The insider information, Klein said, was intended to help the senator avoid conflicts of interest. Although Klein's admission was intended to defuse the issue of Feinstein's conflict of interest, it instead exacerbated it, and Sen. Feinstein did in fact vote on legislation that affected Perini and URS. The story published in Metro Silicon Valley and the North Bay Bohemian examines the many ways in which Sen. Feinstein committed repeated breaches of ethics as MILCON's chairperson from 2001-2005. ", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-22 19:19:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "This is only ONE reason why I have never voted for Feinstein to represent me in the Senate. I cannot stand her. Or Boxer. We need fresh, young candidates. These two are stale, ragged, out of touch, and on the take.", 
        "intTime": 20090423, 
        "postID": 14, 
        "quote": "", 
        "reply": "This is only ONE reason why I have never voted for Feinstein to represent me in the Senate. I cannot stand her. Or Boxer. We need fresh, young candidates. These two are stale, ragged, out of touch, and on the take.", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-23 07:55:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "1WW"
    }, 
    {
        "content": "\"California Democrat\" was all I had to read. Don", 
        "intTime": 20090423, 
        "postID": 15, 
        "quote": "", 
        "reply": "\"California Democrat\" was all I had to read. Don", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-23 09:30:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "This just proves some of our opinions on partisanship. Both parties have corruption, just seems the Democrats are either more bold or think they are untouchable. Republicans have their bad apples, but lately not as mch as the leading party. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090423, 
        "postID": 16, 
        "quote": "", 
        "reply": "This just proves some of our opinions on partisanship. Both parties have corruption, just seems the Democrats are either more bold or think they are untouchable. Republicans have their bad apples, but lately not as mch as the leading party. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3880063122001", 
        "time": "2009-04-23 10:55:00", 
        "title": "Senator's husband cashes in on crisis. (Feinstein)", 
        "userID": "L0A1"
    }
]