[
    {
        "content": "quote: U.S. Seeks Expanded Power to Seize Firms Goal Is to Limit Risk to Broader Economy By Binyamin Appelbaum and David Cho Washington Post Staff Writers Tuesday, March 24, 2009 The Obama administration is considering asking Congress to give the Treasury secretary unprecedented powers to initiate the seizure of non-bank financial companies, such as large insurers, investment firms and hedge funds, whose collapse would damage the broader economy, according to an administration document. The government at present has the authority to seize only banks. Giving the Treasury secretary authority over a broader range of companies would mark a significant shift from the existing model of financial regulation, which relies on independent agencies that are shielded from the political process. The Treasury secretary, a member of the president's Cabinet, would exercise the new powers in consultation with the White House, the Federal Reserve and other regulators, according to the document. The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. <much more> \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/23/AR2009032302830_pf.html\"", 
        "intTime": 20090324, 
        "postID": 1, 
        "quote": "U.S. Seeks Expanded Power to Seize Firms Goal Is to Limit Risk to Broader Economy By Binyamin Appelbaum and David Cho Washington Post Staff Writers Tuesday, March 24, 2009 The Obama administration is considering asking Congress to give the Treasury secretary unprecedented powers to initiate the seizure of non-bank financial companies, such as large insurers, investment firms and hedge funds, whose collapse would damage the broader economy, according to an administration document. The government at present has the authority to seize only banks. Giving the Treasury secretary authority over a broader range of companies would mark a significant shift from the existing model of financial regulation, which relies on independent agencies that are shielded from the political process. The Treasury secretary, a member of the president's Cabinet, would exercise the new powers in consultation with the White House, the Federal Reserve and other regulators, according to the document. The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. <much more> \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/23/AR2009032302830_pf.html\"", 
        "reply": "", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 06:50:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "intTime": 20090324, 
        "postID": 2, 
        "quote": "The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux.", 
        "reply": " Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:11:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "intTime": 20090324, 
        "postID": 3, 
        "quote": "Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "reply": "", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:22:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. What needs to stop is the rank hypocrisy. If Bush had flouted this little nightmare, you'd be the first to denounce it. The bottom line is government does almost nothing well..nothing. And now you want them run everything? You've got to be kidding. On top of that you want to use ONE instance of failure to justify tearing the entire system down, ignore decades of history, and implant some new world order..and why? Cowardice. People are afraid of everything, afraid to take chances, to stand up for what right, afraid to be free. Being free means having the freedom to make mistakes. It does not mean the Fed is your big brother and will take care of you all the time.", 
        "intTime": 20090324, 
        "postID": 4, 
        "quote": "Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop.", 
        "reply": " What needs to stop is the rank hypocrisy. If Bush had flouted this little nightmare, you'd be the first to denounce it. The bottom line is government does almost nothing well..nothing. And now you want them run everything? You've got to be kidding. On top of that you want to use ONE instance of failure to justify tearing the entire system down, ignore decades of history, and implant some new world order..and why? Cowardice. People are afraid of everything, afraid to take chances, to stand up for what right, afraid to be free. Being free means having the freedom to make mistakes. It does not mean the Fed is your big brother and will take care of you all the time.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:40:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it.", 
        "intTime": 20090324, 
        "postID": 5, 
        "quote": "Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark.", 
        "reply": " what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:50:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: dmuhler: The point is we have to keep our eye on all of this crap or one day you will wake up and it will be gone. That's right! We need to keep our eyes on the lib/socialist's efforts to redistribute poverty or one day we will find all private wealth gone. We will all be equally poor except for the socialist cadre.", 
        "intTime": 20090324, 
        "postID": 6, 
        "quote": "dmuhler: The point is we have to keep our eye on all of this crap or one day you will wake up and it will be gone.", 
        "reply": " That's right! We need to keep our eyes on the lib/socialist's efforts to redistribute poverty or one day we will find all private wealth gone. We will all be equally poor except for the socialist cadre.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:54:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail.", 
        "intTime": 20090324, 
        "postID": 7, 
        "quote": "Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark.", 
        "reply": " The only thing the government has ever done well is fight wars and send mail.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:54:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it. Too much of what guvmint is now supposed to do, it does poorly. Defense is not one of them; there is no better way to defend the nation. I, too, look back on time in the service and take great pride in what we accomplished. I remain doubtful that there are many more better examples of substantive, effective cultural change of large organizations as occurred for the Army (other branches, too, I expect) from 1974-1990. And the main reason it happened was effective leadership. Obviously, the funding from the Reagan buildup mattered. But the Army was changing for the better despite disastrous Jimmy Carter, who screwed its funding and turned the 101st into a NMC-rated division by '79, and that was in the midst of the Iranian hostage mess, when the 101st was part of the RDF. Those who contributed to winning the Cold War by being so good at their jobs that the scumbag communists refused to attack us can remain proud of that great accomplishment. Money alone would not have accomplished that; throwing money at problems never does solve the issues and can even impede improvement. The various federal agencies and offices that are extraneous, that would hardly be missed by the overwhelming majority of Americans if immediately abolished, may well be staffed by fine people. But the structural interactions and functions of too many of the federal agencies are excessively intrusive and spend most of their time delaying and impeding actions and resolving internal, bureaucratic conflicts, not much helping typical citizens for the gross amounts of tax money sucked up by them. Never forget that about 25% of the money sent to DC stays in DC or with its assorted agencies, just to fund the G&A costs. Absurd, and heavily non-competitive with the private sector's lower costs. It is those many offices that demand abolition, but Obama wants them bigger, thus to exact more from the private sector, since his power and control over Americans thereby increases. And there, whether it's Obama or Geithner or any of the other obamanoids, lurks the danger.", 
        "intTime": 20090324, 
        "postID": 8, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it.", 
        "reply": " Too much of what guvmint is now supposed to do, it does poorly. Defense is not one of them; there is no better way to defend the nation. I, too, look back on time in the service and take great pride in what we accomplished. I remain doubtful that there are many more better examples of substantive, effective cultural change of large organizations as occurred for the Army (other branches, too, I expect) from 1974-1990. And the main reason it happened was effective leadership. Obviously, the funding from the Reagan buildup mattered. But the Army was changing for the better despite disastrous Jimmy Carter, who screwed its funding and turned the 101st into a NMC-rated division by '79, and that was in the midst of the Iranian hostage mess, when the 101st was part of the RDF. Those who contributed to winning the Cold War by being so good at their jobs that the scumbag communists refused to attack us can remain proud of that great accomplishment. Money alone would not have accomplished that; throwing money at problems never does solve the issues and can even impede improvement. The various federal agencies and offices that are extraneous, that would hardly be missed by the overwhelming majority of Americans if immediately abolished, may well be staffed by fine people. But the structural interactions and functions of too many of the federal agencies are excessively intrusive and spend most of their time delaying and impeding actions and resolving internal, bureaucratic conflicts, not much helping typical citizens for the gross amounts of tax money sucked up by them. Never forget that about 25% of the money sent to DC stays in DC or with its assorted agencies, just to fund the G&A costs. Absurd, and heavily non-competitive with the private sector's lower costs. It is those many offices that demand abolition, but Obama wants them bigger, thus to exact more from the private sector, since his power and control over Americans thereby increases. And there, whether it's Obama or Geithner or any of the other obamanoids, lurks the danger.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:07:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan. Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me.", 
        "intTime": 20090324, 
        "postID": 9, 
        "quote": "The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan.", 
        "reply": " Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:25:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order...", 
        "intTime": 20090324, 
        "postID": 10, 
        "quote": "", 
        "reply": "We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order...", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:30:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090324, 
        "postID": 11, 
        "quote": "Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop.", 
        "reply": " So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:45:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Lets see: War on Drugs = disaster War on Poverty = disaster War on Illiteracy = disaster Regulation of financial industry = disaster Regulation of food supplys = disaster Court system = disaster What does government do good, exactly?", 
        "intTime": 20090324, 
        "postID": 12, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS", 
        "reply": " Lets see: War on Drugs = disaster War on Poverty = disaster War on Illiteracy = disaster Regulation of financial industry = disaster Regulation of food supplys = disaster Court system = disaster What does government do good, exactly?", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:16:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by L0A1: quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. You are the only one talking about absolute power. I bet you hear voices too. The fact they are extending this to NON BANKING INSTITUTIONS creates a PRECIDENCE(sp). So don't belittle my comment because you do not have a valid counter point. This opens the door for the government to do exactly what I just said. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090324, 
        "postID": 13, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by L0A1: quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. You are the only one talking about absolute power. I bet you hear voices too.", 
        "reply": " The fact they are extending this to NON BANKING INSTITUTIONS creates a PRECIDENCE(sp). So don't belittle my comment because you do not have a valid counter point. This opens the door for the government to do exactly what I just said. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:24:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order... I'd just soon keep the government out of my house and pocket just the same, thank you anyway.", 
        "intTime": 20090324, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order...", 
        "reply": " I'd just soon keep the government out of my house and pocket just the same, thank you anyway.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:25:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise. Yeah, snooze it up while The One shreds the Constitution. If you're so stupid and/or ignorant that you can't see how blatantly unconstitutional and dangerous these new proposed powers for the Treasury Dept are, then you're quite simply beyond help.", 
        "intTime": 20090324, 
        "postID": 15, 
        "quote": "Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "reply": " Yeah, snooze it up while The One shreds the Constitution. If you're so stupid and/or ignorant that you can't see how blatantly unconstitutional and dangerous these new proposed powers for the Treasury Dept are, then you're quite simply beyond help.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:32:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder.", 
        "intTime": 20090324, 
        "postID": 16, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS", 
        "reply": " Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:35:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan. Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me. With or without \"due process\", this proposed seizure of private enterprises by B.O.'s emerging Politburo is not only utterly unconstitutional, but is anathema to the very principles and spirit of the founding of our Republic.", 
        "intTime": 20090324, 
        "postID": 17, 
        "quote": "Originally posted by I_M_Qwerty: quote: The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan. Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me.", 
        "reply": " With or without \"due process\", this proposed seizure of private enterprises by B.O.'s emerging Politburo is not only utterly unconstitutional, but is anathema to the very principles and spirit of the founding of our Republic.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:38:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder. gray Some comments on this board are just so stupid that they do not deserve a counter point. Three made such a comment and now you choose to defend it. Well good for you. Fight wars and deliver mail. Brilliant. What does the government do if Caterpillar starts to fail?", 
        "intTime": 20090324, 
        "postID": 18, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder. gray Some comments on this board are just so stupid that they do not deserve a counter point. Three made such a comment and now you choose to defend it. Well good for you. Fight wars and deliver mail. Brilliant.", 
        "reply": " What does the government do if Caterpillar starts to fail?", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:57:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "transport1"
    }, 
    {
        "content": "RICO - Organized Crime and money raised from drug sales and other illegal activities - nice analogy to use, makes it sound like you like the drug dealer or gang banger next door. FDIC - a banking insurance agency, comes in when a bank fails to guarantee deposits and keep the bank open, reorganize it, and start it \"on it's own\" Congress giving a branch of \"government\" with an appointed \"cabinet member\" the ability to seize all assets and monies of a private business - I just don't like it. As far as Cat - the reference was toward one of those companies that are \"too big to allow to fail\" because of the international consequences. I am not saying that Cat is ready or likely to fail.", 
        "intTime": 20090324, 
        "postID": 19, 
        "quote": "", 
        "reply": "RICO - Organized Crime and money raised from drug sales and other illegal activities - nice analogy to use, makes it sound like you like the drug dealer or gang banger next door. FDIC - a banking insurance agency, comes in when a bank fails to guarantee deposits and keep the bank open, reorganize it, and start it \"on it's own\" Congress giving a branch of \"government\" with an appointed \"cabinet member\" the ability to seize all assets and monies of a private business - I just don't like it. As far as Cat - the reference was toward one of those companies that are \"too big to allow to fail\" because of the international consequences. I am not saying that Cat is ready or likely to fail.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 14:20:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: U.S. Seeks Expanded Power to Seize Firms Goal Is to Limit Risk to Broader Economy By Binyamin Appelbaum and David Cho Washington Post Staff Writers Tuesday, March 24, 2009 The Obama administration is considering asking Congress to give the Treasury secretary unprecedented powers to initiate the seizure of non-bank financial companies, such as large insurers, investment firms and hedge funds, whose collapse would damage the broader economy, according to an administration document. The government at present has the authority to seize only banks. Giving the Treasury secretary authority over a broader range of companies would mark a significant shift from the existing model of financial regulation, which relies on independent agencies that are shielded from the political process. The Treasury secretary, a member of the president's Cabinet, would exercise the new powers in consultation with the White House, the Federal Reserve and other regulators, according to the document. The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. <much more> \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/23/AR2009032302830_pf.html\"", 
        "intTime": 20090324, 
        "postID": 20, 
        "quote": "U.S. Seeks Expanded Power to Seize Firms Goal Is to Limit Risk to Broader Economy By Binyamin Appelbaum and David Cho Washington Post Staff Writers Tuesday, March 24, 2009 The Obama administration is considering asking Congress to give the Treasury secretary unprecedented powers to initiate the seizure of non-bank financial companies, such as large insurers, investment firms and hedge funds, whose collapse would damage the broader economy, according to an administration document. The government at present has the authority to seize only banks. Giving the Treasury secretary authority over a broader range of companies would mark a significant shift from the existing model of financial regulation, which relies on independent agencies that are shielded from the political process. The Treasury secretary, a member of the president's Cabinet, would exercise the new powers in consultation with the White House, the Federal Reserve and other regulators, according to the document. The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. <much more> \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/23/AR2009032302830_pf.html\"", 
        "reply": "", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 06:50:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "intTime": 20090324, 
        "postID": 21, 
        "quote": "The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux.", 
        "reply": " Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:11:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "intTime": 20090324, 
        "postID": 22, 
        "quote": "Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "reply": "", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:22:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. What needs to stop is the rank hypocrisy. If Bush had flouted this little nightmare, you'd be the first to denounce it. The bottom line is government does almost nothing well..nothing. And now you want them run everything? You've got to be kidding. On top of that you want to use ONE instance of failure to justify tearing the entire system down, ignore decades of history, and implant some new world order..and why? Cowardice. People are afraid of everything, afraid to take chances, to stand up for what right, afraid to be free. Being free means having the freedom to make mistakes. It does not mean the Fed is your big brother and will take care of you all the time.", 
        "intTime": 20090324, 
        "postID": 23, 
        "quote": "Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop.", 
        "reply": " What needs to stop is the rank hypocrisy. If Bush had flouted this little nightmare, you'd be the first to denounce it. The bottom line is government does almost nothing well..nothing. And now you want them run everything? You've got to be kidding. On top of that you want to use ONE instance of failure to justify tearing the entire system down, ignore decades of history, and implant some new world order..and why? Cowardice. People are afraid of everything, afraid to take chances, to stand up for what right, afraid to be free. Being free means having the freedom to make mistakes. It does not mean the Fed is your big brother and will take care of you all the time.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:40:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it.", 
        "intTime": 20090324, 
        "postID": 24, 
        "quote": "Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark.", 
        "reply": " what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:50:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: dmuhler: The point is we have to keep our eye on all of this crap or one day you will wake up and it will be gone. That's right! We need to keep our eyes on the lib/socialist's efforts to redistribute poverty or one day we will find all private wealth gone. We will all be equally poor except for the socialist cadre.", 
        "intTime": 20090324, 
        "postID": 25, 
        "quote": "dmuhler: The point is we have to keep our eye on all of this crap or one day you will wake up and it will be gone.", 
        "reply": " That's right! We need to keep our eyes on the lib/socialist's efforts to redistribute poverty or one day we will find all private wealth gone. We will all be equally poor except for the socialist cadre.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:54:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail.", 
        "intTime": 20090324, 
        "postID": 26, 
        "quote": "Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark.", 
        "reply": " The only thing the government has ever done well is fight wars and send mail.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 07:54:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it. Too much of what guvmint is now supposed to do, it does poorly. Defense is not one of them; there is no better way to defend the nation. I, too, look back on time in the service and take great pride in what we accomplished. I remain doubtful that there are many more better examples of substantive, effective cultural change of large organizations as occurred for the Army (other branches, too, I expect) from 1974-1990. And the main reason it happened was effective leadership. Obviously, the funding from the Reagan buildup mattered. But the Army was changing for the better despite disastrous Jimmy Carter, who screwed its funding and turned the 101st into a NMC-rated division by '79, and that was in the midst of the Iranian hostage mess, when the 101st was part of the RDF. Those who contributed to winning the Cold War by being so good at their jobs that the scumbag communists refused to attack us can remain proud of that great accomplishment. Money alone would not have accomplished that; throwing money at problems never does solve the issues and can even impede improvement. The various federal agencies and offices that are extraneous, that would hardly be missed by the overwhelming majority of Americans if immediately abolished, may well be staffed by fine people. But the structural interactions and functions of too many of the federal agencies are excessively intrusive and spend most of their time delaying and impeding actions and resolving internal, bureaucratic conflicts, not much helping typical citizens for the gross amounts of tax money sucked up by them. Never forget that about 25% of the money sent to DC stays in DC or with its assorted agencies, just to fund the G&A costs. Absurd, and heavily non-competitive with the private sector's lower costs. It is those many offices that demand abolition, but Obama wants them bigger, thus to exact more from the private sector, since his power and control over Americans thereby increases. And there, whether it's Obama or Geithner or any of the other obamanoids, lurks the danger.", 
        "intTime": 20090324, 
        "postID": 27, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. what a surprise It's true. See the almost nothing. I would suggest that the only thing the govt hasn't f'd up is the military we dont have b-crats running it.", 
        "reply": " Too much of what guvmint is now supposed to do, it does poorly. Defense is not one of them; there is no better way to defend the nation. I, too, look back on time in the service and take great pride in what we accomplished. I remain doubtful that there are many more better examples of substantive, effective cultural change of large organizations as occurred for the Army (other branches, too, I expect) from 1974-1990. And the main reason it happened was effective leadership. Obviously, the funding from the Reagan buildup mattered. But the Army was changing for the better despite disastrous Jimmy Carter, who screwed its funding and turned the 101st into a NMC-rated division by '79, and that was in the midst of the Iranian hostage mess, when the 101st was part of the RDF. Those who contributed to winning the Cold War by being so good at their jobs that the scumbag communists refused to attack us can remain proud of that great accomplishment. Money alone would not have accomplished that; throwing money at problems never does solve the issues and can even impede improvement. The various federal agencies and offices that are extraneous, that would hardly be missed by the overwhelming majority of Americans if immediately abolished, may well be staffed by fine people. But the structural interactions and functions of too many of the federal agencies are excessively intrusive and spend most of their time delaying and impeding actions and resolving internal, bureaucratic conflicts, not much helping typical citizens for the gross amounts of tax money sucked up by them. Never forget that about 25% of the money sent to DC stays in DC or with its assorted agencies, just to fund the G&A costs. Absurd, and heavily non-competitive with the private sector's lower costs. It is those many offices that demand abolition, but Obama wants them bigger, thus to exact more from the private sector, since his power and control over Americans thereby increases. And there, whether it's Obama or Geithner or any of the other obamanoids, lurks the danger.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:07:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan. Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me.", 
        "intTime": 20090324, 
        "postID": 28, 
        "quote": "The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan.", 
        "reply": " Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:25:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order...", 
        "intTime": 20090324, 
        "postID": 29, 
        "quote": "", 
        "reply": "We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order...", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:30:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090324, 
        "postID": 30, 
        "quote": "Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop.", 
        "reply": " So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 08:45:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Lets see: War on Drugs = disaster War on Poverty = disaster War on Illiteracy = disaster Regulation of financial industry = disaster Regulation of food supplys = disaster Court system = disaster What does government do good, exactly?", 
        "intTime": 20090324, 
        "postID": 31, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS", 
        "reply": " Lets see: War on Drugs = disaster War on Poverty = disaster War on Illiteracy = disaster Regulation of financial industry = disaster Regulation of food supplys = disaster Court system = disaster What does government do good, exactly?", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:16:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by L0A1: quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. You are the only one talking about absolute power. I bet you hear voices too. The fact they are extending this to NON BANKING INSTITUTIONS creates a PRECIDENCE(sp). So don't belittle my comment because you do not have a valid counter point. This opens the door for the government to do exactly what I just said. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090324, 
        "postID": 32, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by L0A1: quote: Originally posted by dmuhler: I see no problem with what he is asking. If Congress doesn't want to approve his request, then they need to at least force AIG and/or similar organizations to stop offering unregulated products and services to the banking industry. This unregulated gambling needs to stop. So you will be ok with this when the Republicans take power again? I highly doubt that. I don't think ANY government or party should have absolute power. You are the only one talking about absolute power. I bet you hear voices too.", 
        "reply": " The fact they are extending this to NON BANKING INSTITUTIONS creates a PRECIDENCE(sp). So don't belittle my comment because you do not have a valid counter point. This opens the door for the government to do exactly what I just said. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:24:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order... I'd just soon keep the government out of my house and pocket just the same, thank you anyway.", 
        "intTime": 20090324, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: We are in uncharted waters. Private institutions have the power, or negligence to ruin an entire global economic structure. This clearly defined risk demands a swift response from not only the US govenment but world governments everywhere. We would not let a terrorist group set up shop in South America, and we shouldn't let financial institutions have free reign anymore... They are too dangerous to our well being when they act recklessly, so we(the government) will keep their house in order...", 
        "reply": " I'd just soon keep the government out of my house and pocket just the same, thank you anyway.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:25:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise. Yeah, snooze it up while The One shreds the Constitution. If you're so stupid and/or ignorant that you can't see how blatantly unconstitutional and dangerous these new proposed powers for the Treasury Dept are, then you're quite simply beyond help.", 
        "intTime": 20090324, 
        "postID": 34, 
        "quote": "Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: The administration plans to send legislation to Capitol Hill this week. Sources cautioned that the details, including the Treasury's role, are still in flux. Details? Why start something new like details. You think they might even read it? Govt Seizure, Well surprise surprise.", 
        "reply": " Yeah, snooze it up while The One shreds the Constitution. If you're so stupid and/or ignorant that you can't see how blatantly unconstitutional and dangerous these new proposed powers for the Treasury Dept are, then you're quite simply beyond help.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:32:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder.", 
        "intTime": 20090324, 
        "postID": 35, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS", 
        "reply": " Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:35:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan. Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me. With or without \"due process\", this proposed seizure of private enterprises by B.O.'s emerging Politburo is not only utterly unconstitutional, but is anathema to the very principles and spirit of the founding of our Republic.", 
        "intTime": 20090324, 
        "postID": 36, 
        "quote": "Originally posted by I_M_Qwerty: quote: The Treasury secretary could act only after consulting with the president and getting a recommendation from two-thirds of the Federal Reserve Board, according to the plan. Seems to me that somewhere in this \"government seizure\" business should be a panel of judges ... maybe something along the lines of the FISA Court. Seizure without some form of due process seems a bit unconstitutional to me.", 
        "reply": " With or without \"due process\", this proposed seizure of private enterprises by B.O.'s emerging Politburo is not only utterly unconstitutional, but is anathema to the very principles and spirit of the founding of our Republic.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:38:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder. gray Some comments on this board are just so stupid that they do not deserve a counter point. Three made such a comment and now you choose to defend it. Well good for you. Fight wars and deliver mail. Brilliant. What does the government do if Caterpillar starts to fail?", 
        "intTime": 20090324, 
        "postID": 37, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by threerings: quote: Originally posted by dmuhler: quote: The bottom line is government does almost nothing well..nothing. After having spent 20 years in the military, you have no idea how much I resent that remark. The only thing the government has ever done well is fight wars and send mail. BS Ah, what a brilliant counter-point, uhler. You're nothing but a rank partisan, and since it's The One pulling this blatantly unconstitutional socialist bull$hit, you support it. Had GW Bush tried this, you'd be screaming bloody murder. gray Some comments on this board are just so stupid that they do not deserve a counter point. Three made such a comment and now you choose to defend it. Well good for you. Fight wars and deliver mail. Brilliant.", 
        "reply": " What does the government do if Caterpillar starts to fail?", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 13:57:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "transport1"
    }, 
    {
        "content": "RICO - Organized Crime and money raised from drug sales and other illegal activities - nice analogy to use, makes it sound like you like the drug dealer or gang banger next door. FDIC - a banking insurance agency, comes in when a bank fails to guarantee deposits and keep the bank open, reorganize it, and start it \"on it's own\" Congress giving a branch of \"government\" with an appointed \"cabinet member\" the ability to seize all assets and monies of a private business - I just don't like it. As far as Cat - the reference was toward one of those companies that are \"too big to allow to fail\" because of the international consequences. I am not saying that Cat is ready or likely to fail.", 
        "intTime": 20090324, 
        "postID": 38, 
        "quote": "", 
        "reply": "RICO - Organized Crime and money raised from drug sales and other illegal activities - nice analogy to use, makes it sound like you like the drug dealer or gang banger next door. FDIC - a banking insurance agency, comes in when a bank fails to guarantee deposits and keep the bank open, reorganize it, and start it \"on it's own\" Congress giving a branch of \"government\" with an appointed \"cabinet member\" the ability to seize all assets and monies of a private business - I just don't like it. As far as Cat - the reference was toward one of those companies that are \"too big to allow to fail\" because of the international consequences. I am not saying that Cat is ready or likely to fail.", 
        "threadID": "409192893_4000047812001", 
        "time": "2009-03-24 14:20:00", 
        "title": "Obama to Seek New Seizure Power for SECTREAS", 
        "userID": "transport1"
    }
]