[
    {
        "content": "Mission accomplished there, Mr. Obama--you can't shock me, but you've certainly awed me. The problem with that, however, is that I don't think I was your target--not for that volley, anyway. OK, I get the part where you're the Head FNG in Charge and you're still feeling your way around. You're on The Big Bike now, and it's not unreasonable to think that you might benefit from some training wheels. But since when does anyone mistake JATO rockets for training wheels? In the last week, Mr. Obama, you've \"reached out\" to the British and the Russians. I think it's safe to say you've made an impression. I'm just not sure it's the impression I think you wanted to make. I could be wrong here, but if I'm right whatever stimulus money I get will be going to whoever sells the cheapest popskull vodka. Granted, Gordon Brown isn't the sharpest knife in the drawer--he's more like a plastic spork. He's Flounder--the legacy kid no other college would have touched with a rival's ten-foot pole. But for better or worse he IS the Prime Minister of the United Kingdom. Sure, we fought a revolution against them and had pretty spotty relations with them throughout the 19th Century, but since WWI they've been possibly our staunchest ally. They have soldiers taking fire alongside our soldiers in Afganistan. The Brits call us \"The Cousins\", but we're closer than that, and we are tied by more than just blood and language. Mr. Brown gave you a very thoughtful and original gift; you gave him a prepackaged set of DVDs that some flunky must have grabbed at a 24-hour Walmart at midnight. Your wife gave his kids models of Marine One that were probably bought from the White House gift shop five minutes before they arrived--at a discount, of course. Pretty fiscally responsible of you there, Mr. Big Spender. Now can you say \"false economy\"? Can you wrap your head around that concept? Get to work--you've got four years, and be grateful that the British tend to be forgiving of us and our foibles. The Russians? Not so much, but they at least do appreciate a good joke--I just don't think they got the joke you wanted to tell. So you want to \"reset\" relations with Russia. You want them to help us contain the Iranians, never mind that without the Russians they would,'t have gotten past \"Oh, so THAT'S an atom!\" after Ahm-a-DinnerJacket watched one of his plastic key kids explode on top of an Iraqi mine? Well, Mr. Obama, here's how you DON'T do it. You DON'T send the Secretary of State to Russia bearing a gift of a red button. I might be a Cold War relic, but the imagery of that is just totally wrong. But if you have to try something that sophomoric, please at least get the language right. The Democrats like to riff on Bush's malapropisms and mispronunciations, but the people laughing at him in response were at least nominally Americans. It's a different matter when the people laughing at us for the same reasons are foreigners, and even more so when it's the Russians. We've been dealing seriously with the Russians for almost a century if not longer, and they've been conditional allies at best. We don't get do-overs from them, nor do we get an E for effort. You don't start negotiations with the Russians with a bad joke, and you most certainly don't do it with a mistranslated one. And you don't make that gambit with someone who doesn't even speak the language. The Russians have a very robust and earthy sense of humor, but it can also be quite sophisticated. If your goal was to make the Russians laugh, Mr. Obama, you succeeded--I just hope you don't mind having been the punchline of your own joke. Something tells me that's not the case, which means you've managed to signal Moscow that as long as they treat you with a modicum of dignity (I don't think the Russians will be sending any Tar Babies to Foggy Bottom) you won't get in their way and they can do as they please. As for your Gaza bailout, that just completely blew me away. If you, Mr. Obama, honestly think that money won't end up in Hamas pockets then I honestly have to think you're a completely clueless tool. But that doesn't matter, since that's what you think I am. I've lived in Illinois, so I've had a front-seat view of the political circus there. I left the state before Obama was anything significant, but I can see that he was an apt pupil of Chicago-style politics. What he failed to learn is that Chicago's borders end at Indianapolis. As for the rest of the world, There Be Dragons There, and those dragons will not be bought off by ill-translated gag gifts and DVDs proffered by some novice. I'm not shocked but I am awed by the sheer thoughtlessness of Mr. Obama. Perhaps he will make sense to me after a few shots of cheap rotgut vodka. I'm in a '70s sort of Soviet mood anyway....", 
        "intTime": 20090308, 
        "postID": 1, 
        "quote": "", 
        "reply": "Mission accomplished there, Mr. Obama--you can't shock me, but you've certainly awed me. The problem with that, however, is that I don't think I was your target--not for that volley, anyway. OK, I get the part where you're the Head FNG in Charge and you're still feeling your way around. You're on The Big Bike now, and it's not unreasonable to think that you might benefit from some training wheels. But since when does anyone mistake JATO rockets for training wheels? In the last week, Mr. Obama, you've \"reached out\" to the British and the Russians. I think it's safe to say you've made an impression. I'm just not sure it's the impression I think you wanted to make. I could be wrong here, but if I'm right whatever stimulus money I get will be going to whoever sells the cheapest popskull vodka. Granted, Gordon Brown isn't the sharpest knife in the drawer--he's more like a plastic spork. He's Flounder--the legacy kid no other college would have touched with a rival's ten-foot pole. But for better or worse he IS the Prime Minister of the United Kingdom. Sure, we fought a revolution against them and had pretty spotty relations with them throughout the 19th Century, but since WWI they've been possibly our staunchest ally. They have soldiers taking fire alongside our soldiers in Afganistan. The Brits call us \"The Cousins\", but we're closer than that, and we are tied by more than just blood and language. Mr. Brown gave you a very thoughtful and original gift; you gave him a prepackaged set of DVDs that some flunky must have grabbed at a 24-hour Walmart at midnight. Your wife gave his kids models of Marine One that were probably bought from the White House gift shop five minutes before they arrived--at a discount, of course. Pretty fiscally responsible of you there, Mr. Big Spender. Now can you say \"false economy\"? Can you wrap your head around that concept? Get to work--you've got four years, and be grateful that the British tend to be forgiving of us and our foibles. The Russians? Not so much, but they at least do appreciate a good joke--I just don't think they got the joke you wanted to tell. So you want to \"reset\" relations with Russia. You want them to help us contain the Iranians, never mind that without the Russians they would,'t have gotten past \"Oh, so THAT'S an atom!\" after Ahm-a-DinnerJacket watched one of his plastic key kids explode on top of an Iraqi mine? Well, Mr. Obama, here's how you DON'T do it. You DON'T send the Secretary of State to Russia bearing a gift of a red button. I might be a Cold War relic, but the imagery of that is just totally wrong. But if you have to try something that sophomoric, please at least get the language right. The Democrats like to riff on Bush's malapropisms and mispronunciations, but the people laughing at him in response were at least nominally Americans. It's a different matter when the people laughing at us for the same reasons are foreigners, and even more so when it's the Russians. We've been dealing seriously with the Russians for almost a century if not longer, and they've been conditional allies at best. We don't get do-overs from them, nor do we get an E for effort. You don't start negotiations with the Russians with a bad joke, and you most certainly don't do it with a mistranslated one. And you don't make that gambit with someone who doesn't even speak the language. The Russians have a very robust and earthy sense of humor, but it can also be quite sophisticated. If your goal was to make the Russians laugh, Mr. Obama, you succeeded--I just hope you don't mind having been the punchline of your own joke. Something tells me that's not the case, which means you've managed to signal Moscow that as long as they treat you with a modicum of dignity (I don't think the Russians will be sending any Tar Babies to Foggy Bottom) you won't get in their way and they can do as they please. As for your Gaza bailout, that just completely blew me away. If you, Mr. Obama, honestly think that money won't end up in Hamas pockets then I honestly have to think you're a completely clueless tool. But that doesn't matter, since that's what you think I am. I've lived in Illinois, so I've had a front-seat view of the political circus there. I left the state before Obama was anything significant, but I can see that he was an apt pupil of Chicago-style politics. What he failed to learn is that Chicago's borders end at Indianapolis. As for the rest of the world, There Be Dragons There, and those dragons will not be bought off by ill-translated gag gifts and DVDs proffered by some novice. I'm not shocked but I am awed by the sheer thoughtlessness of Mr. Obama. Perhaps he will make sense to me after a few shots of cheap rotgut vodka. I'm in a '70s sort of Soviet mood anyway....", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-08 13:58:00", 
        "title": "Shock and Awe....", 
        "userID": "ipw533"
    }, 
    {
        "content": "Sounds good to me...Get a job at the state department...change the world...99.9% of the country just does not seem to pass thru this tiny portal P/CP.", 
        "intTime": 20090308, 
        "postID": 2, 
        "quote": "", 
        "reply": "Sounds good to me...Get a job at the state department...change the world...99.9% of the country just does not seem to pass thru this tiny portal P/CP.", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-08 14:07:00", 
        "title": "Shock and Awe....", 
        "userID": "scottrj50"
    }, 
    {
        "content": "Y'know, Scott, I once thought about working at the State Department, but that was before the Wall came down. I'd have joined as a Russian specialist, but now any cabdriver in Philadelphia knows more about conditions in Russia than I do. I thought about the CIA but got turned off by the politics. I may still jump to the fed side of the house, but now I'm looking at the VA--at least I'll be working with my own kind....", 
        "intTime": 20090308, 
        "postID": 3, 
        "quote": "", 
        "reply": "Y'know, Scott, I once thought about working at the State Department, but that was before the Wall came down. I'd have joined as a Russian specialist, but now any cabdriver in Philadelphia knows more about conditions in Russia than I do. I thought about the CIA but got turned off by the politics. I may still jump to the fed side of the house, but now I'm looking at the VA--at least I'll be working with my own kind....", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-08 14:15:00", 
        "title": "Shock and Awe....", 
        "userID": "ipw533"
    }, 
    {
        "content": "ipw533, a magnificent post!", 
        "intTime": 20090308, 
        "postID": 4, 
        "quote": "", 
        "reply": "ipw533, a magnificent post!", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-08 18:16:00", 
        "title": "Shock and Awe....", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Granted, Gordon Brown isn't the sharpest knife in the drawer--he's more like a plastic spork. He's Flounder--the legacy kid no other college would have touched with a rival's ten-foot pole. But for better or worse he IS the Prime Minister of the United Kingdom Hardly. Looks can be deceptive. He qualified for Edinburgh University at age 16 and gained a First Class Honours M.A. in History followed by a Ph.D. the next year. He was elected Rector of the University and Chairman of the University Court. Edinburgh is ranked no 4 out of 120 universities in the UK, with an international reputation. Presumably only the likes of Oxford and Cambridge come higher. He may appear the dour Scot, but he's anything but dull between the ears. And I don't even like the man !!! It taks a long spoon tae sup wi' a Fifer !!!", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "Granted, Gordon Brown isn't the sharpest knife in the drawer--he's more like a plastic spork. He's Flounder--the legacy kid no other college would have touched with a rival's ten-foot pole. But for better or worse he IS the Prime Minister of the United Kingdom", 
        "reply": " Hardly. Looks can be deceptive. He qualified for Edinburgh University at age 16 and gained a First Class Honours M.A. in History followed by a Ph.D. the next year. He was elected Rector of the University and Chairman of the University Court. Edinburgh is ranked no 4 out of 120 universities in the UK, with an international reputation. Presumably only the likes of Oxford and Cambridge come higher. He may appear the dour Scot, but he's anything but dull between the ears. And I don't even like the man !!! It taks a long spoon tae sup wi' a Fifer !!!", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 02:06:00", 
        "title": "Shock and Awe....", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come!", 
        "intTime": 20090309, 
        "postID": 6, 
        "quote": "", 
        "reply": "yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come!", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 02:25:00", 
        "title": "Shock and Awe....", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come! The only criticism of the gift I have seen was not in the gift, but in the translation. They mistranslated \"reset\" to a word that means \"overloaded\" or \"overcharged\". Kind of ironic actually...", 
        "intTime": 20090309, 
        "postID": 7, 
        "quote": "Originally posted by karlhungusjr: yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come!", 
        "reply": " The only criticism of the gift I have seen was not in the gift, but in the translation. They mistranslated \"reset\" to a word that means \"overloaded\" or \"overcharged\". Kind of ironic actually...", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 05:48:00", 
        "title": "Shock and Awe....", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by karlhungusjr: yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come! The only criticism of the gift I have seen was not in the gift, but in the translation. They mistranslated \"reset\" to a word that means \"overloaded\" or \"overcharged\". Kind of ironic moronic actually... Corrected for accuracy.", 
        "intTime": 20090309, 
        "postID": 8, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by karlhungusjr: yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come! The only criticism of the gift I have seen was not in the gift, but in the translation. They mistranslated \"reset\" to a word that means \"overloaded\" or \"overcharged\". Kind of ironic moronic actually...", 
        "reply": " Corrected for accuracy.", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 05:55:00", 
        "title": "Shock and Awe....", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Seems that the \"unintentional mistake\" is the theme of the Obama administration.", 
        "intTime": 20090309, 
        "postID": 9, 
        "quote": "", 
        "reply": "Seems that the \"unintentional mistake\" is the theme of the Obama administration.", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 05:55:00", 
        "title": "Shock and Awe....", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: quote: Originally posted by karlhungusjr: yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come! The only criticism of the gift I have seen was not in the gift, but in the translation. They mistranslated \"reset\" to a word that means \"overloaded\" or \"overcharged\". Kind of ironic moronic actually... Corrected for accuracy. It was that too. You would think that the State Department would be able to have something translated accurately. It was ironic AND stupid.", 
        "intTime": 20090309, 
        "postID": 10, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: quote: Originally posted by karlhungusjr: yeah. i totally hate obama now. i mean come on! the man can't pick a gift correctly! GOP here I come! The only criticism of the gift I have seen was not in the gift, but in the translation. They mistranslated \"reset\" to a word that means \"overloaded\" or \"overcharged\". Kind of ironic moronic actually... Corrected for accuracy.", 
        "reply": " It was that too. You would think that the State Department would be able to have something translated accurately. It was ironic AND stupid.", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 05:59:00", 
        "title": "Shock and Awe....", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Seems that the \"unintentional mistake\" is the theme of the Obama administration. True, and it's already beginning to wear a little thin. He'll be only be able to play the \"hey, we're just getting started\" or \"we enherited this\" for just so long before people get tired of the bull and want real results.", 
        "intTime": 20090309, 
        "postID": 11, 
        "quote": "Originally posted by bill_kananen: Seems that the \"unintentional mistake\" is the theme of the Obama administration.", 
        "reply": " True, and it's already beginning to wear a little thin. He'll be only be able to play the \"hey, we're just getting started\" or \"we enherited this\" for just so long before people get tired of the bull and want real results.", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 05:59:00", 
        "title": "Shock and Awe....", 
        "userID": "adminnco1"
    }, 
    {
        "content": "I think the problem runs deeper than that, and I think it's going to get us in real trouble. I personally like the Russians and have met very few that I would dislike, but as a country Russia has interests which conflict with ours, and they will pursue those interests to our peril. As I said earlier, I'm not that concerned about our snub to the British out of faith that they will forgive us. I think otherwise about the Russians. They are not our allies. At present they are competeters who could once again become enemies, and I lived through a time when they were just that. They haven't changed; only our perception of them has, and that perception shift can best be described as either narrcisistic or myopic; such a vision coupled with a leader who can't see beyond his own adulation is a recipe for disaster....", 
        "intTime": 20090309, 
        "postID": 12, 
        "quote": "", 
        "reply": "I think the problem runs deeper than that, and I think it's going to get us in real trouble. I personally like the Russians and have met very few that I would dislike, but as a country Russia has interests which conflict with ours, and they will pursue those interests to our peril. As I said earlier, I'm not that concerned about our snub to the British out of faith that they will forgive us. I think otherwise about the Russians. They are not our allies. At present they are competeters who could once again become enemies, and I lived through a time when they were just that. They haven't changed; only our perception of them has, and that perception shift can best be described as either narrcisistic or myopic; such a vision coupled with a leader who can't see beyond his own adulation is a recipe for disaster....", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 07:31:00", 
        "title": "Shock and Awe....", 
        "userID": "ipw533"
    }, 
    {
        "content": "Funny story that gives one an idea of the Russian sense of humor. During the SALT II talks of the Carter Administration Andrei Gromyko was the lead Soviet negotiator--he was not a man known for being humorous; his informal nickname was \"Grim Grom\". During a break in the talks a junior White House staffer was curious about a button on the table and pressed it--it made a loud warning noise. The button was an electronic gavel meant to regulate debate during the meetings, but the staffer's curiosity set the Russians off. Gromyko acted like he was about to have a stroke, and one of his juniors began yelling, \"Get Mr. Brezhinski!! Get him now and tell him this was a mistake!! IT WAS A MISTAKE!!!!\" Afterwards I'm pretty sure it took the Russians a few hours to stop laughing....", 
        "intTime": 20090309, 
        "postID": 13, 
        "quote": "", 
        "reply": "Funny story that gives one an idea of the Russian sense of humor. During the SALT II talks of the Carter Administration Andrei Gromyko was the lead Soviet negotiator--he was not a man known for being humorous; his informal nickname was \"Grim Grom\". During a break in the talks a junior White House staffer was curious about a button on the table and pressed it--it made a loud warning noise. The button was an electronic gavel meant to regulate debate during the meetings, but the staffer's curiosity set the Russians off. Gromyko acted like he was about to have a stroke, and one of his juniors began yelling, \"Get Mr. Brezhinski!! Get him now and tell him this was a mistake!! IT WAS A MISTAKE!!!!\" Afterwards I'm pretty sure it took the Russians a few hours to stop laughing....", 
        "threadID": "409192893_2020082712001", 
        "time": "2009-03-09 16:23:00", 
        "title": "Shock and Awe....", 
        "userID": "ipw533"
    }
]