[
    {
        "content": "- the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" quote: CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?", 
        "intTime": 20090519, 
        "postID": 1, 
        "quote": "CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn", 
        "reply": "- the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\"  A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 20:50:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "intTime": 20090519, 
        "postID": 2, 
        "quote": "", 
        "reply": "I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 21:01:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "intTime": 20090519, 
        "postID": 3, 
        "quote": "Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "reply": " I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 21:32:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "intTime": 20090519, 
        "postID": 4, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "reply": " So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 22:02:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do? I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? It's your choice - not mine. If there are consequences, the consequences are yours, not mine.", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "Originally posted by Tangler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "reply": " I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? It's your choice - not mine. If there are consequences, the consequences are yours, not mine.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 05:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do? Thanks for TRYING to start up some bull with this comment. Roe vs wade...what period of birth is that referring to? There is your answer. Who wants partial birth abortion to go on vs a couple of weeks into the pregnancy. To most people there is a huge huge difference. Go look at a garbage bag full of partial birth aborted babies and a jar of roe vs wade fetuses. Duh... So no it is not a contradiction. It is a common knee jerk reaction.", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "reply": " Thanks for TRYING to start up some bull with this comment. Roe vs wade...what period of birth is that referring to? There is your answer. Who wants partial birth abortion to go on vs a couple of weeks into the pregnancy. To most people there is a huge huge difference. Go look at a garbage bag full of partial birth aborted babies and a jar of roe vs wade fetuses. Duh... So no it is not a contradiction. It is a common knee jerk reaction.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:02:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: - the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" quote: CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions? The VAST majority of people in this country (even those that support legal abortions) have ALWAYS prefered to reduce the number of abortions. I think what is changing is that many of the younger leaders in the so called \"pro-life\" movement have stopped treating it as an absolute that to be \"pro-life\" you have to support outlawing ALL or almost all abortions and started supporting the non-criminal law methods you mentioned.", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "Originally posted by Fightdirector: - the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" quote: CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?", 
        "reply": " The VAST majority of people in this country (even those that support legal abortions) have ALWAYS prefered to reduce the number of abortions. I think what is changing is that many of the younger leaders in the so called \"pro-life\" movement have stopped treating it as an absolute that to be \"pro-life\" you have to support outlawing ALL or almost all abortions and started supporting the non-criminal law methods you mentioned.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:13:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. Always? * Even if carrying the baby to term will cause health problems for the mother? * Even if the baby can not survive, for example born with only a brain stem?", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "reply": " Always? * Even if carrying the baby to term will cause health problems for the mother? * Even if the baby can not survive, for example born with only a brain stem?", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:17:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "rayld2"
    }, 
    {
        "content": "I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "", 
        "reply": "I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:23:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex. When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life.", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "Originally posted by QuanticoBornMarine: I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex.", 
        "reply": " When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 07:38:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it.", 
        "intTime": 20090520, 
        "postID": 11, 
        "quote": "Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death?", 
        "reply": " The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 07:44:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "RRR52"
    }, 
    {
        "content": "I should have been more clear: If there is a legitimate medical reason for the abortion in those advanced stages of life then okay.. Absolutely no abortions in the 2nd and 3rd trimester if it is not a medical emergency...", 
        "intTime": 20090520, 
        "postID": 12, 
        "quote": "", 
        "reply": "I should have been more clear: If there is a legitimate medical reason for the abortion in those advanced stages of life then okay.. Absolutely no abortions in the 2nd and 3rd trimester if it is not a medical emergency...", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 08:13:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "", 
        "reply": "Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 10:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! Actually that was at the Mount of Olives, but no biggie. More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "reply": " Actually that was at the Mount of Olives, but no biggie. More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 13:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life. There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 15, 
        "quote": "Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life.", 
        "reply": " There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 13:24:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: quote: Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life. There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all. But you are agitating for the state to force a woman to carry to term.", 
        "intTime": 20090520, 
        "postID": 16, 
        "quote": "Originally posted by QuanticoBornMarine: quote: Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life. There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all.", 
        "reply": " But you are agitating for the state to force a woman to carry to term.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 15:23:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force.", 
        "intTime": 20090520, 
        "postID": 17, 
        "quote": "Originally posted by QuanticoBornMarine: quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\"", 
        "reply": " More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 18:29:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Tangler"
    }, 
    {
        "content": "My older brother was the first one to point out to me that the power of prayer has shifted the stance on \"life itself.\" I want to believe that. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090520, 
        "postID": 18, 
        "quote": "", 
        "reply": "My older brother was the first one to point out to me that the power of prayer has shifted the stance on \"life itself.\" I want to believe that. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 19:15:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God...", 
        "intTime": 20090520, 
        "postID": 19, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it.", 
        "reply": " So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God...", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 21:01:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force. You are correct on point number one. My bust. He had just returned to the temple from the Mount of Olives. You are incorrect on point number two. Demonstrate to me ANYWHERE that I have forced or attempted to force something upon another, unless you are saying that I should not be able to vote or speak on my beliefs or speak on my beliefs. That would be very unconstitutional of you. I state my beliefs. If my beliefs offend, then so be it, but offending and coercing are very different. I am not ashamed or embarrassed by my beliefs, so I will continue to share them. I don't know your political or moral leaning Tangler, but I have found, over the years, that most \"liberals\" simply refuse to accept that someone else can hold a viewpoint that might offend another. They get so wrapped up in \"tolerance\" that they become intolerant of anyone they deem intolerant. They tend to allow their emotions to override their logic, and they tend to make exaggerated statements such as the one you made. I don't believe that all \"liberals\" fall into lockstep with Peter Singer or George Tiller, so I don't make those kind of exaggerated claims. Christ stated clearly that the Gospel offends, and that Christians will be hated for His sake. So I don't expect much out of people these days. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090521, 
        "postID": 20, 
        "quote": "Originally posted by Tangler: quote: Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force.", 
        "reply": " You are correct on point number one. My bust. He had just returned to the temple from the Mount of Olives. You are incorrect on point number two. Demonstrate to me ANYWHERE that I have forced or attempted to force something upon another, unless you are saying that I should not be able to vote or speak on my beliefs or speak on my beliefs. That would be very unconstitutional of you. I state my beliefs. If my beliefs offend, then so be it, but offending and coercing are very different. I am not ashamed or embarrassed by my beliefs, so I will continue to share them. I don't know your political or moral leaning Tangler, but I have found, over the years, that most \"liberals\" simply refuse to accept that someone else can hold a viewpoint that might offend another. They get so wrapped up in \"tolerance\" that they become intolerant of anyone they deem intolerant. They tend to allow their emotions to override their logic, and they tend to make exaggerated statements such as the one you made. I don't believe that all \"liberals\" fall into lockstep with Peter Singer or George Tiller, so I don't make those kind of exaggerated claims. Christ stated clearly that the Gospel offends, and that Christians will be hated for His sake. So I don't expect much out of people these days. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "Question: With all this \"to each his own\" and \"that's between the mother and God\" stuff, have we lost our sense of moral outrage? Is there anything that gives Americans the right to speak up and say, \"No, that is just wrong\"? Does anyone believe in absolute right and wrong in the universe. I used to be a bit of a computer geek back in the day, and I recall the beauty of the binary system. It's either a 1 or a 0, no other option. Some things in this universe can and should be reduced to that simplicity. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090521, 
        "postID": 21, 
        "quote": "", 
        "reply": "Question: With all this \"to each his own\" and \"that's between the mother and God\" stuff, have we lost our sense of moral outrage? Is there anything that gives Americans the right to speak up and say, \"No, that is just wrong\"? Does anyone believe in absolute right and wrong in the universe. I used to be a bit of a computer geek back in the day, and I recall the beauty of the binary system. It's either a 1 or a 0, no other option. Some things in this universe can and should be reduced to that simplicity. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:26:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! that was then this is now...most people in this country are busy taking god out of everything.", 
        "intTime": 20090521, 
        "postID": 22, 
        "quote": "Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "reply": " that was then this is now...most people in this country are busy taking god out of everything.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:47:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God... THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.", 
        "intTime": 20090521, 
        "postID": 23, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God...", 
        "reply": " THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:49:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. The majority of active anti-abortionists are controlling MALES who do not want to give up the last vestiges of absolute dominance over women. The term, \"pro-life,\" is just a misnomer that they use to try to somehow make their obsession as being a moral issue. However, when a blind cross-section of the population that includes an equal number of women are asked, the numbers of those who support a woman's rights to decide abortion issues for themselves overwhelmingly supports the rights for the individual to be free to make procreation decisions without any government intrusion.", 
        "intTime": 20090521, 
        "postID": 24, 
        "quote": "Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "reply": " The majority of active anti-abortionists are controlling MALES who do not want to give up the last vestiges of absolute dominance over women. The term, \"pro-life,\" is just a misnomer that they use to try to somehow make their obsession as being a moral issue. However, when a blind cross-section of the population that includes an equal number of women are asked, the numbers of those who support a woman's rights to decide abortion issues for themselves overwhelmingly supports the rights for the individual to be free to make procreation decisions without any government intrusion.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:51:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "skinman13"
    }, 
    {
        "content": "ABORTION IS DONE FOR THE MOST PART TO COVER UP A MISTAKE WITH ANOTHER MISTAKE. MOST OF THE TIME IT HAS NOTHING TO DO WITH THE \"HEALTH\" OF ANY OF THE PARTICIPANTS...IT IS DONE FOR THE SOLE PURPOSE OF GETTING RID OF THE EVIDENCE OF A STUPID DECISION.", 
        "intTime": 20090521, 
        "postID": 25, 
        "quote": "", 
        "reply": "ABORTION IS DONE FOR THE MOST PART TO COVER UP A MISTAKE WITH ANOTHER MISTAKE. MOST OF THE TIME IT HAS NOTHING TO DO WITH THE \"HEALTH\" OF ANY OF THE PARTICIPANTS...IT IS DONE FOR THE SOLE PURPOSE OF GETTING RID OF THE EVIDENCE OF A STUPID DECISION.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:53:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "Those who feel the need to SHOUT, are usually those who realize that their argument is weak.", 
        "intTime": 20090521, 
        "postID": 26, 
        "quote": "", 
        "reply": "Those who feel the need to SHOUT, are usually those who realize that their argument is weak.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:59:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by backtoiraq: quote: Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God... THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER. Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 27, 
        "quote": "Originally posted by backtoiraq: quote: Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God... THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.", 
        "reply": " Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 06:13:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now...", 
        "intTime": 20090521, 
        "postID": 28, 
        "quote": "Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks.", 
        "reply": " The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now...", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 06:25:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now... Oh and you were right on in your email.", 
        "intTime": 20090521, 
        "postID": 29, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now...", 
        "reply": " Oh and you were right on in your email.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 06:30:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "- the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" quote: CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?", 
        "intTime": 20090519, 
        "postID": 30, 
        "quote": "CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn", 
        "reply": "- the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\"  A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 20:50:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "intTime": 20090519, 
        "postID": 31, 
        "quote": "", 
        "reply": "I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 21:01:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "intTime": 20090519, 
        "postID": 32, 
        "quote": "Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "reply": " I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 21:32:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "intTime": 20090519, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "reply": " So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-19 22:02:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do? I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? It's your choice - not mine. If there are consequences, the consequences are yours, not mine.", 
        "intTime": 20090520, 
        "postID": 34, 
        "quote": "Originally posted by Tangler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "reply": " I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? It's your choice - not mine. If there are consequences, the consequences are yours, not mine.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 05:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do? Thanks for TRYING to start up some bull with this comment. Roe vs wade...what period of birth is that referring to? There is your answer. Who wants partial birth abortion to go on vs a couple of weeks into the pregnancy. To most people there is a huge huge difference. Go look at a garbage bag full of partial birth aborted babies and a jar of roe vs wade fetuses. Duh... So no it is not a contradiction. It is a common knee jerk reaction.", 
        "intTime": 20090520, 
        "postID": 35, 
        "quote": "So, if your wife or daughter was pregnent and their doctor comes to you in the second or third \"trimester\" and told you \"The choice is yours but your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured. What do you do?", 
        "reply": " Thanks for TRYING to start up some bull with this comment. Roe vs wade...what period of birth is that referring to? There is your answer. Who wants partial birth abortion to go on vs a couple of weeks into the pregnancy. To most people there is a huge huge difference. Go look at a garbage bag full of partial birth aborted babies and a jar of roe vs wade fetuses. Duh... So no it is not a contradiction. It is a common knee jerk reaction.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:02:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: - the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" quote: CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions? The VAST majority of people in this country (even those that support legal abortions) have ALWAYS prefered to reduce the number of abortions. I think what is changing is that many of the younger leaders in the so called \"pro-life\" movement have stopped treating it as an absolute that to be \"pro-life\" you have to support outlawing ALL or almost all abortions and started supporting the non-criminal law methods you mentioned.", 
        "intTime": 20090520, 
        "postID": 36, 
        "quote": "Originally posted by Fightdirector: - the majority do not want Roe v. Wade overturned. \"http://www.pollster.com/blogs/us_national_survey_cnn51415.php\" quote: CNN / ORC 5/14-15/09; 1,010 adults, 3% margin of error Mode: Live Telephone Interviews Question: The 1973 Roe versus Wade decision established a woman's constitutional right to an abortion, at least in the first three months of pregnancy. Would you like to see the Supreme Court completely overturn its Roe versus Wade decision, or not? 30% Yes, overturn 68% No, not overturn A contradiction? Or do the majority of those who identify themselves as \"pro-life\" still don't want to criminalize abortion, but hope to use non-criminal law methods such as education, persuasion, etc. to reduce abortions?", 
        "reply": " The VAST majority of people in this country (even those that support legal abortions) have ALWAYS prefered to reduce the number of abortions. I think what is changing is that many of the younger leaders in the so called \"pro-life\" movement have stopped treating it as an absolute that to be \"pro-life\" you have to support outlawing ALL or almost all abortions and started supporting the non-criminal law methods you mentioned.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:13:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right. Always? * Even if carrying the baby to term will cause health problems for the mother? * Even if the baby can not survive, for example born with only a brain stem?", 
        "intTime": 20090520, 
        "postID": 37, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. I want limits on abortion...No abortions in the second or third \"semesters?\" of pregnancy, that just ain't right.", 
        "reply": " Always? * Even if carrying the baby to term will cause health problems for the mother? * Even if the baby can not survive, for example born with only a brain stem?", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:17:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "rayld2"
    }, 
    {
        "content": "I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 38, 
        "quote": "", 
        "reply": "I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 06:23:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex. When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life.", 
        "intTime": 20090520, 
        "postID": 39, 
        "quote": "Originally posted by QuanticoBornMarine: I don't quite understand how it is a \"human rights\" violation to waterboard someone, which causes no permanent injury or death, yet the decision to terminate a life on demand is a \"fundamental right\". I don't care if it was rape, incest, mother/child's life is at risk, etc., I cannot and will not support abortion. I don't accept that a child is unwanted by everybody. If you don't want to have a child, don't have sex.", 
        "reply": " When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 07:38:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it.", 
        "intTime": 20090520, 
        "postID": 40, 
        "quote": "Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death?", 
        "reply": " The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 07:44:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "RRR52"
    }, 
    {
        "content": "I should have been more clear: If there is a legitimate medical reason for the abortion in those advanced stages of life then okay.. Absolutely no abortions in the 2nd and 3rd trimester if it is not a medical emergency...", 
        "intTime": 20090520, 
        "postID": 41, 
        "quote": "", 
        "reply": "I should have been more clear: If there is a legitimate medical reason for the abortion in those advanced stages of life then okay.. Absolutely no abortions in the 2nd and 3rd trimester if it is not a medical emergency...", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 08:13:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "intTime": 20090520, 
        "postID": 42, 
        "quote": "", 
        "reply": "Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 10:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! Actually that was at the Mount of Olives, but no biggie. More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 43, 
        "quote": "Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "reply": " Actually that was at the Mount of Olives, but no biggie. More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 13:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life. There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 44, 
        "quote": "Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life.", 
        "reply": " There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 13:24:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: quote: Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life. There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all. But you are agitating for the state to force a woman to carry to term.", 
        "intTime": 20090520, 
        "postID": 45, 
        "quote": "Originally posted by QuanticoBornMarine: quote: Originally posted by rayld2: When someone can FORCE another person to give blood (after all it will save a life), donate skin (can save a life) or undergo other medical procedures for the benfit of ANOTHER person THEN everyone would be held to the same level of responsiblity for another person YOU want to force on women when it comes to babies. When you support allowing these types of actions to be forced on YOU then I will belief you are actually basing this on belief in the the right to life. There is no issue of force or coercion at play. I cannot force a woman to not abort any more than she can force someone to abort. The issue is one of morality. I believe that it is wrong to take the life of an unborn child, regardless of the circumstances. What can I do about it? I can vote, I can pray, I can speak out. But you won't see me FORCING anybody to do anything or not do anything. A coerced virtue is no virtue at all.", 
        "reply": " But you are agitating for the state to force a woman to carry to term.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 15:23:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force.", 
        "intTime": 20090520, 
        "postID": 46, 
        "quote": "Originally posted by QuanticoBornMarine: quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\"", 
        "reply": " More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 18:29:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Tangler"
    }, 
    {
        "content": "My older brother was the first one to point out to me that the power of prayer has shifted the stance on \"life itself.\" I want to believe that. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090520, 
        "postID": 47, 
        "quote": "", 
        "reply": "My older brother was the first one to point out to me that the power of prayer has shifted the stance on \"life itself.\" I want to believe that. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 19:15:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God...", 
        "intTime": 20090520, 
        "postID": 48, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it.", 
        "reply": " So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God...", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-20 21:01:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force. You are correct on point number one. My bust. He had just returned to the temple from the Mount of Olives. You are incorrect on point number two. Demonstrate to me ANYWHERE that I have forced or attempted to force something upon another, unless you are saying that I should not be able to vote or speak on my beliefs or speak on my beliefs. That would be very unconstitutional of you. I state my beliefs. If my beliefs offend, then so be it, but offending and coercing are very different. I am not ashamed or embarrassed by my beliefs, so I will continue to share them. I don't know your political or moral leaning Tangler, but I have found, over the years, that most \"liberals\" simply refuse to accept that someone else can hold a viewpoint that might offend another. They get so wrapped up in \"tolerance\" that they become intolerant of anyone they deem intolerant. They tend to allow their emotions to override their logic, and they tend to make exaggerated statements such as the one you made. I don't believe that all \"liberals\" fall into lockstep with Peter Singer or George Tiller, so I don't make those kind of exaggerated claims. Christ stated clearly that the Gospel offends, and that Christians will be hated for His sake. So I don't expect much out of people these days. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090521, 
        "postID": 49, 
        "quote": "Originally posted by Tangler: quote: Actually that was at the Mount of Olives, but no biggie. Sorry, it was at the main temple see John 8:4-11 More importantly, after no one condemned her, Jesus told her to \"Go now and sin no more.\" More importantly, your trying to force you religious believes on to others who don't share it. God/Jesus have given you a law your suppose to follow so you shouldn't have a abortion but if someone else chooses, that is their look out not yours. You can warn them but if they don't belive you can't force.", 
        "reply": " You are correct on point number one. My bust. He had just returned to the temple from the Mount of Olives. You are incorrect on point number two. Demonstrate to me ANYWHERE that I have forced or attempted to force something upon another, unless you are saying that I should not be able to vote or speak on my beliefs or speak on my beliefs. That would be very unconstitutional of you. I state my beliefs. If my beliefs offend, then so be it, but offending and coercing are very different. I am not ashamed or embarrassed by my beliefs, so I will continue to share them. I don't know your political or moral leaning Tangler, but I have found, over the years, that most \"liberals\" simply refuse to accept that someone else can hold a viewpoint that might offend another. They get so wrapped up in \"tolerance\" that they become intolerant of anyone they deem intolerant. They tend to allow their emotions to override their logic, and they tend to make exaggerated statements such as the one you made. I don't believe that all \"liberals\" fall into lockstep with Peter Singer or George Tiller, so I don't make those kind of exaggerated claims. Christ stated clearly that the Gospel offends, and that Christians will be hated for His sake. So I don't expect much out of people these days. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:19:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "Question: With all this \"to each his own\" and \"that's between the mother and God\" stuff, have we lost our sense of moral outrage? Is there anything that gives Americans the right to speak up and say, \"No, that is just wrong\"? Does anyone believe in absolute right and wrong in the universe. I used to be a bit of a computer geek back in the day, and I recall the beauty of the binary system. It's either a 1 or a 0, no other option. Some things in this universe can and should be reduced to that simplicity. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090521, 
        "postID": 50, 
        "quote": "", 
        "reply": "Question: With all this \"to each his own\" and \"that's between the mother and God\" stuff, have we lost our sense of moral outrage? Is there anything that gives Americans the right to speak up and say, \"No, that is just wrong\"? Does anyone believe in absolute right and wrong in the universe. I used to be a bit of a computer geek back in the day, and I recall the beauty of the binary system. It's either a 1 or a 0, no other option. Some things in this universe can and should be reduced to that simplicity. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:26:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point! that was then this is now...most people in this country are busy taking god out of everything.", 
        "intTime": 20090521, 
        "postID": 51, 
        "quote": "Originally posted by dragonflyer04: Pro-Life as a belief is more than just the issue of abortion...it also is anti-euthenasia, anti-capital punishment, keeping the environment safe, anti-physical abuse and torture, protecting and proper care for our animals and wildlife, and in general looking at the world around us in terms of Biblical content that we are those who are responsible to take dominion over this planet and care for it. Now about abortion... the Bible also notes we have \"freedom of choice\" as individual people and souls... and if someone does have an abortion it is between them and God... The Bilble also says \"judge not least ye be judged\"... and the woman at the well Jesus says, \"He who is without sin cast the first stone\"...no one threw a stone at that point!", 
        "reply": " that was then this is now...most people in this country are busy taking god out of everything.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:47:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God... THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.", 
        "intTime": 20090521, 
        "postID": 52, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God...", 
        "reply": " THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:49:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions. The majority of active anti-abortionists are controlling MALES who do not want to give up the last vestiges of absolute dominance over women. The term, \"pro-life,\" is just a misnomer that they use to try to somehow make their obsession as being a moral issue. However, when a blind cross-section of the population that includes an equal number of women are asked, the numbers of those who support a woman's rights to decide abortion issues for themselves overwhelmingly supports the rights for the individual to be free to make procreation decisions without any government intrusion.", 
        "intTime": 20090521, 
        "postID": 53, 
        "quote": "Originally posted by Thud357L: I think you called it FD. The majority of pro-lifers are realists and are looking for tactics to reduce unwanted pregnancies and abortions.", 
        "reply": " The majority of active anti-abortionists are controlling MALES who do not want to give up the last vestiges of absolute dominance over women. The term, \"pro-life,\" is just a misnomer that they use to try to somehow make their obsession as being a moral issue. However, when a blind cross-section of the population that includes an equal number of women are asked, the numbers of those who support a woman's rights to decide abortion issues for themselves overwhelmingly supports the rights for the individual to be free to make procreation decisions without any government intrusion.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:51:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "skinman13"
    }, 
    {
        "content": "ABORTION IS DONE FOR THE MOST PART TO COVER UP A MISTAKE WITH ANOTHER MISTAKE. MOST OF THE TIME IT HAS NOTHING TO DO WITH THE \"HEALTH\" OF ANY OF THE PARTICIPANTS...IT IS DONE FOR THE SOLE PURPOSE OF GETTING RID OF THE EVIDENCE OF A STUPID DECISION.", 
        "intTime": 20090521, 
        "postID": 54, 
        "quote": "", 
        "reply": "ABORTION IS DONE FOR THE MOST PART TO COVER UP A MISTAKE WITH ANOTHER MISTAKE. MOST OF THE TIME IT HAS NOTHING TO DO WITH THE \"HEALTH\" OF ANY OF THE PARTICIPANTS...IT IS DONE FOR THE SOLE PURPOSE OF GETTING RID OF THE EVIDENCE OF A STUPID DECISION.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:53:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "Those who feel the need to SHOUT, are usually those who realize that their argument is weak.", 
        "intTime": 20090521, 
        "postID": 55, 
        "quote": "", 
        "reply": "Those who feel the need to SHOUT, are usually those who realize that their argument is weak.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 04:59:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by backtoiraq: quote: Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God... THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER. Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090521, 
        "postID": 56, 
        "quote": "Originally posted by backtoiraq: quote: Originally posted by Fightdirector: quote: Originally posted by RRR52: quote: Originally posted by Fightdirector:I think the question is more like this: If your wife or daughter was pregnant and their doctor comes to you in the second or third \"trimester\" and tells you \"Your wife or daughter will die if you don't abort the baby now. This is a medical problem and can not be cured\", do you want someone who lives down in the street or in another town or in another state to be able to prevent that abortion, and condemn your wife or daughter to death? The vast majority of abortions, at least 97% by some documentation I have read over the years, are NOT life and death issues or even medically significant for the mother. They are matters of \"convenience.\" No different morally from the sinful concept that has sometimes been tendered to euthanize people who cannot fend well for themselves, and for whom other people do not wish to expend resources in their care. Fifty million (50,000,000) budding lives have been obliterated since 1973 in America. (Leftists whine about potentialities of destroyed jungle habitat; how many great people would now be alive and serving great needs had they not been wantonly destroyed by abortions?) This is a holocaust by any definition of the word, despite the abortionists making big bucks off the medical procedures disliking to have the reality of the evil stated so honestly and clearly. It is likely that eventually, in some way, this nation and the perpetrators of such invidious action shall eventually pay a price for their heartlessness toward innocents. And I could care less if DHS or other bureaucrats without enough meaningful work to do decide to put me on their watch list for saying so--or \"elevate\" my military veteran, gun-owning, tax reducing, God-worshipping status on it. So, I gather from your comment that you feel you have the right, indeed the obligation, to decide for someone else (not just for yourself or your spouse) whether or not they can or cannot have a abortion. Did I read you correctly? If so, what other things do you feel you have the right, indeed the obligation, to decide for someone else? Whether or not they can drink alcohol? Whether or not they can stay home on Sunday and not attend a church? Whether or not they can watch CNN rather than FOX? How far are you willing to go to set yourself up as the decider for other's people's lives? I, for one, agree with dragonflyer04: quote: ...if someone does have an abortion it is between them and God... THAT WOULD BE TRUE EXCEPT MY TAX MONEY IS BEING USED TO MAKE SURE YOU CAN KILL BABIES. SO IT IS JUST NOT BETWEEN GOD AND THE KILLER.", 
        "reply": " Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 06:13:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now...", 
        "intTime": 20090521, 
        "postID": 57, 
        "quote": "Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks.", 
        "reply": " The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now...", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 06:25:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now... Oh and you were right on in your email.", 
        "intTime": 20090521, 
        "postID": 58, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by PinkBlossoms: Yes, it is (tax money being spent on killing babies.) Makes me want to quit working and join the liberal porch sitters waiting on their monthly entitlement checks. The winky icon does not make your \"liberal\" comment any less insidious. Seems to me there has been only one person on this board bragging about their entitlement checks and he wasn't a liberal. Excuse me, but I have to head off to WORK now...", 
        "reply": " Oh and you were right on in your email.", 
        "threadID": "409192893_1310027322001", 
        "time": "2009-05-21 06:30:00", 
        "title": "More people say they are \"pro-life\" in poll, but -", 
        "userID": "DMarkUhler"
    }
]