[
    {
        "content": "Don't care what side of the aisle you're are, these are as farking funny as the are true ...... 1.'If you don't read the newspaper you are uninformed; if you do read the newspaper you are misinformed.’ **-Mark Twain 2. Suppose you were an idiot. And suppose you were a member of Congress.... But then I repeat myself.**-Mark Twain 3. I contend that for a nation to try to tax itself into prosperity is like a man standing in a bucket and trying to lift himself up by the handle.**-Winston Churchill 4. A government which robs Peter to pay Paul can always depend on the support of Paul.**- George Bernard Shaw 5. Foreign aid might be defined as a transfer of money from poor people in rich countries to rich people in poor countries.**-Douglas Casey 6. Giving money and power to government is like giving whiskey and car keys to teenage boys.**-P.J. O'Rourke, Civil Libertarian 7. Government is the great fiction, through which everybody endeavors to live at the expense of everybody else.**-Frederic Bastiat, French Economist (1801-1850) 8. Government's view of the economy could be summed up in a few short phrases: If it moves, tax it. If it keeps moving, regulate it. And if it stops moving, subsidize it.**-Ronald Reagan (1986) 9. I don't make jokes... I just watch the government and report the facts.**-Will Rogers 10. If you think health care is expensive now, wait until you see what it costs when it's free!**-P.J. O'Rourke** 11. In general, the art of government consists of taking as much money as possible from one party of the citizens to give to the other.**-Voltaire (1764) 12. Just because you do not take an interest in politics doesn't mean politics won't take an interest in you!**-Pericles (430 B.C.) 13. No man's life, liberty, or property is safe while the legislature is in session.**-Mark Twain (1866 ) 14. Talk is cheap...except when Congress does it.**-Unknown 15. The government is like a baby's alimentary canal: a happy appetite at one end and no responsibility at the other.**-Ronald Reagan 16. The inherent vice of capitalism is the unequal sharing of the blessings. The inherent blessing of socialism is the equal sharing of misery.**-Winston Churchill 17. The ultimate result of shielding men from the effects of folly is to fill the world with fools.**-Herbert Spencer, English Philosopher (1820-1903) 18. There is no distinctly Native American criminal class...save Congress.**-Mark Twain 19. What this country needs are more unemployed politicians.**-Edward Langley, Artist (1928 - 1995) 20. A government big enough to give you everything you want, is strong enough to take everything you have.**-Thomas Jefferson", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "Don't care what side of the aisle you're are, these are as farking funny as the are true ...... 1.'If you don't read the newspaper you are uninformed; if you do read the newspaper you are misinformed.’ **-Mark Twain 2. Suppose you were an idiot. And suppose you were a member of Congress.... But then I repeat myself.**-Mark Twain 3. I contend that for a nation to try to tax itself into prosperity is like a man standing in a bucket and trying to lift himself up by the handle.**-Winston Churchill 4. A government which robs Peter to pay Paul can always depend on the support of Paul.**- George Bernard Shaw 5. Foreign aid might be defined as a transfer of money from poor people in rich countries to rich people in poor countries.**-Douglas Casey 6. Giving money and power to government is like giving whiskey and car keys to teenage boys.**-P.J. O'Rourke, Civil Libertarian 7. Government is the great fiction, through which everybody endeavors to live at the expense of everybody else.**-Frederic Bastiat, French Economist (1801-1850) 8. Government's view of the economy could be summed up in a few short phrases: If it moves, tax it. If it keeps moving, regulate it. And if it stops moving, subsidize it.**-Ronald Reagan (1986) 9. I don't make jokes... I just watch the government and report the facts.**-Will Rogers 10. If you think health care is expensive now, wait until you see what it costs when it's free!**-P.J. O'Rourke** 11. In general, the art of government consists of taking as much money as possible from one party of the citizens to give to the other.**-Voltaire (1764) 12. Just because you do not take an interest in politics doesn't mean politics won't take an interest in you!**-Pericles (430 B.C.) 13. No man's life, liberty, or property is safe while the legislature is in session.**-Mark Twain (1866 ) 14. Talk is cheap...except when Congress does it.**-Unknown 15. The government is like a baby's alimentary canal: a happy appetite at one end and no responsibility at the other.**-Ronald Reagan 16. The inherent vice of capitalism is the unequal sharing of the blessings. The inherent blessing of socialism is the equal sharing of misery.**-Winston Churchill 17. The ultimate result of shielding men from the effects of folly is to fill the world with fools.**-Herbert Spencer, English Philosopher (1820-1903) 18. There is no distinctly Native American criminal class...save Congress.**-Mark Twain 19. What this country needs are more unemployed politicians.**-Edward Langley, Artist (1928 - 1995) 20. A government big enough to give you everything you want, is strong enough to take everything you have.**-Thomas Jefferson", 
        "threadID": "409192893_9550044712001", 
        "time": "2009-03-10 08:23:00", 
        "title": "Various Musing and Quotes .... As true today as when they were first said.", 
        "userID": "navy8086"
    }, 
    {
        "content": "Oh so true! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "Oh so true! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_9550044712001", 
        "time": "2009-03-10 10:50:00", 
        "title": "Various Musing and Quotes .... As true today as when they were first said.", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Oh so true! yep, any thread that the libs leave alone must have too much truth in it. \"A man with both feet planted firmly in the air can be safely called a liberal”", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "Oh so true!", 
        "reply": " yep, any thread that the libs leave alone must have too much truth in it. \"A man with both feet planted firmly in the air can be safely called a liberal”", 
        "threadID": "409192893_9550044712001", 
        "time": "2009-03-10 11:29:00", 
        "title": "Various Musing and Quotes .... As true today as when they were first said.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "You cannot help the poor by destroying the rich. You cannot strengthen the weak by weakening the strong. You cannot bring about prosperity by discouraging thrift. You cannot lift the wage earner up by pulling the wager payer down. You cannot further the brotherhood of man by inciting class hatred. You cannot build character and courage by taking away peoples initiative and independence. You cannot help people permanently by doing for them, what they could and should do for themselves. Try and guess whose words these are before scrolling down. Abraham Lincoln \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "", 
        "reply": "You cannot help the poor by destroying the rich. You cannot strengthen the weak by weakening the strong. You cannot bring about prosperity by discouraging thrift. You cannot lift the wage earner up by pulling the wager payer down. You cannot further the brotherhood of man by inciting class hatred. You cannot build character and courage by taking away peoples initiative and independence. You cannot help people permanently by doing for them, what they could and should do for themselves. Try and guess whose words these are before scrolling down. Abraham Lincoln \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_9550044712001", 
        "time": "2009-03-10 12:35:00", 
        "title": "Various Musing and Quotes .... As true today as when they were first said.", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: You cannot help the poor by destroying the rich. You cannot strengthen the weak by weakening the strong. You cannot bring about prosperity by discouraging thrift. You cannot lift the wage earner up by pulling the wager payer down. You cannot further the brotherhood of man by inciting class hatred. You cannot build character and courage by taking away peoples initiative and independence. You cannot help people permanently by doing for them, what they could and should do for themselves. Try and guess whose words these are before scrolling down. Abraham Lincoln Hmmm...I wonder how PBHO missed this, I mean what with him admiring Lincoln so much and all...", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "Originally posted by EngrOpsNCO: You cannot help the poor by destroying the rich. You cannot strengthen the weak by weakening the strong. You cannot bring about prosperity by discouraging thrift. You cannot lift the wage earner up by pulling the wager payer down. You cannot further the brotherhood of man by inciting class hatred. You cannot build character and courage by taking away peoples initiative and independence. You cannot help people permanently by doing for them, what they could and should do for themselves. Try and guess whose words these are before scrolling down. Abraham Lincoln", 
        "reply": " Hmmm...I wonder how PBHO missed this, I mean what with him admiring Lincoln so much and all...", 
        "threadID": "409192893_9550044712001", 
        "time": "2009-03-10 13:06:00", 
        "title": "Various Musing and Quotes .... As true today as when they were first said.", 
        "userID": "BayStateGal"
    }, 
    {
        "content": "quote: Originally posted by BayStateGal: quote: Originally posted by EngrOpsNCO: You cannot help the poor by destroying the rich. You cannot strengthen the weak by weakening the strong. You cannot bring about prosperity by discouraging thrift. You cannot lift the wage earner up by pulling the wager payer down. You cannot further the brotherhood of man by inciting class hatred. You cannot build character and courage by taking away peoples initiative and independence. You cannot help people permanently by doing for them, what they could and should do for themselves. Try and guess whose words these are before scrolling down. Abraham Lincoln Hmmm...I wonder how PBHO missed this, I mean what with him admiring Lincoln so much and all... He admired MARX and STALIN MORE !", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "Originally posted by BayStateGal: quote: Originally posted by EngrOpsNCO: You cannot help the poor by destroying the rich. You cannot strengthen the weak by weakening the strong. You cannot bring about prosperity by discouraging thrift. You cannot lift the wage earner up by pulling the wager payer down. You cannot further the brotherhood of man by inciting class hatred. You cannot build character and courage by taking away peoples initiative and independence. You cannot help people permanently by doing for them, what they could and should do for themselves. Try and guess whose words these are before scrolling down. Abraham Lincoln Hmmm...I wonder how PBHO missed this, I mean what with him admiring Lincoln so much and all...", 
        "reply": " He admired MARX and STALIN MORE !", 
        "threadID": "409192893_9550044712001", 
        "time": "2009-03-10 13:08:00", 
        "title": "Various Musing and Quotes .... As true today as when they were first said.", 
        "userID": "navy8086"
    }
]