[
    {
        "content": "I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "", 
        "reply": "I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 20:02:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "quote: Whats with the costant drum beat that Christians and traditionalists have dissapeared? You're throwing a lot of groups into your premise. But I'll answer for the conservatives: It's dead because no law is ever given the constitutionality test anymore to deem if it is even lawful. As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were.", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "reply": " You're throwing a lot of groups into your premise. But I'll answer for the conservatives: It's dead because no law is ever given the constitutionality test anymore to deem if it is even lawful. As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 20:12:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were. Sucking off who? Other blue states? It certainly can't be red states, most of my blue state tax dollars to go all red states in a terrible redistribution of wealth. California gets back $0.78 of every tax dollar paid. Only a handful of other states do better, and they're all blue states. Red States like Arizona get back almost $1.19 back of every $1.00 paid in taxes.", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "Originally posted by soscorpio: As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were.", 
        "reply": " Sucking off who? Other blue states? It certainly can't be red states, most of my blue state tax dollars to go all red states in a terrible redistribution of wealth. California gets back $0.78 of every tax dollar paid. Only a handful of other states do better, and they're all blue states. Red States like Arizona get back almost $1.19 back of every $1.00 paid in taxes.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 21:12:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Boots_"
    }, 
    {
        "content": "It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "intTime": 20090513, 
        "postID": 4, 
        "quote": "", 
        "reply": "It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 21:26:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "So we need 2 democratic parties? And you dont think that if Rep do that they will commit politacal hairy kari? Traditional values are anything but fringe.", 
        "intTime": 20090513, 
        "postID": 5, 
        "quote": "", 
        "reply": "So we need 2 democratic parties? And you dont think that if Rep do that they will commit politacal hairy kari? Traditional values are anything but fringe.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:13:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "quote: It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\". Had Ron Paul won the primary ticket, the republican party would be strong, because Ron Paul is right on the crux of the issues. So going mainstream is liberal speak for keep on compromising. The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are.", 
        "intTime": 20090513, 
        "postID": 6, 
        "quote": "It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "reply": " Had Ron Paul won the primary ticket, the republican party would be strong, because Ron Paul is right on the crux of the issues. So going mainstream is liberal speak for keep on compromising. The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:21:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: So we need 2 democratic parties? Never said that. quote: And you dont think that if Rep do that they will commit politacal hairy kari? like lose the executive AND congress? quote: Traditional values are anything but fringe. When you preach \"small government\" and then want to legislate \"Traditional values\". Yeah that's fringe. But here's a better Idea. How about the Republicans go back a read some stuff by Will Buckley Sr. and Goldwater and try to remember what being a conservative actually is. Its not god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.", 
        "intTime": 20090513, 
        "postID": 7, 
        "quote": "So we need 2 democratic parties?", 
        "reply": " Never said that. quote: And you dont think that if Rep do that they will commit politacal hairy kari? like lose the executive AND congress? quote: Traditional values are anything but fringe. When you preach \"small government\" and then want to legislate \"Traditional values\". Yeah that's fringe. But here's a better Idea. How about the Republicans go back a read some stuff by Will Buckley Sr. and Goldwater and try to remember what being a conservative actually is. Its not god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:26:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: So going mainstream is liberal speak for keep on compromising. No it's not. Its recognizing that moderates and independents are what win elections. Not your parties base. quote: The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. That's a massive generalization. quote: Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. Hey. if you think anti gay marriage amendments and being anti science is \"main stream\"...well...I'm not sure what to say to you. quote: The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. another massive assumption and generalization. quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend. quote: I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are. I like how you make a judgment about me based on something I haven't done. It's kinda cute.", 
        "intTime": 20090513, 
        "postID": 8, 
        "quote": "So going mainstream is liberal speak for keep on compromising.", 
        "reply": " No it's not. Its recognizing that moderates and independents are what win elections. Not your parties base. quote: The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. That's a massive generalization. quote: Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. Hey. if you think anti gay marriage amendments and being anti science is \"main stream\"...well...I'm not sure what to say to you. quote: The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. another massive assumption and generalization. quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend. quote: I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are. I like how you make a judgment about me based on something I haven't done. It's kinda cute.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:35:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water? let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. I think Liberals are waay over reaching and republicans had better wake up. when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe.", 
        "intTime": 20090513, 
        "postID": 9, 
        "quote": "", 
        "reply": "So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water? let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. I think Liberals are waay over reaching and republicans had better wake up. when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 23:56:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "quote: So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water? I said conservativeism \"is NOT god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.\" quote: let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? It makes no difference if the majority back it or not. It's either a right or it isn't. And you're either for small government or your not. and if you are FOR a ban on gay marriage you are NOT for small government. period. quote: Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. Irrelevant. It's either a right or it isn't. Just like even if the majority of the people in CA wanted to ban all fire arms that doesn't mean they can. quote: when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe. being religious or christian isn't fringe. try to legislate your beliefs and morals is fringe.", 
        "intTime": 20090514, 
        "postID": 10, 
        "quote": "So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water?", 
        "reply": " I said conservativeism \"is NOT god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.\" quote: let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? It makes no difference if the majority back it or not. It's either a right or it isn't. And you're either for small government or your not. and if you are FOR a ban on gay marriage you are NOT for small government. period. quote: Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. Irrelevant. It's either a right or it isn't. Just like even if the majority of the people in CA wanted to ban all fire arms that doesn't mean they can. quote: when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe. being religious or christian isn't fringe. try to legislate your beliefs and morals is fringe.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 00:08:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "intTime": 20090514, 
        "postID": 11, 
        "quote": "", 
        "reply": "Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 05:09:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend. \"Liberal in what way?\" His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands.", 
        "intTime": 20090514, 
        "postID": 12, 
        "quote": "quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend.", 
        "reply": " \"Liberal in what way?\" His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 06:50:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands. so that's your defination of a \"liberal\"?someone who doesn't follow the constitution? REALLY?", 
        "intTime": 20090514, 
        "postID": 13, 
        "quote": "His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands.", 
        "reply": " so that's your defination of a \"liberal\"?someone who doesn't follow the constitution? REALLY?", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 07:00:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain... So you couldn't get it passed in an extremely liberal state why?", 
        "intTime": 20090514, 
        "postID": 14, 
        "quote": "Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "reply": " So you couldn't get it passed in an extremely liberal state why?", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 07:27:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\". The same can be said for the Democratic party. The Dem Leadership panders to the left wing fringe. That's why I am in favor of at least another viable party. Problem is the funding for such a movement. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 15, 
        "quote": "Originally posted by karlhungusjr: It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "reply": " The same can be said for the Democratic party. The Dem Leadership panders to the left wing fringe. That's why I am in favor of at least another viable party. Problem is the funding for such a movement. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:14:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain... I support civil unions, so don't most folks I know. But you equating it to racial crap is apples and oranges and OLD. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 16, 
        "quote": "Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "reply": " I support civil unions, so don't most folks I know. But you equating it to racial crap is apples and oranges and OLD. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:15:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Fact: A Majority of Americans do not want to redefine marriage for H.omo.s, it is the President's offical stance actually. Gays need to leave it up to the voters...oops, that didn't work BTW: Don't even start, because no one is hanged from tree's for being gay....", 
        "intTime": 20090514, 
        "postID": 17, 
        "quote": "", 
        "reply": "Fact: A Majority of Americans do not want to redefine marriage for H.omo.s, it is the President's offical stance actually. Gays need to leave it up to the voters...oops, that didn't work BTW: Don't even start, because no one is hanged from tree's for being gay....", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:25:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: The Dem Leadership panders to the left wing fringe. I think they do too. way too often. The assualt weapons ban is a good example of them doing just that. But the republicans seem to do it a great deal more IMO. It would be like the dems putting Code Pink positions on the national party platform. and thats exactly what the republicans do eveytime they bow to Rush/hannity/beck/etc..", 
        "intTime": 20090514, 
        "postID": 18, 
        "quote": "The Dem Leadership panders to the left wing fringe.", 
        "reply": " I think they do too. way too often. The assualt weapons ban is a good example of them doing just that. But the republicans seem to do it a great deal more IMO. It would be like the dems putting Code Pink positions on the national party platform. and thats exactly what the republicans do eveytime they bow to Rush/hannity/beck/etc..", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:47:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: no one is hanged from tree's for being gay.... nah. they just get beat and stabbed in mens bathrooms.", 
        "intTime": 20090514, 
        "postID": 19, 
        "quote": "no one is hanged from tree's for being gay....", 
        "reply": " nah. they just get beat and stabbed in mens bathrooms.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:49:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: no one is hanged from tree's for being gay.... nah. they just get beat and stabbed in mens bathrooms. Yeah well, that happes to alot of people.. Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid...", 
        "intTime": 20090514, 
        "postID": 20, 
        "quote": "Originally posted by karlhungusjr: quote: no one is hanged from tree's for being gay.... nah. they just get beat and stabbed in mens bathrooms.", 
        "reply": " Yeah well, that happes to alot of people.. Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:02:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: So do straight people. go ahead and post an article where a straight person was stabbed and beat for being straight. I'll wait...", 
        "intTime": 20090514, 
        "postID": 21, 
        "quote": "So do straight people.", 
        "reply": " go ahead and post an article where a straight person was stabbed and beat for being straight. I'll wait...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:05:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: BTW: Don't even start, because no one is hanged from tree's for being gay.... Yeah...that's stupid to compare one bias to another. If Matthew Shephard had been a real hate crime he would have been lynched instead of beaten and left to die, tied to fence...in the cold...", 
        "intTime": 20090514, 
        "postID": 22, 
        "quote": "BTW: Don't even start, because no one is hanged from tree's for being gay....", 
        "reply": " Yeah...that's stupid to compare one bias to another. If Matthew Shephard had been a real hate crime he would have been lynched instead of beaten and left to die, tied to fence...in the cold...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:06:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you.", 
        "intTime": 20090514, 
        "postID": 23, 
        "quote": "Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc", 
        "reply": " last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:07:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you. I think I see it now: You belive in Utopia What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery? Face it, this is BS. Everyone see's it and votes accordingly...", 
        "intTime": 20090514, 
        "postID": 24, 
        "quote": "Originally posted by karlhungusjr: quote: Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you.", 
        "reply": " I think I see it now: You belive in Utopia What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery? Face it, this is BS. Everyone see's it and votes accordingly...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:16:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery? I love the assumptions you make about me. Discrimination is Discrimination. One form is not \"ok\" just becuase another form of Discrimination was worse at somepoint in the past. the argument of \"its just not the same!\" is basically a temper tantrum because it's an inconvient comparision for you. but feel free to keep pushing for \"big government\" telling private citizens what they can and can't do when their actions hurt no one.", 
        "intTime": 20090514, 
        "postID": 25, 
        "quote": "What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery?", 
        "reply": " I love the assumptions you make about me. Discrimination is Discrimination. One form is not \"ok\" just becuase another form of Discrimination was worse at somepoint in the past. the argument of \"its just not the same!\" is basically a temper tantrum because it's an inconvient comparision for you. but feel free to keep pushing for \"big government\" telling private citizens what they can and can't do when their actions hurt no one.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:27:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared? One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club.", 
        "intTime": 20090514, 
        "postID": 26, 
        "quote": "Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "reply": " One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:50:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared? One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club. That is true for both parties. It's their way or the highway. Yo0u can not be a true democrat unless you believe in abortion (not the right to choose), bigger government, gay marraige, prosecuting ONLY republicans, etc. This is why I am independent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 27, 
        "quote": "Originally posted by thorin001: quote: Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared? One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club.", 
        "reply": " That is true for both parties. It's their way or the highway. Yo0u can not be a true democrat unless you believe in abortion (not the right to choose), bigger government, gay marraige, prosecuting ONLY republicans, etc. This is why I am independent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:56:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "L0A1"
    }, 
    {
        "content": "I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "intTime": 20090513, 
        "postID": 28, 
        "quote": "", 
        "reply": "I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 20:02:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "quote: Whats with the costant drum beat that Christians and traditionalists have dissapeared? You're throwing a lot of groups into your premise. But I'll answer for the conservatives: It's dead because no law is ever given the constitutionality test anymore to deem if it is even lawful. As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were.", 
        "intTime": 20090513, 
        "postID": 29, 
        "quote": "Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "reply": " You're throwing a lot of groups into your premise. But I'll answer for the conservatives: It's dead because no law is ever given the constitutionality test anymore to deem if it is even lawful. As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 20:12:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were. Sucking off who? Other blue states? It certainly can't be red states, most of my blue state tax dollars to go all red states in a terrible redistribution of wealth. California gets back $0.78 of every tax dollar paid. Only a handful of other states do better, and they're all blue states. Red States like Arizona get back almost $1.19 back of every $1.00 paid in taxes.", 
        "intTime": 20090513, 
        "postID": 30, 
        "quote": "Originally posted by soscorpio: As for gay marriage as a state issue, yes it can be addressed, is CAconservative? They wouldn't be flat broke and sucking off the rest of us if they were.", 
        "reply": " Sucking off who? Other blue states? It certainly can't be red states, most of my blue state tax dollars to go all red states in a terrible redistribution of wealth. California gets back $0.78 of every tax dollar paid. Only a handful of other states do better, and they're all blue states. Red States like Arizona get back almost $1.19 back of every $1.00 paid in taxes.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 21:12:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Boots_"
    }, 
    {
        "content": "It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "intTime": 20090513, 
        "postID": 31, 
        "quote": "", 
        "reply": "It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 21:26:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "So we need 2 democratic parties? And you dont think that if Rep do that they will commit politacal hairy kari? Traditional values are anything but fringe.", 
        "intTime": 20090513, 
        "postID": 32, 
        "quote": "", 
        "reply": "So we need 2 democratic parties? And you dont think that if Rep do that they will commit politacal hairy kari? Traditional values are anything but fringe.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:13:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "quote: It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\". Had Ron Paul won the primary ticket, the republican party would be strong, because Ron Paul is right on the crux of the issues. So going mainstream is liberal speak for keep on compromising. The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are.", 
        "intTime": 20090513, 
        "postID": 33, 
        "quote": "It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "reply": " Had Ron Paul won the primary ticket, the republican party would be strong, because Ron Paul is right on the crux of the issues. So going mainstream is liberal speak for keep on compromising. The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:21:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: So we need 2 democratic parties? Never said that. quote: And you dont think that if Rep do that they will commit politacal hairy kari? like lose the executive AND congress? quote: Traditional values are anything but fringe. When you preach \"small government\" and then want to legislate \"Traditional values\". Yeah that's fringe. But here's a better Idea. How about the Republicans go back a read some stuff by Will Buckley Sr. and Goldwater and try to remember what being a conservative actually is. Its not god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.", 
        "intTime": 20090513, 
        "postID": 34, 
        "quote": "So we need 2 democratic parties?", 
        "reply": " Never said that. quote: And you dont think that if Rep do that they will commit politacal hairy kari? like lose the executive AND congress? quote: Traditional values are anything but fringe. When you preach \"small government\" and then want to legislate \"Traditional values\". Yeah that's fringe. But here's a better Idea. How about the Republicans go back a read some stuff by Will Buckley Sr. and Goldwater and try to remember what being a conservative actually is. Its not god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:26:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: So going mainstream is liberal speak for keep on compromising. No it's not. Its recognizing that moderates and independents are what win elections. Not your parties base. quote: The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. That's a massive generalization. quote: Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. Hey. if you think anti gay marriage amendments and being anti science is \"main stream\"...well...I'm not sure what to say to you. quote: The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. another massive assumption and generalization. quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend. quote: I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are. I like how you make a judgment about me based on something I haven't done. It's kinda cute.", 
        "intTime": 20090513, 
        "postID": 35, 
        "quote": "So going mainstream is liberal speak for keep on compromising.", 
        "reply": " No it's not. Its recognizing that moderates and independents are what win elections. Not your parties base. quote: The problem when conservatives comprimise with liberals is that we lose and they gain because the liberal didn't bring anything to the table the conservative wanted and the liberal wants to see some relaxation on the rule of law the constitution. That's a massive generalization. quote: Well, the conservatives have compromised and gone mainstream so often, they are merely liberal-lites at this point, and the conservative message such as Paul's is fading. Hey. if you think anti gay marriage amendments and being anti science is \"main stream\"...well...I'm not sure what to say to you. quote: The young and middle-aged don't believe the constitution is valid or feel it should change with the current times. another massive assumption and generalization. quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend. quote: I know you're going to call me a sore loser instead of considering what I posted. Ahh, so easily led some us are. I like how you make a judgment about me based on something I haven't done. It's kinda cute.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 22:35:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water? let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. I think Liberals are waay over reaching and republicans had better wake up. when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe.", 
        "intTime": 20090513, 
        "postID": 36, 
        "quote": "", 
        "reply": "So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water? let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. I think Liberals are waay over reaching and republicans had better wake up. when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-13 23:56:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "quote: So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water? I said conservativeism \"is NOT god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.\" quote: let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? It makes no difference if the majority back it or not. It's either a right or it isn't. And you're either for small government or your not. and if you are FOR a ban on gay marriage you are NOT for small government. period. quote: Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. Irrelevant. It's either a right or it isn't. Just like even if the majority of the people in CA wanted to ban all fire arms that doesn't mean they can. quote: when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe. being religious or christian isn't fringe. try to legislate your beliefs and morals is fringe.", 
        "intTime": 20090514, 
        "postID": 37, 
        "quote": "So your saying gay marriage is main stream for the entire country? even though Liberal califirnia Just blew it out of the water?", 
        "reply": " I said conservativeism \"is NOT god guns and gays. Its not torture. Its not lower taxes no matter how much you spend. And it sure as hell isn't southern Baptists telling the country whats moral and what isn't.\" quote: let me ask you this: Are the majority of Americans for gay marriage, or is there a constant barrage of activist Judges trying to force states on the issue? It makes no difference if the majority back it or not. It's either a right or it isn't. And you're either for small government or your not. and if you are FOR a ban on gay marriage you are NOT for small government. period. quote: Give me one instance in any state where gay marriage was approved by the people and not judicial or legislative fiat. Irrelevant. It's either a right or it isn't. Just like even if the majority of the people in CA wanted to ban all fire arms that doesn't mean they can. quote: when you have 70% of the country still thinking they are christians you might wanna reconsider Not calling traditional values fringe. being religious or christian isn't fringe. try to legislate your beliefs and morals is fringe.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 00:08:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "intTime": 20090514, 
        "postID": 38, 
        "quote": "", 
        "reply": "Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 05:09:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend. \"Liberal in what way?\" His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands.", 
        "intTime": 20090514, 
        "postID": 39, 
        "quote": "quote: America's deviation from the wisdom of the founders is how we got here. America, after a very liberal president (Bush) needed the likes of Ron Paul. Liberal in what way? socially he wasn't liberal. They only way Bush could be called \"liberal\" is fiscially. and even then he wasn't tax and spend. He was buy it on credit and spend.", 
        "reply": " \"Liberal in what way?\" His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 06:50:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands. so that's your defination of a \"liberal\"?someone who doesn't follow the constitution? REALLY?", 
        "intTime": 20090514, 
        "postID": 40, 
        "quote": "His actions are not supported by the powers given to him in the constitution. Constitutionally speaking, President Bush was very liberal as the office has a certain role and for some reason the strict guidlines for that role were not analyzed. All of washington has gone liberal since that is the path to assume power, since the constitution attempts to keep that power in We the peoples hands.", 
        "reply": " so that's your defination of a \"liberal\"?someone who doesn't follow the constitution? REALLY?", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 07:00:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain... So you couldn't get it passed in an extremely liberal state why?", 
        "intTime": 20090514, 
        "postID": 41, 
        "quote": "Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "reply": " So you couldn't get it passed in an extremely liberal state why?", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 07:27:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\". The same can be said for the Democratic party. The Dem Leadership panders to the left wing fringe. That's why I am in favor of at least another viable party. Problem is the funding for such a movement. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 42, 
        "quote": "Originally posted by karlhungusjr: It's not a question of \"should Conservatives go left\". It's a question of \"Should the republican party stop pandering to the fringe and start becoming more mainstream\".", 
        "reply": " The same can be said for the Democratic party. The Dem Leadership panders to the left wing fringe. That's why I am in favor of at least another viable party. Problem is the funding for such a movement. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:14:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain... I support civil unions, so don't most folks I know. But you equating it to racial crap is apples and oranges and OLD. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 43, 
        "quote": "Originally posted by SeaWitch1220: Support for gay marriage: Support for interracial marriage: Get off the tracks, the marriage train is coming. Sure, it might start with Civil Unions, but this is as inevitable as rain...", 
        "reply": " I support civil unions, so don't most folks I know. But you equating it to racial crap is apples and oranges and OLD. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:15:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Fact: A Majority of Americans do not want to redefine marriage for H.omo.s, it is the President's offical stance actually. Gays need to leave it up to the voters...oops, that didn't work BTW: Don't even start, because no one is hanged from tree's for being gay....", 
        "intTime": 20090514, 
        "postID": 44, 
        "quote": "", 
        "reply": "Fact: A Majority of Americans do not want to redefine marriage for H.omo.s, it is the President's offical stance actually. Gays need to leave it up to the voters...oops, that didn't work BTW: Don't even start, because no one is hanged from tree's for being gay....", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:25:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: The Dem Leadership panders to the left wing fringe. I think they do too. way too often. The assualt weapons ban is a good example of them doing just that. But the republicans seem to do it a great deal more IMO. It would be like the dems putting Code Pink positions on the national party platform. and thats exactly what the republicans do eveytime they bow to Rush/hannity/beck/etc..", 
        "intTime": 20090514, 
        "postID": 45, 
        "quote": "The Dem Leadership panders to the left wing fringe.", 
        "reply": " I think they do too. way too often. The assualt weapons ban is a good example of them doing just that. But the republicans seem to do it a great deal more IMO. It would be like the dems putting Code Pink positions on the national party platform. and thats exactly what the republicans do eveytime they bow to Rush/hannity/beck/etc..", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:47:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: no one is hanged from tree's for being gay.... nah. they just get beat and stabbed in mens bathrooms.", 
        "intTime": 20090514, 
        "postID": 46, 
        "quote": "no one is hanged from tree's for being gay....", 
        "reply": " nah. they just get beat and stabbed in mens bathrooms.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 08:49:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: no one is hanged from tree's for being gay.... nah. they just get beat and stabbed in mens bathrooms. Yeah well, that happes to alot of people.. Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid...", 
        "intTime": 20090514, 
        "postID": 47, 
        "quote": "Originally posted by karlhungusjr: quote: no one is hanged from tree's for being gay.... nah. they just get beat and stabbed in mens bathrooms.", 
        "reply": " Yeah well, that happes to alot of people.. Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:02:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: So do straight people. go ahead and post an article where a straight person was stabbed and beat for being straight. I'll wait...", 
        "intTime": 20090514, 
        "postID": 48, 
        "quote": "So do straight people.", 
        "reply": " go ahead and post an article where a straight person was stabbed and beat for being straight. I'll wait...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:05:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: BTW: Don't even start, because no one is hanged from tree's for being gay.... Yeah...that's stupid to compare one bias to another. If Matthew Shephard had been a real hate crime he would have been lynched instead of beaten and left to die, tied to fence...in the cold...", 
        "intTime": 20090514, 
        "postID": 49, 
        "quote": "BTW: Don't even start, because no one is hanged from tree's for being gay....", 
        "reply": " Yeah...that's stupid to compare one bias to another. If Matthew Shephard had been a real hate crime he would have been lynched instead of beaten and left to die, tied to fence...in the cold...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:06:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you.", 
        "intTime": 20090514, 
        "postID": 50, 
        "quote": "Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc", 
        "reply": " last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:07:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you. I think I see it now: You belive in Utopia What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery? Face it, this is BS. Everyone see's it and votes accordingly...", 
        "intTime": 20090514, 
        "postID": 51, 
        "quote": "Originally posted by karlhungusjr: quote: Last time I checked, Gays can get pretty much any job they want, go to any school they want, shop where they want...etc..etc last I checked black people can get \"pretty much\" as you say, any job they want, go to any school they want, shop where they want...etc..etc. But thats doesn't mean racism hasn't gone away. quote: Comparing the \"plight\" of gays to racism is obscene and outrageous....not to mention idiotic and stupid... No. It's just inconvient for you.", 
        "reply": " I think I see it now: You belive in Utopia What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery? Face it, this is BS. Everyone see's it and votes accordingly...", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:16:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery? I love the assumptions you make about me. Discrimination is Discrimination. One form is not \"ok\" just becuase another form of Discrimination was worse at somepoint in the past. the argument of \"its just not the same!\" is basically a temper tantrum because it's an inconvient comparision for you. but feel free to keep pushing for \"big government\" telling private citizens what they can and can't do when their actions hurt no one.", 
        "intTime": 20090514, 
        "postID": 52, 
        "quote": "What a silly non sequiter you bring up. You \"figure\" that since gays are not allowed to redefined Marriage as a union between a man and women, then obviously society as a whole is guilty of discrimination....Discrimination as violent, and appalling as say...slavery?", 
        "reply": " I love the assumptions you make about me. Discrimination is Discrimination. One form is not \"ok\" just becuase another form of Discrimination was worse at somepoint in the past. the argument of \"its just not the same!\" is basically a temper tantrum because it's an inconvient comparision for you. but feel free to keep pushing for \"big government\" telling private citizens what they can and can't do when their actions hurt no one.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:27:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared? One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club.", 
        "intTime": 20090514, 
        "postID": 53, 
        "quote": "Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared?", 
        "reply": " One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club.", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:50:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared? One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club. That is true for both parties. It's their way or the highway. Yo0u can not be a true democrat unless you believe in abortion (not the right to choose), bigger government, gay marraige, prosecuting ONLY republicans, etc. This is why I am independent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 54, 
        "quote": "Originally posted by thorin001: quote: Originally posted by jessmo24: I just read a TIMES article that went on and on about how the country is swinging to the left and how Conservative Rep need to go left. How can this be when in the very last election Americas Most populous state voted against gay marriage? Whats with the costant drum beat that Christians and traditionalists have dissapeared? One issue does not a conservative make. In fact, according to them, it seems that one must toe the party line on every issue to stay in the club.", 
        "reply": " That is true for both parties. It's their way or the highway. Yo0u can not be a true democrat unless you believe in abortion (not the right to choose), bigger government, gay marraige, prosecuting ONLY republicans, etc. This is why I am independent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8030062322001", 
        "time": "2009-05-14 09:56:00", 
        "title": "How is conservatism dead when CA just banned G*Y marriage?", 
        "userID": "L0A1"
    }
]