[
    {
        "content": "In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "", 
        "reply": "In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 13:38:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "intTime": 20090529, 
        "postID": 2, 
        "quote": "", 
        "reply": "I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:11:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in. I don't think they've snuffed out every last Hispanic vote, but they've likely snuffed out 99% percent of the Hispanic vote", 
        "intTime": 20090529, 
        "postID": 3, 
        "quote": "Originally posted by ProgMod: In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in.", 
        "reply": " I don't think they've snuffed out every last Hispanic vote, but they've likely snuffed out 99% percent of the Hispanic vote", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:17:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "intTime": 20090529, 
        "postID": 4, 
        "quote": "", 
        "reply": "This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:28:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion.", 
        "intTime": 20090529, 
        "postID": 5, 
        "quote": "Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "reply": " Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:45:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\".", 
        "intTime": 20090529, 
        "postID": 6, 
        "quote": "Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "reply": " So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\".", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:46:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\". IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "intTime": 20090529, 
        "postID": 7, 
        "quote": "Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\".", 
        "reply": " IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:58:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\". IRS...I despise tax and spend politics, but he was also a wrestler.. You must have loved the Bush administration.", 
        "intTime": 20090529, 
        "postID": 8, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\". IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "reply": " You must have loved the Bush administration.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:59:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting?? Why are neoconservatives so racist?", 
        "intTime": 20090529, 
        "postID": 9, 
        "quote": "Originally posted by Irwin_R_Schyster: I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "reply": " Why are neoconservatives so racist?", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 15:31:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: IRS...I despise tax and spend politics, but he was also a wrestler.. As opposed to \"borrow and spend\" politics? Like it or not, Bush left this country in a real craphole of a mess, and it's going to take a lot of work to get us out of it. Cuss as you may about Obama's stimulus package - but at this point it's likely the only thing that's kept us from becoming a third world economy. As to the tax side of it, I'd rather pay for it now than leave it as a burden for our kids and grandkids to pay off.", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "reply": " As opposed to \"borrow and spend\" politics? Like it or not, Bush left this country in a real craphole of a mess, and it's going to take a lot of work to get us out of it. Cuss as you may about Obama's stimulus package - but at this point it's likely the only thing that's kept us from becoming a third world economy. As to the tax side of it, I'd rather pay for it now than leave it as a burden for our kids and grandkids to pay off.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 06:02:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by skinman13: Why are neoconservatives so racist? When you point your finger, you have three pointing back at you. Additionally, he who smelt it, is usually the one who dealt it. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 11, 
        "quote": "Originally posted by skinman13: Why are neoconservatives so racist?", 
        "reply": " When you point your finger, you have three pointing back at you. Additionally, he who smelt it, is usually the one who dealt it. \"The World's Finest\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 06:48:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion. Well considering IRS is Hispanic, I think he does have a handle on things. I know I don't like it when folks try to talk for me and assume silly things like this. IMHO, it is race baiting and this Dem Administration is doing it at it's height. Before you start off ranting at me being a republicant, I am not, I am an independent, AMERICAN. For anyone to lump one ethnic group into a saying like this is discriminatory at the very least. It's equal to saying the only reason African Americans voted for Obama was because he was African American. This message has been edited. Last edited by: L0A1, Sat 30 May 2009 08:58 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 12, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion.", 
        "reply": " Well considering IRS is Hispanic, I think he does have a handle on things. I know I don't like it when folks try to talk for me and assume silly things like this. IMHO, it is race baiting and this Dem Administration is doing it at it's height. Before you start off ranting at me being a republicant, I am not, I am an independent, AMERICAN. For anyone to lump one ethnic group into a saying like this is discriminatory at the very least. It's equal to saying the only reason African Americans voted for Obama was because he was African American. This message has been edited. Last edited by: L0A1, Sat 30 May 2009 08:58 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 07:37:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090530, 
        "postID": 13, 
        "quote": "Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "reply": " Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 15:58:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\"", 
        "intTime": 20090530, 
        "postID": 14, 
        "quote": "", 
        "reply": "There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 17:40:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway.", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial.", 
        "reply": " Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 18:57:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "So if a candidate for whatever position is put forward, it's racism to look at past statements? PC running amuck.", 
        "intTime": 20090531, 
        "postID": 16, 
        "quote": "", 
        "reply": "So if a candidate for whatever position is put forward, it's racism to look at past statements? PC running amuck.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 07:46:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway. Roger that jdk. Fair enough. And I agree, it's not always easy for me to figure out where IRS is coming from. He started out as an ardent Obama supporter. One can only \"now\" wonder ....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090531, 
        "postID": 17, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway.", 
        "reply": " Roger that jdk. Fair enough. And I agree, it's not always easy for me to figure out where IRS is coming from. He started out as an ardent Obama supporter. One can only \"now\" wonder ....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 12:11:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by scooter_mech: There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\" Perhaps not, but the backlash in the South during the last two congressional elections (and of course in putting a Dem in the White House) will render the rantings about activism and 'beliefs' to be only so much blather. The Big Fat Liar in Chief said it during the Alito confirmation process--win an election or STFU. Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment. From the level of discourse I see lately, get used to it. \"Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment.\" \"From the level of discourse I see lately, get used to it.\" THANK YOU FOR NOT ONLY HITTING THE NAIL ON THE HEAD, BUT HITTING IT WITH A SLEDGE HAMMER!..... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090531, 
        "postID": 18, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by scooter_mech: There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\" Perhaps not, but the backlash in the South during the last two congressional elections (and of course in putting a Dem in the White House) will render the rantings about activism and 'beliefs' to be only so much blather. The Big Fat Liar in Chief said it during the Alito confirmation process--win an election or STFU. Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment. From the level of discourse I see lately, get used to it.", 
        "reply": " \"Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment.\" \"From the level of discourse I see lately, get used to it.\" THANK YOU FOR NOT ONLY HITTING THE NAIL ON THE HEAD, BUT HITTING IT WITH A SLEDGE HAMMER!..... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 12:18:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. \"Quis custodiet ipsos custodies\"", 
        "intTime": 20090531, 
        "postID": 19, 
        "quote": "", 
        "reply": "You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. \"Quis custodiet ipsos custodies\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 13:38:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Azurerepublic"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. I'm not so sure the GOP ever really had control of the 'racist Hispanic vote'. I don't think they've ever done so well with the Pro-Choice Pro Gun-Control Pro-Welfare Pro-Taxation Democrats either. Indeed. Might have to write those off too. The Horror, the horror! \"Quis custodiet ipsos custodies\"", 
        "intTime": 20090531, 
        "postID": 20, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. I'm not so sure the GOP ever really had control of the 'racist Hispanic vote'. I don't think they've ever done so well with the Pro-Choice Pro Gun-Control Pro-Welfare Pro-Taxation Democrats either.", 
        "reply": " Indeed. Might have to write those off too. The Horror, the horror! \"Quis custodiet ipsos custodies\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 13:52:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Azurerepublic"
    }, 
    {
        "content": "quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP...", 
        "intTime": 20090531, 
        "postID": 21, 
        "quote": "Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote.", 
        "reply": " Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP...", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 15:59:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP... I think he is talking about the Hispanics who just follow the liberal party line and view any republican as a racist. Hispanics like me despise tax and spend liberals, soft politicians who put our national security in danger, and naive statesmen who take from the rich to give to the poor in the hopes that problems will be solved... Liberals are the only people who tell me that I need a hand out to make it in America", 
        "intTime": 20090531, 
        "postID": 22, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP...", 
        "reply": " I think he is talking about the Hispanics who just follow the liberal party line and view any republican as a racist. Hispanics like me despise tax and spend liberals, soft politicians who put our national security in danger, and naive statesmen who take from the rich to give to the poor in the hopes that problems will be solved... Liberals are the only people who tell me that I need a hand out to make it in America", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 16:07:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090531, 
        "postID": 23, 
        "quote": "Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote.", 
        "reply": " No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 17:22:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by ProgMod: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. ...and if this is truly a center-right country, that observation explains a great deal about the results of the last two congressional elections. Funny how the conservative purists ignore the most important equation I can imagine to their bottom line: Number of Conservative/Repubs in Congress minus the number of Liberal/Dems in Congress equals the net effect on the personal wealth of said conservative. More dems than repubs provides a negative solution to this equation. Shunning impure voters simply makes the negative larger in the next election. I always knew those guys weren't that good at math. Well, Conservative Purists are ignoring A LOT OF THINGS these days....... IMHO, they will simply continue this trend. Tea parties with crumpets and signs displaying Mr. Obama as a nazi or communist will not help their cause, indeed, it will only exacerbate GOP ills. This is especially true when Tom Tancredo and his kind, use the KKK analogy. I see absolutely no reason for repubs to slow or stop these tactics, when especially their red neck base not only applauds them, but like wild animals in the Roman Colosseum, they shout for more, and more, and more. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090601, 
        "postID": 24, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by ProgMod: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. ...and if this is truly a center-right country, that observation explains a great deal about the results of the last two congressional elections. Funny how the conservative purists ignore the most important equation I can imagine to their bottom line: Number of Conservative/Repubs in Congress minus the number of Liberal/Dems in Congress equals the net effect on the personal wealth of said conservative. More dems than repubs provides a negative solution to this equation. Shunning impure voters simply makes the negative larger in the next election. I always knew those guys weren't that good at math.", 
        "reply": " Well, Conservative Purists are ignoring A LOT OF THINGS these days....... IMHO, they will simply continue this trend. Tea parties with crumpets and signs displaying Mr. Obama as a nazi or communist will not help their cause, indeed, it will only exacerbate GOP ills. This is especially true when Tom Tancredo and his kind, use the KKK analogy. I see absolutely no reason for repubs to slow or stop these tactics, when especially their red neck base not only applauds them, but like wild animals in the Roman Colosseum, they shout for more, and more, and more. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-06-01 04:17:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting?? you should voice your concerns on the GOP's Hispanic page. \"http://hispanics.gop.com/GroupPage.aspx?\"", 
        "intTime": 20090601, 
        "postID": 25, 
        "quote": "I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "reply": " you should voice your concerns on the GOP's Hispanic page. \"http://hispanics.gop.com/GroupPage.aspx?\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-06-01 04:37:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090529, 
        "postID": 26, 
        "quote": "", 
        "reply": "In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 13:38:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "intTime": 20090529, 
        "postID": 27, 
        "quote": "", 
        "reply": "I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:11:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in. I don't think they've snuffed out every last Hispanic vote, but they've likely snuffed out 99% percent of the Hispanic vote", 
        "intTime": 20090529, 
        "postID": 28, 
        "quote": "Originally posted by ProgMod: In lieu of Rush Limbaugh calling Supreme Court Nominee Judge Sonia Sotomayer a Racist, has the GOP snuffed the Hispanic Vote for Good? \"http://www.youtube.com/watch?v=ecKkQvjOPOk\" \"http://ricksanchez.blogs.cnn.com/\" Tom Tancredo also weighs in.", 
        "reply": " I don't think they've snuffed out every last Hispanic vote, but they've likely snuffed out 99% percent of the Hispanic vote", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:17:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "intTime": 20090529, 
        "postID": 29, 
        "quote": "", 
        "reply": "This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:28:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion.", 
        "intTime": 20090529, 
        "postID": 30, 
        "quote": "Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "reply": " Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:45:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\".", 
        "intTime": 20090529, 
        "postID": 31, 
        "quote": "Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "reply": " So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\".", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:46:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\". IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "intTime": 20090529, 
        "postID": 32, 
        "quote": "Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\".", 
        "reply": " IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:58:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\". IRS...I despise tax and spend politics, but he was also a wrestler.. You must have loved the Bush administration.", 
        "intTime": 20090529, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by 1WW: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... So, just for sh*ts and giggles -- where'd you come up with such a distinctive handle ... \"Irwin R. Schyster\". IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "reply": " You must have loved the Bush administration.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 14:59:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting?? Why are neoconservatives so racist?", 
        "intTime": 20090529, 
        "postID": 34, 
        "quote": "Originally posted by Irwin_R_Schyster: I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "reply": " Why are neoconservatives so racist?", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-29 15:31:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: IRS...I despise tax and spend politics, but he was also a wrestler.. As opposed to \"borrow and spend\" politics? Like it or not, Bush left this country in a real craphole of a mess, and it's going to take a lot of work to get us out of it. Cuss as you may about Obama's stimulus package - but at this point it's likely the only thing that's kept us from becoming a third world economy. As to the tax side of it, I'd rather pay for it now than leave it as a burden for our kids and grandkids to pay off.", 
        "intTime": 20090530, 
        "postID": 35, 
        "quote": "Originally posted by Irwin_R_Schyster: IRS...I despise tax and spend politics, but he was also a wrestler..", 
        "reply": " As opposed to \"borrow and spend\" politics? Like it or not, Bush left this country in a real craphole of a mess, and it's going to take a lot of work to get us out of it. Cuss as you may about Obama's stimulus package - but at this point it's likely the only thing that's kept us from becoming a third world economy. As to the tax side of it, I'd rather pay for it now than leave it as a burden for our kids and grandkids to pay off.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 06:02:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by skinman13: Why are neoconservatives so racist? When you point your finger, you have three pointing back at you. Additionally, he who smelt it, is usually the one who dealt it. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 36, 
        "quote": "Originally posted by skinman13: Why are neoconservatives so racist?", 
        "reply": " When you point your finger, you have three pointing back at you. Additionally, he who smelt it, is usually the one who dealt it. \"The World's Finest\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 06:48:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion. Well considering IRS is Hispanic, I think he does have a handle on things. I know I don't like it when folks try to talk for me and assume silly things like this. IMHO, it is race baiting and this Dem Administration is doing it at it's height. Before you start off ranting at me being a republicant, I am not, I am an independent, AMERICAN. For anyone to lump one ethnic group into a saying like this is discriminatory at the very least. It's equal to saying the only reason African Americans voted for Obama was because he was African American. This message has been edited. Last edited by: L0A1, Sat 30 May 2009 08:58 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 37, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Tough to see the big picture for you isn't it?? Step back, take a breath and really try hard to think about the implcations of what Limpdick has said. If you try really hard, you'll figure it out. Take a look at the demographics of the last election. Fuse that with the fact that this is the first Latina to be nominated to the supreme court, etc, etc. Keep in mind the history of the Republican Party. It's hardly perceived as the party of inclusion.", 
        "reply": " Well considering IRS is Hispanic, I think he does have a handle on things. I know I don't like it when folks try to talk for me and assume silly things like this. IMHO, it is race baiting and this Dem Administration is doing it at it's height. Before you start off ranting at me being a republicant, I am not, I am an independent, AMERICAN. For anyone to lump one ethnic group into a saying like this is discriminatory at the very least. It's equal to saying the only reason African Americans voted for Obama was because he was African American. This message has been edited. Last edited by: L0A1, Sat 30 May 2009 08:58 AM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 07:37:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090530, 
        "postID": 38, 
        "quote": "Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW...", 
        "reply": " Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 15:58:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\"", 
        "intTime": 20090530, 
        "postID": 39, 
        "quote": "", 
        "reply": "There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 17:40:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway.", 
        "intTime": 20090530, 
        "postID": 40, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial.", 
        "reply": " Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-30 18:57:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "So if a candidate for whatever position is put forward, it's racism to look at past statements? PC running amuck.", 
        "intTime": 20090531, 
        "postID": 41, 
        "quote": "", 
        "reply": "So if a candidate for whatever position is put forward, it's racism to look at past statements? PC running amuck.", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 07:46:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway. Roger that jdk. Fair enough. And I agree, it's not always easy for me to figure out where IRS is coming from. He started out as an ardent Obama supporter. One can only \"now\" wonder ....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090531, 
        "postID": 42, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by ProgMod: quote: Originally posted by Irwin_R_Schyster: This is one of the most offensive and condescending threads to date. The notion that Hispanics are so easily manipulated like cattle because a \"Newyorkrican\" is nominated to the Supreme court is nothing short of prejudice.. WOW... Just exactly what makes this thread the most offensive and condescending to date? No one in their right mind is saying anything about Hispanics being easily manipulated like cattle because of a native New Yorker being nominated to the Supreme Court, or infering it was prejudicial. Where did you come up with that one? Reverse argumentative tactics that have no bearing are often used when one cannot make a valid arguement. When carefully examining your \"Newyorkrican\" comment, one could assess that your comment is equally prejudicial. Not coming to his defense but Sotomayor referred to herself as a Newyorkrican. http://content.usatoday.com/communities/theoval/post/2009/05/67275855/1 Just as IRS is a self described Hispanic his intentions and comments are not always that clear, to me anyway.", 
        "reply": " Roger that jdk. Fair enough. And I agree, it's not always easy for me to figure out where IRS is coming from. He started out as an ardent Obama supporter. One can only \"now\" wonder ....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 12:11:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by scooter_mech: There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\" Perhaps not, but the backlash in the South during the last two congressional elections (and of course in putting a Dem in the White House) will render the rantings about activism and 'beliefs' to be only so much blather. The Big Fat Liar in Chief said it during the Alito confirmation process--win an election or STFU. Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment. From the level of discourse I see lately, get used to it. \"Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment.\" \"From the level of discourse I see lately, get used to it.\" THANK YOU FOR NOT ONLY HITTING THE NAIL ON THE HEAD, BUT HITTING IT WITH A SLEDGE HAMMER!..... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090531, 
        "postID": 43, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by scooter_mech: There is good reason to suspect that Ms Sotomayor is racist. Look at the quote in question again. She said... \"I would hope that a wise Latina woman with the richness of her experience would more often than not reach a better conclusion than a white male who hasn't lived that life.\" Now let's give it what I call the \"white man\" test. If you have a white male makeing a similar statement and it isn't racist, well, she's OK. Fair enough? I would hope that a white man man with the richness of his experience would more often than not reach a better conclusion than a [enter minority here] who hasn't lived that life.\" There is nothing about being Hispanic and/or female that disqualifies anyone from the court. But their beliefs certainly could. Did Lincoln \"snuff out\" the Southern white GOP vote \"for good?\" Perhaps not, but the backlash in the South during the last two congressional elections (and of course in putting a Dem in the White House) will render the rantings about activism and 'beliefs' to be only so much blather. The Big Fat Liar in Chief said it during the Alito confirmation process--win an election or STFU. Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment. From the level of discourse I see lately, get used to it.", 
        "reply": " \"Knock the process all you want, but the GOP pizzed off enough Americans this past 6 years that they have pretty well shut themselves out of any opportunity to even obstruct any Obama judicial appointment.\" \"From the level of discourse I see lately, get used to it.\" THANK YOU FOR NOT ONLY HITTING THE NAIL ON THE HEAD, BUT HITTING IT WITH A SLEDGE HAMMER!..... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 12:18:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. \"Quis custodiet ipsos custodies\"", 
        "intTime": 20090531, 
        "postID": 44, 
        "quote": "", 
        "reply": "You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. \"Quis custodiet ipsos custodies\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 13:38:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Azurerepublic"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. I'm not so sure the GOP ever really had control of the 'racist Hispanic vote'. I don't think they've ever done so well with the Pro-Choice Pro Gun-Control Pro-Welfare Pro-Taxation Democrats either. Indeed. Might have to write those off too. The Horror, the horror! \"Quis custodiet ipsos custodies\"", 
        "intTime": 20090531, 
        "postID": 45, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. I'm not so sure the GOP ever really had control of the 'racist Hispanic vote'. I don't think they've ever done so well with the Pro-Choice Pro Gun-Control Pro-Welfare Pro-Taxation Democrats either.", 
        "reply": " Indeed. Might have to write those off too. The Horror, the horror! \"Quis custodiet ipsos custodies\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 13:52:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Azurerepublic"
    }, 
    {
        "content": "quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP...", 
        "intTime": 20090531, 
        "postID": 46, 
        "quote": "Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote.", 
        "reply": " Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP...", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 15:59:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP... I think he is talking about the Hispanics who just follow the liberal party line and view any republican as a racist. Hispanics like me despise tax and spend liberals, soft politicians who put our national security in danger, and naive statesmen who take from the rich to give to the poor in the hopes that problems will be solved... Liberals are the only people who tell me that I need a hand out to make it in America", 
        "intTime": 20090531, 
        "postID": 47, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. Yes, but what about the \"racist\" Hispanics who are concerned that big government will tax them excessivly and take away their right to bear arms? Maybe, just maybe, they might vote GOP...", 
        "reply": " I think he is talking about the Hispanics who just follow the liberal party line and view any republican as a racist. Hispanics like me despise tax and spend liberals, soft politicians who put our national security in danger, and naive statesmen who take from the rich to give to the poor in the hopes that problems will be solved... Liberals are the only people who tell me that I need a hand out to make it in America", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 16:07:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090531, 
        "postID": 48, 
        "quote": "Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote.", 
        "reply": " No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-05-31 17:22:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by ProgMod: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. ...and if this is truly a center-right country, that observation explains a great deal about the results of the last two congressional elections. Funny how the conservative purists ignore the most important equation I can imagine to their bottom line: Number of Conservative/Repubs in Congress minus the number of Liberal/Dems in Congress equals the net effect on the personal wealth of said conservative. More dems than repubs provides a negative solution to this equation. Shunning impure voters simply makes the negative larger in the next election. I always knew those guys weren't that good at math. Well, Conservative Purists are ignoring A LOT OF THINGS these days....... IMHO, they will simply continue this trend. Tea parties with crumpets and signs displaying Mr. Obama as a nazi or communist will not help their cause, indeed, it will only exacerbate GOP ills. This is especially true when Tom Tancredo and his kind, use the KKK analogy. I see absolutely no reason for repubs to slow or stop these tactics, when especially their red neck base not only applauds them, but like wild animals in the Roman Colosseum, they shout for more, and more, and more. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090601, 
        "postID": 49, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by ProgMod: quote: Originally posted by Azurerepublic: You can only kiss the hispanic vote good bye if all hispanics are the same. But the racist hispanic vote, yeah, the GOP might be losing that vote. No one is saying that all Hispanics are the same. What some of us are simply saying is the GOP is losing Hispanic support which translates into votes. We saw that in the 2006 and 2008 elections. If those trends continue, and there is no reason to think that they won't, more Hispanics will be voting Democratic. I wouldn't go so far as to say that the GOP has lost 99% of the Hispanic vote, but that party has certainly lost over 50% of the Hispanic vote. When the GOP hate mongers such as Limbaugh and his likes make RACIST statements on radio/internet, constantly bashing President Obama, and Judge Sotomayer, it's not just Democrats who take notice of the negativism that is spewed. ...and if this is truly a center-right country, that observation explains a great deal about the results of the last two congressional elections. Funny how the conservative purists ignore the most important equation I can imagine to their bottom line: Number of Conservative/Repubs in Congress minus the number of Liberal/Dems in Congress equals the net effect on the personal wealth of said conservative. More dems than repubs provides a negative solution to this equation. Shunning impure voters simply makes the negative larger in the next election. I always knew those guys weren't that good at math.", 
        "reply": " Well, Conservative Purists are ignoring A LOT OF THINGS these days....... IMHO, they will simply continue this trend. Tea parties with crumpets and signs displaying Mr. Obama as a nazi or communist will not help their cause, indeed, it will only exacerbate GOP ills. This is especially true when Tom Tancredo and his kind, use the KKK analogy. I see absolutely no reason for repubs to slow or stop these tactics, when especially their red neck base not only applauds them, but like wild animals in the Roman Colosseum, they shout for more, and more, and more. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-06-01 04:17:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting?? you should voice your concerns on the GOP's Hispanic page. \"http://hispanics.gop.com/GroupPage.aspx?\"", 
        "intTime": 20090601, 
        "postID": 50, 
        "quote": "I thought every candidate was looking for the vote of any American... Why are liberals so obsessed with race baiting??", 
        "reply": " you should voice your concerns on the GOP's Hispanic page. \"http://hispanics.gop.com/GroupPage.aspx?\"", 
        "threadID": "409192893_1900026422001", 
        "time": "2009-06-01 04:37:00", 
        "title": "Has the GOP Snuffed the Hispanic Vote for Good?", 
        "userID": "karlhungusjr"
    }
]