[
    {
        "content": "Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 05:42:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Duster6"
    }, 
    {
        "content": "I do not know why ABC, NBC,CBS do not ask the tough questions. I don't think Meet the Press is as tough as it once was with Tim Russert but for me Glen Beck is absolutely the one news show I do watch regularly. He has the best people on and will ask tough questions and great followup. I know that he goofs around and gets emotional but for me it is worth it to see him grill people. His segment last week with a SPOKESMAN for ACORN was brilliant followed by a interview 2-3 nights later with 2 ladies on the board of ACORN airing their real problems with the national office and the direction ACORN is heading.", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "", 
        "reply": "I do not know why ABC, NBC,CBS do not ask the tough questions. I don't think Meet the Press is as tough as it once was with Tim Russert but for me Glen Beck is absolutely the one news show I do watch regularly. He has the best people on and will ask tough questions and great followup. I know that he goofs around and gets emotional but for me it is worth it to see him grill people. His segment last week with a SPOKESMAN for ACORN was brilliant followed by a interview 2-3 nights later with 2 ladies on the board of ACORN airing their real problems with the national office and the direction ACORN is heading.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 05:53:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "m1tom"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reports. I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "Originally posted by Duster6: Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "reply": " I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reports. I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:08:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "", 
        "reply": "Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:16:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:19:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head.", 
        "intTime": 20090511, 
        "postID": 6, 
        "quote": "Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "reply": " Very mature of you. Try again to make your point ****head.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "intTime": 20090511, 
        "postID": 7, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:24:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "intTime": 20090511, 
        "postID": 8, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:25:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answer) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insane. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "intTime": 20090511, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians.", 
        "reply": " Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answer) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insane. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? There was one example of a love fest between Olbermann and Matthews over Obama after one of his speeches during the primary, and it was quickly remedied by MSNBC by not using those two to host election speeches.", 
        "intTime": 20090511, 
        "postID": 11, 
        "quote": "Originally posted by WepsFP: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " There was one example of a love fest between Olbermann and Matthews over Obama after one of his speeches during the primary, and it was quickly remedied by MSNBC by not using those two to host election speeches.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:33:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "intTime": 20090511, 
        "postID": 12, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:38:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it. It appears that the \"peanut gallery\" is exploding.", 
        "intTime": 20090511, 
        "postID": 13, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "reply": " It appears that the \"peanut gallery\" is exploding.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:40:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Does it really matter anymore? The \"Big 3\", plus MSNBC, CNN, et al are getting hammered by FNC in the ratings daily. Then again, those networks are probably \"too big to fail\". \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 14, 
        "quote": "", 
        "reply": "Does it really matter anymore? The \"Big 3\", plus MSNBC, CNN, et al are getting hammered by FNC in the ratings daily. Then again, those networks are probably \"too big to fail\". \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:44:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head. You call me mature and ...head in the same post..ironic. Hope and change!", 
        "intTime": 20090511, 
        "postID": 15, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head.", 
        "reply": " You call me mature and ...head in the same post..ironic. Hope and change!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:00:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said. You cite a single repoter that asked a series of questions at a press conference as your evidence of a love fest? Try again. You're less than convincing.", 
        "intTime": 20090511, 
        "postID": 16, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "reply": " You cite a single repoter that asked a series of questions at a press conference as your evidence of a love fest? Try again. You're less than convincing.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:00:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Dont blame me if your hero turns out to be just another political hack. Dont blame me if your hero is just another Bush. I warned you. Its not your fault...blame the school system. Hahhahhaha.... Its not your fault.", 
        "intTime": 20090511, 
        "postID": 17, 
        "quote": "", 
        "reply": "Dont blame me if your hero turns out to be just another political hack. Dont blame me if your hero is just another Bush. I warned you. Its not your fault...blame the school system. Hahhahhaha.... Its not your fault.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:01:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "This is one reason! \"http://www.youtube.com/watch?v=KTkqosRiyYo\"", 
        "intTime": 20090511, 
        "postID": 18, 
        "quote": "", 
        "reply": "This is one reason! \"http://www.youtube.com/watch?v=KTkqosRiyYo\"", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:08:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah With the shuffling off of the scene by Teddy the \"K\" I think he did make his point!! WE HAVE A NEW WIZARD OF UH'S!!!!!", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "reply": " With the shuffling off of the scene by Teddy the \"K\" I think he did make his point!! WE HAVE A NEW WIZARD OF UH'S!!!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "reply": " Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:25:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Do the multiple orgasms of Meridith Viera and Matt Laur, immediately after the election every time Pres. Obama's name was mentioned count?? We coined a new term thanks to them!! OBASMS!! Man, there's one news show I wish I had the towel consession for!!!!", 
        "intTime": 20090511, 
        "postID": 21, 
        "quote": "Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " Do the multiple orgasms of Meridith Viera and Matt Laur, immediately after the election every time Pres. Obama's name was mentioned count?? We coined a new term thanks to them!! OBASMS!! Man, there's one news show I wish I had the towel consession for!!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:26:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Let me guess...is it because that's all they have? No, wait, I know, the DNC hasn't finished their new Talking Points book yet? I mean how many of these clowns can come up with their own material?", 
        "intTime": 20090511, 
        "postID": 22, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Let me guess...is it because that's all they have? No, wait, I know, the DNC hasn't finished their new Talking Points book yet? I mean how many of these clowns can come up with their own material?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Why I will always watch FOX: during the Hilton/Prejean controversy, though it centered on her response to Hilton's question, Fox always ran the story with file video of Ms Prejean in the swimsuit competiton. so though the story centered on the Q&A, Fox also covered the T&A... God bless you, FOX, keep up the good work.", 
        "intTime": 20090511, 
        "postID": 23, 
        "quote": "", 
        "reply": "Why I will always watch FOX: during the Hilton/Prejean controversy, though it centered on her response to Hilton's question, Fox always ran the story with file video of Ms Prejean in the swimsuit competiton. so though the story centered on the Q&A, Fox also covered the T&A... God bless you, FOX, keep up the good work.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:41:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left. Envy??? Nah. I just realize the aforementioned guys make their money convincing hard working Americans to stand against their own best interests. They are very good at what they do. They get richer while the middle class loses purchasing power and they convince the middle class that Bush had it right and Obama is hosed. Amazing!!!", 
        "intTime": 20090511, 
        "postID": 24, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "reply": " Envy??? Nah. I just realize the aforementioned guys make their money convincing hard working Americans to stand against their own best interests. They are very good at what they do. They get richer while the middle class loses purchasing power and they convince the middle class that Bush had it right and Obama is hosed. Amazing!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:10:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "The reason the middle class continues to lose purchasing power is because we keep putting our faith in moving stack of currency around like the pieces in some elaborate shell game, while ignoring productivity. raise productivity and you'll raise purchasing power.", 
        "intTime": 20090511, 
        "postID": 25, 
        "quote": "", 
        "reply": "The reason the middle class continues to lose purchasing power is because we keep putting our faith in moving stack of currency around like the pieces in some elaborate shell game, while ignoring productivity. raise productivity and you'll raise purchasing power.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:15:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?... Calling that event a \"press conference\" is a bit of a stretch. Disgustingly sycophantic \"news\" reporters like Jeff Zeleny lining up to kiss B.O.'s posterior with such questions as what Barry has found most \"enchanting\" in his first 100 days is an important \"news conference\" worthy of airing on every single channel? I don't think so. Of course you're a fiercely dedicated Obamaphile, so I'm sure you loved this propaganda event, witchy. They aired it on Fox News Channel, and lost millions of dollars in revenue by doing so. There was no reason whatsoever to air it on their entertainment channel as well.", 
        "intTime": 20090511, 
        "postID": 26, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?...", 
        "reply": " Calling that event a \"press conference\" is a bit of a stretch. Disgustingly sycophantic \"news\" reporters like Jeff Zeleny lining up to kiss B.O.'s posterior with such questions as what Barry has found most \"enchanting\" in his first 100 days is an important \"news conference\" worthy of airing on every single channel? I don't think so. Of course you're a fiercely dedicated Obamaphile, so I'm sure you loved this propaganda event, witchy. They aired it on Fox News Channel, and lost millions of dollars in revenue by doing so. There was no reason whatsoever to air it on their entertainment channel as well.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN", 
        "intTime": 20090511, 
        "postID": 27, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking.", 
        "reply": " At least try to be a little intellectuly honest. GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:33:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?Why is he afraid of the FNC reporters? Bush answered questions from \"all news reporters\"? You are really going to go with that? I know you're gay and all, but Im sure you get a little \"hot\" when you watch PO speak. Watch it, he may turn you straight GRAYMAN", 
        "intTime": 20090511, 
        "postID": 28, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?Why is he afraid of the FNC reporters? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " I know you're gay and all, but Im sure you get a little \"hot\" when you watch PO speak. Watch it, he may turn you straight GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:37:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN The post was about Fox. The response concentrated on Fox. Get it??", 
        "intTime": 20090511, 
        "postID": 29, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN", 
        "reply": " The post was about Fox. The response concentrated on Fox. Get it??", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:44:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answerIn your eyes its thoughtful, but you forget he's a poltician, just like Bush, Clinton and Reagan) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insaneYou're a medical doctor now? Wow, and here I thought you were just some dum hack that cant see straight at all. Cool.. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism! Where in the he11 have you been for the last 8 years? This is what I mean by people not being honest with themselves. Bush, who I am no big fan of, got hammered every fricking night by your \"honest\" outlets for every stupid thing he said and done, but when it comes to BO, he gets a fricking pass. You sit there and defend this man when he hasnt done much other than saddle my children and their children with a debt that can never be paid off. If your company that packages eggs keeps breaking eggs, do you,as the owner, break more eggs in the hopes that it'll get better? Dont you see how frickin stupid of an idea that PO, along with the dem's, have? PO is going to say whatever it takes to appease the likes of you, weps and Seawitch to make you happy and feel comfy with the idea that you elected a schmuck for a President. The MSM promoted the idea that Bush was an idiot, but he was smart enough to pull the wools over everyones eyes on everything that he did. The MSM promotes, as evidenced by the dam near orgasms on election night, that PO is the best thing since apple pie. Get real and open your eyes people. GRAYMAN", 
        "intTime": 20090511, 
        "postID": 30, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answerIn your eyes its thoughtful, but you forget he's a poltician, just like Bush, Clinton and Reagan) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insaneYou're a medical doctor now? Wow, and here I thought you were just some dum hack that cant see straight at all. Cool.. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "reply": " Where in the he11 have you been for the last 8 years? This is what I mean by people not being honest with themselves. Bush, who I am no big fan of, got hammered every fricking night by your \"honest\" outlets for every stupid thing he said and done, but when it comes to BO, he gets a fricking pass. You sit there and defend this man when he hasnt done much other than saddle my children and their children with a debt that can never be paid off. If your company that packages eggs keeps breaking eggs, do you,as the owner, break more eggs in the hopes that it'll get better? Dont you see how frickin stupid of an idea that PO, along with the dem's, have? PO is going to say whatever it takes to appease the likes of you, weps and Seawitch to make you happy and feel comfy with the idea that you elected a schmuck for a President. The MSM promoted the idea that Bush was an idiot, but he was smart enough to pull the wools over everyones eyes on everything that he did. The MSM promotes, as evidenced by the dam near orgasms on election night, that PO is the best thing since apple pie. Get real and open your eyes people. GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:52:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "intTime": 20090511, 
        "postID": 31, 
        "quote": "", 
        "reply": "Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 05:42:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Duster6"
    }, 
    {
        "content": "I do not know why ABC, NBC,CBS do not ask the tough questions. I don't think Meet the Press is as tough as it once was with Tim Russert but for me Glen Beck is absolutely the one news show I do watch regularly. He has the best people on and will ask tough questions and great followup. I know that he goofs around and gets emotional but for me it is worth it to see him grill people. His segment last week with a SPOKESMAN for ACORN was brilliant followed by a interview 2-3 nights later with 2 ladies on the board of ACORN airing their real problems with the national office and the direction ACORN is heading.", 
        "intTime": 20090511, 
        "postID": 32, 
        "quote": "", 
        "reply": "I do not know why ABC, NBC,CBS do not ask the tough questions. I don't think Meet the Press is as tough as it once was with Tim Russert but for me Glen Beck is absolutely the one news show I do watch regularly. He has the best people on and will ask tough questions and great followup. I know that he goofs around and gets emotional but for me it is worth it to see him grill people. His segment last week with a SPOKESMAN for ACORN was brilliant followed by a interview 2-3 nights later with 2 ladies on the board of ACORN airing their real problems with the national office and the direction ACORN is heading.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 05:53:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "m1tom"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reports. I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "intTime": 20090511, 
        "postID": 33, 
        "quote": "Originally posted by Duster6: Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "reply": " I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reports. I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:08:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "intTime": 20090511, 
        "postID": 34, 
        "quote": "", 
        "reply": "Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:16:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "intTime": 20090511, 
        "postID": 35, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:19:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head.", 
        "intTime": 20090511, 
        "postID": 36, 
        "quote": "Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "reply": " Very mature of you. Try again to make your point ****head.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "intTime": 20090511, 
        "postID": 37, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:24:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "intTime": 20090511, 
        "postID": 38, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:25:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "intTime": 20090511, 
        "postID": 39, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answer) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insane. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "intTime": 20090511, 
        "postID": 40, 
        "quote": "Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians.", 
        "reply": " Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answer) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insane. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? There was one example of a love fest between Olbermann and Matthews over Obama after one of his speeches during the primary, and it was quickly remedied by MSNBC by not using those two to host election speeches.", 
        "intTime": 20090511, 
        "postID": 41, 
        "quote": "Originally posted by WepsFP: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " There was one example of a love fest between Olbermann and Matthews over Obama after one of his speeches during the primary, and it was quickly remedied by MSNBC by not using those two to host election speeches.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:33:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "intTime": 20090511, 
        "postID": 42, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:38:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it. It appears that the \"peanut gallery\" is exploding.", 
        "intTime": 20090511, 
        "postID": 43, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "reply": " It appears that the \"peanut gallery\" is exploding.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:40:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Does it really matter anymore? The \"Big 3\", plus MSNBC, CNN, et al are getting hammered by FNC in the ratings daily. Then again, those networks are probably \"too big to fail\". \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 44, 
        "quote": "", 
        "reply": "Does it really matter anymore? The \"Big 3\", plus MSNBC, CNN, et al are getting hammered by FNC in the ratings daily. Then again, those networks are probably \"too big to fail\". \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:44:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head. You call me mature and ...head in the same post..ironic. Hope and change!", 
        "intTime": 20090511, 
        "postID": 45, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head.", 
        "reply": " You call me mature and ...head in the same post..ironic. Hope and change!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:00:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said. You cite a single repoter that asked a series of questions at a press conference as your evidence of a love fest? Try again. You're less than convincing.", 
        "intTime": 20090511, 
        "postID": 46, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "reply": " You cite a single repoter that asked a series of questions at a press conference as your evidence of a love fest? Try again. You're less than convincing.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:00:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Dont blame me if your hero turns out to be just another political hack. Dont blame me if your hero is just another Bush. I warned you. Its not your fault...blame the school system. Hahhahhaha.... Its not your fault.", 
        "intTime": 20090511, 
        "postID": 47, 
        "quote": "", 
        "reply": "Dont blame me if your hero turns out to be just another political hack. Dont blame me if your hero is just another Bush. I warned you. Its not your fault...blame the school system. Hahhahhaha.... Its not your fault.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:01:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "This is one reason! \"http://www.youtube.com/watch?v=KTkqosRiyYo\"", 
        "intTime": 20090511, 
        "postID": 48, 
        "quote": "", 
        "reply": "This is one reason! \"http://www.youtube.com/watch?v=KTkqosRiyYo\"", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:08:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah With the shuffling off of the scene by Teddy the \"K\" I think he did make his point!! WE HAVE A NEW WIZARD OF UH'S!!!!!", 
        "intTime": 20090511, 
        "postID": 49, 
        "quote": "Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "reply": " With the shuffling off of the scene by Teddy the \"K\" I think he did make his point!! WE HAVE A NEW WIZARD OF UH'S!!!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "intTime": 20090511, 
        "postID": 50, 
        "quote": "Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "reply": " Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:25:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Do the multiple orgasms of Meridith Viera and Matt Laur, immediately after the election every time Pres. Obama's name was mentioned count?? We coined a new term thanks to them!! OBASMS!! Man, there's one news show I wish I had the towel consession for!!!!", 
        "intTime": 20090511, 
        "postID": 51, 
        "quote": "Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " Do the multiple orgasms of Meridith Viera and Matt Laur, immediately after the election every time Pres. Obama's name was mentioned count?? We coined a new term thanks to them!! OBASMS!! Man, there's one news show I wish I had the towel consession for!!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:26:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Let me guess...is it because that's all they have? No, wait, I know, the DNC hasn't finished their new Talking Points book yet? I mean how many of these clowns can come up with their own material?", 
        "intTime": 20090511, 
        "postID": 52, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Let me guess...is it because that's all they have? No, wait, I know, the DNC hasn't finished their new Talking Points book yet? I mean how many of these clowns can come up with their own material?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Why I will always watch FOX: during the Hilton/Prejean controversy, though it centered on her response to Hilton's question, Fox always ran the story with file video of Ms Prejean in the swimsuit competiton. so though the story centered on the Q&A, Fox also covered the T&A... God bless you, FOX, keep up the good work.", 
        "intTime": 20090511, 
        "postID": 53, 
        "quote": "", 
        "reply": "Why I will always watch FOX: during the Hilton/Prejean controversy, though it centered on her response to Hilton's question, Fox always ran the story with file video of Ms Prejean in the swimsuit competiton. so though the story centered on the Q&A, Fox also covered the T&A... God bless you, FOX, keep up the good work.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:41:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left. Envy??? Nah. I just realize the aforementioned guys make their money convincing hard working Americans to stand against their own best interests. They are very good at what they do. They get richer while the middle class loses purchasing power and they convince the middle class that Bush had it right and Obama is hosed. Amazing!!!", 
        "intTime": 20090511, 
        "postID": 54, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "reply": " Envy??? Nah. I just realize the aforementioned guys make their money convincing hard working Americans to stand against their own best interests. They are very good at what they do. They get richer while the middle class loses purchasing power and they convince the middle class that Bush had it right and Obama is hosed. Amazing!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:10:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "The reason the middle class continues to lose purchasing power is because we keep putting our faith in moving stack of currency around like the pieces in some elaborate shell game, while ignoring productivity. raise productivity and you'll raise purchasing power.", 
        "intTime": 20090511, 
        "postID": 55, 
        "quote": "", 
        "reply": "The reason the middle class continues to lose purchasing power is because we keep putting our faith in moving stack of currency around like the pieces in some elaborate shell game, while ignoring productivity. raise productivity and you'll raise purchasing power.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:15:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?... Calling that event a \"press conference\" is a bit of a stretch. Disgustingly sycophantic \"news\" reporters like Jeff Zeleny lining up to kiss B.O.'s posterior with such questions as what Barry has found most \"enchanting\" in his first 100 days is an important \"news conference\" worthy of airing on every single channel? I don't think so. Of course you're a fiercely dedicated Obamaphile, so I'm sure you loved this propaganda event, witchy. They aired it on Fox News Channel, and lost millions of dollars in revenue by doing so. There was no reason whatsoever to air it on their entertainment channel as well.", 
        "intTime": 20090511, 
        "postID": 56, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?...", 
        "reply": " Calling that event a \"press conference\" is a bit of a stretch. Disgustingly sycophantic \"news\" reporters like Jeff Zeleny lining up to kiss B.O.'s posterior with such questions as what Barry has found most \"enchanting\" in his first 100 days is an important \"news conference\" worthy of airing on every single channel? I don't think so. Of course you're a fiercely dedicated Obamaphile, so I'm sure you loved this propaganda event, witchy. They aired it on Fox News Channel, and lost millions of dollars in revenue by doing so. There was no reason whatsoever to air it on their entertainment channel as well.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN", 
        "intTime": 20090511, 
        "postID": 57, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking.", 
        "reply": " At least try to be a little intellectuly honest. GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:33:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?Why is he afraid of the FNC reporters? Bush answered questions from \"all news reporters\"? You are really going to go with that? I know you're gay and all, but Im sure you get a little \"hot\" when you watch PO speak. Watch it, he may turn you straight GRAYMAN", 
        "intTime": 20090511, 
        "postID": 58, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?Why is he afraid of the FNC reporters? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " I know you're gay and all, but Im sure you get a little \"hot\" when you watch PO speak. Watch it, he may turn you straight GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:37:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN The post was about Fox. The response concentrated on Fox. Get it??", 
        "intTime": 20090511, 
        "postID": 59, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN", 
        "reply": " The post was about Fox. The response concentrated on Fox. Get it??", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:44:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answerIn your eyes its thoughtful, but you forget he's a poltician, just like Bush, Clinton and Reagan) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insaneYou're a medical doctor now? Wow, and here I thought you were just some dum hack that cant see straight at all. Cool.. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism! Where in the he11 have you been for the last 8 years? This is what I mean by people not being honest with themselves. Bush, who I am no big fan of, got hammered every fricking night by your \"honest\" outlets for every stupid thing he said and done, but when it comes to BO, he gets a fricking pass. You sit there and defend this man when he hasnt done much other than saddle my children and their children with a debt that can never be paid off. If your company that packages eggs keeps breaking eggs, do you,as the owner, break more eggs in the hopes that it'll get better? Dont you see how frickin stupid of an idea that PO, along with the dem's, have? PO is going to say whatever it takes to appease the likes of you, weps and Seawitch to make you happy and feel comfy with the idea that you elected a schmuck for a President. The MSM promoted the idea that Bush was an idiot, but he was smart enough to pull the wools over everyones eyes on everything that he did. The MSM promotes, as evidenced by the dam near orgasms on election night, that PO is the best thing since apple pie. Get real and open your eyes people. GRAYMAN", 
        "intTime": 20090511, 
        "postID": 60, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answerIn your eyes its thoughtful, but you forget he's a poltician, just like Bush, Clinton and Reagan) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insaneYou're a medical doctor now? Wow, and here I thought you were just some dum hack that cant see straight at all. Cool.. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "reply": " Where in the he11 have you been for the last 8 years? This is what I mean by people not being honest with themselves. Bush, who I am no big fan of, got hammered every fricking night by your \"honest\" outlets for every stupid thing he said and done, but when it comes to BO, he gets a fricking pass. You sit there and defend this man when he hasnt done much other than saddle my children and their children with a debt that can never be paid off. If your company that packages eggs keeps breaking eggs, do you,as the owner, break more eggs in the hopes that it'll get better? Dont you see how frickin stupid of an idea that PO, along with the dem's, have? PO is going to say whatever it takes to appease the likes of you, weps and Seawitch to make you happy and feel comfy with the idea that you elected a schmuck for a President. The MSM promoted the idea that Bush was an idiot, but he was smart enough to pull the wools over everyones eyes on everything that he did. The MSM promotes, as evidenced by the dam near orgasms on election night, that PO is the best thing since apple pie. Get real and open your eyes people. GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:52:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "intTime": 20090511, 
        "postID": 61, 
        "quote": "", 
        "reply": "Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 05:42:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Duster6"
    }, 
    {
        "content": "I do not know why ABC, NBC,CBS do not ask the tough questions. I don't think Meet the Press is as tough as it once was with Tim Russert but for me Glen Beck is absolutely the one news show I do watch regularly. He has the best people on and will ask tough questions and great followup. I know that he goofs around and gets emotional but for me it is worth it to see him grill people. His segment last week with a SPOKESMAN for ACORN was brilliant followed by a interview 2-3 nights later with 2 ladies on the board of ACORN airing their real problems with the national office and the direction ACORN is heading.", 
        "intTime": 20090511, 
        "postID": 62, 
        "quote": "", 
        "reply": "I do not know why ABC, NBC,CBS do not ask the tough questions. I don't think Meet the Press is as tough as it once was with Tim Russert but for me Glen Beck is absolutely the one news show I do watch regularly. He has the best people on and will ask tough questions and great followup. I know that he goofs around and gets emotional but for me it is worth it to see him grill people. His segment last week with a SPOKESMAN for ACORN was brilliant followed by a interview 2-3 nights later with 2 ladies on the board of ACORN airing their real problems with the national office and the direction ACORN is heading.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 05:53:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "m1tom"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reports. I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "intTime": 20090511, 
        "postID": 63, 
        "quote": "Originally posted by Duster6: Did you notice when Bush was in office that he talked to all news reporters big and small? But why doesn't Obama, Pelosi, Reid, and others? Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Another thing I have noticed is that Fox news investigates wrong doing more than other news stations. Oh sure I watch 20/20 and dateline but mostly they are entertainment stories or crime scenarios. Just for a week try watching the Glenn Beck news show and listen to what he has to say. I know he likes to kid around most of the time but notice what he says is never rebuked by the democrats. I wonder why? Another example of Fox news being a thorn in the side of the democratic party is when they kept showing the fly over by Air Force One. The man responsible resigned over it. It was stupid but NBC, ABC, and CBS covered it and let it go. Not Fox. They keep at it until someone is held accountable. That I like and that is why they are the best news team out their IMO.", 
        "reply": " I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reports. I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:08:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "intTime": 20090511, 
        "postID": 64, 
        "quote": "", 
        "reply": "Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:16:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "intTime": 20090511, 
        "postID": 65, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:19:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head.", 
        "intTime": 20090511, 
        "postID": 66, 
        "quote": "Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "reply": " Very mature of you. Try again to make your point ****head.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "intTime": 20090511, 
        "postID": 67, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:24:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "intTime": 20090511, 
        "postID": 68, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:25:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "intTime": 20090511, 
        "postID": 69, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answer) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insane. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "intTime": 20090511, 
        "postID": 70, 
        "quote": "Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians.", 
        "reply": " Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answer) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insane. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? There was one example of a love fest between Olbermann and Matthews over Obama after one of his speeches during the primary, and it was quickly remedied by MSNBC by not using those two to host election speeches.", 
        "intTime": 20090511, 
        "postID": 71, 
        "quote": "Originally posted by WepsFP: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " There was one example of a love fest between Olbermann and Matthews over Obama after one of his speeches during the primary, and it was quickly remedied by MSNBC by not using those two to host election speeches.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:33:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "intTime": 20090511, 
        "postID": 72, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:38:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it. It appears that the \"peanut gallery\" is exploding.", 
        "intTime": 20090511, 
        "postID": 73, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Here is the first line of the OP: Did you notice when Bush was in office that he talked to all news reporters big and small? . I responded to a post. Get over it.", 
        "reply": " It appears that the \"peanut gallery\" is exploding.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:40:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Does it really matter anymore? The \"Big 3\", plus MSNBC, CNN, et al are getting hammered by FNC in the ratings daily. Then again, those networks are probably \"too big to fail\". \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 74, 
        "quote": "", 
        "reply": "Does it really matter anymore? The \"Big 3\", plus MSNBC, CNN, et al are getting hammered by FNC in the ratings daily. Then again, those networks are probably \"too big to fail\". \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 06:44:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head. You call me mature and ...head in the same post..ironic. Hope and change!", 
        "intTime": 20090511, 
        "postID": 75, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah Very mature of you. Try again to make your point ****head.", 
        "reply": " You call me mature and ...head in the same post..ironic. Hope and change!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:00:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said. You cite a single repoter that asked a series of questions at a press conference as your evidence of a love fest? Try again. You're less than convincing.", 
        "intTime": 20090511, 
        "postID": 76, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Maybe because the opening post made a referance to Bush and provided a comparison between Obama and Bush. Stupid question adminnco1. Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Considering the source I will take your comment as a compliment. In response to your question, the \"enchanted\" question says all the need be said.", 
        "reply": " You cite a single repoter that asked a series of questions at a press conference as your evidence of a love fest? Try again. You're less than convincing.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:00:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "Dont blame me if your hero turns out to be just another political hack. Dont blame me if your hero is just another Bush. I warned you. Its not your fault...blame the school system. Hahhahhaha.... Its not your fault.", 
        "intTime": 20090511, 
        "postID": 77, 
        "quote": "", 
        "reply": "Dont blame me if your hero turns out to be just another political hack. Dont blame me if your hero is just another Bush. I warned you. Its not your fault...blame the school system. Hahhahhaha.... Its not your fault.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 07:01:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "threerings"
    }, 
    {
        "content": "This is one reason! \"http://www.youtube.com/watch?v=KTkqosRiyYo\"", 
        "intTime": 20090511, 
        "postID": 78, 
        "quote": "", 
        "reply": "This is one reason! \"http://www.youtube.com/watch?v=KTkqosRiyYo\"", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:08:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah With the shuffling off of the scene by Teddy the \"K\" I think he did make his point!! WE HAVE A NEW WIZARD OF UH'S!!!!!", 
        "intTime": 20090511, 
        "postID": 79, 
        "quote": "Quick is this Bush or Obama: humm umm err ahh...umm... hope and change...umm err...ahhh...e-e-e-e-...ah", 
        "reply": " With the shuffling off of the scene by Teddy the \"K\" I think he did make his point!! WE HAVE A NEW WIZARD OF UH'S!!!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "intTime": 20090511, 
        "postID": 80, 
        "quote": "Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.", 
        "reply": " Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:25:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples?? Do the multiple orgasms of Meridith Viera and Matt Laur, immediately after the election every time Pres. Obama's name was mentioned count?? We coined a new term thanks to them!! OBASMS!! Man, there's one news show I wish I had the towel consession for!!!!", 
        "intTime": 20090511, 
        "postID": 81, 
        "quote": "Love fest? Do you actually watch other news outlets besides Fox? Can you provide some \"love fest\" examples??", 
        "reply": " Do the multiple orgasms of Meridith Viera and Matt Laur, immediately after the election every time Pres. Obama's name was mentioned count?? We coined a new term thanks to them!! OBASMS!! Man, there's one news show I wish I had the towel consession for!!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:26:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush? Let me guess...is it because that's all they have? No, wait, I know, the DNC hasn't finished their new Talking Points book yet? I mean how many of these clowns can come up with their own material?", 
        "intTime": 20090511, 
        "postID": 82, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference love fest on their network? Bush answered questions from \"all news reporters\"? You are really going to go with that? Corrected for accuracy. Also, why does every response require a reference to Bush?", 
        "reply": " Let me guess...is it because that's all they have? No, wait, I know, the DNC hasn't finished their new Talking Points book yet? I mean how many of these clowns can come up with their own material?", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:28:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Why I will always watch FOX: during the Hilton/Prejean controversy, though it centered on her response to Hilton's question, Fox always ran the story with file video of Ms Prejean in the swimsuit competiton. so though the story centered on the Q&A, Fox also covered the T&A... God bless you, FOX, keep up the good work.", 
        "intTime": 20090511, 
        "postID": 83, 
        "quote": "", 
        "reply": "Why I will always watch FOX: during the Hilton/Prejean controversy, though it centered on her response to Hilton's question, Fox always ran the story with file video of Ms Prejean in the swimsuit competiton. so though the story centered on the Q&A, Fox also covered the T&A... God bless you, FOX, keep up the good work.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 08:41:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left. Envy??? Nah. I just realize the aforementioned guys make their money convincing hard working Americans to stand against their own best interests. They are very good at what they do. They get richer while the middle class loses purchasing power and they convince the middle class that Bush had it right and Obama is hosed. Amazing!!!", 
        "intTime": 20090511, 
        "postID": 84, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by WepsFP: You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart. Aha! Now your views become clear....\"rich ********'s\" indeed! This little gem certainly tells the tale. Class envy raises it's ugly head once again on the left.", 
        "reply": " Envy??? Nah. I just realize the aforementioned guys make their money convincing hard working Americans to stand against their own best interests. They are very good at what they do. They get richer while the middle class loses purchasing power and they convince the middle class that Bush had it right and Obama is hosed. Amazing!!!", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:10:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "The reason the middle class continues to lose purchasing power is because we keep putting our faith in moving stack of currency around like the pieces in some elaborate shell game, while ignoring productivity. raise productivity and you'll raise purchasing power.", 
        "intTime": 20090511, 
        "postID": 85, 
        "quote": "", 
        "reply": "The reason the middle class continues to lose purchasing power is because we keep putting our faith in moving stack of currency around like the pieces in some elaborate shell game, while ignoring productivity. raise productivity and you'll raise purchasing power.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:15:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "godawgz"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?... Calling that event a \"press conference\" is a bit of a stretch. Disgustingly sycophantic \"news\" reporters like Jeff Zeleny lining up to kiss B.O.'s posterior with such questions as what Barry has found most \"enchanting\" in his first 100 days is an important \"news conference\" worthy of airing on every single channel? I don't think so. Of course you're a fiercely dedicated Obamaphile, so I'm sure you loved this propaganda event, witchy. They aired it on Fox News Channel, and lost millions of dollars in revenue by doing so. There was no reason whatsoever to air it on their entertainment channel as well.", 
        "intTime": 20090511, 
        "postID": 86, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?...", 
        "reply": " Calling that event a \"press conference\" is a bit of a stretch. Disgustingly sycophantic \"news\" reporters like Jeff Zeleny lining up to kiss B.O.'s posterior with such questions as what Barry has found most \"enchanting\" in his first 100 days is an important \"news conference\" worthy of airing on every single channel? I don't think so. Of course you're a fiercely dedicated Obamaphile, so I'm sure you loved this propaganda event, witchy. They aired it on Fox News Channel, and lost millions of dollars in revenue by doing so. There was no reason whatsoever to air it on their entertainment channel as well.", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:23:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN", 
        "intTime": 20090511, 
        "postID": 87, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking.", 
        "reply": " At least try to be a little intellectuly honest. GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:33:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?Why is he afraid of the FNC reporters? Bush answered questions from \"all news reporters\"? You are really going to go with that? I know you're gay and all, but Im sure you get a little \"hot\" when you watch PO speak. Watch it, he may turn you straight GRAYMAN", 
        "intTime": 20090511, 
        "postID": 88, 
        "quote": "Originally posted by SeaWitch1220: Why should the President answer questions from Fox when they didn't air his press conference on their network?Why is he afraid of the FNC reporters? Bush answered questions from \"all news reporters\"? You are really going to go with that?", 
        "reply": " I know you're gay and all, but Im sure you get a little \"hot\" when you watch PO speak. Watch it, he may turn you straight GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:37:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN The post was about Fox. The response concentrated on Fox. Get it??", 
        "intTime": 20090511, 
        "postID": 89, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: -SNIP-. I disagree with this entire post. I don't think Democrats intentionally avoid Fox News Reporters, but there is clearly a bias with Fox reportsand there isnt with the other media outlets? Really? You cant even be honest with yourself. . I suppose if Dems wanted every answer they provide twisted, Fox would be the News Organization to turn to. Sometimes.......most times, the world is gray and black and white (yes and no) answers just don't serve. You can have Beck, Hannity and O'Reilly. I'm sure those rich *******s have the best interest of the middle class at heart.Ah, you are just jealous. Why didnt you comment on the MSNBC hacks Oberman and that one chick that im sure those rich ******s have the best interest of the middle class at heart. You're slacking. At least try to be a little intellectuly honest. GRAYMAN", 
        "reply": " The post was about Fox. The response concentrated on Fox. Get it??", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:44:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answerIn your eyes its thoughtful, but you forget he's a poltician, just like Bush, Clinton and Reagan) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insaneYou're a medical doctor now? Wow, and here I thought you were just some dum hack that cant see straight at all. Cool.. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism! Where in the he11 have you been for the last 8 years? This is what I mean by people not being honest with themselves. Bush, who I am no big fan of, got hammered every fricking night by your \"honest\" outlets for every stupid thing he said and done, but when it comes to BO, he gets a fricking pass. You sit there and defend this man when he hasnt done much other than saddle my children and their children with a debt that can never be paid off. If your company that packages eggs keeps breaking eggs, do you,as the owner, break more eggs in the hopes that it'll get better? Dont you see how frickin stupid of an idea that PO, along with the dem's, have? PO is going to say whatever it takes to appease the likes of you, weps and Seawitch to make you happy and feel comfy with the idea that you elected a schmuck for a President. The MSM promoted the idea that Bush was an idiot, but he was smart enough to pull the wools over everyones eyes on everything that he did. The MSM promotes, as evidenced by the dam near orgasms on election night, that PO is the best thing since apple pie. Get real and open your eyes people. GRAYMAN", 
        "intTime": 20090511, 
        "postID": 90, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Duster6: Now I expect the peanut gallery to explode but one thing I have noticed about Fox news which I really like is they basically ask yes or no questions and never get a yes or no answer from politicians. Complex issues need more than simple yes and no answers to yes or no questions. Unfortunately, you won't get anything more than watered down black and white politics from Foxnews. FOXNEWS:Mr. President, simple question, are you a socialist that hates America? OBAMA: (Provides a thoughtful answerIn your eyes its thoughtful, but you forget he's a poltician, just like Bush, Clinton and Reagan) FOXNEWS: There he goes again, dodging tough questions! Bash the other networks all you want, but shows like Meet the Press are on a completely separate level than anything on Foxnews. Also, I've watched Glenn Beck enough to realize he's certifiably insaneYou're a medical doctor now? Wow, and here I thought you were just some dum hack that cant see straight at all. Cool.. Glenn Beck's in depth analysis of the Obama administration : throw fake gasoline on his staff member, pretend to light the person on fire, and tell his viewers this is what Obama is doing to America. Wow, now that's journalism!", 
        "reply": " Where in the he11 have you been for the last 8 years? This is what I mean by people not being honest with themselves. Bush, who I am no big fan of, got hammered every fricking night by your \"honest\" outlets for every stupid thing he said and done, but when it comes to BO, he gets a fricking pass. You sit there and defend this man when he hasnt done much other than saddle my children and their children with a debt that can never be paid off. If your company that packages eggs keeps breaking eggs, do you,as the owner, break more eggs in the hopes that it'll get better? Dont you see how frickin stupid of an idea that PO, along with the dem's, have? PO is going to say whatever it takes to appease the likes of you, weps and Seawitch to make you happy and feel comfy with the idea that you elected a schmuck for a President. The MSM promoted the idea that Bush was an idiot, but he was smart enough to pull the wools over everyones eyes on everything that he did. The MSM promotes, as evidenced by the dam near orgasms on election night, that PO is the best thing since apple pie. Get real and open your eyes people. GRAYMAN", 
        "threadID": "409192893_7050010322001", 
        "time": "2009-05-11 09:52:00", 
        "title": "Why Democrats are afraid of Fox News Reporters", 
        "userID": "GRAYMAN"
    }
]