[
    {
        "content": "With Bush FBI Director Robert Mueller confirming that we heard him right, that he didn't \"believe\" torture had disrupted any attacks, the last of the moral ambiguity hanging over the torture issue is being removed. Mueller directly contradicts what Dick Cheney has repeated many times, that \"enhanced interrogation methods\" such as slamming prisoners' heads into walls, sodomy with instruments, electric shocks to the genitals, and the host of tortures we are not even aware of conducted by our allies like Egypt during extraordinary rendition \"did work. They kept us safe for seven years,\" as Cheney said last week on Fox News Sunday. In one case documented in a report by General Anthony Taguba, a prisoner was forced to drink urine. Taguba concludes that the tortures were a result of: quote: [a] permissive environment created by implicit and explicit authorizations by senior US officials to \"take the gloves off\"... The additional testimony of former Air Force interrogator Matthew Alexander that, in the course of his interrogations in Iraq, he found repeatedly that the claims that the Americans torture whether you are innocent or guilty to be Al Qaeda's number one recruiting tool, and the reason most Iraqis joined the resistance. This, combined with former Bush official Col. Lawrence Wilkerson's revelation that Bush knew most of those he had at Gitmo were in the wrong place at the wrong time when caught by bounty-hunters, puts a very different sheen on Bush's claim that he was \"protecting America.\" Wikerson: quote: largely unreported is that several in the U.S. leadership became aware of the reality that many of the detainees were innocent of any substantial wrongdoing, had little intelligence value, and should be immediately released. But to have admitted this reality would have been a black mark on their leadership from virtually day one of the so-called Global War on Terror and these leaders already had black marks enough: the dead in a field in Pennsylvania, in the ashes of the Pentagon, and in the ruins of the World Trade Towers. They were not about to admit to their further errors at Guantanamo Bay. Better to claim that everyone there was a hardcore terrorist, was of enduring intelligence value, and would return to jihad if released. Individual details of the innocent being tortured are emerging randomly. These should be the focus of any commissions. Damage control is being attempted by, for example, cleverly placing the spotlight on stories like Khalid Shiek Mohammed being waterboarded 180-something times. Take a man firmly convicted in the public mind (who knows what the truth is anymore?) as one of those closest to the 9/11 attacks, then make the debate over how right it is to torture him. Getting less coverage is the story of Dilawar, the 22-year-old taxi-driver who made the mistake of driving past Baghram AFB a few days after a rocket attack with three paying fares. The New York Times revealed: quote: \"In February, an American military official disclosed that the Afghan guerrilla commander whose men had arrested Mr. Dilawar and his passengers had himself been detained. The commander, Jan Baz Khan, was suspected of attacking Camp Salerno himself and then turning over innocent \"suspects\" to the Americans in a ploy to win their trust, the military official said. One form of torture used on Dilawar was the peroneal Strikes. Peroneal strikes are a specific form of beating, consisting of blows to the soft tissue and nerves just above the knee. Dilalwar was beaten to death at Bagram had been given so many peroneal strikes that a coroner testified that his leg tissue had ‘\"basically been pulpified.’\" Orders from the top bring out sadists at the bottom. Dilawar, was 5'9\", 122 pounds. Dysblog quoting the Times report tells us: quote: one guard noticed, for instance, that the bruise on his leg was \"the size of a fist.\" Why would guards torture a man they considered innocent? At first it was all in fun: M.P.'s would drop by to give him common peroneal strikes just to hear him scream, \"Allah! Allah! Allah!\" This was done to him perhaps 100 times, according to one of his tormentors, Specialist Corey E. Jones: \"My first reaction was that he was crying out to his god... Everybody heard him cry out and thought it was funny.\" 19-year-old Murat Kurnaz disappeared into the House of Horrors That Bush Built even though according to 60 Minutes: quote: there seemed to be ample evidence that Kurnaz was an innocent man with no connection to terrorism. The FBI thought so, U.S. intelligence thought so, and German intelligence agreed. But once he was picked up, Kurnaz found himself in a prison system that required no evidence and answered to no one. Kurnaz says they shocked him with electricity, and that he was hoisted up on chains suspended by his arms from the ceiling of an aircraft hangar for five days. quote: \"Every five or six hours they came and pulled me back down. And the doctor came to watch if I can still survive to not. He looked into my eyes. He checked my heart. And when he said okay, then they pulled me back up,\" Former prosecutor and tireless accountability activist Elizabeth De La Vega warns us against jumping the gun in appointing a special prosecutor too soon, before a cohesive and irrefutable public narrative of the criminal activity is developed and an opportunity is given for victims to be heard in an open forum. She fears the appointment of an SP before open commissions with subpoena powers do their work will result in congresscritters clamming up with \"no comment during an ongoing official investigation\" gambit. The narrative must indeed be focused, and public. Leahy's comission must have a narrow title like \"Commission on the Torture and Detention of the Innocent,\" otherwise the defenders of torture will shift the debate onto ground they like, that of the non-existent \"ticking-bomb\" scenario. And it must be public, broadcast on CSPAN full-blast, rather than letting them pull a \"Conyers\" which is to have hearings guaranteed to go nowhere because they let no one in the media know that they are taking place. Making the truly awful even worse is that it was all done in your name. Only the loud shouts that this cannot stand has forced the politicians to address it this far. Obama is kicking and screaming not to have to address this, because it's dirty and he would rather do things that make him liked. They can do whatever they want in their own names, but sure as hell not in mine. Oh yes, and get Pelosi while they're at it. She was briefed. Please forward this post to your congressmember \"\"http://www.visi.com/juan/congress/ and to the White House. \"\"http://www.whitehouse.gov/contact/ Air Force Interrogator Matthew Alexander video \"\"http://www.youtube.com/watch?v=bzinMDaT1jw This message has been edited. Last edited by: WitchitaKid, Fri 24 April 2009 02:45 PM", 
        "intTime": 20090424, 
        "postID": 1, 
        "quote": "[a] permissive environment created by implicit and explicit authorizations by senior US officials to \"take the gloves off\"...", 
        "reply": "With Bush FBI Director Robert Mueller confirming that we heard him right, that he didn't \"believe\" torture had disrupted any attacks, the last of the moral ambiguity hanging over the torture issue is being removed. Mueller directly contradicts what Dick Cheney has repeated many times, that \"enhanced interrogation methods\" such as slamming prisoners' heads into walls, sodomy with instruments, electric shocks to the genitals, and the host of tortures we are not even aware of conducted by our allies like Egypt during extraordinary rendition \"did work. They kept us safe for seven years,\" as Cheney said last week on Fox News Sunday. In one case documented in a report by General Anthony Taguba, a prisoner was forced to drink urine. Taguba concludes that the tortures were a result of:  The additional testimony of former Air Force interrogator Matthew Alexander that, in the course of his interrogations in Iraq, he found repeatedly that the claims that the Americans torture whether you are innocent or guilty to be Al Qaeda's number one recruiting tool, and the reason most Iraqis joined the resistance. This, combined with former Bush official Col. Lawrence Wilkerson's revelation that Bush knew most of those he had at Gitmo were in the wrong place at the wrong time when caught by bounty-hunters, puts a very different sheen on Bush's claim that he was \"protecting America.\" Wikerson: quote: largely unreported is that several in the U.S. leadership became aware of the reality that many of the detainees were innocent of any substantial wrongdoing, had little intelligence value, and should be immediately released. But to have admitted this reality would have been a black mark on their leadership from virtually day one of the so-called Global War on Terror and these leaders already had black marks enough: the dead in a field in Pennsylvania, in the ashes of the Pentagon, and in the ruins of the World Trade Towers. They were not about to admit to their further errors at Guantanamo Bay. Better to claim that everyone there was a hardcore terrorist, was of enduring intelligence value, and would return to jihad if released. Individual details of the innocent being tortured are emerging randomly. These should be the focus of any commissions. Damage control is being attempted by, for example, cleverly placing the spotlight on stories like Khalid Shiek Mohammed being waterboarded 180-something times. Take a man firmly convicted in the public mind (who knows what the truth is anymore?) as one of those closest to the 9/11 attacks, then make the debate over how right it is to torture him. Getting less coverage is the story of Dilawar, the 22-year-old taxi-driver who made the mistake of driving past Baghram AFB a few days after a rocket attack with three paying fares. The New York Times revealed: quote: \"In February, an American military official disclosed that the Afghan guerrilla commander whose men had arrested Mr. Dilawar and his passengers had himself been detained. The commander, Jan Baz Khan, was suspected of attacking Camp Salerno himself and then turning over innocent \"suspects\" to the Americans in a ploy to win their trust, the military official said. One form of torture used on Dilawar was the peroneal Strikes. Peroneal strikes are a specific form of beating, consisting of blows to the soft tissue and nerves just above the knee. Dilalwar was beaten to death at Bagram had been given so many peroneal strikes that a coroner testified that his leg tissue had ‘\"basically been pulpified.’\" Orders from the top bring out sadists at the bottom. Dilawar, was 5'9\", 122 pounds. Dysblog quoting the Times report tells us: quote: one guard noticed, for instance, that the bruise on his leg was \"the size of a fist.\" Why would guards torture a man they considered innocent? At first it was all in fun: M.P.'s would drop by to give him common peroneal strikes just to hear him scream, \"Allah! Allah! Allah!\" This was done to him perhaps 100 times, according to one of his tormentors, Specialist Corey E. Jones: \"My first reaction was that he was crying out to his god... Everybody heard him cry out and thought it was funny.\" 19-year-old Murat Kurnaz disappeared into the House of Horrors That Bush Built even though according to 60 Minutes: quote: there seemed to be ample evidence that Kurnaz was an innocent man with no connection to terrorism. The FBI thought so, U.S. intelligence thought so, and German intelligence agreed. But once he was picked up, Kurnaz found himself in a prison system that required no evidence and answered to no one. Kurnaz says they shocked him with electricity, and that he was hoisted up on chains suspended by his arms from the ceiling of an aircraft hangar for five days. quote: \"Every five or six hours they came and pulled me back down. And the doctor came to watch if I can still survive to not. He looked into my eyes. He checked my heart. And when he said okay, then they pulled me back up,\" Former prosecutor and tireless accountability activist Elizabeth De La Vega warns us against jumping the gun in appointing a special prosecutor too soon, before a cohesive and irrefutable public narrative of the criminal activity is developed and an opportunity is given for victims to be heard in an open forum. She fears the appointment of an SP before open commissions with subpoena powers do their work will result in congresscritters clamming up with \"no comment during an ongoing official investigation\" gambit. The narrative must indeed be focused, and public. Leahy's comission must have a narrow title like \"Commission on the Torture and Detention of the Innocent,\" otherwise the defenders of torture will shift the debate onto ground they like, that of the non-existent \"ticking-bomb\" scenario. And it must be public, broadcast on CSPAN full-blast, rather than letting them pull a \"Conyers\" which is to have hearings guaranteed to go nowhere because they let no one in the media know that they are taking place. Making the truly awful even worse is that it was all done in your name. Only the loud shouts that this cannot stand has forced the politicians to address it this far. Obama is kicking and screaming not to have to address this, because it's dirty and he would rather do things that make him liked. They can do whatever they want in their own names, but sure as hell not in mine. Oh yes, and get Pelosi while they're at it. She was briefed. Please forward this post to your congressmember \"\"http://www.visi.com/juan/congress/ and to the White House. \"\"http://www.whitehouse.gov/contact/ Air Force Interrogator Matthew Alexander video \"\"http://www.youtube.com/watch?v=bzinMDaT1jw This message has been edited. Last edited by: WitchitaKid, Fri 24 April 2009 02:45 PM", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 13:25:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "Cute and all..But the memo that Obama DID release seems to say otherwise.", 
        "intTime": 20090424, 
        "postID": 2, 
        "quote": "", 
        "reply": "Cute and all..But the memo that Obama DID release seems to say otherwise.", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 13:29:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Cute and all..But the memo that Obama DID release seems to say otherwise. Which part?", 
        "intTime": 20090424, 
        "postID": 3, 
        "quote": "Originally posted by threerings: Cute and all..But the memo that Obama DID release seems to say otherwise.", 
        "reply": " Which part?", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 13:44:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "quote: Originally posted by WitchitaKid: quote: Originally posted by threerings: Cute and all..But the memo that Obama DID release seems to say otherwise. Which part? The part about how it saved Hethro Airport, LA and a few other cities from 9/11 style attacks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090424, 
        "postID": 4, 
        "quote": "Originally posted by WitchitaKid: quote: Originally posted by threerings: Cute and all..But the memo that Obama DID release seems to say otherwise. Which part?", 
        "reply": " The part about how it saved Hethro Airport, LA and a few other cities from 9/11 style attacks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 13:50:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "L0A1"
    }, 
    {
        "content": "Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php", 
        "intTime": 20090424, 
        "postID": 5, 
        "quote": "", 
        "reply": "Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 15:10:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "quote: Originally posted by WitchitaKid: Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php Aww hell, you can't even spell Wichita right.", 
        "intTime": 20090424, 
        "postID": 6, 
        "quote": "Originally posted by WitchitaKid: Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php", 
        "reply": " Aww hell, you can't even spell Wichita right.", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 16:26:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: quote: Originally posted by WitchitaKid: Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php Aww hell, you can't even spell Wichita right. Time to make it a discussion of spelling, eeh ? \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090424, 
        "postID": 7, 
        "quote": "Originally posted by JustanotherGI: quote: Originally posted by WitchitaKid: Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php Aww hell, you can't even spell Wichita right.", 
        "reply": " Time to make it a discussion of spelling, eeh ? \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 20:02:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "quote: Originally posted by JakobA_DK: quote: Originally posted by JustanotherGI: quote: Originally posted by WitchitaKid: Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php Aww hell, you can't even spell Wichita right. Time to make it a discussion of spelling, eeh ? The mis-informed do that when they are proven wrong as is the case here. Common tactic.", 
        "intTime": 20090424, 
        "postID": 8, 
        "quote": "Originally posted by JakobA_DK: quote: Originally posted by JustanotherGI: quote: Originally posted by WitchitaKid: Would appreciate the quotes and pages. I see nothing like that in there. Here are the links to the memos: \"\"http://tpmmuckraker.talkingpointsmemo.com/2009/04/torture_memos_released.php Aww hell, you can't even spell Wichita right. Time to make it a discussion of spelling, eeh ?", 
        "reply": " The mis-informed do that when they are proven wrong as is the case here. Common tactic.", 
        "threadID": "409192893_4100086122001", 
        "time": "2009-04-24 21:38:00", 
        "title": "Tortured Wrong Guys, Didn't Prevent Attacks, Helped Al Qaeda", 
        "userID": "WepsFP"
    }
]