[
    {
        "content": "It turns out a surprising number of conservatives are satirically challenged... I find this truly shocking! MAYBE OVER-THE-TOP IS TOO SUBTLE.... It never occurred to me that some viewers might think Stephen Colbert is actually a conservative blow-hard. But Jason Linkins highlights this study from Ohio State, where researchers found that the satirical quality of \"The Colbert Report\" was lost on a surprising number of conservatives. This study investigated biased message processing of political satire in The Colbert Report and the influence of political ideology on perceptions of Stephen Colbert. Results indicate that political ideology influences biased processing of ambiguous political messages and source in late-night comedy. Using data from an experiment (N = 332), we found that individual-level political ideology significantly predicted perceptions of Colbert's political ideology. Additionally, there was no significant difference between the groups in thinking Colbert was funny, but conservatives were more likely to report that Colbert only pretends to be joking and genuinely meant what he said while liberals were more likely to report that Colbert used satire and was not serious when offering political statements. Conservatism also significantly predicted perceptions that Colbert disliked liberalism. [emphasis added] Linkins added, \"I think a lot of conservatives are going to ****ed when they realize that Stephen Colbert's performance at the 2006 White House Correspondents' Dinner was not, in fact, an awkward and ineffective attempt to praise President George W. Bush, but actually a bitter and satiric criticism of his incompetence!\" Link to article: \"http://www.washingtonmonthly.com/archives/individual/2009_04/017947.php\" Link to report: \"http://hij.sagepub.com/cgi/content/abstract/14/2/212\"", 
        "intTime": 20090503, 
        "postID": 1, 
        "quote": "", 
        "reply": "It turns out a surprising number of conservatives are satirically challenged... I find this truly shocking! MAYBE OVER-THE-TOP IS TOO SUBTLE.... It never occurred to me that some viewers might think Stephen Colbert is actually a conservative blow-hard. But Jason Linkins highlights this study from Ohio State, where researchers found that the satirical quality of \"The Colbert Report\" was lost on a surprising number of conservatives. This study investigated biased message processing of political satire in The Colbert Report and the influence of political ideology on perceptions of Stephen Colbert. Results indicate that political ideology influences biased processing of ambiguous political messages and source in late-night comedy. Using data from an experiment (N = 332), we found that individual-level political ideology significantly predicted perceptions of Colbert's political ideology. Additionally, there was no significant difference between the groups in thinking Colbert was funny, but conservatives were more likely to report that Colbert only pretends to be joking and genuinely meant what he said while liberals were more likely to report that Colbert used satire and was not serious when offering political statements. Conservatism also significantly predicted perceptions that Colbert disliked liberalism. [emphasis added] Linkins added, \"I think a lot of conservatives are going to ****ed when they realize that Stephen Colbert's performance at the 2006 White House Correspondents' Dinner was not, in fact, an awkward and ineffective attempt to praise President George W. Bush, but actually a bitter and satiric criticism of his incompetence!\" Link to article: \"http://www.washingtonmonthly.com/archives/individual/2009_04/017947.php\" Link to report: \"http://hij.sagepub.com/cgi/content/abstract/14/2/212\"", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-03 06:33:00", 
        "title": "The Irony of Satire", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: It turns out a surprising number of conservatives are satirically challenged... I find this truly shocking! MAYBE OVER-THE-TOP IS TOO SUBTLE.... It never occurred to me that some viewers might think Stephen Colbert is actually a conservative blow-hard. But Jason Linkins highlights this study from Ohio State, where researchers found that the satirical quality of \"The Colbert Report\" was lost on a surprising number of conservatives. This study investigated biased message processing of political satire in The Colbert Report and the influence of political ideology on perceptions of Stephen Colbert. Results indicate that political ideology influences biased processing of ambiguous political messages and source in late-night comedy. Using data from an experiment (N = 332), we found that individual-level political ideology significantly predicted perceptions of Colbert's political ideology. Additionally, there was no significant difference between the groups in thinking Colbert was funny, but conservatives were more likely to report that Colbert only pretends to be joking and genuinely meant what he said while liberals were more likely to report that Colbert used satire and was not serious when offering political statements. Conservatism also significantly predicted perceptions that Colbert disliked liberalism. [emphasis added] Linkins added, \"I think a lot of conservatives are going to ****ed when they realize that Stephen Colbert's performance at the 2006 White House Correspondents' Dinner was not, in fact, an awkward and ineffective attempt to praise President George W. Bush, but actually a bitter and satiric criticism of his incompetence!\" Link to article: \"http://www.washingtonmonthly.com/archives/individual/2009_04/017947.php\" Link to report: \"http://hij.sagepub.com/cgi/content/abstract/14/2/212\" Hardly surprising, after all some people actually believe Obama This message has been edited. Last edited by: adminnco1, Sun 03 May 2009 07:11 AM", 
        "intTime": 20090503, 
        "postID": 2, 
        "quote": "Originally posted by SeaWitch1220: It turns out a surprising number of conservatives are satirically challenged... I find this truly shocking! MAYBE OVER-THE-TOP IS TOO SUBTLE.... It never occurred to me that some viewers might think Stephen Colbert is actually a conservative blow-hard. But Jason Linkins highlights this study from Ohio State, where researchers found that the satirical quality of \"The Colbert Report\" was lost on a surprising number of conservatives. This study investigated biased message processing of political satire in The Colbert Report and the influence of political ideology on perceptions of Stephen Colbert. Results indicate that political ideology influences biased processing of ambiguous political messages and source in late-night comedy. Using data from an experiment (N = 332), we found that individual-level political ideology significantly predicted perceptions of Colbert's political ideology. Additionally, there was no significant difference between the groups in thinking Colbert was funny, but conservatives were more likely to report that Colbert only pretends to be joking and genuinely meant what he said while liberals were more likely to report that Colbert used satire and was not serious when offering political statements. Conservatism also significantly predicted perceptions that Colbert disliked liberalism. [emphasis added] Linkins added, \"I think a lot of conservatives are going to ****ed when they realize that Stephen Colbert's performance at the 2006 White House Correspondents' Dinner was not, in fact, an awkward and ineffective attempt to praise President George W. Bush, but actually a bitter and satiric criticism of his incompetence!\" Link to article: \"http://www.washingtonmonthly.com/archives/individual/2009_04/017947.php\" Link to report: \"http://hij.sagepub.com/cgi/content/abstract/14/2/212\"", 
        "reply": " Hardly surprising, after all some people actually believe Obama This message has been edited. Last edited by: adminnco1, Sun 03 May 2009 07:11 AM", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-03 06:36:00", 
        "title": "The Irony of Satire", 
        "userID": "adminnco1"
    }, 
    {
        "content": "If you take notice one side of Obama's head is flatter since taking office? That is from being whooped in the head by lobbyists against his \"change\" agenda.", 
        "intTime": 20090503, 
        "postID": 3, 
        "quote": "", 
        "reply": "If you take notice one side of Obama's head is flatter since taking office? That is from being whooped in the head by lobbyists against his \"change\" agenda.", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-03 09:41:00", 
        "title": "The Irony of Satire", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: It turns out a surprising number of conservatives are satirically challenged... I find this truly shocking! MAYBE OVER-THE-TOP IS TOO SUBTLE.... It never occurred to me that some viewers might think Stephen Colbert is actually a conservative blow-hard. <snip> They are wired differently. It helps to understand why they are so fearful of things we feel are absolutely no threat and so willing to support those things that really are a threat, like war in general, preemptive nukes, torture and other fun stuff. It also helps to explain why they absolutely will not question jarring disconnects such as a President telling us to \"go shopping\" after 9/11. I figured he would call for the draft.", 
        "intTime": 20090503, 
        "postID": 4, 
        "quote": "Originally posted by SeaWitch1220: It turns out a surprising number of conservatives are satirically challenged... I find this truly shocking! MAYBE OVER-THE-TOP IS TOO SUBTLE.... It never occurred to me that some viewers might think Stephen Colbert is actually a conservative blow-hard. <snip>", 
        "reply": " They are wired differently. It helps to understand why they are so fearful of things we feel are absolutely no threat and so willing to support those things that really are a threat, like war in general, preemptive nukes, torture and other fun stuff. It also helps to explain why they absolutely will not question jarring disconnects such as a President telling us to \"go shopping\" after 9/11. I figured he would call for the draft.", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-03 09:44:00", 
        "title": "The Irony of Satire", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Limitations of 'research'. By the study's own abstract, this is hardly a scientific study. quote: N=332 332 people's opinions were taken. quote: Using data from an experiment The 'study' didn't even poll anyone - they took 'data' from a previous experiment on something else. Not mentioned in the abstract is the population queried, the language of the questions, the location, conditions and methods used. In short, with such a vague title and conclusion, and such a miniscule data collection (322 people's opinions?), the margin of error would be make any findings unusable. In short, it is no more a true research than the author's other great work: quote: Everyone wants to sing a silly love song: A content analysis of music themes from 1960 -2005. Paper presented at the Midwest Association for Public Opinion Research. Chicago, Illinois. Reference: CURRICULUM VITAE of Heather Lyn LaMarre, Ohio State University Sullivan013", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "N=332", 
        "reply": "Limitations of 'research'. By the study's own abstract, this is hardly a scientific study.  332 people's opinions were taken. quote: Using data from an experiment The 'study' didn't even poll anyone - they took 'data' from a previous experiment on something else. Not mentioned in the abstract is the population queried, the language of the questions, the location, conditions and methods used. In short, with such a vague title and conclusion, and such a miniscule data collection (322 people's opinions?), the margin of error would be make any findings unusable. In short, it is no more a true research than the author's other great work: quote: Everyone wants to sing a silly love song: A content analysis of music themes from 1960 -2005. Paper presented at the Midwest Association for Public Opinion Research. Chicago, Illinois. Reference: CURRICULUM VITAE of Heather Lyn LaMarre, Ohio State University Sullivan013", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-06 12:27:00", 
        "title": "The Irony of Satire", 
        "userID": "sullivan013"
    }, 
    {
        "content": "The biggest problem from using satire is that there will always be someone who thinks you're being serious.", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "", 
        "reply": "The biggest problem from using satire is that there will always be someone who thinks you're being serious.", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-06 12:34:00", 
        "title": "The Irony of Satire", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Yeah I posted something from The Onion a while back and a number of people were very confused.", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "", 
        "reply": "Yeah I posted something from The Onion a while back and a number of people were very confused.", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-06 12:40:00", 
        "title": "The Irony of Satire", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: The biggest problem from using satire is that there will always be someone who thinks you're being serious. Yep, when Jonathan Swift wrote his Modest Proposal there were people who genuinely though it might be an idea to make the Irish eat their children. More recently there was a BBC sitcom called In Sickness and in Health about a racist, anti-semitic bigot called Alf Garnet. He actually had a fan club amongst skinheads and National Front types who were apparently unaware that Garnet was played by a Jewish actor called Warren Clarke. Mind you there were a lot of hand-wringing lefties who didn't get the joke as well.", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by Fightdirector: The biggest problem from using satire is that there will always be someone who thinks you're being serious.", 
        "reply": " Yep, when Jonathan Swift wrote his Modest Proposal there were people who genuinely though it might be an idea to make the Irish eat their children. More recently there was a BBC sitcom called In Sickness and in Health about a racist, anti-semitic bigot called Alf Garnet. He actually had a fan club amongst skinheads and National Front types who were apparently unaware that Garnet was played by a Jewish actor called Warren Clarke. Mind you there were a lot of hand-wringing lefties who didn't get the joke as well.", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-06 13:35:00", 
        "title": "The Irony of Satire", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Poe's Law. I invoke it around here from time to time. Look it up.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "", 
        "reply": "Poe's Law. I invoke it around here from time to time. Look it up.", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-06 14:31:00", 
        "title": "The Irony of Satire", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by Fightdirector: The biggest problem from using satire is that there will always be someone who thinks you're being serious. Yep, when Jonathan Swift wrote his Modest Proposal there were people who genuinely though it might be an idea to make the Irish eat their children. More recently there was a BBC sitcom called In Sickness and in Health about a racist, anti-semitic bigot called Alf Garnet. He actually had a fan club amongst skinheads and National Front types who were apparently unaware that Garnet was played by a Jewish actor called Warren Clarke. Mind you there were a lot of hand-wringing lefties who didn't get the joke as well. You must admit it's bad when jokes all turn politically correct. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by Fightdirector: The biggest problem from using satire is that there will always be someone who thinks you're being serious. Yep, when Jonathan Swift wrote his Modest Proposal there were people who genuinely though it might be an idea to make the Irish eat their children. More recently there was a BBC sitcom called In Sickness and in Health about a racist, anti-semitic bigot called Alf Garnet. He actually had a fan club amongst skinheads and National Front types who were apparently unaware that Garnet was played by a Jewish actor called Warren Clarke. Mind you there were a lot of hand-wringing lefties who didn't get the joke as well.", 
        "reply": " You must admit it's bad when jokes all turn politically correct. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-06 14:35:00", 
        "title": "The Irony of Satire", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Bladensburg: quote: Originally posted by Fightdirector: The biggest problem from using satire is that there will always be someone who thinks you're being serious. Yep, when Jonathan Swift wrote his Modest Proposal there were people who genuinely though it might be an idea to make the Irish eat their children. More recently there was a BBC sitcom called In Sickness and in Health about a racist, anti-semitic bigot called Alf Garnet. He actually had a fan club amongst skinheads and National Front types who were apparently unaware that Garnet was played by a Jewish actor called Warren Clarke. Mind you there were a lot of hand-wringing lefties who didn't get the joke as well. You must admit it's bad when jokes all turn politically correct. Quite right but it's the intent behind the telling of some \"non PC\" jokes that causes problems. It's all very well and amusing pointing out the more ludicrous foibles of various religions and cultures but when you introduce an element of contempt that is undeserved (and sometimes it is deserved) then trouble starts. Oh and before anybody pulls me up on it Alf Garnet was played by Warren Mitchell not Warren Clarke, he played Eastwoods Russian driver who shoots himself in Firefox (and the spectacularly un-PC Det. Supt. Andy Dalziel in the cop show Dalziel and Pascoe).", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Bladensburg: quote: Originally posted by Fightdirector: The biggest problem from using satire is that there will always be someone who thinks you're being serious. Yep, when Jonathan Swift wrote his Modest Proposal there were people who genuinely though it might be an idea to make the Irish eat their children. More recently there was a BBC sitcom called In Sickness and in Health about a racist, anti-semitic bigot called Alf Garnet. He actually had a fan club amongst skinheads and National Front types who were apparently unaware that Garnet was played by a Jewish actor called Warren Clarke. Mind you there were a lot of hand-wringing lefties who didn't get the joke as well. You must admit it's bad when jokes all turn politically correct.", 
        "reply": " Quite right but it's the intent behind the telling of some \"non PC\" jokes that causes problems. It's all very well and amusing pointing out the more ludicrous foibles of various religions and cultures but when you introduce an element of contempt that is undeserved (and sometimes it is deserved) then trouble starts. Oh and before anybody pulls me up on it Alf Garnet was played by Warren Mitchell not Warren Clarke, he played Eastwoods Russian driver who shoots himself in Firefox (and the spectacularly un-PC Det. Supt. Andy Dalziel in the cop show Dalziel and Pascoe).", 
        "threadID": "409192893_3230083222001", 
        "time": "2009-05-06 14:56:00", 
        "title": "The Irony of Satire", 
        "userID": "Bladensburg"
    }
]