[
    {
        "content": "This just about nails it.", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "This just about nails it.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-06 15:29:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "Boots_"
    }, 
    {
        "content": "No way that Targ bait Biden is worthy to portray Bones!", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "No way that Targ bait Biden is worthy to portray Bones!", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-06 16:42:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It could have been funny if not so biased.", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "", 
        "reply": "It could have been funny if not so biased.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-06 17:03:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "ACR26"
    }, 
    {
        "content": "and who is Nancy Patooie........? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "", 
        "reply": "and who is Nancy Patooie........? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-06 17:11:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE.", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "", 
        "reply": "I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-06 17:46:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic.", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE.", 
        "reply": " Just when the fun starts some Vulcan shows up and ruins it with logic.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-06 18:44:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic Now that was funny", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic", 
        "reply": " Now that was funny", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-06 18:48:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic. Nope just stating what I feel about this POS topic.", 
        "intTime": 20090507, 
        "postID": 8, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic.", 
        "reply": " Nope just stating what I feel about this POS topic.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 05:31:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic Now that was funny In your minni Liberial mind.", 
        "intTime": 20090507, 
        "postID": 9, 
        "quote": "Originally posted by ACR26: quote: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic Now that was funny", 
        "reply": " In your minni Liberial mind.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 05:31:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "Migbuster"
    }, 
    {
        "content": "Dick Cheney as the Emperor? No, no, no! He is Darth Cheney!", 
        "intTime": 20090507, 
        "postID": 10, 
        "quote": "", 
        "reply": "Dick Cheney as the Emperor? No, no, no! He is Darth Cheney!", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 05:57:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I look at that photo of Rahm Emanual and all I see is Robert Downey Jr with silver hair. Don", 
        "intTime": 20090507, 
        "postID": 11, 
        "quote": "", 
        "reply": "I look at that photo of Rahm Emanual and all I see is Robert Downey Jr with silver hair. Don", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 06:07:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: quote: Originally posted by ACR26: quote: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic Now that was funny In your minni Liberial mind. You need to lighten up a little. The new Star Trek movie comes out tomorrow so perhaps for a few short hours the constant partisan wrangling can be conducted in a different venue. In that light, I would agree with Darth Cheney and suggest that the spirit of Nixon would be an excellent Emperor, the theory being that he never really died but simply transformed to a more paranoid and hostile entity.", 
        "intTime": 20090507, 
        "postID": 12, 
        "quote": "Originally posted by Migbuster: quote: Originally posted by ACR26: quote: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic Now that was funny In your minni Liberial mind.", 
        "reply": " You need to lighten up a little. The new Star Trek movie comes out tomorrow so perhaps for a few short hours the constant partisan wrangling can be conducted in a different venue. In that light, I would agree with Darth Cheney and suggest that the spirit of Nixon would be an excellent Emperor, the theory being that he never really died but simply transformed to a more paranoid and hostile entity.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 06:50:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: In that light, I would agree with Darth Cheney and suggest that the spirit of Nixon would be an excellent Emperor, the theory being that he never really died but simply transformed to a more paranoid and hostile entity. Ya any good with photoshop? You could fix it for us", 
        "intTime": 20090507, 
        "postID": 13, 
        "quote": "Originally posted by adminnco1: In that light, I would agree with Darth Cheney and suggest that the spirit of Nixon would be an excellent Emperor, the theory being that he never really died but simply transformed to a more paranoid and hostile entity.", 
        "reply": " Ya any good with photoshop? You could fix it for us", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 07:00:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic Now that was funny It certainly was..... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 14, 
        "quote": "Originally posted by ACR26: quote: quote: Originally posted by Migbuster: I FIND THIS QUITE CHILDISH. SOME ONE NEED TO GROW UP AND GET A LIFE. Just when the fun starts some Vulcan shows up and ruins it with logic Now that was funny", 
        "reply": " It certainly was..... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 07:06:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Kind of crap i would expect from Lucas talking politics and politicians with Maureen Dowd... I mean c'mon....Rahm Emmanual as Kirk? He is way to much of a twit for Kirk. Kirk was cool and got women. 41 and Clinton are the best ones cast...", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "", 
        "reply": "Kind of crap i would expect from Lucas talking politics and politicians with Maureen Dowd... I mean c'mon....Rahm Emmanual as Kirk? He is way to much of a twit for Kirk. Kirk was cool and got women. 41 and Clinton are the best ones cast...", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 07:51:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: In that light, I would agree with Darth Cheney and suggest that the spirit of Nixon would be an excellent Emperor, the theory being that he never really died but simply transformed to a more paranoid and hostile entity. Ya any good with photoshop? You could fix it for us Sadly I am technologically challenged. Attaching a file to email is about as good as it gets for me...", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: In that light, I would agree with Darth Cheney and suggest that the spirit of Nixon would be an excellent Emperor, the theory being that he never really died but simply transformed to a more paranoid and hostile entity. Ya any good with photoshop? You could fix it for us", 
        "reply": " Sadly I am technologically challenged. Attaching a file to email is about as good as it gets for me...", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 11:51:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Dick Cheney as the Emperor? No, no, no! He is Darth Cheney! I agree. Rummy would make a FAR better emporer.", 
        "intTime": 20090507, 
        "postID": 17, 
        "quote": "Originally posted by SeaWitch1220: Dick Cheney as the Emperor? No, no, no! He is Darth Cheney!", 
        "reply": " I agree. Rummy would make a FAR better emporer.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-07 12:46:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: and who is Nancy Patooie........? As the green chick in Star Trek... ...just there for show and really doesn't add much.", 
        "intTime": 20090508, 
        "postID": 18, 
        "quote": "Originally posted by m551sheridan: and who is Nancy Patooie........?", 
        "reply": " As the green chick in Star Trek... ...just there for show and really doesn't add much.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-08 10:08:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by m551sheridan: and who is Nancy Patooie........? As the green chick in Star Trek... ...just there for show and really doesn't add much. I hope you don't mean Orion slave women. As observed by Commodore Mendez: \"They're like animals. Vicious, seductive. They say no Human male can resist them\" I suspect that while she may be vicious, the average Human male will have no difficulty at all resisting the sexual charms of Ms. Pelosi. I would suggest that she would be better cast as the Borg Queen, the leader of a collective incapable of independent thought or action.", 
        "intTime": 20090508, 
        "postID": 19, 
        "quote": "Originally posted by shuman14: quote: Originally posted by m551sheridan: and who is Nancy Patooie........? As the green chick in Star Trek... ...just there for show and really doesn't add much.", 
        "reply": " I hope you don't mean Orion slave women. As observed by Commodore Mendez: \"They're like animals. Vicious, seductive. They say no Human male can resist them\" I suspect that while she may be vicious, the average Human male will have no difficulty at all resisting the sexual charms of Ms. Pelosi. I would suggest that she would be better cast as the Borg Queen, the leader of a collective incapable of independent thought or action.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-08 18:59:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "adminnco1"
    }, 
    {
        "content": "I stand corrected, Borg Queen it is!", 
        "intTime": 20090509, 
        "postID": 20, 
        "quote": "", 
        "reply": "I stand corrected, Borg Queen it is!", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-09 10:49:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: I stand corrected, Borg Queen it is! Somehow the catchphrase \"resistance is futile\" suits her very well.", 
        "intTime": 20090509, 
        "postID": 21, 
        "quote": "Originally posted by shuman14: I stand corrected, Borg Queen it is!", 
        "reply": " Somehow the catchphrase \"resistance is futile\" suits her very well.", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-09 19:04:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "adminnco1"
    }, 
    {
        "content": "And me...as a Tribble !!", 
        "intTime": 20090509, 
        "postID": 22, 
        "quote": "", 
        "reply": "And me...as a Tribble !!", 
        "threadID": "409192893_9360066222001", 
        "time": "2009-05-09 22:27:00", 
        "title": "Casting Star Trek and Star Wars", 
        "userID": "OddBall1st"
    }
]