[
    {
        "content": "Cheney has been talking frequently about how torture has saved hundreds of thousands of lives, but is that the real story? quote: Finding a \"smoking gun\" linking Iraq and al Qaeda became the main purpose of the abusive interrogation program the Bush administration authorized in 2002, a former State Department official told CNN on Thursday. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. The allegation was included in an online broadside aimed at former Vice President Dick Cheney by Lawrence Wilkerson, chief of staff for then-Secretary of State Colin Powell. In it, Wilkerson wrote that the interrogation program began in April and May of 2002, and then-Vice President Cheney's office kept close tabs on the questioning. \"Its principal priority for intelligence was not aimed at preempting another terrorist attack on the U.S. but discovering a smoking gun linking Iraq and al Qaeda,\" Wilkerson wrote in The Washington Note, an online political journal. Wilkerson is a retired Army Colonel and Powell's former chief of staff.", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "Finding a \"smoking gun\" linking Iraq and al Qaeda became the main purpose of the abusive interrogation program the Bush administration authorized in 2002, a former State Department official told CNN on Thursday. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. The allegation was included in an online broadside aimed at former Vice President Dick Cheney by Lawrence Wilkerson, chief of staff for then-Secretary of State Colin Powell. In it, Wilkerson wrote that the interrogation program began in April and May of 2002, and then-Vice President Cheney's office kept close tabs on the questioning. \"Its principal priority for intelligence was not aimed at preempting another terrorist attack on the U.S. but discovering a smoking gun linking Iraq and al Qaeda,\" Wilkerson wrote in The Washington Note, an online political journal.", 
        "reply": "Cheney has been talking frequently about how torture has saved hundreds of thousands of lives, but is that the real story?  Wilkerson is a retired Army Colonel and Powell's former chief of staff.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:13:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "Where's the proof?", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "Where's the proof?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:15:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "", 
        "reply": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:21:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I heard Custer screwed the pooch at the Little Big Horn.", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "", 
        "reply": "I heard Custer screwed the pooch at the Little Big Horn.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:43:00", 
        "title": "Now let's talk about lies.", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Yes it lacks facts, but since when is that a condition to post anything?", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "", 
        "reply": "Yes it lacks facts, but since when is that a condition to post anything?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:47:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "I've done some reading on Wilkerson, he doesn't have the best reputation, not very credible, and there's no corroboration of his claims from other sources. Like he said himself on CNN: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate.", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "", 
        "reply": "I've done some reading on Wilkerson, he doesn't have the best reputation, not very credible, and there's no corroboration of his claims from other sources. Like he said himself on CNN: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:56:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread.", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt?", 
        "reply": " You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 19:44:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Two words sum it up. \"career politicians.\"", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "", 
        "reply": "Two words sum it up. \"career politicians.\"", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 19:57:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread. Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time.", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread.", 
        "reply": " Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:00:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime.", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "", 
        "reply": "I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:17:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "intTime": 20090520, 
        "postID": 11, 
        "quote": "Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "reply": " The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:18:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you? That would be a hoot.", 
        "intTime": 20090520, 
        "postID": 12, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you?", 
        "reply": " That would be a hoot.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:32:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "reply": " Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:34:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread. Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time. BUZZZZZZZ!!!!!!! Wrong thread! Hey, I've wasted too much time already trying to explain the situation to you, if you truly want to figure it out, go and read all six pages of the Pelosi thread.", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread. Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time.", 
        "reply": " BUZZZZZZZ!!!!!!! Wrong thread! Hey, I've wasted too much time already trying to explain the situation to you, if you truly want to figure it out, go and read all six pages of the Pelosi thread.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:37:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "intTime": 20090520, 
        "postID": 15, 
        "quote": "", 
        "reply": "Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:50:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney. Profound statement. I just LOVE the way Vice-President Cheney gets under the left wing skin. Means he did, and is doing something right.", 
        "intTime": 20090520, 
        "postID": 16, 
        "quote": "Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "reply": " Profound statement. I just LOVE the way Vice-President Cheney gets under the left wing skin. Means he did, and is doing something right.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:59:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! You can take a fact and build any kind of theory you want. It's still a fact.", 
        "intTime": 20090520, 
        "postID": 17, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "reply": " You can take a fact and build any kind of theory you want. It's still a fact.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 21:04:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick[/QUOTE] The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?", 
        "intTime": 20090520, 
        "postID": 18, 
        "quote": "", 
        "reply": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick[/QUOTE] The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 21:13:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you? Never even met him!!", 
        "intTime": 20090520, 
        "postID": 19, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you?", 
        "reply": " Never even met him!!", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 21:20:00", 
        "title": "Now let's talk about lies.", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?", 
        "intTime": 20090520, 
        "postID": 20, 
        "quote": "Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "reply": " The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 23:54:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.", 
        "intTime": 20090521, 
        "postID": 21, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "reply": " Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 04:43:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.[/QUOTE] You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.", 
        "intTime": 20090521, 
        "postID": 22, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "reply": " You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.[/QUOTE] You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 10:45:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Yes it lacks facts, Like the dems/socialist agenda.", 
        "intTime": 20090521, 
        "postID": 23, 
        "quote": "Yes it lacks facts,", 
        "reply": " Like the dems/socialist agenda.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 11:10:00", 
        "title": "Now let's talk about lies.", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, Most Jews in America are democrats and liberal.", 
        "intTime": 20090521, 
        "postID": 24, 
        "quote": "Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish,", 
        "reply": " Most Jews in America are democrats and liberal.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 11:12:00", 
        "title": "Now let's talk about lies.", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney. Pierre Salinger was a WWII Navy vet but he was also an admitted liar and betrayed the U.S. by accusing the Navy of shooting down flight 800 and also a nut with his \"the DEA shot down PanAm fligt 103 over Lockerbie.\" He also respected the Constitution so much that he moved to France since the majority of Americans didn't vote the way he wanted them to. Also look at Murtha. Wilkerson's status does not make him any more reliable than anyone else.", 
        "intTime": 20090521, 
        "postID": 25, 
        "quote": "Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "reply": " Pierre Salinger was a WWII Navy vet but he was also an admitted liar and betrayed the U.S. by accusing the Navy of shooting down flight 800 and also a nut with his \"the DEA shot down PanAm fligt 103 over Lockerbie.\" He also respected the Constitution so much that he moved to France since the majority of Americans didn't vote the way he wanted them to. Also look at Murtha. Wilkerson's status does not make him any more reliable than anyone else.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 11:50:00", 
        "title": "Now let's talk about lies.", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.[/QUOTE] Guess what, I'll let you in on a little secret... China and especially Russia has been selling materials to Iran for their \"peaceful\" nuke program. It's not those \"megalomaniacs\" that I'm worried about, it's their blind followers that actually will, and do every-freaking-day, die for a fairy tale. Those are the ones that put on the suicide bomb vests, drive the VBIEDs, fly the planes into buildings. They're the ones that concern me. I'm concerned with a country that says it'll nuke another country that it calls the \"little Satan\" as soon as it gets a bomb, because guess what, the United States in the \"great Satan\". And finally, everyone that I've ever heard talk about the neo-con \"JIUCE\" are rampantly anti-Israel and anti-semitic. Of course you can say whatever you want about anything you want, this is the UNITED STATES of AMERICA!!!!! The greatest nation on God's green earth....I just want to see it stay that way. This message has been edited. Last edited by: psychoABN, Thu 21 May 2009 12:55 PM", 
        "intTime": 20090521, 
        "postID": 26, 
        "quote": "", 
        "reply": "You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.[/QUOTE] Guess what, I'll let you in on a little secret... China and especially Russia has been selling materials to Iran for their \"peaceful\" nuke program. It's not those \"megalomaniacs\" that I'm worried about, it's their blind followers that actually will, and do every-freaking-day, die for a fairy tale. Those are the ones that put on the suicide bomb vests, drive the VBIEDs, fly the planes into buildings. They're the ones that concern me. I'm concerned with a country that says it'll nuke another country that it calls the \"little Satan\" as soon as it gets a bomb, because guess what, the United States in the \"great Satan\". And finally, everyone that I've ever heard talk about the neo-con \"JIUCE\" are rampantly anti-Israel and anti-semitic. Of course you can say whatever you want about anything you want, this is the UNITED STATES of AMERICA!!!!! The greatest nation on God's green earth....I just want to see it stay that way. This message has been edited. Last edited by: psychoABN, Thu 21 May 2009 12:55 PM", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 12:39:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Cheney has been talking frequently about how torture has saved hundreds of thousands of lives, but is that the real story? quote: Finding a \"smoking gun\" linking Iraq and al Qaeda became the main purpose of the abusive interrogation program the Bush administration authorized in 2002, a former State Department official told CNN on Thursday. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. The allegation was included in an online broadside aimed at former Vice President Dick Cheney by Lawrence Wilkerson, chief of staff for then-Secretary of State Colin Powell. In it, Wilkerson wrote that the interrogation program began in April and May of 2002, and then-Vice President Cheney's office kept close tabs on the questioning. \"Its principal priority for intelligence was not aimed at preempting another terrorist attack on the U.S. but discovering a smoking gun linking Iraq and al Qaeda,\" Wilkerson wrote in The Washington Note, an online political journal. Wilkerson is a retired Army Colonel and Powell's former chief of staff.", 
        "intTime": 20090520, 
        "postID": 27, 
        "quote": "Finding a \"smoking gun\" linking Iraq and al Qaeda became the main purpose of the abusive interrogation program the Bush administration authorized in 2002, a former State Department official told CNN on Thursday. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. Dick Cheney's office ordered use of \"alternative\" techniques against CIA's recommendations, aide says. The allegation was included in an online broadside aimed at former Vice President Dick Cheney by Lawrence Wilkerson, chief of staff for then-Secretary of State Colin Powell. In it, Wilkerson wrote that the interrogation program began in April and May of 2002, and then-Vice President Cheney's office kept close tabs on the questioning. \"Its principal priority for intelligence was not aimed at preempting another terrorist attack on the U.S. but discovering a smoking gun linking Iraq and al Qaeda,\" Wilkerson wrote in The Washington Note, an online political journal.", 
        "reply": "Cheney has been talking frequently about how torture has saved hundreds of thousands of lives, but is that the real story?  Wilkerson is a retired Army Colonel and Powell's former chief of staff.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:13:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "Where's the proof?", 
        "intTime": 20090520, 
        "postID": 28, 
        "quote": "", 
        "reply": "Where's the proof?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:15:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "intTime": 20090520, 
        "postID": 29, 
        "quote": "", 
        "reply": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:21:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "I heard Custer screwed the pooch at the Little Big Horn.", 
        "intTime": 20090520, 
        "postID": 30, 
        "quote": "", 
        "reply": "I heard Custer screwed the pooch at the Little Big Horn.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:43:00", 
        "title": "Now let's talk about lies.", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Yes it lacks facts, but since when is that a condition to post anything?", 
        "intTime": 20090520, 
        "postID": 31, 
        "quote": "", 
        "reply": "Yes it lacks facts, but since when is that a condition to post anything?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:47:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "I've done some reading on Wilkerson, he doesn't have the best reputation, not very credible, and there's no corroboration of his claims from other sources. Like he said himself on CNN: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate.", 
        "intTime": 20090520, 
        "postID": 32, 
        "quote": "", 
        "reply": "I've done some reading on Wilkerson, he doesn't have the best reputation, not very credible, and there's no corroboration of his claims from other sources. Like he said himself on CNN: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 17:56:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread.", 
        "intTime": 20090520, 
        "postID": 33, 
        "quote": "Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt?", 
        "reply": " You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 19:44:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Two words sum it up. \"career politicians.\"", 
        "intTime": 20090520, 
        "postID": 34, 
        "quote": "", 
        "reply": "Two words sum it up. \"career politicians.\"", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 19:57:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread. Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time.", 
        "intTime": 20090520, 
        "postID": 35, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread.", 
        "reply": " Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:00:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime.", 
        "intTime": 20090520, 
        "postID": 36, 
        "quote": "", 
        "reply": "I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:17:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "intTime": 20090520, 
        "postID": 37, 
        "quote": "Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "reply": " The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:18:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you? That would be a hoot.", 
        "intTime": 20090520, 
        "postID": 38, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you?", 
        "reply": " That would be a hoot.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:32:00", 
        "title": "Now let's talk about lies.", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "intTime": 20090520, 
        "postID": 39, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "reply": " Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:34:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread. Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time. BUZZZZZZZ!!!!!!! Wrong thread! Hey, I've wasted too much time already trying to explain the situation to you, if you truly want to figure it out, go and read all six pages of the Pelosi thread.", 
        "intTime": 20090520, 
        "postID": 40, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by klassylady25: quote: I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. Can you say reasonable doubt? You might have as much luck with explaining that as I had explaining circumstantial evidence on the Pelosi thread. Circumstantial evidence can be used to gain a conviction. Problem is there would have to be a broken law. So, what law did Pelosi break? Take your time.", 
        "reply": " BUZZZZZZZ!!!!!!! Wrong thread! Hey, I've wasted too much time already trying to explain the situation to you, if you truly want to figure it out, go and read all six pages of the Pelosi thread.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:37:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "intTime": 20090520, 
        "postID": 41, 
        "quote": "", 
        "reply": "Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:50:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney. Profound statement. I just LOVE the way Vice-President Cheney gets under the left wing skin. Means he did, and is doing something right.", 
        "intTime": 20090520, 
        "postID": 42, 
        "quote": "Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "reply": " Profound statement. I just LOVE the way Vice-President Cheney gets under the left wing skin. Means he did, and is doing something right.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 20:59:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! You can take a fact and build any kind of theory you want. It's still a fact.", 
        "intTime": 20090520, 
        "postID": 43, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "reply": " You can take a fact and build any kind of theory you want. It's still a fact.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 21:04:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick[/QUOTE] The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?", 
        "intTime": 20090520, 
        "postID": 44, 
        "quote": "", 
        "reply": "Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick[/QUOTE] The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 21:13:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you? Never even met him!!", 
        "intTime": 20090520, 
        "postID": 45, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by DMarkUhler: I wonder how you would do up on the stage....in the mean time, being \"rattled\" is hardly a crime. I do very well on stage. I was a vocalist for years. I love acapela. Don't you?", 
        "reply": " Never even met him!!", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 21:20:00", 
        "title": "Now let's talk about lies.", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?", 
        "intTime": 20090520, 
        "postID": 46, 
        "quote": "Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick", 
        "reply": " The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.[/QUOTE] Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-20 23:54:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.", 
        "intTime": 20090521, 
        "postID": 47, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial.", 
        "reply": " Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! [/QUOTE] You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 04:43:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!! You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.[/QUOTE] You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.", 
        "intTime": 20090521, 
        "postID": 48, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: Since we're doing blogs, here's one from the New Republic: The Latest Delusions of Lawrence Wilkerson On Wednesday, Colin Powell's former Chief of Staff Lawrence Wilkerson wrote a post for Steve Clemons's The Washington Note blog which has been attracting some attention (Mike linked to it yesterday). In particular, Wilkerson wrote the following about Dick Cheney's public criticisms of the Obama administration's poilcy reversals on enhanced interrogation techniques: My investigations have revealed to me--vividly and clearly--that once the Abu Ghraib photographs were made public in the Spring of 2004, the CIA, its contractors, and everyone else involved in administering \"the Cheney methods of interrogation\", simply shut down.... [N]o torture or harsh interrogation techniques were employed by any U.S. interrogator for the entire second term of Cheney-Bush, 2005-2009. So, if we are to believe the protestations of Dick Cheney, that Obama's having shut down the \"Cheney interrogation methods\" will endanger the nation, what are we to say to Dick Cheney for having endangered the nation for the last four years of his vice presidency? There are several problems with this assertion. First is that there is no evidence to substantiate Wilkerson's claim that, after Abu Ghraib, \"No torture or harsh techniques were employed by any U.S. interrogator.\" How would Wilkerson even know this? He left the government with Powell four years ago. Oh yes, he has his \"investigations.\" And while it's true that Obama issued an executive order banning waterboarding, he left open the option of continuing the renditioning of terrorists to foreign countries, where, presumably, they will undergo worse ordeals than simulated drowning and being put in a small space with a caterpillar. The other sensational claim Wilkerson makes is that the Bush administration authorized the Egyptian government to waterboard a senior Egyptian al Qaeda leader named Ibn al Shaykh al Libi with the purpose of ginning up false intelligence connecting Iraq and al Qaeda. But as Thomas Joscelyn points out, al Libi actually divulged information about Iraq-al Qaeda links two months before Wilkerson claims he had been waterboarded. This information is available in a four-year old report, rendering Wilkerson's ruminations about the \"Sith Lord\" Cheney less than scoop-worthy, as well as inaccurate. But the more important thing people should know about Lawrence Wilkerson is that nothing he says can be taken at face value. The man is a third-rate conspiracy theorist and a borderline bigot. Here, for instance, is what he told Robert Dreyfuss, the former Middle East Editor of Lyndon LaRouche's Executive Intelligence Review and now a Senior Correspondent for the American Prospect and Contributing Editor to The Nation, in 2006, about David Wurmser, Doug Feith and other \"neocons\" in the Bush Defense Department: A lot of these guys, including Wurmser, I looked at as card-carrying members of the Likud party, as I did with Feith. You wouldn't open their wallet and find a card, but I often wondered if their primary allegiance was to their own country or to Israel. That was the thing that troubled me, because there was so much that they said and did that looked like it was more reflective of Israel's interest than our own. Perhaps the gravest charge that one can make about a government official is that he has dual loyalties. It is usually liberals who complain about being tarred as \"unpatriotic\" by conservatives, but for the past 8 years, the charge that a set of individuals put the interests of a foreign country ahead of their own was almost exclusively found in the precincts of the left (the exception being in the pages of The American Conservative, no edition of which seems to hit newsstands without at least one story alleging various and sundry Jewish - er - \"neocon\" plots). Wilkerson, as the former Chief of Staff to a Secretary of State, has taken this slander to a new level by offering a gloss of official-ness to it. This wouldn't be the first time, by the way, that Steve Clemons has handed over his blog to creepy people making outlandish assertions. A few months ago, he published a letter from Chas Freeman's grown son addressed to Jon Chait, Marty Peretz and me in which he accused us of being \"low-lives,\" \"schmucks\" and \"more loyal to Israel\" simply for questioning whether his father was an appropriate nominee to fill the position of Chairman of the National Intelligence Council. (Why is that Wilkerson, Freeman and people of their ilk seem incapable of having debates without accusing those who disagree with them of being traitors?) Another of Wilkerson's conspiracy theories is that \"neocons\" in the Bush administration attempted to push the Taiwanese government of Chen Shui-bien to declare independence from China. Such a move would, of course, precipitate a war with the Communist regime in Beijing, but the possibility of hostilities with a nuclear-armed China was apparently not enough to dissuade the likes of Doug Feith, Donald Rumsfeld, Paul Wolfowitz, John Bolton et. al. from their \"utopian\" fantasies. As with Wilkerson's other tales, this one similarly disappeared into the ether for lack of evidence. Wilkerson's post-government career has been one, drawn-out campaign of special pleading. Like his former boss, Wilkerson had ample opportunity to oppose the policies he's now so resoundingly condemning when he was in the State Department. But like Nancy Pelosi and waterboarding, he chose not to speak out until it became politically convenient. As State Department Chief of Staff, Wilkerson was intimately involved in preparing Colin Powell's presentation to the United Nations Security Council making the case for war. He was at Powell's side for four years. Yet only once the war started to become unpopular and he was safely ensconced elsewhere outside of government, did he decide to turn. What we're seeing here is a particularly nasty iteration of the long-simmering feud between Colin Powell and Dick Cheney, with one particularly hot-headed subordinate picking up the slack for his embittered former boss. Since departing government at the end of the first Bush term, Wilkerson has emerged as the most outspoken member of the Powell faction. One would think that Powell would want someone a little less paranoid and juvenile serving as his primary public advocate; that he would tell Wilkerson to turn the Jew-baiting and hysteria down a notch. That the former Secretary of State seems unbothered by his erstwhile Chief of Staff's behavior speaks volumes about his own character. Update: Here's what Wilkerson told CNN about his allegations (via John McCormack): I couldn't walk into a courtroom and prove this to anybody, but I'm pretty sure it's fairly accurate. What a high evidentiary standard! How unfortunate that a man of such fine ethical caliber no longer works in the State Department --James Kirchick The claim that the neocons had close ties and support deep within the Likud government is hardly a secret and to scoff at this is a form of denial. Oooooooooooo, anti-semitic conspiracy theories, FUN!!!!!!!!!", 
        "reply": " You can take a fact and build any kind of theory you want. It's still a fact.[/QUOTE] Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, have strong ties to the Jewish Likud Party in Israel, a Jewish nation, and influence the action of the US government in favor of Jewish interests...Hmmmmmmmmmmmmm... YEP!!!!!!!!!! So........what do you have against Jews?[/QUOTE] If you did some basic research you'd already know that it's an undisguised fact. Looks like you're doing OK with Jew bashing all by yourself since you seem to think that Jews being Jews must all think and behave the same. You couldn't be more wrong. The right wing Jews in Israel are already sowing divisiveness by calling the American Jews that backed Obama traitors to the cause of Jewry, whatever that is. What's your take on that?[/QUOTE] Ohhhhhhhh No you you don't. You brought up the \"neo-con\" conspiracy, out of the blue. AS far as what Jews in Israel might think about the current administration, from the meeting between Netanyahu and Obama, I can't say that I blame them. After all, President Obama said to give Iran until the end of the year for his \"diplomacy\" to work, and the very next day, Iran launches a missle that can reach Israel. So much for \"Smart Power\". Not so smart. Iran pretty much made the President look a fool by giving him the finger a day after that meeting.[/QUOTE] You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 10:45:00", 
        "title": "Now let's talk about lies.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Yes it lacks facts, Like the dems/socialist agenda.", 
        "intTime": 20090521, 
        "postID": 49, 
        "quote": "Yes it lacks facts,", 
        "reply": " Like the dems/socialist agenda.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 11:10:00", 
        "title": "Now let's talk about lies.", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish, Most Jews in America are democrats and liberal.", 
        "intTime": 20090521, 
        "postID": 50, 
        "quote": "Sooooo, you're saying that it's a fact that the neo-cons, which a lot of, hell, most of them are Jewish,", 
        "reply": " Most Jews in America are democrats and liberal.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 11:12:00", 
        "title": "Now let's talk about lies.", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney. Pierre Salinger was a WWII Navy vet but he was also an admitted liar and betrayed the U.S. by accusing the Navy of shooting down flight 800 and also a nut with his \"the DEA shot down PanAm fligt 103 over Lockerbie.\" He also respected the Constitution so much that he moved to France since the majority of Americans didn't vote the way he wanted them to. Also look at Murtha. Wilkerson's status does not make him any more reliable than anyone else.", 
        "intTime": 20090521, 
        "postID": 51, 
        "quote": "Originally posted by Fightdirector: Let's see: Wilkerson is a retired Army Colonel Cheney is a yellow-bellied, gutless, cowardly draft-dodger. based on the above data, i would say that Colonel Wilkerson is more likely to be telling the truth than the draft-dodging Cheney.", 
        "reply": " Pierre Salinger was a WWII Navy vet but he was also an admitted liar and betrayed the U.S. by accusing the Navy of shooting down flight 800 and also a nut with his \"the DEA shot down PanAm fligt 103 over Lockerbie.\" He also respected the Constitution so much that he moved to France since the majority of Americans didn't vote the way he wanted them to. Also look at Murtha. Wilkerson's status does not make him any more reliable than anyone else.", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 11:50:00", 
        "title": "Now let's talk about lies.", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.[/QUOTE] Guess what, I'll let you in on a little secret... China and especially Russia has been selling materials to Iran for their \"peaceful\" nuke program. It's not those \"megalomaniacs\" that I'm worried about, it's their blind followers that actually will, and do every-freaking-day, die for a fairy tale. Those are the ones that put on the suicide bomb vests, drive the VBIEDs, fly the planes into buildings. They're the ones that concern me. I'm concerned with a country that says it'll nuke another country that it calls the \"little Satan\" as soon as it gets a bomb, because guess what, the United States in the \"great Satan\". And finally, everyone that I've ever heard talk about the neo-con \"JIUCE\" are rampantly anti-Israel and anti-semitic. Of course you can say whatever you want about anything you want, this is the UNITED STATES of AMERICA!!!!! The greatest nation on God's green earth....I just want to see it stay that way. This message has been edited. Last edited by: psychoABN, Thu 21 May 2009 12:55 PM", 
        "intTime": 20090521, 
        "postID": 52, 
        "quote": "", 
        "reply": "You can take that anti-Semite BS and shove it. Damn near everybody in the ME is a Semite. I'll speak freely about any state or government I feel like and you're the one that brought up the conspiracy angle, not me. I stated a fact and you pulled something out of your 4th point. Obama didn't make the stupid move, Iran did. They're trying to get some chips on the table. Once again, look at a map. They can hit Israel and Iraq. They can also hit Turkey, Russia, Egypt, China, Saudi Arabia, Pakistan and India. They just made their rivals unite against them and they have even pizzed off Russia and China. Advantage Obama. That calipahte crap that so frightens you right wingers is mainly for consumption of the true believers. Those megalomaniacs that pull the strings have no intention of dying for fairy tales.[/QUOTE] Guess what, I'll let you in on a little secret... China and especially Russia has been selling materials to Iran for their \"peaceful\" nuke program. It's not those \"megalomaniacs\" that I'm worried about, it's their blind followers that actually will, and do every-freaking-day, die for a fairy tale. Those are the ones that put on the suicide bomb vests, drive the VBIEDs, fly the planes into buildings. They're the ones that concern me. I'm concerned with a country that says it'll nuke another country that it calls the \"little Satan\" as soon as it gets a bomb, because guess what, the United States in the \"great Satan\". And finally, everyone that I've ever heard talk about the neo-con \"JIUCE\" are rampantly anti-Israel and anti-semitic. Of course you can say whatever you want about anything you want, this is the UNITED STATES of AMERICA!!!!! The greatest nation on God's green earth....I just want to see it stay that way. This message has been edited. Last edited by: psychoABN, Thu 21 May 2009 12:55 PM", 
        "threadID": "409192893_2380097322001", 
        "time": "2009-05-21 12:39:00", 
        "title": "Now let's talk about lies.", 
        "userID": "psychoABN"
    }
]