[
    {
        "content": "I think these individuals show quite clearly that it can be done quicker, better, and cheaper if GOVT is left out of the process. quote: Their livelihood was being threatened, and they were tired of waiting for government help, so business owners and residents on Hawaii's Kauai island pulled together and completed a $4 million repair job to a state park -- for free. Polihale State Park has been closed since severe flooding destroyed an access road to the park and damaged facilities in December. The state Department of Land and Natural Resources had estimated that the damage would cost $4 million to fix, money the agency doesn't have, according to a news release from department Chairwoman Laura Thielen. \"It would not have been open this summer, and it probably wouldn't be open next summer,\" said Bruce Pleas, a local surfer who helped organize the volunteers. \"They said it would probably take two years. And with the way they are cutting funds, we felt like they'd never get the money to fix it.\" And if the repairs weren't made, some business owners faced the possibility of having to shut down. Ivan Slack, co-owner of Napali Kayak, said his company relies solely on revenue from kayak tours and needs the state park to be open to operate. The company jumped in and donated resources because it knew that without the repairs, Napali Kayak would be in financial trouble. \"If the park is not open, it would be extreme for us, to say the least,\" he said. \"Bankruptcy would be imminent. How many years can you be expected to continue operating, owning 15-passenger vans, $2 million in insurance and a staff? For us, it was crucial, and our survival was dependent on it. That park is the key to the sheer survival of the business.\" So Slack, other business owners and residents made the decision not to sit on their hands and wait for state money that many expected would never come. Instead, they pulled together machinery and manpower and hit the ground running March 23. And after only eight days, all of the repairs were done, Pleas said. It was a shockingly quick fix to a problem that may have taken much longer if they waited for state money to funnel in. \"We can wait around for the state or federal government to make this move, or we can go out and do our part,\" Slack said. \"Just like everyone's sitting around waiting for a stimulus check, we were waiting for this but decided we couldn't wait anymore.\" Thielen has been waiting, too. She wants the legislature to approve her Recreation Renaissance project, a $240 million booster shot to help fix parks across the state. Without it, at least five state parks may be forced to close, and there would be no emergency repair money to fix Polihale State Park. -http://edition.cnn.com/2009/US/04/09/hawaii.volunteers.repair/index.html", 
        "intTime": 20090410, 
        "postID": 1, 
        "quote": "Their livelihood was being threatened, and they were tired of waiting for government help, so business owners and residents on Hawaii's Kauai island pulled together and completed a $4 million repair job to a state park -- for free. Polihale State Park has been closed since severe flooding destroyed an access road to the park and damaged facilities in December. The state Department of Land and Natural Resources had estimated that the damage would cost $4 million to fix, money the agency doesn't have, according to a news release from department Chairwoman Laura Thielen. \"It would not have been open this summer, and it probably wouldn't be open next summer,\" said Bruce Pleas, a local surfer who helped organize the volunteers. \"They said it would probably take two years. And with the way they are cutting funds, we felt like they'd never get the money to fix it.\" And if the repairs weren't made, some business owners faced the possibility of having to shut down. Ivan Slack, co-owner of Napali Kayak, said his company relies solely on revenue from kayak tours and needs the state park to be open to operate. The company jumped in and donated resources because it knew that without the repairs, Napali Kayak would be in financial trouble. \"If the park is not open, it would be extreme for us, to say the least,\" he said. \"Bankruptcy would be imminent. How many years can you be expected to continue operating, owning 15-passenger vans, $2 million in insurance and a staff? For us, it was crucial, and our survival was dependent on it. That park is the key to the sheer survival of the business.\" So Slack, other business owners and residents made the decision not to sit on their hands and wait for state money that many expected would never come. Instead, they pulled together machinery and manpower and hit the ground running March 23. And after only eight days, all of the repairs were done, Pleas said. It was a shockingly quick fix to a problem that may have taken much longer if they waited for state money to funnel in. \"We can wait around for the state or federal government to make this move, or we can go out and do our part,\" Slack said. \"Just like everyone's sitting around waiting for a stimulus check, we were waiting for this but decided we couldn't wait anymore.\" Thielen has been waiting, too. She wants the legislature to approve her Recreation Renaissance project, a $240 million booster shot to help fix parks across the state. Without it, at least five state parks may be forced to close, and there would be no emergency repair money to fix Polihale State Park.", 
        "reply": "I think these individuals show quite clearly that it can be done quicker, better, and cheaper if GOVT is left out of the process.  -http://edition.cnn.com/2009/US/04/09/hawaii.volunteers.repair/index.html", 
        "threadID": "409192893_1930063022001", 
        "time": "2009-04-10 08:35:00", 
        "title": "A Lesson on the Need for Govt", 
        "userID": "floersh"
    }, 
    {
        "content": "There is no doubt that the government adds a layer of bureaucracy, and makes even the most minor job a professional position with benefits and retirement. Still, this is a hard thing to institutionalize. If the parks were private, they would probably not exist in many places, as the land would be more valuable for development. The estimates from the government were probably based on private industry estimates, so they are already hiring out the actual work. Volunteers cannot normally be counted on to do the work - this was an unusual case. Plus what would have happened if someone was hurt, or something important was damaged? Who was liable? Government contracting at all levels gets expensive for a bunch of reasons, some valid, some not.", 
        "intTime": 20090410, 
        "postID": 2, 
        "quote": "", 
        "reply": "There is no doubt that the government adds a layer of bureaucracy, and makes even the most minor job a professional position with benefits and retirement. Still, this is a hard thing to institutionalize. If the parks were private, they would probably not exist in many places, as the land would be more valuable for development. The estimates from the government were probably based on private industry estimates, so they are already hiring out the actual work. Volunteers cannot normally be counted on to do the work - this was an unusual case. Plus what would have happened if someone was hurt, or something important was damaged? Who was liable? Government contracting at all levels gets expensive for a bunch of reasons, some valid, some not.", 
        "threadID": "409192893_1930063022001", 
        "time": "2009-04-10 08:57:00", 
        "title": "A Lesson on the Need for Govt", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Government, even at its finest, is inherintly evil... Any farmer or rancher will tell you that we have nightmares about those famous words... \"I'm from the federal government and I'm here to help.\"", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "", 
        "reply": "Government, even at its finest, is inherintly evil... Any farmer or rancher will tell you that we have nightmares about those famous words... \"I'm from the federal government and I'm here to help.\"", 
        "threadID": "409192893_1930063022001", 
        "time": "2009-04-10 08:58:00", 
        "title": "A Lesson on the Need for Govt", 
        "userID": "OldUSAFSniper"
    }
]