[
    {
        "content": "As I recover from a snowball fight with the little ones..and ready myself for more...A few things on my mind... 1: Snow is horriable. Why do people still live in the snowbelt? And global warming is a myth: +++http://www.washingtonpost.com/wp-dyn/content/article/2009/02/26/AR2009022602906.html?sub=AR Note that the New York Times attacked this article because they claim Will's sources are wrong.. One of the major sources? The New York Times.. Funny 2: Running sucks. The only good thing about running is stopping. I've played hockey, football, kickboxed, and power lifted my entire life. Sports that require intense short bursts of energy. Running? Running hurts. Running is for people that weigh less then 180. 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president. 4: We've lost something in this nation. I'm not sure what to call it. I can still recall a time when people could disagree without demonizing each other..for sure I'm as guilty as any other right? But I also recall a time when you could expect a certain level respect, when people where just a bit more polite to each other in daily life. I walked into a small chain store this morning to buy one of my bad habits: diet coke..I was the only person in the place besides the manager..and she couldn't even be bothered to look up from the counter..or even look at me when I placed my order. I know I'm not exactly Tom Cruise..but really? I dont know why or when this happned, but our culture has lost a certain level of class.. 5: You should do at least one thing in your life that could end you up in the back seat of a police car. I said this to one of the older soccer moms during one of my son's games last fall.. She was horrified. I spent a few minutes picking her brain and getting to know her after that. My questions and train of thought must have touched a nerve..because towards the end of our conversation she started getting a little sad. Seems she has some regrets..looking back on her life..she feels like maybe she never really lived..because she was afraid too. I dont know what any of this means. Strange things pop into my head when I'm shoveling snow at 0400. Well back to the snow ball fight!", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "As I recover from a snowball fight with the little ones..and ready myself for more...A few things on my mind... 1: Snow is horriable. Why do people still live in the snowbelt? And global warming is a myth: +++http://www.washingtonpost.com/wp-dyn/content/article/2009/02/26/AR2009022602906.html?sub=AR Note that the New York Times attacked this article because they claim Will's sources are wrong.. One of the major sources? The New York Times.. Funny 2: Running sucks. The only good thing about running is stopping. I've played hockey, football, kickboxed, and power lifted my entire life. Sports that require intense short bursts of energy. Running? Running hurts. Running is for people that weigh less then 180. 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president. 4: We've lost something in this nation. I'm not sure what to call it. I can still recall a time when people could disagree without demonizing each other..for sure I'm as guilty as any other right? But I also recall a time when you could expect a certain level respect, when people where just a bit more polite to each other in daily life. I walked into a small chain store this morning to buy one of my bad habits: diet coke..I was the only person in the place besides the manager..and she couldn't even be bothered to look up from the counter..or even look at me when I placed my order. I know I'm not exactly Tom Cruise..but really? I dont know why or when this happned, but our culture has lost a certain level of class.. 5: You should do at least one thing in your life that could end you up in the back seat of a police car. I said this to one of the older soccer moms during one of my son's games last fall.. She was horrified. I spent a few minutes picking her brain and getting to know her after that. My questions and train of thought must have touched a nerve..because towards the end of our conversation she started getting a little sad. Seems she has some regrets..looking back on her life..she feels like maybe she never really lived..because she was afraid too. I dont know what any of this means. Strange things pop into my head when I'm shoveling snow at 0400. Well back to the snow ball fight!", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 08:33:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "threerings"
    }, 
    {
        "content": "40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "", 
        "reply": "40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground.", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 08:41:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground. We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it.", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground.", 
        "reply": " We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it.", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 08:45:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground. We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it. We've had 15 FEET this year.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "Originally posted by floersh: quote: Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground. We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it.", 
        "reply": " We've had 15 FEET this year.", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 08:52:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by floersh: quote: Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground. We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it. We've had 15 FEET this year. Well you must realize that this is the South. It hardly ever snows down here. And when it does it sticks even less often. So sticking snow is something to talk about. But I do remember much larger storms. I lived in Penn. for a number of years. I remember the big NorEasters of 95 and 03... As a kid I loved the snow. Not so much as an adult.. I feel for ya. But your probably getting some time off with the kids.. Enjoy your snow ball fight..", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "Originally posted by threerings: quote: Originally posted by floersh: quote: Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground. We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it. We've had 15 FEET this year.", 
        "reply": " Well you must realize that this is the South. It hardly ever snows down here. And when it does it sticks even less often. So sticking snow is something to talk about. But I do remember much larger storms. I lived in Penn. for a number of years. I remember the big NorEasters of 95 and 03... As a kid I loved the snow. Not so much as an adult.. I feel for ya. But your probably getting some time off with the kids.. Enjoy your snow ball fight..", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 09:03:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by threerings: quote: Originally posted by floersh: quote: Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground. We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it. We've had 15 FEET this year. Well you must realize that this is the South. It hardly ever snows down here. And when it does it sticks even less often. So sticking snow is something to talk about. But I do remember much larger storms. I lived in Penn. for a number of years. I remember the big NorEasters of 95 and 03... As a kid I loved the snow. Not so much as an adult.. I feel for ya. But your probably getting some time off with the kids.. Enjoy your snow ball fight.. Seems I wore them out.. It should start snowing again this afternoon.. I'll send the little buggers out to shovel..and then conduct a movement to contact", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "Originally posted by floersh: quote: Originally posted by threerings: quote: Originally posted by floersh: quote: Originally posted by GunnyRet03: 40 here in Beaufort SC. I'd like to see a little snow, but it would melt once it hit the ground. We had the rare treat yesterday here on the west side Atlanta. It snowed for several hours, eventually some began to stick, and we still have a tad bit on our lawn today.. The kids thouroughly enjoyed it. We've had 15 FEET this year. Well you must realize that this is the South. It hardly ever snows down here. And when it does it sticks even less often. So sticking snow is something to talk about. But I do remember much larger storms. I lived in Penn. for a number of years. I remember the big NorEasters of 95 and 03... As a kid I loved the snow. Not so much as an adult.. I feel for ya. But your probably getting some time off with the kids.. Enjoy your snow ball fight..", 
        "reply": " Seems I wore them out.. It should start snowing again this afternoon.. I'll send the little buggers out to shovel..and then conduct a movement to contact", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 09:10:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president. here's a thought 3rings.... it was said this past week on a show trying to put a perspective to the amount of monies being borrowed, er, made by the Obama team.... it said if you lined up one dollar bills end to end they would stretch all the way to the sun and back... and then back to the sun and almost back to earth.... and the sun is what? 93 million miles away. Just something interesting to ponder what PO is doing. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "Originally posted by threerings: 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president.", 
        "reply": " here's a thought 3rings.... it was said this past week on a show trying to put a perspective to the amount of monies being borrowed, er, made by the Obama team.... it said if you lined up one dollar bills end to end they would stretch all the way to the sun and back... and then back to the sun and almost back to earth.... and the sun is what? 93 million miles away. Just something interesting to ponder what PO is doing. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 10:53:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by threerings: 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president. here's a thought 3rings.... it was said this past week on a show trying to put a perspective to the amount of monies being borrowed, er, made by the Obama team.... it said if you lined up one dollar bills end to end they would stretch all the way to the sun and back... and then back to the sun and almost back to earth.... and the sun is what? 93 million miles away. Just something interesting to ponder what PO is doing. It really blows the mind that the best the left can do is sputter: hey ur..BUSH SPENT MONEY TOO! As if Bush's spending wasn't ENOUGH to forestal the economic crisis.. WE NEED TO SPEND MORE! Then ask them to explain how more spending will help...and get nothing. I mean nothing.", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by threerings: 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president. here's a thought 3rings.... it was said this past week on a show trying to put a perspective to the amount of monies being borrowed, er, made by the Obama team.... it said if you lined up one dollar bills end to end they would stretch all the way to the sun and back... and then back to the sun and almost back to earth.... and the sun is what? 93 million miles away. Just something interesting to ponder what PO is doing.", 
        "reply": " It really blows the mind that the best the left can do is sputter: hey ur..BUSH SPENT MONEY TOO! As if Bush's spending wasn't ENOUGH to forestal the economic crisis.. WE NEED TO SPEND MORE! Then ask them to explain how more spending will help...and get nothing. I mean nothing.", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 13:38:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by m551sheridan: quote: Originally posted by threerings: 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president. here's a thought 3rings.... it was said this past week on a show trying to put a perspective to the amount of monies being borrowed, er, made by the Obama team.... it said if you lined up one dollar bills end to end they would stretch all the way to the sun and back... and then back to the sun and almost back to earth.... and the sun is what? 93 million miles away. Just something interesting to ponder what PO is doing. It really blows the mind that the best the left can do is sputter: hey ur..BUSH SPENT MONEY TOO! As if Bush's spending wasn't ENOUGH to forestal the economic crisis.. WE NEED TO SPEND MORE! Then ask them to explain how more spending will help...and get nothing. I mean nothing. yepper, just had a congressman on N. Cavuto and he was asking him a very similar question.. Cavuto also mentioned why when Bush was spending the dems were screeming - your spending to much, your spending to much.. but when you(dems) are spending all you can say is we have to spend, we have to spend... and Neil had him stuttering, over and over and over again... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090302, 
        "postID": 9, 
        "quote": "Originally posted by threerings: quote: Originally posted by m551sheridan: quote: Originally posted by threerings: 3: The Wall Street Journal calulated that if you took every cent that the people over 250K make..it wouldnt come close to paying for Obama's spending plan. Obama plans to create more debt for this nation then the combined debt of EVERY other president. here's a thought 3rings.... it was said this past week on a show trying to put a perspective to the amount of monies being borrowed, er, made by the Obama team.... it said if you lined up one dollar bills end to end they would stretch all the way to the sun and back... and then back to the sun and almost back to earth.... and the sun is what? 93 million miles away. Just something interesting to ponder what PO is doing. It really blows the mind that the best the left can do is sputter: hey ur..BUSH SPENT MONEY TOO! As if Bush's spending wasn't ENOUGH to forestal the economic crisis.. WE NEED TO SPEND MORE! Then ask them to explain how more spending will help...and get nothing. I mean nothing.", 
        "reply": " yepper, just had a congressman on N. Cavuto and he was asking him a very similar question.. Cavuto also mentioned why when Bush was spending the dems were screeming - your spending to much, your spending to much.. but when you(dems) are spending all you can say is we have to spend, we have to spend... and Neil had him stuttering, over and over and over again... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_1450076612001", 
        "time": "2009-03-02 13:47:00", 
        "title": "Random Thoughts on a snowy day..", 
        "userID": "m551sheridan"
    }
]