[
    {
        "content": "does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "", 
        "reply": "does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 04:27:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "He is a puppet of Nancy P.", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "", 
        "reply": "He is a puppet of Nancy P.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 04:42:00", 
        "title": "teleprompter??", 
        "userID": "Duster6"
    }, 
    {
        "content": "The TOTUS has made a statement on the snafu. 'http://baracksteleprompter.blogspot.com/'", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "", 
        "reply": "The TOTUS has made a statement on the snafu. 'http://baracksteleprompter.blogspot.com/'", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:28:00", 
        "title": "teleprompter??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "intTime": 20090428, 
        "postID": 4, 
        "quote": "Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "reply": " You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:30:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "", 
        "reply": "WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:58:00", 
        "title": "teleprompter??", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "intTime": 20090428, 
        "postID": 6, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "reply": " Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 06:10:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm Wonderful critique of his presidency. Try focusing on something that matters. You desperate right wingers. Looking for the most trivial thing to bash your President with. Sad really.", 
        "intTime": 20090428, 
        "postID": 7, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "reply": " Wonderful critique of his presidency. Try focusing on something that matters. You desperate right wingers. Looking for the most trivial thing to bash your President with. Sad really.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 06:39:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "intTime": 20090428, 
        "postID": 8, 
        "quote": "Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "reply": " Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:29:00", 
        "title": "teleprompter??", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "intTime": 20090428, 
        "postID": 9, 
        "quote": "critique of his presidency", 
        "reply": " it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:39:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure Let me get this straight. Obama bows to a king and offers some apologies for some past American screw ups and you condemn his entire presidency after 100 days? When he starts a couple of wars and falls asleep at the wheel of national security, we’ll talk. Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Cripes, the list goes on and on of less than desirable \"records\" to have associated with ones administration. I can't imagine the feeling one must have knowing they voted for that inept dude and all the death and destruction that came with him. Tough to sleep at night???", 
        "intTime": 20090428, 
        "postID": 10, 
        "quote": "Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "reply": " Let me get this straight. Obama bows to a king and offers some apologies for some past American screw ups and you condemn his entire presidency after 100 days? When he starts a couple of wars and falls asleep at the wheel of national security, we’ll talk. Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Cripes, the list goes on and on of less than desirable \"records\" to have associated with ones administration. I can't imagine the feeling one must have knowing they voted for that inept dude and all the death and destruction that came with him. Tough to sleep at night???", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:57:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "intTime": 20090428, 
        "postID": 11, 
        "quote": "Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\".", 
        "reply": " Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:07:00", 
        "title": "teleprompter??", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old Clearly you're a Bush supporter to justify your screwed up decision to support him. Don't worry, the country will forgive you eventually. In the meantime, you'll feel better once you admit what a mistake it was to put that guy in office twice. We all make mistakes. Just so happens your mistake was pretty freaking costly in lives and treasure. You can dismiss them as talking points if it makes you feel better.", 
        "intTime": 20090428, 
        "postID": 12, 
        "quote": "Originally posted by ACR26: quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "reply": " Clearly you're a Bush supporter to justify your screwed up decision to support him. Don't worry, the country will forgive you eventually. In the meantime, you'll feel better once you admit what a mistake it was to put that guy in office twice. We all make mistakes. Just so happens your mistake was pretty freaking costly in lives and treasure. You can dismiss them as talking points if it makes you feel better.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:17:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure I predict the Bush apologists will name a school of higher (at least a middle school) learning after him in the decades to come to help mitigate the low opinion most Americans have of him.", 
        "intTime": 20090428, 
        "postID": 13, 
        "quote": "Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "reply": " I predict the Bush apologists will name a school of higher (at least a middle school) learning after him in the decades to come to help mitigate the low opinion most Americans have of him.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:44:00", 
        "title": "teleprompter??", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "intTime": 20090428, 
        "postID": 14, 
        "quote": "", 
        "reply": "Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:12:00", 
        "title": "teleprompter??", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: US Senator how do you vote senator obama um uh uh aaa umh uh************ i vote present he is a hyde park creation completely controlled by george soros, does not have a original bone or thought in his head history will prove this out. how much has he spent in 100 days?? we will talk about history when we have to unpuck what he has done and at least i have the balls to say who i am, where i am. and i dont hide", 
        "intTime": 20090428, 
        "postID": 15, 
        "quote": "US Senator", 
        "reply": " how do you vote senator obama um uh uh aaa umh uh************ i vote present he is a hyde park creation completely controlled by george soros, does not have a original bone or thought in his head history will prove this out. how much has he spent in 100 days?? we will talk about history when we have to unpuck what he has done and at least i have the balls to say who i am, where i am. and i dont hide", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:18:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "intTime": 20090428, 
        "postID": 16, 
        "quote": "Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "reply": " Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:23:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN Why would anyone want to be assimilated by the LOSING Repub party with it's constant whining and sulking? After all they are losing membership fast because of the way they are acting.", 
        "intTime": 20090428, 
        "postID": 17, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "reply": " Why would anyone want to be assimilated by the LOSING Repub party with it's constant whining and sulking? After all they are losing membership fast because of the way they are acting.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:26:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Boots_: How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. By BHO's own admission he seemed to take care of himself in that area(drugs).", 
        "intTime": 20090428, 
        "postID": 18, 
        "quote": "Originally posted by Boots_: How dare he make it to Harvard without Herbert Walker funding his cocaine escapades.", 
        "reply": " By BHO's own admission he seemed to take care of himself in that area(drugs).", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:31:00", 
        "title": "teleprompter??", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost? You seem to forget that Dems did the same while out of power. SOP for the party on the outside looking in.", 
        "intTime": 20090428, 
        "postID": 19, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "reply": " You seem to forget that Dems did the same while out of power. SOP for the party on the outside looking in.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:32:00", 
        "title": "teleprompter??", 
        "userID": "67NOV"
    }, 
    {
        "content": "", 
        "intTime": 20090428, 
        "postID": 20, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:50:00", 
        "title": "teleprompter??", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "intTime": 20090428, 
        "postID": 21, 
        "quote": "Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "reply": " WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:54:00", 
        "title": "teleprompter??", 
        "userID": "navy8086"
    }, 
    {
        "content": "The entire thing is really funny. When you take in account of how aften he has been described as the best orator in Washington, his Telepromter gaffes are funny. He does rely TOO much on it. That said, i am not saying he can't think on his own, just that he isn't all that great of a speech giver without one. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090428, 
        "postID": 22, 
        "quote": "", 
        "reply": "The entire thing is really funny. When you take in account of how aften he has been described as the best orator in Washington, his Telepromter gaffes are funny. He does rely TOO much on it. That said, i am not saying he can't think on his own, just that he isn't all that great of a speech giver without one. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:01:00", 
        "title": "teleprompter??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! OUTSTANDING. I could not agree more.", 
        "intTime": 20090428, 
        "postID": 23, 
        "quote": "Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "reply": " OUTSTANDING. I could not agree more.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:05:00", 
        "title": "teleprompter??", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090428, 
        "postID": 24, 
        "quote": "Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\"", 
        "reply": " ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:35:00", 
        "title": "teleprompter??", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !? The preponderance of fake and manufactured issues being used by the Repub party and the \"complete\" (unlike the Demo's almost complete) refusal of the Repub party to present any valid alternatives to policies. The way the Repub party leadership whines and sulks and the way the remaining members of the party continue to parrot the attacks made by the talking heads.", 
        "intTime": 20090428, 
        "postID": 25, 
        "quote": "Originally posted by navy8086: quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "reply": " The preponderance of fake and manufactured issues being used by the Repub party and the \"complete\" (unlike the Demo's almost complete) refusal of the Repub party to present any valid alternatives to policies. The way the Repub party leadership whines and sulks and the way the remaining members of the party continue to parrot the attacks made by the talking heads.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:24:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! I hate it too. Makes me sick to my stomach.", 
        "intTime": 20090428, 
        "postID": 26, 
        "quote": "Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "reply": " I hate it too. Makes me sick to my stomach.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:24:00", 
        "title": "teleprompter??", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. Decision based on the BUSH admin report that had all information that even implied that Sadam might not have WMD program and that REMOVED the information that the WORST case for Iraq getting WMD was almost 10 years.", 
        "intTime": 20090428, 
        "postID": 27, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else.", 
        "reply": " Decision based on the BUSH admin report that had all information that even implied that Sadam might not have WMD program and that REMOVED the information that the WORST case for Iraq getting WMD was almost 10 years.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:27:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. You continue to be confused and drunk on the Republican kool-aide. I can't help you my friend.", 
        "intTime": 20090428, 
        "postID": 28, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else.", 
        "reply": " You continue to be confused and drunk on the Republican kool-aide. I can't help you my friend.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 12:02:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "intTime": 20090428, 
        "postID": 29, 
        "quote": "", 
        "reply": "does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 04:27:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "He is a puppet of Nancy P.", 
        "intTime": 20090428, 
        "postID": 30, 
        "quote": "", 
        "reply": "He is a puppet of Nancy P.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 04:42:00", 
        "title": "teleprompter??", 
        "userID": "Duster6"
    }, 
    {
        "content": "The TOTUS has made a statement on the snafu. 'http://baracksteleprompter.blogspot.com/'", 
        "intTime": 20090428, 
        "postID": 31, 
        "quote": "", 
        "reply": "The TOTUS has made a statement on the snafu. 'http://baracksteleprompter.blogspot.com/'", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:28:00", 
        "title": "teleprompter??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "intTime": 20090428, 
        "postID": 32, 
        "quote": "Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "reply": " You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:30:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "intTime": 20090428, 
        "postID": 33, 
        "quote": "", 
        "reply": "WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:58:00", 
        "title": "teleprompter??", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "intTime": 20090428, 
        "postID": 34, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "reply": " Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 06:10:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm Wonderful critique of his presidency. Try focusing on something that matters. You desperate right wingers. Looking for the most trivial thing to bash your President with. Sad really.", 
        "intTime": 20090428, 
        "postID": 35, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "reply": " Wonderful critique of his presidency. Try focusing on something that matters. You desperate right wingers. Looking for the most trivial thing to bash your President with. Sad really.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 06:39:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "intTime": 20090428, 
        "postID": 36, 
        "quote": "Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "reply": " Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:29:00", 
        "title": "teleprompter??", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "intTime": 20090428, 
        "postID": 37, 
        "quote": "critique of his presidency", 
        "reply": " it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:39:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure Let me get this straight. Obama bows to a king and offers some apologies for some past American screw ups and you condemn his entire presidency after 100 days? When he starts a couple of wars and falls asleep at the wheel of national security, we’ll talk. Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Cripes, the list goes on and on of less than desirable \"records\" to have associated with ones administration. I can't imagine the feeling one must have knowing they voted for that inept dude and all the death and destruction that came with him. Tough to sleep at night???", 
        "intTime": 20090428, 
        "postID": 38, 
        "quote": "Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "reply": " Let me get this straight. Obama bows to a king and offers some apologies for some past American screw ups and you condemn his entire presidency after 100 days? When he starts a couple of wars and falls asleep at the wheel of national security, we’ll talk. Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Cripes, the list goes on and on of less than desirable \"records\" to have associated with ones administration. I can't imagine the feeling one must have knowing they voted for that inept dude and all the death and destruction that came with him. Tough to sleep at night???", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:57:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "intTime": 20090428, 
        "postID": 39, 
        "quote": "Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\".", 
        "reply": " Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:07:00", 
        "title": "teleprompter??", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old Clearly you're a Bush supporter to justify your screwed up decision to support him. Don't worry, the country will forgive you eventually. In the meantime, you'll feel better once you admit what a mistake it was to put that guy in office twice. We all make mistakes. Just so happens your mistake was pretty freaking costly in lives and treasure. You can dismiss them as talking points if it makes you feel better.", 
        "intTime": 20090428, 
        "postID": 40, 
        "quote": "Originally posted by ACR26: quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "reply": " Clearly you're a Bush supporter to justify your screwed up decision to support him. Don't worry, the country will forgive you eventually. In the meantime, you'll feel better once you admit what a mistake it was to put that guy in office twice. We all make mistakes. Just so happens your mistake was pretty freaking costly in lives and treasure. You can dismiss them as talking points if it makes you feel better.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:17:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure I predict the Bush apologists will name a school of higher (at least a middle school) learning after him in the decades to come to help mitigate the low opinion most Americans have of him.", 
        "intTime": 20090428, 
        "postID": 41, 
        "quote": "Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "reply": " I predict the Bush apologists will name a school of higher (at least a middle school) learning after him in the decades to come to help mitigate the low opinion most Americans have of him.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:44:00", 
        "title": "teleprompter??", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "intTime": 20090428, 
        "postID": 42, 
        "quote": "", 
        "reply": "Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:12:00", 
        "title": "teleprompter??", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: US Senator how do you vote senator obama um uh uh aaa umh uh************ i vote present he is a hyde park creation completely controlled by george soros, does not have a original bone or thought in his head history will prove this out. how much has he spent in 100 days?? we will talk about history when we have to unpuck what he has done and at least i have the balls to say who i am, where i am. and i dont hide", 
        "intTime": 20090428, 
        "postID": 43, 
        "quote": "US Senator", 
        "reply": " how do you vote senator obama um uh uh aaa umh uh************ i vote present he is a hyde park creation completely controlled by george soros, does not have a original bone or thought in his head history will prove this out. how much has he spent in 100 days?? we will talk about history when we have to unpuck what he has done and at least i have the balls to say who i am, where i am. and i dont hide", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:18:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "intTime": 20090428, 
        "postID": 44, 
        "quote": "Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "reply": " Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:23:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN Why would anyone want to be assimilated by the LOSING Repub party with it's constant whining and sulking? After all they are losing membership fast because of the way they are acting.", 
        "intTime": 20090428, 
        "postID": 45, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "reply": " Why would anyone want to be assimilated by the LOSING Repub party with it's constant whining and sulking? After all they are losing membership fast because of the way they are acting.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:26:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Boots_: How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. By BHO's own admission he seemed to take care of himself in that area(drugs).", 
        "intTime": 20090428, 
        "postID": 46, 
        "quote": "Originally posted by Boots_: How dare he make it to Harvard without Herbert Walker funding his cocaine escapades.", 
        "reply": " By BHO's own admission he seemed to take care of himself in that area(drugs).", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:31:00", 
        "title": "teleprompter??", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost? You seem to forget that Dems did the same while out of power. SOP for the party on the outside looking in.", 
        "intTime": 20090428, 
        "postID": 47, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "reply": " You seem to forget that Dems did the same while out of power. SOP for the party on the outside looking in.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:32:00", 
        "title": "teleprompter??", 
        "userID": "67NOV"
    }, 
    {
        "content": "", 
        "intTime": 20090428, 
        "postID": 48, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:50:00", 
        "title": "teleprompter??", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "intTime": 20090428, 
        "postID": 49, 
        "quote": "Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "reply": " WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:54:00", 
        "title": "teleprompter??", 
        "userID": "navy8086"
    }, 
    {
        "content": "The entire thing is really funny. When you take in account of how aften he has been described as the best orator in Washington, his Telepromter gaffes are funny. He does rely TOO much on it. That said, i am not saying he can't think on his own, just that he isn't all that great of a speech giver without one. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090428, 
        "postID": 50, 
        "quote": "", 
        "reply": "The entire thing is really funny. When you take in account of how aften he has been described as the best orator in Washington, his Telepromter gaffes are funny. He does rely TOO much on it. That said, i am not saying he can't think on his own, just that he isn't all that great of a speech giver without one. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:01:00", 
        "title": "teleprompter??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! OUTSTANDING. I could not agree more.", 
        "intTime": 20090428, 
        "postID": 51, 
        "quote": "Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "reply": " OUTSTANDING. I could not agree more.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:05:00", 
        "title": "teleprompter??", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090428, 
        "postID": 52, 
        "quote": "Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\"", 
        "reply": " ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:35:00", 
        "title": "teleprompter??", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !? The preponderance of fake and manufactured issues being used by the Repub party and the \"complete\" (unlike the Demo's almost complete) refusal of the Repub party to present any valid alternatives to policies. The way the Repub party leadership whines and sulks and the way the remaining members of the party continue to parrot the attacks made by the talking heads.", 
        "intTime": 20090428, 
        "postID": 53, 
        "quote": "Originally posted by navy8086: quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "reply": " The preponderance of fake and manufactured issues being used by the Repub party and the \"complete\" (unlike the Demo's almost complete) refusal of the Repub party to present any valid alternatives to policies. The way the Repub party leadership whines and sulks and the way the remaining members of the party continue to parrot the attacks made by the talking heads.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:24:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! I hate it too. Makes me sick to my stomach.", 
        "intTime": 20090428, 
        "postID": 54, 
        "quote": "Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "reply": " I hate it too. Makes me sick to my stomach.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:24:00", 
        "title": "teleprompter??", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. Decision based on the BUSH admin report that had all information that even implied that Sadam might not have WMD program and that REMOVED the information that the WORST case for Iraq getting WMD was almost 10 years.", 
        "intTime": 20090428, 
        "postID": 55, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else.", 
        "reply": " Decision based on the BUSH admin report that had all information that even implied that Sadam might not have WMD program and that REMOVED the information that the WORST case for Iraq getting WMD was almost 10 years.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:27:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. You continue to be confused and drunk on the Republican kool-aide. I can't help you my friend.", 
        "intTime": 20090428, 
        "postID": 56, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else.", 
        "reply": " You continue to be confused and drunk on the Republican kool-aide. I can't help you my friend.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 12:02:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "intTime": 20090428, 
        "postID": 57, 
        "quote": "", 
        "reply": "does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 04:27:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "He is a puppet of Nancy P.", 
        "intTime": 20090428, 
        "postID": 58, 
        "quote": "", 
        "reply": "He is a puppet of Nancy P.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 04:42:00", 
        "title": "teleprompter??", 
        "userID": "Duster6"
    }, 
    {
        "content": "The TOTUS has made a statement on the snafu. 'http://baracksteleprompter.blogspot.com/'", 
        "intTime": 20090428, 
        "postID": 59, 
        "quote": "", 
        "reply": "The TOTUS has made a statement on the snafu. 'http://baracksteleprompter.blogspot.com/'", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:28:00", 
        "title": "teleprompter??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "intTime": 20090428, 
        "postID": 60, 
        "quote": "Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "reply": " You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:30:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "intTime": 20090428, 
        "postID": 61, 
        "quote": "", 
        "reply": "WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 05:58:00", 
        "title": "teleprompter??", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "intTime": 20090428, 
        "postID": 62, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life.", 
        "reply": " Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 06:10:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm Wonderful critique of his presidency. Try focusing on something that matters. You desperate right wingers. Looking for the most trivial thing to bash your President with. Sad really.", 
        "intTime": 20090428, 
        "postID": 63, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by WepsFP: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one You listen to too much Hannity that wastes his time discussing this stupid crap and you seem to have way too much time on your hands. In the big scheme of things, is this really an important issue to you? I heard the Hannity clip. Guess what? It doesn't matter. It's trivial BS and not important. Glad you thought is was important enough to start a thread....now get a life. Obama does not have a original thought in his head, can not deliver anything without the need for teleprompter put a sock in it dont watch hannity did see it on CNN, NBC, CBS and yes Fox made him even look more inept, the way he actually pointed at the teleprompter and actually underlined with his finger the words inept comes to mind more than any other therm", 
        "reply": " Wonderful critique of his presidency. Try focusing on something that matters. You desperate right wingers. Looking for the most trivial thing to bash your President with. Sad really.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 06:39:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "intTime": 20090428, 
        "postID": 64, 
        "quote": "Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "reply": " Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:29:00", 
        "title": "teleprompter??", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "intTime": 20090428, 
        "postID": 65, 
        "quote": "critique of his presidency", 
        "reply": " it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:39:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure Let me get this straight. Obama bows to a king and offers some apologies for some past American screw ups and you condemn his entire presidency after 100 days? When he starts a couple of wars and falls asleep at the wheel of national security, we’ll talk. Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Cripes, the list goes on and on of less than desirable \"records\" to have associated with ones administration. I can't imagine the feeling one must have knowing they voted for that inept dude and all the death and destruction that came with him. Tough to sleep at night???", 
        "intTime": 20090428, 
        "postID": 66, 
        "quote": "Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "reply": " Let me get this straight. Obama bows to a king and offers some apologies for some past American screw ups and you condemn his entire presidency after 100 days? When he starts a couple of wars and falls asleep at the wheel of national security, we’ll talk. Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Cripes, the list goes on and on of less than desirable \"records\" to have associated with ones administration. I can't imagine the feeling one must have knowing they voted for that inept dude and all the death and destruction that came with him. Tough to sleep at night???", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 07:57:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "intTime": 20090428, 
        "postID": 67, 
        "quote": "Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\".", 
        "reply": " Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:07:00", 
        "title": "teleprompter??", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old Clearly you're a Bush supporter to justify your screwed up decision to support him. Don't worry, the country will forgive you eventually. In the meantime, you'll feel better once you admit what a mistake it was to put that guy in office twice. We all make mistakes. Just so happens your mistake was pretty freaking costly in lives and treasure. You can dismiss them as talking points if it makes you feel better.", 
        "intTime": 20090428, 
        "postID": 68, 
        "quote": "Originally posted by ACR26: quote: Do you view Bush as successful? After all, he presided over the biggest intelligence failure in American history resulting in 3000 Americans being killed in the twin towers, sent us to war after phantom WMD's, failed to finish Afghanistan, destroyed America's reputation by torturing prisoners, denying them due process and generally being a ******bag. Who knows how many moderate Muslims became extremist as a result of his administration. Don't forget he destroyed our economy, told the terrorist to \"bring it on\". Blah Talking points and no rational thought applied. There were no radical muslims before 9/11. And I am sure they NEED a reason to become radical. Intelligence failure? Yes it was. Set up by you know who. Tortured prisoners? Dodn't see the pics with him holding the pliers. Man is this old", 
        "reply": " Clearly you're a Bush supporter to justify your screwed up decision to support him. Don't worry, the country will forgive you eventually. In the meantime, you'll feel better once you admit what a mistake it was to put that guy in office twice. We all make mistakes. Just so happens your mistake was pretty freaking costly in lives and treasure. You can dismiss them as talking points if it makes you feel better.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:17:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure I predict the Bush apologists will name a school of higher (at least a middle school) learning after him in the decades to come to help mitigate the low opinion most Americans have of him.", 
        "intTime": 20090428, 
        "postID": 69, 
        "quote": "Originally posted by Ira1945: quote: critique of his presidency it will not be me that will do this, but history bows to a saudi king apologizes so many times you lose count the man is inept, and will go down as a total failure", 
        "reply": " I predict the Bush apologists will name a school of higher (at least a middle school) learning after him in the decades to come to help mitigate the low opinion most Americans have of him.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 08:44:00", 
        "title": "teleprompter??", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "intTime": 20090428, 
        "postID": 70, 
        "quote": "", 
        "reply": "Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:12:00", 
        "title": "teleprompter??", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: US Senator how do you vote senator obama um uh uh aaa umh uh************ i vote present he is a hyde park creation completely controlled by george soros, does not have a original bone or thought in his head history will prove this out. how much has he spent in 100 days?? we will talk about history when we have to unpuck what he has done and at least i have the balls to say who i am, where i am. and i dont hide", 
        "intTime": 20090428, 
        "postID": 71, 
        "quote": "US Senator", 
        "reply": " how do you vote senator obama um uh uh aaa umh uh************ i vote present he is a hyde park creation completely controlled by george soros, does not have a original bone or thought in his head history will prove this out. how much has he spent in 100 days?? we will talk about history when we have to unpuck what he has done and at least i have the balls to say who i am, where i am. and i dont hide", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:18:00", 
        "title": "teleprompter??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "intTime": 20090428, 
        "postID": 72, 
        "quote": "Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one", 
        "reply": " Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:23:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN Why would anyone want to be assimilated by the LOSING Repub party with it's constant whining and sulking? After all they are losing membership fast because of the way they are acting.", 
        "intTime": 20090428, 
        "postID": 73, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! Please report to the re education camp nearest to you. You will assimilate just like weps. GRAYMAN", 
        "reply": " Why would anyone want to be assimilated by the LOSING Repub party with it's constant whining and sulking? After all they are losing membership fast because of the way they are acting.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:26:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Boots_: How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. By BHO's own admission he seemed to take care of himself in that area(drugs).", 
        "intTime": 20090428, 
        "postID": 74, 
        "quote": "Originally posted by Boots_: How dare he make it to Harvard without Herbert Walker funding his cocaine escapades.", 
        "reply": " By BHO's own admission he seemed to take care of himself in that area(drugs).", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:31:00", 
        "title": "teleprompter??", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost? You seem to forget that Dems did the same while out of power. SOP for the party on the outside looking in.", 
        "intTime": 20090428, 
        "postID": 75, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: does the man have the ability to speak without one, seems to be having a issue speaking with one Do Republicans have the ability to do anything but Whine and sulk because their party lost?", 
        "reply": " You seem to forget that Dems did the same while out of power. SOP for the party on the outside looking in.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:32:00", 
        "title": "teleprompter??", 
        "userID": "67NOV"
    }, 
    {
        "content": "", 
        "intTime": 20090428, 
        "postID": 76, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:50:00", 
        "title": "teleprompter??", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "intTime": 20090428, 
        "postID": 77, 
        "quote": "Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "reply": " WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 09:54:00", 
        "title": "teleprompter??", 
        "userID": "navy8086"
    }, 
    {
        "content": "The entire thing is really funny. When you take in account of how aften he has been described as the best orator in Washington, his Telepromter gaffes are funny. He does rely TOO much on it. That said, i am not saying he can't think on his own, just that he isn't all that great of a speech giver without one. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090428, 
        "postID": 78, 
        "quote": "", 
        "reply": "The entire thing is really funny. When you take in account of how aften he has been described as the best orator in Washington, his Telepromter gaffes are funny. He does rely TOO much on it. That said, i am not saying he can't think on his own, just that he isn't all that great of a speech giver without one. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:01:00", 
        "title": "teleprompter??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!! OUTSTANDING. I could not agree more.", 
        "intTime": 20090428, 
        "postID": 79, 
        "quote": "Originally posted by tawodi: WAIT A MINUTE!!!! After nine years listening to how Bush was dislexic, stupid, couldn't \"speak\" his way out of a paper bag and all the rest of the CRAP!! We can't comment on the Wizard of uh's???? Well I've got just one question for you....WHY THE HELL NOT!!?? He ain't the King of ME!! And, he ain't MY massiah!!", 
        "reply": " OUTSTANDING. I could not agree more.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:05:00", 
        "title": "teleprompter??", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090428, 
        "postID": 80, 
        "quote": "Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\"", 
        "reply": " ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 10:35:00", 
        "title": "teleprompter??", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !? The preponderance of fake and manufactured issues being used by the Repub party and the \"complete\" (unlike the Demo's almost complete) refusal of the Repub party to present any valid alternatives to policies. The way the Repub party leadership whines and sulks and the way the remaining members of the party continue to parrot the attacks made by the talking heads.", 
        "intTime": 20090428, 
        "postID": 81, 
        "quote": "Originally posted by navy8086: quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! WAIT! When the DEMOLIBS did it to BUSH, it was called being the LOYAL OPPOSITION! What's changed !?", 
        "reply": " The preponderance of fake and manufactured issues being used by the Repub party and the \"complete\" (unlike the Demo's almost complete) refusal of the Repub party to present any valid alternatives to policies. The way the Repub party leadership whines and sulks and the way the remaining members of the party continue to parrot the attacks made by the talking heads.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:24:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it! I hate it too. Makes me sick to my stomach.", 
        "intTime": 20090428, 
        "postID": 82, 
        "quote": "Originally posted by Boots_: Guys like Ira1945 can't stand the fact that Obama came from nothing and rose through the ranks to become President of the Harvard Law review, a US Senator, and now, President of the United States. Yea, he must be a real dummy. How dare he make it to Harvard without Herbert Walker funding his cocaine escapades. They can't stand that the scientific community adores Obama, the international community overwhelmingly supports him, and 2 out of every 3 Americans approve of him! They can't stand it!", 
        "reply": " I hate it too. Makes me sick to my stomach.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:24:00", 
        "title": "teleprompter??", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. Decision based on the BUSH admin report that had all information that even implied that Sadam might not have WMD program and that REMOVED the information that the WORST case for Iraq getting WMD was almost 10 years.", 
        "intTime": 20090428, 
        "postID": 83, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else.", 
        "reply": " Decision based on the BUSH admin report that had all information that even implied that Sadam might not have WMD program and that REMOVED the information that the WORST case for Iraq getting WMD was almost 10 years.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 11:27:00", 
        "title": "teleprompter??", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else. You continue to be confused and drunk on the Republican kool-aide. I can't help you my friend.", 
        "intTime": 20090428, 
        "postID": 84, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by WepsFP: \"....sent us to war after phantom WMD's,....\" ya know I just don't get it with you folks...... you people continually bring this up as a Bush SNAFU....... when in fact almost every swinging dick of any note in both houses and the senate stood up and said Sudam had these weapons and was a danger to the world... Bush just acted on these beliefs and once they (WMD's) were not found y'all blame Bush and forget the fact that you (dems) were shouting about them just as loud as anyone else.", 
        "reply": " You continue to be confused and drunk on the Republican kool-aide. I can't help you my friend.", 
        "threadID": "409192893_6410059122001", 
        "time": "2009-04-28 12:02:00", 
        "title": "teleprompter??", 
        "userID": "WepsFP"
    }
]