[
    {
        "content": "Saying that calls for prosecution of Bush officials can never let up, the director of the staid and respectable Center for Constitutional Rights, who is a legal scholar, has said that the legal arguments made in the infamous Yoo memos amount to treason against the nation's institutions, similar to the \"Fuhrer's law\" of Nazi Germany. Naomi Wolf, a non-lawyer, mused before her interview with Michael Ratner: quote: The memos [revealed in early March] lay the legal groundwork for the president to send the military to wage war against U.S. citizens; take them from their homes to Navy brigs without trial and keep them forever; close down the First Amendment; and invade whatever country he chooses without regard to any treaty or objection by Congress...The memos could not be clearer: This was the legal groundwork of an attempted coup. I expected massive front page headlines from the revelation that these memos exited. Almost nothing. I was shocked. Wolf then sought out the Center for Constitutional Rights' Michael Ratner to understand what she was missing. The Yoo memos seemed to say that the president's authority as commander in chief is not bound by any law, any treaty, or the protections of free speech, due process and the right to be free from unreasonable searches and seizures. \"The First, Fourth and Fifth amendments -- gone,\" she wrote. Legal expert Michal Ratner agreed: quote: What [the Yoo memos] actually mean is that the president can order the military to operate in the U.S. and to operate without constitutional restrictions. They -- the military -- can pick you or me up in the U.S. for any reason and without any legal process. They would not have any restrictions on entering your house to search it, or to seize you. They can put you into a brig without any due process or going to court. (That's the Fourth and Fifth amendments.) Who has suspended the law this way in the past? It is like a Caesar's law in Rome; a Mussolini's law in Italy; a Fuhrer's law in Germany; a Stalin's law in the Soviet Union. It is right down the line. It is enforcing the will of the dictator through the military. Ratner says the biggest hint we had that this was coming was when the military picked up Jose Padilla, going to a civilian prison and \"snatching\" him off to a brig under the orders of the president. quote: During his 3 1/2 year military detention, Padilla's lawyers said he was subject to hooding, stress positions, assaults, and threats of imminent execution. Warren Richey of the Christian Science Monitor reported: quote: \"Padilla's cell measured nine feet by seven feet. The windows were covered over. There was a toilet and sink. The steel bunk was missing its mattress. He had no pillow. No sheet. No clock. No calendar. No radio. No television. No telephone calls. No visitors. Even Padilla's lawyer was prevented from seeing him for nearly two years....[Padilla's captors] punctured the extreme sensory deprivation with sensory overload, blasting him with harsh lights and pounding sounds.\" \"\"http://www.csmonitor.com/2007/0814/p11s01-usju.html Padilla also stated that he was \"injected with a `truth serum,' a substance his lawyers believe was LSD or PCP. Deprived of any view of the outside world, with the lights always kept on, Padilla had no way of knowing what time of day it was or what day of the week. Padilla's attorney Andrew Patel said, \"I was told by members of the brig staff that Mr. Padilla's temperament was so docile and inactive that his behavior was like that of `a piece of furniture.' \" Patel described how it was difficult to work with Padilla in his defense, because \"Mr. Padilla remains unsure if I and the other attorneys working on his case are actually his attorneys or another component of the government's interrogation scheme.\" Padilla was found guilty based on the testimony of a terrorist suspect whose interrogation tapes were among those ordered destroyed by CIA chief General Michael Hayden. Paul Craig Roberts, former Assistant Secretary of the Treasury under Ronald Reagan and an editor of the Wall Street Journal, criticized the jury's verdict in the Padilla case as having \"overthrown\" the Constitution and doing far more damage to the US' liberty than any terrorist could. Ratner states \"We need the deterrence of prosecution so this does not happen again.\" He said in the interview with Wolf: quote: Treason need not involve another state. Aaron Burr was tried for treason. The authority given by these memos that could be used to raid every congressional office, raid and search every home, detain tens of thousands, would certainly fit a definition of treason. This would be the president making war against the institutions of the United States. The law regarding American enemy combatants has been established...in a war with hardware and armies that can be seen, defeated, and the war declared over. The first thing Bush said was this is a war which has \"no end,\" treasonous words if you are claiming powers over the Constitution. Email for Senator Pat Leahy, the \"Truth Commission\": senator_leahy@leahy.senate.gov \"\"http://www.alternet.org/story/133273/do_the_secret_bush_memos_amount_to_treason_top_constitutional_scholar_says_yes/ This message has been edited. Last edited by: WitchitaKid, Wed 25 March 2009 12:59 PM", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "The memos [revealed in early March] lay the legal groundwork for the president to send the military to wage war against U.S. citizens; take them from their homes to Navy brigs without trial and keep them forever; close down the First Amendment; and invade whatever country he chooses without regard to any treaty or objection by Congress...The memos could not be clearer: This was the legal groundwork of an attempted coup. I expected massive front page headlines from the revelation that these memos exited. Almost nothing. I was shocked.", 
        "reply": "Saying that calls for prosecution of Bush officials can never let up, the director of the staid and respectable Center for Constitutional Rights, who is a legal scholar, has said that the legal arguments made in the infamous Yoo memos amount to treason against the nation's institutions, similar to the \"Fuhrer's law\" of Nazi Germany. Naomi Wolf, a non-lawyer, mused before her interview with Michael Ratner:  Wolf then sought out the Center for Constitutional Rights' Michael Ratner to understand what she was missing. The Yoo memos seemed to say that the president's authority as commander in chief is not bound by any law, any treaty, or the protections of free speech, due process and the right to be free from unreasonable searches and seizures. \"The First, Fourth and Fifth amendments -- gone,\" she wrote. Legal expert Michal Ratner agreed: quote: What [the Yoo memos] actually mean is that the president can order the military to operate in the U.S. and to operate without constitutional restrictions. They -- the military -- can pick you or me up in the U.S. for any reason and without any legal process. They would not have any restrictions on entering your house to search it, or to seize you. They can put you into a brig without any due process or going to court. (That's the Fourth and Fifth amendments.) Who has suspended the law this way in the past? It is like a Caesar's law in Rome; a Mussolini's law in Italy; a Fuhrer's law in Germany; a Stalin's law in the Soviet Union. It is right down the line. It is enforcing the will of the dictator through the military. Ratner says the biggest hint we had that this was coming was when the military picked up Jose Padilla, going to a civilian prison and \"snatching\" him off to a brig under the orders of the president. quote: During his 3 1/2 year military detention, Padilla's lawyers said he was subject to hooding, stress positions, assaults, and threats of imminent execution. Warren Richey of the Christian Science Monitor reported: quote: \"Padilla's cell measured nine feet by seven feet. The windows were covered over. There was a toilet and sink. The steel bunk was missing its mattress. He had no pillow. No sheet. No clock. No calendar. No radio. No television. No telephone calls. No visitors. Even Padilla's lawyer was prevented from seeing him for nearly two years....[Padilla's captors] punctured the extreme sensory deprivation with sensory overload, blasting him with harsh lights and pounding sounds.\" \"\"http://www.csmonitor.com/2007/0814/p11s01-usju.html Padilla also stated that he was \"injected with a `truth serum,' a substance his lawyers believe was LSD or PCP. Deprived of any view of the outside world, with the lights always kept on, Padilla had no way of knowing what time of day it was or what day of the week. Padilla's attorney Andrew Patel said, \"I was told by members of the brig staff that Mr. Padilla's temperament was so docile and inactive that his behavior was like that of `a piece of furniture.' \" Patel described how it was difficult to work with Padilla in his defense, because \"Mr. Padilla remains unsure if I and the other attorneys working on his case are actually his attorneys or another component of the government's interrogation scheme.\" Padilla was found guilty based on the testimony of a terrorist suspect whose interrogation tapes were among those ordered destroyed by CIA chief General Michael Hayden. Paul Craig Roberts, former Assistant Secretary of the Treasury under Ronald Reagan and an editor of the Wall Street Journal, criticized the jury's verdict in the Padilla case as having \"overthrown\" the Constitution and doing far more damage to the US' liberty than any terrorist could. Ratner states \"We need the deterrence of prosecution so this does not happen again.\" He said in the interview with Wolf: quote: Treason need not involve another state. Aaron Burr was tried for treason. The authority given by these memos that could be used to raid every congressional office, raid and search every home, detain tens of thousands, would certainly fit a definition of treason. This would be the president making war against the institutions of the United States. The law regarding American enemy combatants has been established...in a war with hardware and armies that can be seen, defeated, and the war declared over. The first thing Bush said was this is a war which has \"no end,\" treasonous words if you are claiming powers over the Constitution. Email for Senator Pat Leahy, the \"Truth Commission\": senator_leahy@leahy.senate.gov \"\"http://www.alternet.org/story/133273/do_the_secret_bush_memos_amount_to_treason_top_constitutional_scholar_says_yes/ This message has been edited. Last edited by: WitchitaKid, Wed 25 March 2009 12:59 PM", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 12:20:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "Much of this has been talked and written about around the nation and world. GWB was on a power trip as were the neo-cons. The Constitution was abrogated in many places by the last Administration under the guise of terrorist attack. What happened on 911 is still being investigated by many and it was pulled off in a rather simplistic fashion. It was too easy for the Saudi's that pulled it off. And, it creates questions about who was on guard duty at the time and what were they doing...meaning the Bush Administration.", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "Much of this has been talked and written about around the nation and world. GWB was on a power trip as were the neo-cons. The Constitution was abrogated in many places by the last Administration under the guise of terrorist attack. What happened on 911 is still being investigated by many and it was pulled off in a rather simplistic fashion. It was too easy for the Saudi's that pulled it off. And, it creates questions about who was on guard duty at the time and what were they doing...meaning the Bush Administration.", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 12:31:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "...and all those powers that Bush was able to create and use is still in force and have not been voided. Barry has the same powers today and is wanting more; ie, the financial institutions.", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "", 
        "reply": "...and all those powers that Bush was able to create and use is still in force and have not been voided. Barry has the same powers today and is wanting more; ie, the financial institutions.", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 12:38:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "... and yet another koolaide drinking O-bot with severe BDS. W-Kid, OK, now you can go back to your buddies at the daily kos, hufftards or what ever left wing blog site and brag about how you \"stuck it to the neo-cons\".", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "", 
        "reply": "... and yet another koolaide drinking O-bot with severe BDS. W-Kid, OK, now you can go back to your buddies at the daily kos, hufftards or what ever left wing blog site and brag about how you \"stuck it to the neo-cons\".", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 12:45:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: ...and all those powers that Bush was able to create and use is still in force and have not been voided. Barry has the same powers today and is wanting more; ie, the financial institutions. Funny how he didn't deny those powers once he came in, or pass a presidential to get rid of them. Shoot fire, I think even the patriot act is still in effect.", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "Originally posted by SignalSgtWilliams: ...and all those powers that Bush was able to create and use is still in force and have not been voided. Barry has the same powers today and is wanting more; ie, the financial institutions.", 
        "reply": " Funny how he didn't deny those powers once he came in, or pass a presidential to get rid of them. Shoot fire, I think even the patriot act is still in effect.", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 12:54:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "transport1"
    }, 
    {
        "content": "", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 12:58:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Good God... another report of how George W. Bush was solely responsible for faking the moon landings, shooting from the grassy knoll, and has hid the debris from Roswell in Laura's closet. Every one is well aware that it was GWB who masterminded and executed the 9/11 catastrophies, keeps Osama bin Landen alive and living in a small segregated building on Ft. Bragg, and who, along with his father and grandfather keep Nazi's in suspended animation in Guatamala. I'm getting so tired...", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "", 
        "reply": "Good God... another report of how George W. Bush was solely responsible for faking the moon landings, shooting from the grassy knoll, and has hid the debris from Roswell in Laura's closet. Every one is well aware that it was GWB who masterminded and executed the 9/11 catastrophies, keeps Osama bin Landen alive and living in a small segregated building on Ft. Bragg, and who, along with his father and grandfather keep Nazi's in suspended animation in Guatamala. I'm getting so tired...", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 14:42:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "OldUSAFSniper"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Much of this has been talked and written about around the nation and world. GWB was on a power trip as were the neo-cons. The Constitution was abrogated in many places by the last Administration under the guise of terrorist attack. What happened on 911 is still being investigated by many and it was pulled off in a rather simplistic fashion. It was too easy for the Saudi's that pulled it off. And, it creates questions about who was on guard duty at the time and what were they doing...meaning the Bush Administration. And guess what??? Now President Obama is excericising these and many other powers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "Originally posted by dragonflyer04: Much of this has been talked and written about around the nation and world. GWB was on a power trip as were the neo-cons. The Constitution was abrogated in many places by the last Administration under the guise of terrorist attack. What happened on 911 is still being investigated by many and it was pulled off in a rather simplistic fashion. It was too easy for the Saudi's that pulled it off. And, it creates questions about who was on guard duty at the time and what were they doing...meaning the Bush Administration.", 
        "reply": " And guess what??? Now President Obama is excericising these and many other powers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 14:45:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Now President Obama is excericising these and many other powers. ...and wanting more, don't forget.", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: Now President Obama is excericising these and many other powers.", 
        "reply": " ...and wanting more, don't forget.", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 14:50:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Naomi Wolf...is that the same woman who wrote \"The Beauty Myth\"??? Either way, George W Bush is not guilty of treason he was just doing what his handlers were telling him to do. He is akin to a 13 year old boy who happens to be riding with two 18 year old gangbangers(Cheney..etc) who committ a drive by and murder a bunch of people....", 
        "intTime": 20090325, 
        "postID": 10, 
        "quote": "", 
        "reply": "Naomi Wolf...is that the same woman who wrote \"The Beauty Myth\"??? Either way, George W Bush is not guilty of treason he was just doing what his handlers were telling him to do. He is akin to a 13 year old boy who happens to be riding with two 18 year old gangbangers(Cheney..etc) who committ a drive by and murder a bunch of people....", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 14:52:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Naomi Wolf...is that the same woman who wrote \"The Beauty Myth\"??? Either way, George W Bush is not guilty of treason he was just doing what his handlers were telling him to do. He is akin to a 13 year old boy who happens to be riding with two 18 year old gangbangers(Cheney..etc) who committ a drive by and murder a bunch of people.... I can agree, just like President Obama does what the TOTUS tells him to do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090325, 
        "postID": 11, 
        "quote": "Originally posted by Irwin_R_Schyster: Naomi Wolf...is that the same woman who wrote \"The Beauty Myth\"??? Either way, George W Bush is not guilty of treason he was just doing what his handlers were telling him to do. He is akin to a 13 year old boy who happens to be riding with two 18 year old gangbangers(Cheney..etc) who committ a drive by and murder a bunch of people....", 
        "reply": " I can agree, just like President Obama does what the TOTUS tells him to do. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 14:54:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by SignalSgtWilliams: ...and all those powers that Bush was able to create and use is still in force and have not been voided. Barry has the same powers today and is wanting more; ie, the financial institutions. Funny how he didn't deny those powers once he came in, or pass a presidential to get rid of them. Shoot fire, I think even the patriot act is still in effect. yup", 
        "intTime": 20090325, 
        "postID": 12, 
        "quote": "Originally posted by transport1: quote: Originally posted by SignalSgtWilliams: ...and all those powers that Bush was able to create and use is still in force and have not been voided. Barry has the same powers today and is wanting more; ie, the financial institutions. Funny how he didn't deny those powers once he came in, or pass a presidential to get rid of them. Shoot fire, I think even the patriot act is still in effect.", 
        "reply": " yup", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 15:00:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Much of this has been talked and written about around the nation and world. GWB was on a power trip as were the neo-cons. The Constitution was abrogated in many places by the last Administration under the guise of terrorist attack. What happened on 911 is still being investigated by many and it was pulled off in a rather simplistic fashion. It was too easy for the Saudi's that pulled it off. And, it creates questions about who was on guard duty at the time and what were they doing...meaning the Bush Administration. Time to buy more stock in Reynolds Wrap.... What about the 5 major attacks before GWB took office? 7 if you go back and count the two Lebenon bombings.", 
        "intTime": 20090325, 
        "postID": 13, 
        "quote": "Originally posted by dragonflyer04: Much of this has been talked and written about around the nation and world. GWB was on a power trip as were the neo-cons. The Constitution was abrogated in many places by the last Administration under the guise of terrorist attack. What happened on 911 is still being investigated by many and it was pulled off in a rather simplistic fashion. It was too easy for the Saudi's that pulled it off. And, it creates questions about who was on guard duty at the time and what were they doing...meaning the Bush Administration.", 
        "reply": " Time to buy more stock in Reynolds Wrap.... What about the 5 major attacks before GWB took office? 7 if you go back and count the two Lebenon bombings.", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-25 18:25:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "sw614"
    }, 
    {
        "content": "Hopefully the President will heed the works of JFK: Let us not seek the Republican answer or the Democratic answer, but the right answer. Let us not seek to fix the blame for the past. Let us accept our own responsibility for the future. John F. Kennedy", 
        "intTime": 20090326, 
        "postID": 14, 
        "quote": "", 
        "reply": "Hopefully the President will heed the works of JFK: Let us not seek the Republican answer or the Democratic answer, but the right answer. Let us not seek to fix the blame for the past. Let us accept our own responsibility for the future. John F. Kennedy", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-26 02:35:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "This is a lib/socialist campaign to keep President G.W. Bush from campaigning for other Republicans. Bush still has a following and could raise significant funds. The lib/socialists are trying to prevent that. It isn't working.", 
        "intTime": 20090326, 
        "postID": 15, 
        "quote": "", 
        "reply": "This is a lib/socialist campaign to keep President G.W. Bush from campaigning for other Republicans. Bush still has a following and could raise significant funds. The lib/socialists are trying to prevent that. It isn't working.", 
        "threadID": "409192893_9530088812001", 
        "time": "2009-03-26 05:29:00", 
        "title": "Constitution Center's Ratner Says New Bush Memos Amount to \"Treason\"", 
        "userID": "bill_kananen"
    }
]