[
    {
        "content": "+++http://voices.washingtonpost.com/sleuth/2009/03/obama_likens_his_bowling_game.html Obama Likens His Bowling Game to Special Olympics Updated, 12:18 AM President Obama seemed relaxed and in good cheer tonight during his appearance on \"The Tonight Show with Jay Leno.\" But there was one misstep that surely made his advisers wince. Leno asked the president whether the White House bowling alley had been \"burned and closed down\" in light of Obama's gutter ball embarrassment on the campaign trail last year. Obama replied, \"No, no. I have been practicing . . . I bowled a 129.\" The audience roared with laughter, and the late-night talk show host assured Obama \"that's very good, Mr. President.\" To which Obama interjected, \"It's like -- it was like Special Olympics, or something.\" The audience laughed. But the White House didn't let the comment linger without clarification. \"The president made an offhand remark making fun of his own bowling that was in no way intended to disparage the Special Olympics,\" White House spokesman Bill Burton told reporters flying aboard Air Force One after the taping of the show, according to a transcript released by the White House. \"He thinks that the Special Olympics are a wonderful program that gives an opportunity to shine to people with disabilities from around the world.\" Also on the \"Tonight Show,\" Leno asked the president when he would finally be making good on his famous campaign promise to reward his daughters with a puppy, which so far hasn't surfaced. \"Listen, this is Washington. That was a campaign promise,\" the president deadpanned to much laughter. The president said he was \"teasing,\" and explained that as soon as he returns from the NATO summit in France in Germany early next month, the \"dog will be in place.\" Leno asked if the dog would be a \"Portuguese Water Head,\" referencing first lady Michelle Obama's recent suggestion that the first family was leaning toward a Portuguese Water Dog. The president laughed and said, \"It's not a 'water head.' That sounds like a scary dog. Sort of dripping around the house.\" But the first dad gave absolutely no hints about what kind of dog - or puppy - it will be. \"We're going to get a dog that is -- that I think the girls will have a great time -- I think I'm going to have a lot of fun with it. You know, they say if you want a friend in Washington, get a dog.\" And according to the schedule the president described, his girls will have their new furry friend by Easter. I'd say his handling of the economy is sort of speical olympics like...", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://voices.washingtonpost.com/sleuth/2009/03/obama_likens_his_bowling_game.html Obama Likens His Bowling Game to Special Olympics Updated, 12:18 AM President Obama seemed relaxed and in good cheer tonight during his appearance on \"The Tonight Show with Jay Leno.\" But there was one misstep that surely made his advisers wince. Leno asked the president whether the White House bowling alley had been \"burned and closed down\" in light of Obama's gutter ball embarrassment on the campaign trail last year. Obama replied, \"No, no. I have been practicing . . . I bowled a 129.\" The audience roared with laughter, and the late-night talk show host assured Obama \"that's very good, Mr. President.\" To which Obama interjected, \"It's like -- it was like Special Olympics, or something.\" The audience laughed. But the White House didn't let the comment linger without clarification. \"The president made an offhand remark making fun of his own bowling that was in no way intended to disparage the Special Olympics,\" White House spokesman Bill Burton told reporters flying aboard Air Force One after the taping of the show, according to a transcript released by the White House. \"He thinks that the Special Olympics are a wonderful program that gives an opportunity to shine to people with disabilities from around the world.\" Also on the \"Tonight Show,\" Leno asked the president when he would finally be making good on his famous campaign promise to reward his daughters with a puppy, which so far hasn't surfaced. \"Listen, this is Washington. That was a campaign promise,\" the president deadpanned to much laughter. The president said he was \"teasing,\" and explained that as soon as he returns from the NATO summit in France in Germany early next month, the \"dog will be in place.\" Leno asked if the dog would be a \"Portuguese Water Head,\" referencing first lady Michelle Obama's recent suggestion that the first family was leaning toward a Portuguese Water Dog. The president laughed and said, \"It's not a 'water head.' That sounds like a scary dog. Sort of dripping around the house.\" But the first dad gave absolutely no hints about what kind of dog - or puppy - it will be. \"We're going to get a dog that is -- that I think the girls will have a great time -- I think I'm going to have a lot of fun with it. You know, they say if you want a friend in Washington, get a dog.\" And according to the schedule the president described, his girls will have their new furry friend by Easter. I'd say his handling of the economy is sort of speical olympics like...", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 04:58:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH", 
        "intTime": 20090320, 
        "postID": 2, 
        "quote": "", 
        "reply": "LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:19:00", 
        "title": "Special Olympics", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "", 
        "reply": "People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:21:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally.", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH", 
        "reply": " No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:38:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "intTime": 20090320, 
        "postID": 5, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally.", 
        "reply": " The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:41:00", 
        "title": "Special Olympics", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. Yeh, no surprise and along will be one of the koolaid crowd to say ' it was a grand slam!' just probably another teleprompter incident.", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " Yeh, no surprise and along will be one of the koolaid crowd to say ' it was a grand slam!' just probably another teleprompter incident.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:43:00", 
        "title": "Special Olympics", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. If it had been Bush making such a flippant and insulting remark the airwaves would have been deluged with interviews with insulted Special Olympians expressing their outrage. There are many on this site who no doubt will ignore the comment and continue with their uncritical and unthinking adoration of all things Obama. Personally I found the appearance confusing, the reference to some reality show (who is Simon?) was lost on me. The taped laughter seemed to approve, but that is only one technician at a switch so who really knows.", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " If it had been Bush making such a flippant and insulting remark the airwaves would have been deluged with interviews with insulted Special Olympians expressing their outrage. There are many on this site who no doubt will ignore the comment and continue with their uncritical and unthinking adoration of all things Obama. Personally I found the appearance confusing, the reference to some reality show (who is Simon?) was lost on me. The taped laughter seemed to approve, but that is only one technician at a switch so who really knows.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:44:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set. And they are all products of liberal education systems.. You know, the ones that teach WWII was an overt act of American and English agression towrds the peace loving nazis. They just dont have the breath and depth of knowledge required to play on the world stage..its like taking a highschool football players and expecting him to play in the NFL.", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "reply": " And they are all products of liberal education systems.. You know, the ones that teach WWII was an overt act of American and English agression towrds the peace loving nazis. They just dont have the breath and depth of knowledge required to play on the world stage..its like taking a highschool football players and expecting him to play in the NFL.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:45:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:45:00", 
        "title": "Special Olympics", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set. Somehow I can't picture the Brown family preparing the popcorn and hunkering down for the evening to enjoy Brokeback Mountain...", 
        "intTime": 20090320, 
        "postID": 10, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "reply": " Somehow I can't picture the Brown family preparing the popcorn and hunkering down for the evening to enjoy Brokeback Mountain...", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:46:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It should be obvious that Obama has a mental defect. It's called liberalism. This defect not only makes itself evident in his policies but also his bowling.", 
        "intTime": 20090320, 
        "postID": 11, 
        "quote": "", 
        "reply": "It should be obvious that Obama has a mental defect. It's called liberalism. This defect not only makes itself evident in his policies but also his bowling.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:48:00", 
        "title": "Special Olympics", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered. I believe you are in error. Certain elements of the media loves to loath Bush and would hardly ignore such an obvious opportunity to bash him further.", 
        "intTime": 20090320, 
        "postID": 12, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "reply": " I believe you are in error. Certain elements of the media loves to loath Bush and would hardly ignore such an obvious opportunity to bash him further.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:53:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "intTime": 20090320, 
        "postID": 13, 
        "quote": "", 
        "reply": "i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:57:00", 
        "title": "Special Olympics", 
        "userID": "Persy"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: ...just probably another teleprompter incident. You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "intTime": 20090320, 
        "postID": 14, 
        "quote": "Originally posted by GunnyRet03: ...just probably another teleprompter incident.", 
        "reply": " You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:57:00", 
        "title": "Special Olympics", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion. You are correct, but since the President represents are party that can hardly be considered tolerant of such behavior in others he certainly deserves to be called on it.", 
        "intTime": 20090320, 
        "postID": 15, 
        "quote": "Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "reply": " You are correct, but since the President represents are party that can hardly be considered tolerant of such behavior in others he certainly deserves to be called on it.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:00:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by GunnyRet03: ...just probably another teleprompter incident. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that! Considering who is presently occupying the position of VP it is worse than that.", 
        "intTime": 20090320, 
        "postID": 16, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by GunnyRet03: ...just probably another teleprompter incident. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "reply": " Considering who is presently occupying the position of VP it is worse than that.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:02:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home.", 
        "intTime": 20090320, 
        "postID": 17, 
        "quote": "", 
        "reply": "Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:02:00", 
        "title": "Special Olympics", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home. The White House could sponsor a bi-partisan bowling tournament...squeezed in between the new Jay Leno show and whatever Howie Mandel comes up with next.", 
        "intTime": 20090320, 
        "postID": 18, 
        "quote": "Originally posted by bill_kananen: Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home.", 
        "reply": " The White House could sponsor a bi-partisan bowling tournament...squeezed in between the new Jay Leno show and whatever Howie Mandel comes up with next.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:26:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If they do that, they’ll have nothing left. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that! Well said!", 
        "intTime": 20090320, 
        "postID": 19, 
        "quote": "Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If they do that, they’ll have nothing left. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "reply": " Well said!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:59:00", 
        "title": "Special Olympics", 
        "userID": "Knele"
    }, 
    {
        "content": "let's give it up once again for....... the Wizard of UH'S!!!!", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "", 
        "reply": "let's give it up once again for....... the Wizard of UH'S!!!!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 07:57:00", 
        "title": "Special Olympics", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion. Personally, I am offended by the joke. I have a cousin with Down's. It is very insensitive. Yes, we have all said a thing or two in the past. But, we are not the POTUS. He is under the microscope. It is something that everyone, him and his supporters, need to deal with. I think that is what some people were saying with the thing with Palin's daugher and boyfriend breaking up. Palin put her daughter in the limelight by wanting to become the VP so her daughter is fair game. Well, Obama put himself in the limelight, he and everyone who supports him needs to take the lumps when he screws up. Now, according to all of this, it is OK for the libs to have their say on stupid things people say and we are supposed to deal with the backlash when we defend. BUT our Liberal President says something offensive and insensitive, but because he apologized and we have all said stupid stuff, we are being oversensitive. Got it.", 
        "intTime": 20090320, 
        "postID": 21, 
        "quote": "Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "reply": " Personally, I am offended by the joke. I have a cousin with Down's. It is very insensitive. Yes, we have all said a thing or two in the past. But, we are not the POTUS. He is under the microscope. It is something that everyone, him and his supporters, need to deal with. I think that is what some people were saying with the thing with Palin's daugher and boyfriend breaking up. Palin put her daughter in the limelight by wanting to become the VP so her daughter is fair game. Well, Obama put himself in the limelight, he and everyone who supports him needs to take the lumps when he screws up. Now, according to all of this, it is OK for the libs to have their say on stupid things people say and we are supposed to deal with the backlash when we defend. BUT our Liberal President says something offensive and insensitive, but because he apologized and we have all said stupid stuff, we are being oversensitive. Got it.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:11:00", 
        "title": "Special Olympics", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered. Yeaaaaah, it \"almost\" wouldn't have registered!", 
        "intTime": 20090320, 
        "postID": 22, 
        "quote": "Originally posted by SteveDeHaven: If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "reply": " Yeaaaaah, it \"almost\" wouldn't have registered!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:23:00", 
        "title": "Special Olympics", 
        "userID": "67NOV"
    }, 
    {
        "content": "It looks to me that only the lib/socialists are making a stink over the remark. AND Obama is their guy. Had they not tried to look all sensitive and offended the right would never have noticed it.", 
        "intTime": 20090320, 
        "postID": 23, 
        "quote": "", 
        "reply": "It looks to me that only the lib/socialists are making a stink over the remark. AND Obama is their guy. Had they not tried to look all sensitive and offended the right would never have noticed it.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:31:00", 
        "title": "Special Olympics", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. : You need to come away from the rays of the bright light that shines from Washington, it's blinding you, next, it will make you impotant and have skin cancer.", 
        "intTime": 20090320, 
        "postID": 24, 
        "quote": "Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. :", 
        "reply": " You need to come away from the rays of the bright light that shines from Washington, it's blinding you, next, it will make you impotant and have skin cancer.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:38:00", 
        "title": "Special Olympics", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I've bowled 129 before.... \"DEATH ON CALL\"", 
        "intTime": 20090320, 
        "postID": 25, 
        "quote": "", 
        "reply": "I've bowled 129 before.... \"DEATH ON CALL\"", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:56:00", 
        "title": "Special Olympics", 
        "userID": "Combatmix"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. H e did say silly things like this... a lot more often... so what?", 
        "intTime": 20090320, 
        "postID": 26, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " H e did say silly things like this... a lot more often... so what?", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 09:20:00", 
        "title": "Special Olympics", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. H e did say silly things like this... a lot more often... so what? Thanks for proving my point.", 
        "intTime": 20090320, 
        "postID": 27, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. H e did say silly things like this... a lot more often... so what?", 
        "reply": " Thanks for proving my point.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 10:47:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. Exactly. I can't fault a guy for saying something me and any of my friends might have said, but I can fault his supporters for choosing this moment to misplace their endless sense of outrage.", 
        "intTime": 20090320, 
        "postID": 28, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " Exactly. I can't fault a guy for saying something me and any of my friends might have said, but I can fault his supporters for choosing this moment to misplace their endless sense of outrage.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 10:51:00", 
        "title": "Special Olympics", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: you know that the President made eye contact with Leno for most of the interview. So you couldn't see the Jack Bauer earpiece in his left ear feeding him his lines and instructions from a secret bunker deep beneath the Sasketchewan crust.", 
        "intTime": 20090320, 
        "postID": 29, 
        "quote": "you know that the President made eye contact with Leno for most of the interview.", 
        "reply": " So you couldn't see the Jack Bauer earpiece in his left ear feeding him his lines and instructions from a secret bunker deep beneath the Sasketchewan crust.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 10:55:00", 
        "title": "Special Olympics", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "+++http://voices.washingtonpost.com/sleuth/2009/03/obama_likens_his_bowling_game.html Obama Likens His Bowling Game to Special Olympics Updated, 12:18 AM President Obama seemed relaxed and in good cheer tonight during his appearance on \"The Tonight Show with Jay Leno.\" But there was one misstep that surely made his advisers wince. Leno asked the president whether the White House bowling alley had been \"burned and closed down\" in light of Obama's gutter ball embarrassment on the campaign trail last year. Obama replied, \"No, no. I have been practicing . . . I bowled a 129.\" The audience roared with laughter, and the late-night talk show host assured Obama \"that's very good, Mr. President.\" To which Obama interjected, \"It's like -- it was like Special Olympics, or something.\" The audience laughed. But the White House didn't let the comment linger without clarification. \"The president made an offhand remark making fun of his own bowling that was in no way intended to disparage the Special Olympics,\" White House spokesman Bill Burton told reporters flying aboard Air Force One after the taping of the show, according to a transcript released by the White House. \"He thinks that the Special Olympics are a wonderful program that gives an opportunity to shine to people with disabilities from around the world.\" Also on the \"Tonight Show,\" Leno asked the president when he would finally be making good on his famous campaign promise to reward his daughters with a puppy, which so far hasn't surfaced. \"Listen, this is Washington. That was a campaign promise,\" the president deadpanned to much laughter. The president said he was \"teasing,\" and explained that as soon as he returns from the NATO summit in France in Germany early next month, the \"dog will be in place.\" Leno asked if the dog would be a \"Portuguese Water Head,\" referencing first lady Michelle Obama's recent suggestion that the first family was leaning toward a Portuguese Water Dog. The president laughed and said, \"It's not a 'water head.' That sounds like a scary dog. Sort of dripping around the house.\" But the first dad gave absolutely no hints about what kind of dog - or puppy - it will be. \"We're going to get a dog that is -- that I think the girls will have a great time -- I think I'm going to have a lot of fun with it. You know, they say if you want a friend in Washington, get a dog.\" And according to the schedule the president described, his girls will have their new furry friend by Easter. I'd say his handling of the economy is sort of speical olympics like...", 
        "intTime": 20090320, 
        "postID": 30, 
        "quote": "", 
        "reply": "+++http://voices.washingtonpost.com/sleuth/2009/03/obama_likens_his_bowling_game.html Obama Likens His Bowling Game to Special Olympics Updated, 12:18 AM President Obama seemed relaxed and in good cheer tonight during his appearance on \"The Tonight Show with Jay Leno.\" But there was one misstep that surely made his advisers wince. Leno asked the president whether the White House bowling alley had been \"burned and closed down\" in light of Obama's gutter ball embarrassment on the campaign trail last year. Obama replied, \"No, no. I have been practicing . . . I bowled a 129.\" The audience roared with laughter, and the late-night talk show host assured Obama \"that's very good, Mr. President.\" To which Obama interjected, \"It's like -- it was like Special Olympics, or something.\" The audience laughed. But the White House didn't let the comment linger without clarification. \"The president made an offhand remark making fun of his own bowling that was in no way intended to disparage the Special Olympics,\" White House spokesman Bill Burton told reporters flying aboard Air Force One after the taping of the show, according to a transcript released by the White House. \"He thinks that the Special Olympics are a wonderful program that gives an opportunity to shine to people with disabilities from around the world.\" Also on the \"Tonight Show,\" Leno asked the president when he would finally be making good on his famous campaign promise to reward his daughters with a puppy, which so far hasn't surfaced. \"Listen, this is Washington. That was a campaign promise,\" the president deadpanned to much laughter. The president said he was \"teasing,\" and explained that as soon as he returns from the NATO summit in France in Germany early next month, the \"dog will be in place.\" Leno asked if the dog would be a \"Portuguese Water Head,\" referencing first lady Michelle Obama's recent suggestion that the first family was leaning toward a Portuguese Water Dog. The president laughed and said, \"It's not a 'water head.' That sounds like a scary dog. Sort of dripping around the house.\" But the first dad gave absolutely no hints about what kind of dog - or puppy - it will be. \"We're going to get a dog that is -- that I think the girls will have a great time -- I think I'm going to have a lot of fun with it. You know, they say if you want a friend in Washington, get a dog.\" And according to the schedule the president described, his girls will have their new furry friend by Easter. I'd say his handling of the economy is sort of speical olympics like...", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 04:58:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH", 
        "intTime": 20090320, 
        "postID": 31, 
        "quote": "", 
        "reply": "LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:19:00", 
        "title": "Special Olympics", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "intTime": 20090320, 
        "postID": 32, 
        "quote": "", 
        "reply": "People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:21:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally.", 
        "intTime": 20090320, 
        "postID": 33, 
        "quote": "Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH", 
        "reply": " No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:38:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "intTime": 20090320, 
        "postID": 34, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally.", 
        "reply": " The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:41:00", 
        "title": "Special Olympics", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. Yeh, no surprise and along will be one of the koolaid crowd to say ' it was a grand slam!' just probably another teleprompter incident.", 
        "intTime": 20090320, 
        "postID": 35, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " Yeh, no surprise and along will be one of the koolaid crowd to say ' it was a grand slam!' just probably another teleprompter incident.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:43:00", 
        "title": "Special Olympics", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. If it had been Bush making such a flippant and insulting remark the airwaves would have been deluged with interviews with insulted Special Olympians expressing their outrage. There are many on this site who no doubt will ignore the comment and continue with their uncritical and unthinking adoration of all things Obama. Personally I found the appearance confusing, the reference to some reality show (who is Simon?) was lost on me. The taped laughter seemed to approve, but that is only one technician at a switch so who really knows.", 
        "intTime": 20090320, 
        "postID": 36, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " If it had been Bush making such a flippant and insulting remark the airwaves would have been deluged with interviews with insulted Special Olympians expressing their outrage. There are many on this site who no doubt will ignore the comment and continue with their uncritical and unthinking adoration of all things Obama. Personally I found the appearance confusing, the reference to some reality show (who is Simon?) was lost on me. The taped laughter seemed to approve, but that is only one technician at a switch so who really knows.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:44:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set. And they are all products of liberal education systems.. You know, the ones that teach WWII was an overt act of American and English agression towrds the peace loving nazis. They just dont have the breath and depth of knowledge required to play on the world stage..its like taking a highschool football players and expecting him to play in the NFL.", 
        "intTime": 20090320, 
        "postID": 37, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "reply": " And they are all products of liberal education systems.. You know, the ones that teach WWII was an overt act of American and English agression towrds the peace loving nazis. They just dont have the breath and depth of knowledge required to play on the world stage..its like taking a highschool football players and expecting him to play in the NFL.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:45:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "intTime": 20090320, 
        "postID": 38, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:45:00", 
        "title": "Special Olympics", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set. Somehow I can't picture the Brown family preparing the popcorn and hunkering down for the evening to enjoy Brokeback Mountain...", 
        "intTime": 20090320, 
        "postID": 39, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by adminnco1: quote: Originally posted by GunnyRet03: LMAO! Yeh, special olympics alright his adm is if full of them, sorry for the insult special olympics. Meanwhile its confirmed he gave PM Brown the wrong format tapes, isnt that special. Uh Uh UH UH UM UM UM You know UHHHHHHH No doubt PM Brown was thrilled with the Blockbuster Gift Pack. I wonder if he bothered to take them back to the UK or if they ended up in a dustbin with the rest of the trash. A sad beginning to the new administration's relationship with what we always assumed is an old and valued ally. The buck stops with him. You know he didnt buy them so it's not his fault but he accepts responsibility. It was one of his young crack team of savvy urbanites techies that had the idea of the dvd box set.", 
        "reply": " Somehow I can't picture the Brown family preparing the popcorn and hunkering down for the evening to enjoy Brokeback Mountain...", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:46:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It should be obvious that Obama has a mental defect. It's called liberalism. This defect not only makes itself evident in his policies but also his bowling.", 
        "intTime": 20090320, 
        "postID": 40, 
        "quote": "", 
        "reply": "It should be obvious that Obama has a mental defect. It's called liberalism. This defect not only makes itself evident in his policies but also his bowling.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:48:00", 
        "title": "Special Olympics", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered. I believe you are in error. Certain elements of the media loves to loath Bush and would hardly ignore such an obvious opportunity to bash him further.", 
        "intTime": 20090320, 
        "postID": 41, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. President Obama shouldn't have made the Special Olympics remark. Neither should I on the occasions when I've done so. I know I'm not alone in that. If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "reply": " I believe you are in error. Certain elements of the media loves to loath Bush and would hardly ignore such an obvious opportunity to bash him further.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:53:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "intTime": 20090320, 
        "postID": 42, 
        "quote": "", 
        "reply": "i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:57:00", 
        "title": "Special Olympics", 
        "userID": "Persy"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: ...just probably another teleprompter incident. You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "intTime": 20090320, 
        "postID": 43, 
        "quote": "Originally posted by GunnyRet03: ...just probably another teleprompter incident.", 
        "reply": " You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 05:57:00", 
        "title": "Special Olympics", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion. You are correct, but since the President represents are party that can hardly be considered tolerant of such behavior in others he certainly deserves to be called on it.", 
        "intTime": 20090320, 
        "postID": 44, 
        "quote": "Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "reply": " You are correct, but since the President represents are party that can hardly be considered tolerant of such behavior in others he certainly deserves to be called on it.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:00:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by GunnyRet03: ...just probably another teleprompter incident. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that! Considering who is presently occupying the position of VP it is worse than that.", 
        "intTime": 20090320, 
        "postID": 45, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by GunnyRet03: ...just probably another teleprompter incident. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "reply": " Considering who is presently occupying the position of VP it is worse than that.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:02:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home.", 
        "intTime": 20090320, 
        "postID": 46, 
        "quote": "", 
        "reply": "Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:02:00", 
        "title": "Special Olympics", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home. The White House could sponsor a bi-partisan bowling tournament...squeezed in between the new Jay Leno show and whatever Howie Mandel comes up with next.", 
        "intTime": 20090320, 
        "postID": 47, 
        "quote": "Originally posted by bill_kananen: Worse? What is Sarah Palin's bowling score? What is John McCain's bowling score. I think we need a Whitehouse bowling ternament to settle this. Oh, I see. This is just another lib/socialist diversion. The AIG debacle really hit home.", 
        "reply": " The White House could sponsor a bi-partisan bowling tournament...squeezed in between the new Jay Leno show and whatever Howie Mandel comes up with next.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:26:00", 
        "title": "Special Olympics", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If they do that, they’ll have nothing left. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that! Well said!", 
        "intTime": 20090320, 
        "postID": 48, 
        "quote": "Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. If they do that, they’ll have nothing left. If you watched Leno last night, you know that the President made eye contact with Leno for most of the interview. He speaks intelligently, which is probably your greatest heartache with him, given his predecessor's incompetence with the English language. As for the verbalized pauses (ahs, ums, etc.), that's an unfortunate habit that some speakers haven't learned to quell. But it shows that he thinks before he speaks, which is another stark contrast to The Decider, who didn't even think AFTER he spoke. How many of you would be able to be in front of the cameras every waking moment, and be able to speak intelligently off the cuff on as many topics as President Obama is able to do? I finally realized what all this whining is about. It's the classic battle between the \"frat boy/jock\" set and the \"nerd/geek\" set. Well this time, the geeks won. Get over it. It could have been worse. How? Three words: Vice President Palin. And with Grampa McCain as President, it could have been even worse than that!", 
        "reply": " Well said!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 06:59:00", 
        "title": "Special Olympics", 
        "userID": "Knele"
    }, 
    {
        "content": "let's give it up once again for....... the Wizard of UH'S!!!!", 
        "intTime": 20090320, 
        "postID": 49, 
        "quote": "", 
        "reply": "let's give it up once again for....... the Wizard of UH'S!!!!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 07:57:00", 
        "title": "Special Olympics", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion. Personally, I am offended by the joke. I have a cousin with Down's. It is very insensitive. Yes, we have all said a thing or two in the past. But, we are not the POTUS. He is under the microscope. It is something that everyone, him and his supporters, need to deal with. I think that is what some people were saying with the thing with Palin's daugher and boyfriend breaking up. Palin put her daughter in the limelight by wanting to become the VP so her daughter is fair game. Well, Obama put himself in the limelight, he and everyone who supports him needs to take the lumps when he screws up. Now, according to all of this, it is OK for the libs to have their say on stupid things people say and we are supposed to deal with the backlash when we defend. BUT our Liberal President says something offensive and insensitive, but because he apologized and we have all said stupid stuff, we are being oversensitive. Got it.", 
        "intTime": 20090320, 
        "postID": 50, 
        "quote": "Originally posted by Persy: i think people are WAY to freaking sensitive. It was a joke - maybe not in the best taste - but a joke. we all say stupid things on occasion. No, this does not mean that I am defending anyone - just stating my opinion.", 
        "reply": " Personally, I am offended by the joke. I have a cousin with Down's. It is very insensitive. Yes, we have all said a thing or two in the past. But, we are not the POTUS. He is under the microscope. It is something that everyone, him and his supporters, need to deal with. I think that is what some people were saying with the thing with Palin's daugher and boyfriend breaking up. Palin put her daughter in the limelight by wanting to become the VP so her daughter is fair game. Well, Obama put himself in the limelight, he and everyone who supports him needs to take the lumps when he screws up. Now, according to all of this, it is OK for the libs to have their say on stupid things people say and we are supposed to deal with the backlash when we defend. BUT our Liberal President says something offensive and insensitive, but because he apologized and we have all said stupid stuff, we are being oversensitive. Got it.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:11:00", 
        "title": "Special Olympics", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered. Yeaaaaah, it \"almost\" wouldn't have registered!", 
        "intTime": 20090320, 
        "postID": 51, 
        "quote": "Originally posted by SteveDeHaven: If Bush had said it, it wouldn't even be news. There was always so much clutter on the \"Bush Gaffe Radar\" screen, this wouldn't even have registered.", 
        "reply": " Yeaaaaah, it \"almost\" wouldn't have registered!", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:23:00", 
        "title": "Special Olympics", 
        "userID": "67NOV"
    }, 
    {
        "content": "It looks to me that only the lib/socialists are making a stink over the remark. AND Obama is their guy. Had they not tried to look all sensitive and offended the right would never have noticed it.", 
        "intTime": 20090320, 
        "postID": 52, 
        "quote": "", 
        "reply": "It looks to me that only the lib/socialists are making a stink over the remark. AND Obama is their guy. Had they not tried to look all sensitive and offended the right would never have noticed it.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:31:00", 
        "title": "Special Olympics", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. : You need to come away from the rays of the bright light that shines from Washington, it's blinding you, next, it will make you impotant and have skin cancer.", 
        "intTime": 20090320, 
        "postID": 53, 
        "quote": "Originally posted by SteveDeHaven: You guys need to stop watching Fox News, or stop listening to Rush, or stop doing whatever you're doing that is eliciting these \"teleprompter\" comments. :", 
        "reply": " You need to come away from the rays of the bright light that shines from Washington, it's blinding you, next, it will make you impotant and have skin cancer.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:38:00", 
        "title": "Special Olympics", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I've bowled 129 before.... \"DEATH ON CALL\"", 
        "intTime": 20090320, 
        "postID": 54, 
        "quote": "", 
        "reply": "I've bowled 129 before.... \"DEATH ON CALL\"", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 08:56:00", 
        "title": "Special Olympics", 
        "userID": "Combatmix"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. H e did say silly things like this... a lot more often... so what?", 
        "intTime": 20090320, 
        "postID": 55, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " H e did say silly things like this... a lot more often... so what?", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 09:20:00", 
        "title": "Special Olympics", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. H e did say silly things like this... a lot more often... so what? Thanks for proving my point.", 
        "intTime": 20090320, 
        "postID": 56, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. H e did say silly things like this... a lot more often... so what?", 
        "reply": " Thanks for proving my point.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 10:47:00", 
        "title": "Special Olympics", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing.. Exactly. I can't fault a guy for saying something me and any of my friends might have said, but I can fault his supporters for choosing this moment to misplace their endless sense of outrage.", 
        "intTime": 20090320, 
        "postID": 57, 
        "quote": "Originally posted by threerings: People are already bending over backwards to defend him... Imagine if Bush had said the same thing..", 
        "reply": " Exactly. I can't fault a guy for saying something me and any of my friends might have said, but I can fault his supporters for choosing this moment to misplace their endless sense of outrage.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 10:51:00", 
        "title": "Special Olympics", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: you know that the President made eye contact with Leno for most of the interview. So you couldn't see the Jack Bauer earpiece in his left ear feeding him his lines and instructions from a secret bunker deep beneath the Sasketchewan crust.", 
        "intTime": 20090320, 
        "postID": 58, 
        "quote": "you know that the President made eye contact with Leno for most of the interview.", 
        "reply": " So you couldn't see the Jack Bauer earpiece in his left ear feeding him his lines and instructions from a secret bunker deep beneath the Sasketchewan crust.", 
        "threadID": "409192893_6130093812001", 
        "time": "2009-03-20 10:55:00", 
        "title": "Special Olympics", 
        "userID": "M1Lase_n_Blaze"
    }
]