[
    {
        "content": "This guy has Ballz! I am pretty sure threerings typed something along these lines in another thread about torture. quote: By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamodetainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from theUnited States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section He said it like it is. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamodetainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from theUnited States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section", 
        "reply": "This guy has Ballz! I am pretty sure threerings typed something along these lines in another thread about torture.  He said it like it is. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 12:30:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "L0A1"
    }, 
    {
        "content": "I've asked the question before, who in their right mind would offer legal advise to this administration? During the Bush administration if you didn't agree you got more time with your family. In the Obama administration if you don't agree you \"may be subject to investigation and prosecution for the content of that advice...\" So I ask you, do you think the best and the brightest will be offering advice to the Obama administration?", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "I've asked the question before, who in their right mind would offer legal advise to this administration? During the Bush administration if you didn't agree you got more time with your family. In the Obama administration if you don't agree you \"may be subject to investigation and prosecution for the content of that advice...\" So I ask you, do you think the best and the brightest will be offering advice to the Obama administration?", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 12:58:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: I've asked the question before, who in their right mind would offer legal advise to this administration? During the Bush administration if you didn't agree you got more time with your family. In the Obama administration if you don't agree you \"may be subject to investigation and prosecution for the content of that advice...\" So I ask you, do you think the best and the brightest will be offering advice to the Obama administration? they couldn't be called the Best and the Brightest. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "Originally posted by bill_kananen: I've asked the question before, who in their right mind would offer legal advise to this administration? During the Bush administration if you didn't agree you got more time with your family. In the Obama administration if you don't agree you \"may be subject to investigation and prosecution for the content of that advice...\" So I ask you, do you think the best and the brightest will be offering advice to the Obama administration?", 
        "reply": " they couldn't be called the Best and the Brightest. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:03:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "L0A1"
    }, 
    {
        "content": "Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "\"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\"", 
        "reply": "Why in the heck would the AG invite anybody to this meeting who wrote this about the President:  McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:04:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting. No one claimed AG Holder was a brainiac. Either politician actually. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting.", 
        "reply": " No one claimed AG Holder was a brainiac. Either politician actually. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:06:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: This guy has Ballz! I am pretty sure threerings typed something along these lines in another thread about torture. quote: By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamodetainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from theUnited States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section He said it like it is. did he get permission from rush limpy before he sent that?...", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: This guy has Ballz! I am pretty sure threerings typed something along these lines in another thread about torture. quote: By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamodetainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from theUnited States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section He said it like it is.", 
        "reply": " did he get permission from rush limpy before he sent that?...", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:17:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: I've asked the question before, who in their right mind would offer legal advise to this administration? Many people would and do. In a way, McCarthy just did. However, if you know your particular opinion is one that would be subject to legal punishment, you are going to stay quiet. As long as the criteria of that legal punishment is reasonable I have no problem with that. If there is a Presidential-advice version of inciting a riot or yelling \"Fire\" in a theater, I have no problems with shutting those people up. Honestly, though, it would be very very difficult to draft a law that would mean anything. quote: Originally posted by bill_kananen: During the Bush administration if you didn't agree you got more time with your family. In the Obama administration if you don't agree you \"may be subject to investigation and prosecution for the content of that advice...\" Both of these policies have flaws - Bush sent dissenters to spend more time with their families, leaving himself surrounded by yes men and manipulators. Obama has given the impression that people will be held responsible for the content of their opinions, which can stifle some genuine debate in the often dark gray areas of executive policy. A better policy would be to now spell out what would constitute \"illegal advice\" and get the approval of both parties - and it should be a high bar to clear. Better still would be to create a system to allow Congress and the President to get pre-emptive decisions from the Supreme Court on legality. Half the trouble the Bush administration got into was because it was using internal opinions of what the SCOTUS and Congress would say - and they were too often wrong. quote: Originally posted by bill_kananen: So I ask you, do you think the best and the brightest will be offering advice to the Obama administration? Yes, just not all of them. The ones who are most likely to duck out are the pragmatists who see ends as more important than means. Yeah, they'll stay quiet.", 
        "intTime": 20090501, 
        "postID": 7, 
        "quote": "Originally posted by bill_kananen: I've asked the question before, who in their right mind would offer legal advise to this administration?", 
        "reply": " Many people would and do. In a way, McCarthy just did. However, if you know your particular opinion is one that would be subject to legal punishment, you are going to stay quiet. As long as the criteria of that legal punishment is reasonable I have no problem with that. If there is a Presidential-advice version of inciting a riot or yelling \"Fire\" in a theater, I have no problems with shutting those people up. Honestly, though, it would be very very difficult to draft a law that would mean anything. quote: Originally posted by bill_kananen: During the Bush administration if you didn't agree you got more time with your family. In the Obama administration if you don't agree you \"may be subject to investigation and prosecution for the content of that advice...\" Both of these policies have flaws - Bush sent dissenters to spend more time with their families, leaving himself surrounded by yes men and manipulators. Obama has given the impression that people will be held responsible for the content of their opinions, which can stifle some genuine debate in the often dark gray areas of executive policy. A better policy would be to now spell out what would constitute \"illegal advice\" and get the approval of both parties - and it should be a high bar to clear. Better still would be to create a system to allow Congress and the President to get pre-emptive decisions from the Supreme Court on legality. Half the trouble the Bush administration got into was because it was using internal opinions of what the SCOTUS and Congress would say - and they were too often wrong. quote: Originally posted by bill_kananen: So I ask you, do you think the best and the brightest will be offering advice to the Obama administration? Yes, just not all of them. The ones who are most likely to duck out are the pragmatists who see ends as more important than means. Yeah, they'll stay quiet.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:18:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by L0A1: Snip to save space quote: Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section He said it like it is. did he get permission from rush limpy before he sent that?... Speaking of brainiacs I guess so, he sent it didn't he? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 8, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by L0A1: Snip to save space quote: Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section He said it like it is. did he get permission from rush limpy before he sent that?...", 
        "reply": " Speaking of brainiacs I guess so, he sent it didn't he? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:20:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting. What's the basis of your observation that he is \"off his rocker\"? Because YOU don't agree with his assessment? Guess what, there are a lot of people who agree with Mr. McCarthy. He is just in a better position to be heard.", 
        "intTime": 20090501, 
        "postID": 9, 
        "quote": "Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting.", 
        "reply": " What's the basis of your observation that he is \"off his rocker\"? Because YOU don't agree with his assessment? Guess what, there are a lot of people who agree with Mr. McCarthy. He is just in a better position to be heard.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:22:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: L0A1: they couldn't be called the Best and the Brightest. Seems during the Bush administration the best and the brightest got to spend more time with the family. However it illustrates the point. The Obama administration results will not be forged by the best and the brightest this nation has to offer. How then do you expect the results to be much different then the previous administration?", 
        "intTime": 20090501, 
        "postID": 10, 
        "quote": "L0A1: they couldn't be called the Best and the Brightest.", 
        "reply": " Seems during the Bush administration the best and the brightest got to spend more time with the family. However it illustrates the point. The Obama administration results will not be forged by the best and the brightest this nation has to offer. How then do you expect the results to be much different then the previous administration?", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:23:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: L0A1: they couldn't be called the Best and the Brightest. Seems during the Bush administration the best and the brightest got to spend more time with the family. However it illustrates the point. The Obama administration results will not be forged by the best and the brightest this nation has to offer. How then do you expect the results to be much different then the previous administration? Must be part of the \"Change You can believe in.\" mantra Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 11, 
        "quote": "Originally posted by bill_kananen: quote: L0A1: they couldn't be called the Best and the Brightest. Seems during the Bush administration the best and the brightest got to spend more time with the family. However it illustrates the point. The Obama administration results will not be forged by the best and the brightest this nation has to offer. How then do you expect the results to be much different then the previous administration?", 
        "reply": " Must be part of the \"Change You can believe in.\" mantra Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:25:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: PhoenixDark: McCarthy is obviously off his rocker and out of his league for a meeting of this importance You have just verified that Attorney General Holder is not among the best and the brightest because he invited McCarthy. What a dummy!", 
        "intTime": 20090501, 
        "postID": 12, 
        "quote": "PhoenixDark: McCarthy is obviously off his rocker and out of his league for a meeting of this importance", 
        "reply": " You have just verified that Attorney General Holder is not among the best and the brightest because he invited McCarthy. What a dummy!", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:26:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "The real issue here is that Presidents are not required to be legal scholars, nor experts in every field of national and international policy - its too much for one person, thats why he has advisors. But how then do we deal with advisors who offer bad advice, either through gross incompetence or deliberate intent. If you went to a doctor, and through incompetence or deliberate intent his trusted professional opinion led you to significant injury, he could lose his license, be sued, or even put in jail. If you went to a lawyer, and through incompetence or deliberate intent his trusted professional opinion led you to a significant legal set back, he could be disbarred, sued, or put in jail. Indeed, this is true for most anybody operating in a professional capacity. How then do White House lawyers get off the hook? How do we deal with those who violate that basic trust while in such an influential position? Bad advice on their part can have world-wide consequences - how do we then rely on their conscience only? Even the President is more accountable then that!", 
        "intTime": 20090501, 
        "postID": 13, 
        "quote": "", 
        "reply": "The real issue here is that Presidents are not required to be legal scholars, nor experts in every field of national and international policy - its too much for one person, thats why he has advisors. But how then do we deal with advisors who offer bad advice, either through gross incompetence or deliberate intent. If you went to a doctor, and through incompetence or deliberate intent his trusted professional opinion led you to significant injury, he could lose his license, be sued, or even put in jail. If you went to a lawyer, and through incompetence or deliberate intent his trusted professional opinion led you to a significant legal set back, he could be disbarred, sued, or put in jail. Indeed, this is true for most anybody operating in a professional capacity. How then do White House lawyers get off the hook? How do we deal with those who violate that basic trust while in such an influential position? Bad advice on their part can have world-wide consequences - how do we then rely on their conscience only? Even the President is more accountable then that!", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:29:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: The real issue here is that Presidents are not required to be legal scholars, nor experts in every field of national and international policy - its too much for one person, thats why he has advisors. But how then do we deal with advisors who offer bad advice, either through gross incompetence or deliberate intent. If you went to a doctor, and through incompetence or deliberate intent his trusted professional opinion led you to significant injury, he could lose his license, be sued, or even put in jail. If you went to a lawyer, and through incompetence or deliberate intent his trusted professional opinion led you to a significant legal set back, he could be disbarred, sued, or put in jail. Indeed, this is true for most anybody operating in a professional capacity. How then do White House lawyers get off the hook? How do we deal with those who violate that basic trust while in such an influential position? Bad advice on their part can have world-wide consequences - how do we then rely on their conscience only? Even the President is more accountable then that! Yep. Remember though, alot of Media and even some folks here would argue that President Obama IS all of the above and more. Of course you have the other side that calls him an Empty suit. They can't both be right, however, they both can be Wrong! I do worry that the folks he is putting up in his Administration are giving him BAD advice. It makes sense if you think about his flip flops on everything from No Lobbyist to moving forward and not investigate Bush Admin for \"Torture.\" I think he needs to clean up his handlers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 14, 
        "quote": "Originally posted by cosmicfish: The real issue here is that Presidents are not required to be legal scholars, nor experts in every field of national and international policy - its too much for one person, thats why he has advisors. But how then do we deal with advisors who offer bad advice, either through gross incompetence or deliberate intent. If you went to a doctor, and through incompetence or deliberate intent his trusted professional opinion led you to significant injury, he could lose his license, be sued, or even put in jail. If you went to a lawyer, and through incompetence or deliberate intent his trusted professional opinion led you to a significant legal set back, he could be disbarred, sued, or put in jail. Indeed, this is true for most anybody operating in a professional capacity. How then do White House lawyers get off the hook? How do we deal with those who violate that basic trust while in such an influential position? Bad advice on their part can have world-wide consequences - how do we then rely on their conscience only? Even the President is more accountable then that!", 
        "reply": " Yep. Remember though, alot of Media and even some folks here would argue that President Obama IS all of the above and more. Of course you have the other side that calls him an Empty suit. They can't both be right, however, they both can be Wrong! I do worry that the folks he is putting up in his Administration are giving him BAD advice. It makes sense if you think about his flip flops on everything from No Lobbyist to moving forward and not investigate Bush Admin for \"Torture.\" I think he needs to clean up his handlers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:44:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "L0A1"
    }, 
    {
        "content": "cosmicfish it is an age old question first asked by Decimus Iunius Iuvenalis, Anglicized as Juvenal, a Roman satiric poet of the late 1st century and early 2nd century AD.: \"Quis custodiet ipsos custodes?\" meaning \"Who shall guard the guardians?\" or more colloquially, \"Who watches the watchers?\". Seem after all that time we still have no answers today.", 
        "intTime": 20090501, 
        "postID": 15, 
        "quote": "", 
        "reply": "cosmicfish it is an age old question first asked by Decimus Iunius Iuvenalis, Anglicized as Juvenal, a Roman satiric poet of the late 1st century and early 2nd century AD.: \"Quis custodiet ipsos custodes?\" meaning \"Who shall guard the guardians?\" or more colloquially, \"Who watches the watchers?\". Seem after all that time we still have no answers today.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 13:47:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse.", 
        "intTime": 20090501, 
        "postID": 16, 
        "quote": "", 
        "reply": "I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 17:30:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Andrew McCarthy From the National Review? Zzzzzzz. Boring. Who would expect anything else?", 
        "intTime": 20090501, 
        "postID": 17, 
        "quote": "Andrew McCarthy", 
        "reply": " From the National Review? Zzzzzzz. Boring. Who would expect anything else?", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 17:39:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse. I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then?", 
        "intTime": 20090501, 
        "postID": 18, 
        "quote": "Originally posted by mcgreer: I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse.", 
        "reply": " I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then?", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 18:03:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: From the National Review? I take them over...dare I say it...Jon Stewart.", 
        "intTime": 20090501, 
        "postID": 19, 
        "quote": "From the National Review?", 
        "reply": " I take them over...dare I say it...Jon Stewart.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 18:20:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then? Try and remember that Distinguished Clarence Thomas is an \"Uncle Tom\" to the exact same group. Barack Obama \"Is he black enough?\" \"Barack the magic __________\" They eat their own until it serves their purpose.", 
        "intTime": 20090501, 
        "postID": 20, 
        "quote": "I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then?", 
        "reply": " Try and remember that Distinguished Clarence Thomas is an \"Uncle Tom\" to the exact same group. Barack Obama \"Is he black enough?\" \"Barack the magic __________\" They eat their own until it serves their purpose.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 18:24:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: From the National Review? I take them over...dare I say it...Jon Stewart. You don't have to \"dare\", it was a given.", 
        "intTime": 20090501, 
        "postID": 21, 
        "quote": "Originally posted by ACR26: quote: From the National Review? I take them over...dare I say it...Jon Stewart.", 
        "reply": " You don't have to \"dare\", it was a given.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 18:36:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by seaservicefan: quote: Originally posted by mcgreer: I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse. I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then? His \"credentials\" are what they are. I was referring to his statements, almost all of which were not based on facts. His experience is that of a prosecuting attorney, who operated within the sphere of United States law. All his insight is informed by that. When he speaks of internees at GTMO, he has no particular expertise, since a) those men were under the control of the US military, and b) since they were at GTMO, they were out of the scope of US law. Hence, he speaks of them as \"enemy combatants\", a term that is informed by nothing more than the decree of the then-SECDEF and his lawyers. Whatever \"debate\" he has listened to, it is from the vantage point of an outsider, since Justice's prosecutors had no role in incarceration and prosecution - and, based on his writings, it has been further colored by his political leanings. The challenges faced by our country and its legal and security mechanisms should not be tainted by either political ideology or emotion. He approaches the problem, in this \"letter\", from both those angles. And the \"floodgates\" at GTMO were opened well before Obama took the oath of office. By January of this year, over 400 of the close to 780 detainees there were released without charges levied against them. \"http://www.globalsecurity.org/military/facility/guantanamo-bay_detainees.htm\"", 
        "intTime": 20090501, 
        "postID": 22, 
        "quote": "Originally posted by seaservicefan: quote: Originally posted by mcgreer: I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse. I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then?", 
        "reply": " His \"credentials\" are what they are. I was referring to his statements, almost all of which were not based on facts. His experience is that of a prosecuting attorney, who operated within the sphere of United States law. All his insight is informed by that. When he speaks of internees at GTMO, he has no particular expertise, since a) those men were under the control of the US military, and b) since they were at GTMO, they were out of the scope of US law. Hence, he speaks of them as \"enemy combatants\", a term that is informed by nothing more than the decree of the then-SECDEF and his lawyers. Whatever \"debate\" he has listened to, it is from the vantage point of an outsider, since Justice's prosecutors had no role in incarceration and prosecution - and, based on his writings, it has been further colored by his political leanings. The challenges faced by our country and its legal and security mechanisms should not be tainted by either political ideology or emotion. He approaches the problem, in this \"letter\", from both those angles. And the \"floodgates\" at GTMO were opened well before Obama took the oath of office. By January of this year, over 400 of the close to 780 detainees there were released without charges levied against them. \"http://www.globalsecurity.org/military/facility/guantanamo-bay_detainees.htm\"", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 18:40:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting. wh should he go to a\"Show meeting\" to where the outcome is already had been d made.", 
        "intTime": 20090501, 
        "postID": 23, 
        "quote": "Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting.", 
        "reply": " wh should he go to a\"Show meeting\" to where the outcome is already had been d made.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 21:14:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I do worry that the folks he is putting up in his Administration are giving him BAD advice. It makes sense if you think about his flip flops on everything from No Lobbyist to moving forward and not investigate Bush Admin for \"Torture.\" I think he needs to clean up his handlers. This may indeed be the case - someone so new to the national scene may well be relying much more on his advisors than a more seasoned politician would. Speculation, but possible. I believe in holding all politicians, and all those who hold the public trust, responsible for their actions - including professional advice given in the creation and execution of national policy. Most ideologues here and elsewhere seem to think that only the opposition requires scrutiny, but you cannot judge one and not the other - and that is why none are judged. No politician will write a law that exposes themselves to the microscope of a judge and jury. I think some of Bush's advisors acted in good faith, and competently, however much I disagree with their decisions. I feel some did not, and sooner or later we need to make it a crime. If we do so now, the Obama administration will have a standard. Otherwise, in 4/8 years they too will have a \"get out of jail free\" card.", 
        "intTime": 20090501, 
        "postID": 24, 
        "quote": "Originally posted by L0A1: I do worry that the folks he is putting up in his Administration are giving him BAD advice. It makes sense if you think about his flip flops on everything from No Lobbyist to moving forward and not investigate Bush Admin for \"Torture.\" I think he needs to clean up his handlers.", 
        "reply": " This may indeed be the case - someone so new to the national scene may well be relying much more on his advisors than a more seasoned politician would. Speculation, but possible. I believe in holding all politicians, and all those who hold the public trust, responsible for their actions - including professional advice given in the creation and execution of national policy. Most ideologues here and elsewhere seem to think that only the opposition requires scrutiny, but you cannot judge one and not the other - and that is why none are judged. No politician will write a law that exposes themselves to the microscope of a judge and jury. I think some of Bush's advisors acted in good faith, and competently, however much I disagree with their decisions. I feel some did not, and sooner or later we need to make it a crime. If we do so now, the Obama administration will have a standard. Otherwise, in 4/8 years they too will have a \"get out of jail free\" card.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 22:40:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: cosmicfish it is an age old question first asked by Decimus Iunius Iuvenalis, Anglicized as Juvenal, a Roman satiric poet of the late 1st century and early 2nd century AD.: \"Quis custodiet ipsos custodes?\" meaning \"Who shall guard the guardians?\" or more colloquially, \"Who watches the watchers?\". Seem after all that time we still have no answers today. In a Republic, as in a Democracy, the answer is supposed to be \"the people.\" We accept the court of public opinion, the lawfirms of Rush and Olbermann, and are surprised when nothing changes. Who watches the watchers? We do. And we do nothing about them.", 
        "intTime": 20090501, 
        "postID": 25, 
        "quote": "Originally posted by bill_kananen: cosmicfish it is an age old question first asked by Decimus Iunius Iuvenalis, Anglicized as Juvenal, a Roman satiric poet of the late 1st century and early 2nd century AD.: \"Quis custodiet ipsos custodes?\" meaning \"Who shall guard the guardians?\" or more colloquially, \"Who watches the watchers?\". Seem after all that time we still have no answers today.", 
        "reply": " In a Republic, as in a Democracy, the answer is supposed to be \"the people.\" We accept the court of public opinion, the lawfirms of Rush and Olbermann, and are surprised when nothing changes. Who watches the watchers? We do. And we do nothing about them.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-01 22:42:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting. Of course he's \"off his rocker\". He needs to \"to do the right thing\" and agree with the President. Should he not his recalcitrance may result in his being subject to Presidential sarcasm.", 
        "intTime": 20090502, 
        "postID": 26, 
        "quote": "Originally posted by PhoenixDark: Why in the heck would the AG invite anybody to this meeting who wrote this about the President: quote: \"I believe that the issue of Obama's personal radicalism, including his collaboration with radical, America-hating Leftists, should have been disqualifying.\" McCarthy is obviously off his rocker and out of his league for a meeting of this importance - it would be like inviting Ann \"The Man\" Coulter to the meeting.", 
        "reply": " Of course he's \"off his rocker\". He needs to \"to do the right thing\" and agree with the President. Should he not his recalcitrance may result in his being subject to Presidential sarcasm.", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-02 03:37:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by seaservicefan: quote: Originally posted by mcgreer: I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse. I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then? His \"credentials\" are what they are. I was referring to his statements, almost all of which were not based on facts. His experience is that of a prosecuting attorney, who operated within the sphere of United States law. All his insight is informed by that. When he speaks of internees at GTMO, he has no particular expertise, since a) those men were under the control of the US military, and b) since they were at GTMO, they were out of the scope of US law. Hence, he speaks of them as \"enemy combatants\", a term that is informed by nothing more than the decree of the then-SECDEF and his lawyers. Whatever \"debate\" he has listened to, it is from the vantage point of an outsider, since Justice's prosecutors had no role in incarceration and prosecution - and, based on his writings, it has been further colored by his political leanings. The challenges faced by our country and its legal and security mechanisms should not be tainted by either political ideology or emotion. He approaches the problem, in this \"letter\", from both those angles. And the \"floodgates\" at GTMO were opened well before Obama took the oath of office. By January of this year, over 400 of the close to 780 detainees there were released without charges levied against them. \"http://www.globalsecurity.org/military/facility/guantanamo-bay_detainees.htm\" ...at the behest of a democrat-run Congress! He, like you, is entitled to his opinion. He is no longer a federal employee and I agree, why have a meeting when the outcome is pre-determined? PBO already dictated the course of events and does not need another \"yes man\" to sit in scorn at that table. I am sure you are familiar with the story of the emperor's new clothes. Well, there you go, Mr. McCarthy would just be the one saying the emperor is naked. As for the tainting of our \"legal and security mechanisms\", that happened when FBI agents were embedded to determine the legality of any option available on the front lines of combat. And that was all about politics simply because a few malcontents did not like that President Bush exercised his constitutional authority as Commander in Chief to conduct military operations since Congress approved the actions (whether based on fallacies of information or not, they still approved it and are on record. I guess they should not have been so reactionary.) and he conducted those operations within the scope of the law and the Constitution. The debate Congress has been relying on has been a political one, not a legal one. The voters who listen to the malcontents determined that they know better than the administration they elected and decided that what was going on was not legal. It seems to me that the Obama administration has engaged more in that \"with-me-or-against-me\" philosophy than President Bush. The new administration will just have to find their own \"yes men\" since there is an ever-growing list of those who are saying \"no, thanks, I have something better to do with my time.\" What goes around...", 
        "intTime": 20090502, 
        "postID": 27, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by seaservicefan: quote: Originally posted by mcgreer: I believe Mr. McCarthy is an ideologue himself. Read his National Review blog post here: \"http://corner.nationalreview.com/post/?q=NzFmZGNiMjM2OTgzNDRlYzNmY2UzMmQ2ZDVjODJkZDc=\" His letter would have far more credibility if he used a little more factual information. How many of those persons who've been detained have been determined to have been a \"trained jihadist\", since virtually none of them have had a proper status review? He seems to be repeating the standard talking points. He also speaks of Obama's releasing of Binyam Mohammed. Well, all charges against Mohammed were dropped in October 2008. And, as far as \"robust debate\" is concerned - there was no debate over the past eight years. It was that Trotskyite \"for-me-or-against-me\" nonsense, and whoever didn't go along with the program was labeled unpatriotic or worse. I think Mr. McCarthy's credentials speak for themselves. It is truly amazing how many people try to discredit those who can make a qualified judgment based on, what, a disagreement with their opinions? In the first place how many times did you scream that the civilian federal court system should be the ones reviewing and evaluating the cases rather than the military tribunals? Now here is one who is qualified to do so and you back-pedal and say \"no-no-no! You don't have all the proper facts,\" when in reality, you are saying \"you are not qualified because you disagree with the administration. That sounds an awful lot like when you disagreed with the last administration. Do we say you were unqualified based on that parameter? I am sure he has heard more than his fair share of the debate that you may not really have been privy to. The illustration he is trying to make in my opinion is that there should not have been any releases of these enemy combatants because they were not eligible to have been tried in our court system. How many others were released and went right back to have been identified as a body with an exploded bomb strapped to them? Several are documented. Now the administration is getting ready to open the flood gates and release dozens to complete their objective. What will you say then? His \"credentials\" are what they are. I was referring to his statements, almost all of which were not based on facts. His experience is that of a prosecuting attorney, who operated within the sphere of United States law. All his insight is informed by that. When he speaks of internees at GTMO, he has no particular expertise, since a) those men were under the control of the US military, and b) since they were at GTMO, they were out of the scope of US law. Hence, he speaks of them as \"enemy combatants\", a term that is informed by nothing more than the decree of the then-SECDEF and his lawyers. Whatever \"debate\" he has listened to, it is from the vantage point of an outsider, since Justice's prosecutors had no role in incarceration and prosecution - and, based on his writings, it has been further colored by his political leanings. The challenges faced by our country and its legal and security mechanisms should not be tainted by either political ideology or emotion. He approaches the problem, in this \"letter\", from both those angles. And the \"floodgates\" at GTMO were opened well before Obama took the oath of office. By January of this year, over 400 of the close to 780 detainees there were released without charges levied against them. \"http://www.globalsecurity.org/military/facility/guantanamo-bay_detainees.htm\"", 
        "reply": " ...at the behest of a democrat-run Congress! He, like you, is entitled to his opinion. He is no longer a federal employee and I agree, why have a meeting when the outcome is pre-determined? PBO already dictated the course of events and does not need another \"yes man\" to sit in scorn at that table. I am sure you are familiar with the story of the emperor's new clothes. Well, there you go, Mr. McCarthy would just be the one saying the emperor is naked. As for the tainting of our \"legal and security mechanisms\", that happened when FBI agents were embedded to determine the legality of any option available on the front lines of combat. And that was all about politics simply because a few malcontents did not like that President Bush exercised his constitutional authority as Commander in Chief to conduct military operations since Congress approved the actions (whether based on fallacies of information or not, they still approved it and are on record. I guess they should not have been so reactionary.) and he conducted those operations within the scope of the law and the Constitution. The debate Congress has been relying on has been a political one, not a legal one. The voters who listen to the malcontents determined that they know better than the administration they elected and decided that what was going on was not legal. It seems to me that the Obama administration has engaged more in that \"with-me-or-against-me\" philosophy than President Bush. The new administration will just have to find their own \"yes men\" since there is an ever-growing list of those who are saying \"no, thanks, I have something better to do with my time.\" What goes around...", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-02 07:44:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: What's the basis of your observation that he is \"off his rocker\"? Because YOU don't agree with his assessment? Guess what, there are a lot of people who agree with Mr. McCarthy. He is just in a better position to be heard.", 
        "intTime": 20090502, 
        "postID": 28, 
        "quote": "What's the basis of your observation that he is \"off his rocker\"? Because YOU don't agree with his assessment? Guess what, there are a lot of people who agree with Mr. McCarthy. He is just in a better position to be heard.", 
        "reply": "", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-02 12:40:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "shuman14"
    }, 
    {
        "content": "The lwnut handbook calls for going adhominum when they have no vaild arguments. Ad so they do here. They further are instructed to claim that the SOURCE, the website , LACKS CREDIBILITY all the while using the huffpost which is completely without socially redeaming qualities as THEIR source. All perfectly logical to them, isn't it?", 
        "intTime": 20090502, 
        "postID": 29, 
        "quote": "", 
        "reply": "The lwnut handbook calls for going adhominum when they have no vaild arguments. Ad so they do here. They further are instructed to claim that the SOURCE, the website , LACKS CREDIBILITY all the while using the huffpost which is completely without socially redeaming qualities as THEIR source. All perfectly logical to them, isn't it?", 
        "threadID": "409192893_6300072222001", 
        "time": "2009-05-02 12:55:00", 
        "title": "Andrew McCarthy Declines Invite from Attorney General Holder", 
        "userID": "peter3_1"
    }
]