[
    {
        "content": "General Petraeus, during an interview on Radio Free Europe: quote: I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees. General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat.", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees.", 
        "reply": "General Petraeus, during an interview on Radio Free Europe:  General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 03:57:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "it won't be long. They love to eat their own. If they keep it up, pretty soon the GOP is just going to be Rush and Hannity alone in a room yelling at each other about who's more patriotic.", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "", 
        "reply": "it won't be long. They love to eat their own. If they keep it up, pretty soon the GOP is just going to be Rush and Hannity alone in a room yelling at each other about who's more patriotic.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:11:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I love it how you libs are so enamoured and irritated by Maharushie! Do you lose sleep at nigth dreaming about El Rushbo? \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "", 
        "reply": "I love it how you libs are so enamoured and irritated by Maharushie! Do you lose sleep at nigth dreaming about El Rushbo? \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:17:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "It is time for General Petraeus to step down. Retire man and spend some time with your Grand Kids. Write a book and enjoy your $12,000 a month retirement check. Let the Generals with years of UnConventional Skills handle this Cluster Fork in Afghanistan for the next 10 years. As far as Rush and Shawn are concerned let them continue to work the long hours running their mouths. They are entertainers. Rush will be dead in a few years because of his eating disorder and Hannity will simply be like the women on the View. All talk and only Morons listening.", 
        "intTime": 20090527, 
        "postID": 4, 
        "quote": "", 
        "reply": "It is time for General Petraeus to step down. Retire man and spend some time with your Grand Kids. Write a book and enjoy your $12,000 a month retirement check. Let the Generals with years of UnConventional Skills handle this Cluster Fork in Afghanistan for the next 10 years. As far as Rush and Shawn are concerned let them continue to work the long hours running their mouths. They are entertainers. Rush will be dead in a few years because of his eating disorder and Hannity will simply be like the women on the View. All talk and only Morons listening.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:18:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"?", 
        "intTime": 20090527, 
        "postID": 5, 
        "quote": "", 
        "reply": "I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"?", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:25:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"? You do it so often, it's obvious you are obsessed with Rush, the Obama antidote. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 6, 
        "quote": "Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"?", 
        "reply": " You do it so often, it's obvious you are obsessed with Rush, the Obama antidote. \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:35:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "nah....see, I don't get emotional about politics, let alone a Tokyo Rose wanna be like Rush. What you see as \"obsessed\", \"enamoured\" and \"irritated\" is me simply calling them as a see 'em. but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up.", 
        "intTime": 20090527, 
        "postID": 7, 
        "quote": "", 
        "reply": "nah....see, I don't get emotional about politics, let alone a Tokyo Rose wanna be like Rush. What you see as \"obsessed\", \"enamoured\" and \"irritated\" is me simply calling them as a see 'em. but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:41:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up. Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. However, I do recall the vicious attacks against Petreaus by the democrats, NY Slimes, and other left-wing hacks, that occurred not too long ago. The democrats have already gone down that road and have a track record of attacking our military. Sadly, there were many liberals here that supported those attacks. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 8, 
        "quote": "Originally posted by karlhungusjr: but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up.", 
        "reply": " Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. However, I do recall the vicious attacks against Petreaus by the democrats, NY Slimes, and other left-wing hacks, that occurred not too long ago. The democrats have already gone down that road and have a track record of attacking our military. Sadly, there were many liberals here that supported those attacks. \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:52:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets?", 
        "intTime": 20090527, 
        "postID": 9, 
        "quote": "Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch.", 
        "reply": " That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets?", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:16:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets? Why would Rush want to attack Gen Petreaus? Petreaus has long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. quote: Our values and the laws governing warfare teach us to respect human dignity, maintain our integrity, and do what is right. Adherence to our values distinguishes us from our enemy. This fight depends on securing the population, which must understand that we - not our enemies - occupy the moral high ground. This strategy has shown results in recent months. Al Qaeda's indiscriminate attacks, for example, have finally started to turn a substantial proportion of the Iraqi population against it. .... In view of this, I was concerned by the results of a recently released survey conducted last fall in Iraq that revealed an apparent unwillingness on the part of some US personnel to report illegal actions taken by fellow members of their units. Some may argue that we would be more effective if we sanctioned torture or other expedient methods to obtain information from the enemy. They would be wrong. Beyond the basic fact that such actions are illegal, history shows that they also are frequently neither useful nor necessary. Certainly, extreme physical action can make someone “talk;” however, what the individual says may be of questionable value.... General Petreaus is a professional Soldier who understands and agrees with the rules that govern his profession, and he avoids \"gotcha\" moments by conducting himself in an honorable way. The only ones on record for attacking General Petreaus' patriotism and professionalism are democrats and their media minions. You liberals haven't already forgotten how they persecuted him, have you? \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 10, 
        "quote": "Originally posted by DMarkUhler: quote: Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets?", 
        "reply": " Why would Rush want to attack Gen Petreaus? Petreaus has long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. quote: Our values and the laws governing warfare teach us to respect human dignity, maintain our integrity, and do what is right. Adherence to our values distinguishes us from our enemy. This fight depends on securing the population, which must understand that we - not our enemies - occupy the moral high ground. This strategy has shown results in recent months. Al Qaeda's indiscriminate attacks, for example, have finally started to turn a substantial proportion of the Iraqi population against it. .... In view of this, I was concerned by the results of a recently released survey conducted last fall in Iraq that revealed an apparent unwillingness on the part of some US personnel to report illegal actions taken by fellow members of their units. Some may argue that we would be more effective if we sanctioned torture or other expedient methods to obtain information from the enemy. They would be wrong. Beyond the basic fact that such actions are illegal, history shows that they also are frequently neither useful nor necessary. Certainly, extreme physical action can make someone “talk;” however, what the individual says may be of questionable value.... General Petreaus is a professional Soldier who understands and agrees with the rules that govern his profession, and he avoids \"gotcha\" moments by conducting himself in an honorable way. The only ones on record for attacking General Petreaus' patriotism and professionalism are democrats and their media minions. You liberals haven't already forgotten how they persecuted him, have you? \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "", 
        "reply": "I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:29:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves. Neither Hannity nor Rush claim to be flag/banner waving repub's...they both criticize that party as well as self-proclaimed members when they appear to abandon the conservative values they espouse. For instance, let's see...why can't conservatives compromise with libs as present-day, mainstream repubs clambor to do??? Well, does that mean \"we\" have to accept the killing of a few babies just to get allong with the pro-abortionists? How many would be enough to convince the dem/libs that we should/could all get on with effective governing? Seems both Hannity and Rush make a lot of people squirm for being just \"entertainers\" I don't find the errosion of the repub party \"hilarious\", I find it disheartening but another, more vigorous conservative political party will emerge to rally this center-right-leaning nation.", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "Originally posted by NSNN: I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves.", 
        "reply": " Neither Hannity nor Rush claim to be flag/banner waving repub's...they both criticize that party as well as self-proclaimed members when they appear to abandon the conservative values they espouse. For instance, let's see...why can't conservatives compromise with libs as present-day, mainstream repubs clambor to do??? Well, does that mean \"we\" have to accept the killing of a few babies just to get allong with the pro-abortionists? How many would be enough to convince the dem/libs that we should/could all get on with effective governing? Seems both Hannity and Rush make a lot of people squirm for being just \"entertainers\" I don't find the errosion of the repub party \"hilarious\", I find it disheartening but another, more vigorous conservative political party will emerge to rally this center-right-leaning nation.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:57:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"? You do it so often, it's obvious you are obsessed with Rush, the Obama antidote. Antidote? Even if you claim Obama is toxic, Rush would still be like chemotherapy - fighting cancer with poison and hoping that they kill each other before either one kills you. Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere.", 
        "intTime": 20090527, 
        "postID": 13, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"? You do it so often, it's obvious you are obsessed with Rush, the Obama antidote.", 
        "reply": " Antidote? Even if you claim Obama is toxic, Rush would still be like chemotherapy - fighting cancer with poison and hoping that they kill each other before either one kills you. Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 08:31:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous.", 
        "intTime": 20090527, 
        "postID": 14, 
        "quote": "", 
        "reply": "Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 08:45:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well... I didn't hear the rant, but I have heard reference to what he maybe talking about. I believe it was about 1981 in which she wrote or said (paraphrase, so don't kill me): Latino women would make better decisions then old, white men. Taken out of context it sounds bad. Also, this was nearly 30 years ago(& may have changed or curbed her thoughts), so I'll give her a chance to repond when it is brought up, which I'm sure it will be.", 
        "intTime": 20090527, 
        "postID": 15, 
        "quote": "Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well...", 
        "reply": " I didn't hear the rant, but I have heard reference to what he maybe talking about. I believe it was about 1981 in which she wrote or said (paraphrase, so don't kill me): Latino women would make better decisions then old, white men. Taken out of context it sounds bad. Also, this was nearly 30 years ago(& may have changed or curbed her thoughts), so I'll give her a chance to repond when it is brought up, which I'm sure it will be.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 08:54:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous. I don't listen to Rush so I did not hear that either. However, remember Black Liberation Theology? BHO went to Rev Wright's Church for 20 years. Where Black Liberation Theology and REPARATIONS were the main theme. As for Sotomayer(sp) she shot down the Reverse Discrimination Case in One Paragraph. The one in NJ about the FFs. So there is a grain of truth in there.", 
        "intTime": 20090527, 
        "postID": 16, 
        "quote": "Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous.", 
        "reply": " I don't listen to Rush so I did not hear that either. However, remember Black Liberation Theology? BHO went to Rev Wright's Church for 20 years. Where Black Liberation Theology and REPARATIONS were the main theme. As for Sotomayer(sp) she shot down the Reverse Discrimination Case in One Paragraph. The one in NJ about the FFs. So there is a grain of truth in there.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 09:20:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: General Petraeus, during an interview on Radio Free Europe: quote: I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees. General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat. I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN", 
        "intTime": 20090527, 
        "postID": 17, 
        "quote": "Originally posted by Fightdirector: General Petraeus, during an interview on Radio Free Europe: quote: I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees. General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat.", 
        "reply": " I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 12:34:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Neither Hannity nor Rush claim to be flag/banner waving repub's... LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out.", 
        "intTime": 20090527, 
        "postID": 18, 
        "quote": "Neither Hannity nor Rush claim to be flag/banner waving repub's...", 
        "reply": " LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 16:43:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere. I have to agree with you on that. Those guys make my head pound, if I am somehow forced to listen to them for more than 30 seconds. O'reilly really gets on my nerves and I never listen to Rush. I heard him once, and that was enough. I have to add that I have nothing but admiration and respect for the General.", 
        "intTime": 20090527, 
        "postID": 19, 
        "quote": "Originally posted by cosmicfish: Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere.", 
        "reply": " I have to agree with you on that. Those guys make my head pound, if I am somehow forced to listen to them for more than 30 seconds. O'reilly really gets on my nerves and I never listen to Rush. I heard him once, and that was enough. I have to add that I have nothing but admiration and respect for the General.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 20:02:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line.", 
        "intTime": 20090528, 
        "postID": 20, 
        "quote": "Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN", 
        "reply": " At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 05:00:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. So you're not sure(\"I believe\") if wrote anything in support of the General when some scumbags take a full page ad besmirching his good name, but you start a thread against Rush for something he hasn't said. Uhhh, yeah.", 
        "intTime": 20090528, 
        "postID": 21, 
        "quote": "Originally posted by Fightdirector: At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them.", 
        "reply": " So you're not sure(\"I believe\") if wrote anything in support of the General when some scumbags take a full page ad besmirching his good name, but you start a thread against Rush for something he hasn't said. Uhhh, yeah.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 06:53:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line. I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks! This message has been edited. Last edited by: adminnco1, Thu 28 May 2009 11:32 AM", 
        "intTime": 20090528, 
        "postID": 22, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line.", 
        "reply": " I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks! This message has been edited. Last edited by: adminnco1, Thu 28 May 2009 11:32 AM", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 07:47:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update.", 
        "intTime": 20090528, 
        "postID": 23, 
        "quote": "", 
        "reply": "Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 13:45:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update. Not to worry, that instuction will be arriving soon and once it does all the liberal drone posters will be dutifully pounding away on their keyboards mindlessly repeating the talking points of the day.", 
        "intTime": 20090529, 
        "postID": 24, 
        "quote": "Originally posted by ACR26: Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update.", 
        "reply": " Not to worry, that instuction will be arriving soon and once it does all the liberal drone posters will be dutifully pounding away on their keyboards mindlessly repeating the talking points of the day.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-29 03:26:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: I think this is known in the industry as a 'pre-emptive strike'. He shoots...he scores! Your observation is correct.", 
        "intTime": 20090529, 
        "postID": 25, 
        "quote": "Originally posted by Yooper_tj: I think this is known in the industry as a 'pre-emptive strike'.", 
        "reply": " He shoots...he scores! Your observation is correct.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-29 03:34:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line. I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks! I love Limbaugh....and Hannity too. They are both masters of sheep manipulation. The good news is there are enough smart Republicans out there that see the damage these two well paid clones are doing. Rush has created more divisions in the Republican party than any Democrat could ever hope to acheive...except for Obama in the 2008 election.", 
        "intTime": 20090529, 
        "postID": 26, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line. I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks!", 
        "reply": " I love Limbaugh....and Hannity too. They are both masters of sheep manipulation. The good news is there are enough smart Republicans out there that see the damage these two well paid clones are doing. Rush has created more divisions in the Republican party than any Democrat could ever hope to acheive...except for Obama in the 2008 election.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-29 14:50:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Neither Hannity nor Rush claim to be flag/banner waving repub's... LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out. Then I can only believe that what they are saying, regardless of their critics' condemnation, must be being listened to and must be having some effect...hopefully that effect is the alerting/informing of an uninformed, apathetic, propagandized public to a different/challanging view of what the MSM says is goin on.", 
        "intTime": 20090531, 
        "postID": 27, 
        "quote": "Originally posted by DMarkUhler: quote: Neither Hannity nor Rush claim to be flag/banner waving repub's... LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out.", 
        "reply": " Then I can only believe that what they are saying, regardless of their critics' condemnation, must be being listened to and must be having some effect...hopefully that effect is the alerting/informing of an uninformed, apathetic, propagandized public to a different/challanging view of what the MSM says is goin on.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-31 16:59:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "quote: Then I can only believe that what they are saying... Yes I guess you can. But why? Are you incapable of your own reasoning?", 
        "intTime": 20090531, 
        "postID": 28, 
        "quote": "Then I can only believe that what they are saying...", 
        "reply": " Yes I guess you can. But why? Are you incapable of your own reasoning?", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-31 17:34:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "General Petraeus, during an interview on Radio Free Europe: quote: I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees. General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat.", 
        "intTime": 20090527, 
        "postID": 29, 
        "quote": "I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees.", 
        "reply": "General Petraeus, during an interview on Radio Free Europe:  General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 03:57:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "it won't be long. They love to eat their own. If they keep it up, pretty soon the GOP is just going to be Rush and Hannity alone in a room yelling at each other about who's more patriotic.", 
        "intTime": 20090527, 
        "postID": 30, 
        "quote": "", 
        "reply": "it won't be long. They love to eat their own. If they keep it up, pretty soon the GOP is just going to be Rush and Hannity alone in a room yelling at each other about who's more patriotic.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:11:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I love it how you libs are so enamoured and irritated by Maharushie! Do you lose sleep at nigth dreaming about El Rushbo? \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 31, 
        "quote": "", 
        "reply": "I love it how you libs are so enamoured and irritated by Maharushie! Do you lose sleep at nigth dreaming about El Rushbo? \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:17:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "It is time for General Petraeus to step down. Retire man and spend some time with your Grand Kids. Write a book and enjoy your $12,000 a month retirement check. Let the Generals with years of UnConventional Skills handle this Cluster Fork in Afghanistan for the next 10 years. As far as Rush and Shawn are concerned let them continue to work the long hours running their mouths. They are entertainers. Rush will be dead in a few years because of his eating disorder and Hannity will simply be like the women on the View. All talk and only Morons listening.", 
        "intTime": 20090527, 
        "postID": 32, 
        "quote": "", 
        "reply": "It is time for General Petraeus to step down. Retire man and spend some time with your Grand Kids. Write a book and enjoy your $12,000 a month retirement check. Let the Generals with years of UnConventional Skills handle this Cluster Fork in Afghanistan for the next 10 years. As far as Rush and Shawn are concerned let them continue to work the long hours running their mouths. They are entertainers. Rush will be dead in a few years because of his eating disorder and Hannity will simply be like the women on the View. All talk and only Morons listening.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:18:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"?", 
        "intTime": 20090527, 
        "postID": 33, 
        "quote": "", 
        "reply": "I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"?", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:25:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"? You do it so often, it's obvious you are obsessed with Rush, the Obama antidote. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 34, 
        "quote": "Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"?", 
        "reply": " You do it so often, it's obvious you are obsessed with Rush, the Obama antidote. \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:35:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "nah....see, I don't get emotional about politics, let alone a Tokyo Rose wanna be like Rush. What you see as \"obsessed\", \"enamoured\" and \"irritated\" is me simply calling them as a see 'em. but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up.", 
        "intTime": 20090527, 
        "postID": 35, 
        "quote": "", 
        "reply": "nah....see, I don't get emotional about politics, let alone a Tokyo Rose wanna be like Rush. What you see as \"obsessed\", \"enamoured\" and \"irritated\" is me simply calling them as a see 'em. but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:41:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up. Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. However, I do recall the vicious attacks against Petreaus by the democrats, NY Slimes, and other left-wing hacks, that occurred not too long ago. The democrats have already gone down that road and have a track record of attacking our military. Sadly, there were many liberals here that supported those attacks. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 36, 
        "quote": "Originally posted by karlhungusjr: but to the topic, which you have yet to comment on, It won't be long before Rush turns on him. Petraeus will suddenly be a dirty socialist lib who hates America. And all his little followers will lap it up.", 
        "reply": " Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. However, I do recall the vicious attacks against Petreaus by the democrats, NY Slimes, and other left-wing hacks, that occurred not too long ago. The democrats have already gone down that road and have a track record of attacking our military. Sadly, there were many liberals here that supported those attacks. \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 04:52:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets?", 
        "intTime": 20090527, 
        "postID": 37, 
        "quote": "Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch.", 
        "reply": " That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets?", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:16:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets? Why would Rush want to attack Gen Petreaus? Petreaus has long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. quote: Our values and the laws governing warfare teach us to respect human dignity, maintain our integrity, and do what is right. Adherence to our values distinguishes us from our enemy. This fight depends on securing the population, which must understand that we - not our enemies - occupy the moral high ground. This strategy has shown results in recent months. Al Qaeda's indiscriminate attacks, for example, have finally started to turn a substantial proportion of the Iraqi population against it. .... In view of this, I was concerned by the results of a recently released survey conducted last fall in Iraq that revealed an apparent unwillingness on the part of some US personnel to report illegal actions taken by fellow members of their units. Some may argue that we would be more effective if we sanctioned torture or other expedient methods to obtain information from the enemy. They would be wrong. Beyond the basic fact that such actions are illegal, history shows that they also are frequently neither useful nor necessary. Certainly, extreme physical action can make someone “talk;” however, what the individual says may be of questionable value.... General Petreaus is a professional Soldier who understands and agrees with the rules that govern his profession, and he avoids \"gotcha\" moments by conducting himself in an honorable way. The only ones on record for attacking General Petreaus' patriotism and professionalism are democrats and their media minions. You liberals haven't already forgotten how they persecuted him, have you? \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 38, 
        "quote": "Originally posted by DMarkUhler: quote: Why would you imply that Rush is going to attack General Petraeus...because of Powell? That's a stretch. That is anything but a stretch with Rush. How long is it going to be before the cons around here attack him? Any bets?", 
        "reply": " Why would Rush want to attack Gen Petreaus? Petreaus has long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. quote: Our values and the laws governing warfare teach us to respect human dignity, maintain our integrity, and do what is right. Adherence to our values distinguishes us from our enemy. This fight depends on securing the population, which must understand that we - not our enemies - occupy the moral high ground. This strategy has shown results in recent months. Al Qaeda's indiscriminate attacks, for example, have finally started to turn a substantial proportion of the Iraqi population against it. .... In view of this, I was concerned by the results of a recently released survey conducted last fall in Iraq that revealed an apparent unwillingness on the part of some US personnel to report illegal actions taken by fellow members of their units. Some may argue that we would be more effective if we sanctioned torture or other expedient methods to obtain information from the enemy. They would be wrong. Beyond the basic fact that such actions are illegal, history shows that they also are frequently neither useful nor necessary. Certainly, extreme physical action can make someone “talk;” however, what the individual says may be of questionable value.... General Petreaus is a professional Soldier who understands and agrees with the rules that govern his profession, and he avoids \"gotcha\" moments by conducting himself in an honorable way. The only ones on record for attacking General Petreaus' patriotism and professionalism are democrats and their media minions. You liberals haven't already forgotten how they persecuted him, have you? \"The World's Finest\"", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 39, 
        "quote": "", 
        "reply": "I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:29:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves. Neither Hannity nor Rush claim to be flag/banner waving repub's...they both criticize that party as well as self-proclaimed members when they appear to abandon the conservative values they espouse. For instance, let's see...why can't conservatives compromise with libs as present-day, mainstream repubs clambor to do??? Well, does that mean \"we\" have to accept the killing of a few babies just to get allong with the pro-abortionists? How many would be enough to convince the dem/libs that we should/could all get on with effective governing? Seems both Hannity and Rush make a lot of people squirm for being just \"entertainers\" I don't find the errosion of the repub party \"hilarious\", I find it disheartening but another, more vigorous conservative political party will emerge to rally this center-right-leaning nation.", 
        "intTime": 20090527, 
        "postID": 40, 
        "quote": "Originally posted by NSNN: I don’t subscribe to either Republicans or Democrats, but I find it hilarious how much damage Rush and Hannity are causing to (supposedly) their own party! I guess you have to point-out the extremist one way or the other; better if they do it themselves.", 
        "reply": " Neither Hannity nor Rush claim to be flag/banner waving repub's...they both criticize that party as well as self-proclaimed members when they appear to abandon the conservative values they espouse. For instance, let's see...why can't conservatives compromise with libs as present-day, mainstream repubs clambor to do??? Well, does that mean \"we\" have to accept the killing of a few babies just to get allong with the pro-abortionists? How many would be enough to convince the dem/libs that we should/could all get on with effective governing? Seems both Hannity and Rush make a lot of people squirm for being just \"entertainers\" I don't find the errosion of the repub party \"hilarious\", I find it disheartening but another, more vigorous conservative political party will emerge to rally this center-right-leaning nation.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 05:57:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"? You do it so often, it's obvious you are obsessed with Rush, the Obama antidote. Antidote? Even if you claim Obama is toxic, Rush would still be like chemotherapy - fighting cancer with poison and hoping that they kill each other before either one kills you. Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere.", 
        "intTime": 20090527, 
        "postID": 41, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by karlhungusjr: I love it how commenting on what the head of the GOP does automatically makes someone \"enamoured and irritated\"? You do it so often, it's obvious you are obsessed with Rush, the Obama antidote.", 
        "reply": " Antidote? Even if you claim Obama is toxic, Rush would still be like chemotherapy - fighting cancer with poison and hoping that they kill each other before either one kills you. Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 08:31:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous.", 
        "intTime": 20090527, 
        "postID": 42, 
        "quote": "", 
        "reply": "Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 08:45:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well... I didn't hear the rant, but I have heard reference to what he maybe talking about. I believe it was about 1981 in which she wrote or said (paraphrase, so don't kill me): Latino women would make better decisions then old, white men. Taken out of context it sounds bad. Also, this was nearly 30 years ago(& may have changed or curbed her thoughts), so I'll give her a chance to repond when it is brought up, which I'm sure it will be.", 
        "intTime": 20090527, 
        "postID": 43, 
        "quote": "Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well...", 
        "reply": " I didn't hear the rant, but I have heard reference to what he maybe talking about. I believe it was about 1981 in which she wrote or said (paraphrase, so don't kill me): Latino women would make better decisions then old, white men. Taken out of context it sounds bad. Also, this was nearly 30 years ago(& may have changed or curbed her thoughts), so I'll give her a chance to repond when it is brought up, which I'm sure it will be.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 08:54:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous. I don't listen to Rush so I did not hear that either. However, remember Black Liberation Theology? BHO went to Rev Wright's Church for 20 years. Where Black Liberation Theology and REPARATIONS were the main theme. As for Sotomayer(sp) she shot down the Reverse Discrimination Case in One Paragraph. The one in NJ about the FFs. So there is a grain of truth in there.", 
        "intTime": 20090527, 
        "postID": 44, 
        "quote": "Originally posted by Irwin_R_Schyster: Rush dropped an awful rant against President Obama's Supreme Court pick....He called her a racist, and called the President a racist as well.. I almost can't believe that crap this guy spews on the air...its just the ignorance of it all that is ****ing this Republican off.. He has to go dammit...that rant was ridiculous.", 
        "reply": " I don't listen to Rush so I did not hear that either. However, remember Black Liberation Theology? BHO went to Rev Wright's Church for 20 years. Where Black Liberation Theology and REPARATIONS were the main theme. As for Sotomayer(sp) she shot down the Reverse Discrimination Case in One Paragraph. The one in NJ about the FFs. So there is a grain of truth in there.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 09:20:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: General Petraeus, during an interview on Radio Free Europe: quote: I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees. General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat. I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN", 
        "intTime": 20090527, 
        "postID": 45, 
        "quote": "Originally posted by Fightdirector: General Petraeus, during an interview on Radio Free Europe: quote: I think, on balance, that those moves to end enhanced interrogation techniques help us. In fact, I have long been on record as having testified and also in helping write doctrine for interrogation techniques that are completely in line with the Geneva Convention. And as a division commander in Iraq in the early days, we put out guidance very early on to make sure that our soldiers, in fact, knew that we needed to stay within those guidelines. With respect to Guantanamo, I think that the closure in a responsible manner, obviously one that is certainly being worked out now by the Department of Justice - I talked to the Attorney General the other day and they have a very intensive effort ongoing to determine, indeed, what to do with the detainees who are left, how to deal with them in a legal way, and if continued incarceration is necessary - again, how to take that forward. But doing that in a responsible manner, I think, sends an important message to the world, as does the commitment of the United States to observe the Geneva Convention when it comes to the treatment of detainees. General Petraeus wants Gitmo to be closed and wants American interrogators to stop using \"enhanced interrogation techniques\" (such as waterboarding). He wants suspected terrorists to be treated under the guidelines of the Geneva Conventions. How soon before Rush Limpbum says something like: quote: General Petraeus has been infected with Socialism and is now lost to us. Supporters of Sarah Palin, as recently as May 15, 2009, were speculating on the strength of a Palin-Petraeus ticket for the 2012 Presidential election. \"http://www.thesarahpalinblog.com/2009/05/sarah-palin-supporters-want-david.html\" Spencer Ackerman in the American Prospect, January 22, 2008 was suggesting the the GOP make Petraeus their Presidential candidate in 2012 \"http://www.prospect.org/cs/articles?article=petraeus_12\" I guess that's all over now. General Petraeus is against waterboarding, he's for giving suspected terrorists protections under the Geneva Conventions and he's for closing Gitmo - all things that, according to Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum means that General Petraeus is a commie/socialist/Democrat.", 
        "reply": " I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 12:34:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Neither Hannity nor Rush claim to be flag/banner waving repub's... LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out.", 
        "intTime": 20090527, 
        "postID": 46, 
        "quote": "Neither Hannity nor Rush claim to be flag/banner waving repub's...", 
        "reply": " LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 16:43:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere. I have to agree with you on that. Those guys make my head pound, if I am somehow forced to listen to them for more than 30 seconds. O'reilly really gets on my nerves and I never listen to Rush. I heard him once, and that was enough. I have to add that I have nothing but admiration and respect for the General.", 
        "intTime": 20090527, 
        "postID": 47, 
        "quote": "Originally posted by cosmicfish: Rush, Hannity, Beck, and O'Reilly can no more repair the failings of the DNC than Olberman and Franken can repair the failings of the RNC. Screaming heads who pocket millions off of national discord get us nowhere.", 
        "reply": " I have to agree with you on that. Those guys make my head pound, if I am somehow forced to listen to them for more than 30 seconds. O'reilly really gets on my nerves and I never listen to Rush. I heard him once, and that was enough. I have to add that I have nothing but admiration and respect for the General.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-27 20:02:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line.", 
        "intTime": 20090528, 
        "postID": 48, 
        "quote": "Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN", 
        "reply": " At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 05:00:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. So you're not sure(\"I believe\") if wrote anything in support of the General when some scumbags take a full page ad besmirching his good name, but you start a thread against Rush for something he hasn't said. Uhhh, yeah.", 
        "intTime": 20090528, 
        "postID": 49, 
        "quote": "Originally posted by Fightdirector: At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them.", 
        "reply": " So you're not sure(\"I believe\") if wrote anything in support of the General when some scumbags take a full page ad besmirching his good name, but you start a thread against Rush for something he hasn't said. Uhhh, yeah.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 06:53:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line. I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks! This message has been edited. Last edited by: adminnco1, Thu 28 May 2009 11:32 AM", 
        "intTime": 20090528, 
        "postID": 50, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line.", 
        "reply": " I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks! This message has been edited. Last edited by: adminnco1, Thu 28 May 2009 11:32 AM", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 07:47:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update.", 
        "intTime": 20090528, 
        "postID": 51, 
        "quote": "", 
        "reply": "Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-28 13:45:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update. Not to worry, that instuction will be arriving soon and once it does all the liberal drone posters will be dutifully pounding away on their keyboards mindlessly repeating the talking points of the day.", 
        "intTime": 20090529, 
        "postID": 52, 
        "quote": "Originally posted by ACR26: Wow...another thread/attack on Rush by those who admit they never listen...but will scream context context context when a lib says something tardedre. Keep pressing the assault...very effective I am waiting for another Palin, Alaska, tea party attack/update.", 
        "reply": " Not to worry, that instuction will be arriving soon and once it does all the liberal drone posters will be dutifully pounding away on their keyboards mindlessly repeating the talking points of the day.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-29 03:26:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: I think this is known in the industry as a 'pre-emptive strike'. He shoots...he scores! Your observation is correct.", 
        "intTime": 20090529, 
        "postID": 53, 
        "quote": "Originally posted by Yooper_tj: I think this is known in the industry as a 'pre-emptive strike'.", 
        "reply": " He shoots...he scores! Your observation is correct.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-29 03:34:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line. I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks! I love Limbaugh....and Hannity too. They are both masters of sheep manipulation. The good news is there are enough smart Republicans out there that see the damage these two well paid clones are doing. Rush has created more divisions in the Republican party than any Democrat could ever hope to acheive...except for Obama in the 2008 election.", 
        "intTime": 20090529, 
        "postID": 54, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Fightdirector: quote: Originally posted by GRAYMAN: I'll take you more seriously when you start defending the General against the likes of MoveOn and Clinton, which you didnt. GRAYMAN At the time of the MoveOn ad, if I remember correctly, I never wrote, posted or said anything against General Petraeus. Many people, here and in other places, spoke out in the General's favor, and I believe I was one of them. Which Clinton are you referring to? Former President Clinton? The Clinton who is now the Secretary of State? George Clinton of the funk bands Parliement and Funkadelic? I am defending General Petraeus in this thread against possible future attacks by Rush \"I can't serve my country - I have a pimple on my butt\" Limpbum - not that the General really needs defending - he's a strong man who can handle himself. But I would hate to hear him bashed by the draft-dodgers of the Right (Limpbutt, O'Reilly, Michael \"Michael Savage\" Weiner, Dick Cheney, Karl Rove, etc.) because he deviated a millemeter from the \"Rush Party\" line. I have not listened to Limbaugh in at least 15 years, and that instance was in error. I must, however, admit to be impressed with impact he obviously has on the easily influenced. It amazes me that I have been able to survive for over 5,475 days without listening to Limbaugh while others are so enamored of him that after a few Limbaugh free minutes they are forced to fabricate tales about him in anticipation of his actual words. No wonder he gets the big bucks!", 
        "reply": " I love Limbaugh....and Hannity too. They are both masters of sheep manipulation. The good news is there are enough smart Republicans out there that see the damage these two well paid clones are doing. Rush has created more divisions in the Republican party than any Democrat could ever hope to acheive...except for Obama in the 2008 election.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-29 14:50:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Neither Hannity nor Rush claim to be flag/banner waving repub's... LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out. Then I can only believe that what they are saying, regardless of their critics' condemnation, must be being listened to and must be having some effect...hopefully that effect is the alerting/informing of an uninformed, apathetic, propagandized public to a different/challanging view of what the MSM says is goin on.", 
        "intTime": 20090531, 
        "postID": 55, 
        "quote": "Originally posted by DMarkUhler: quote: Neither Hannity nor Rush claim to be flag/banner waving repub's... LOL They don't need to claim it. It is theirs by default. They speak and those left in the party bob their heads in agreement. Oh and don't leave Ann out.", 
        "reply": " Then I can only believe that what they are saying, regardless of their critics' condemnation, must be being listened to and must be having some effect...hopefully that effect is the alerting/informing of an uninformed, apathetic, propagandized public to a different/challanging view of what the MSM says is goin on.", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-31 16:59:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "quote: Then I can only believe that what they are saying... Yes I guess you can. But why? Are you incapable of your own reasoning?", 
        "intTime": 20090531, 
        "postID": 56, 
        "quote": "Then I can only believe that what they are saying...", 
        "reply": " Yes I guess you can. But why? Are you incapable of your own reasoning?", 
        "threadID": "409192893_6710083422001", 
        "time": "2009-05-31 17:34:00", 
        "title": "How soon before Rush attacks General Petraeus?", 
        "userID": "DMarkUhler"
    }
]