[
    {
        "content": "Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS??", 
        "intTime": 20090331, 
        "postID": 1, 
        "quote": "", 
        "reply": "Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 05:57:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "intTime": 20090331, 
        "postID": 2, 
        "quote": "", 
        "reply": "When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 06:07:00", 
        "title": "FIAT???", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****! SEZ WHO", 
        "intTime": 20090331, 
        "postID": 3, 
        "quote": "Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "reply": " SEZ WHO", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:04:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Fix It Again Tony...", 
        "intTime": 20090331, 
        "postID": 4, 
        "quote": "", 
        "reply": "Fix It Again Tony...", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:18:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again. yea blame the democrats ...", 
        "intTime": 20090331, 
        "postID": 5, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again.", 
        "reply": " yea blame the democrats ...", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:18:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Chrysler is different than Ford or GM in that it is privately held. (You can't buy Chrysler stock). The merger with Daimler didn't work, and they messed up by dropping Plymouth as an entry level brand. They are in need of small fuel efficient cars, something they are really lacking. Fiat needs a dealer network in order to be more than a novelty in the US. It looks like Fiat will aquire 55% of Chrysler in exchange for retooling Chrysler plants to build Fiat cars.", 
        "intTime": 20090331, 
        "postID": 6, 
        "quote": "", 
        "reply": "Chrysler is different than Ford or GM in that it is privately held. (You can't buy Chrysler stock). The merger with Daimler didn't work, and they messed up by dropping Plymouth as an entry level brand. They are in need of small fuel efficient cars, something they are really lacking. Fiat needs a dealer network in order to be more than a novelty in the US. It looks like Fiat will aquire 55% of Chrysler in exchange for retooling Chrysler plants to build Fiat cars.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:26:00", 
        "title": "FIAT???", 
        "userID": "nspreitler"
    }, 
    {
        "content": "i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design...", 
        "intTime": 20090331, 
        "postID": 7, 
        "quote": "", 
        "reply": "i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design...", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:39:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design... I have a 02 Neon 150,000, runs like a champ and hasn't cost me much outside of routine...except a tie rod... <Frantically knocking on wood> \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090331, 
        "postID": 8, 
        "quote": "Originally posted by outlaws93: i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design...", 
        "reply": " I have a 02 Neon 150,000, runs like a champ and hasn't cost me much outside of routine...except a tie rod... <Frantically knocking on wood> \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 10:03:00", 
        "title": "FIAT???", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again. getting somewhat tired of YOU putting words in my mouth show me where i blamed obama for this??", 
        "intTime": 20090331, 
        "postID": 9, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again.", 
        "reply": " getting somewhat tired of YOU putting words in my mouth show me where i blamed obama for this??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 10:25:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy.", 
        "intTime": 20090331, 
        "postID": 10, 
        "quote": "Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT???", 
        "reply": " Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 10:44:00", 
        "title": "FIAT???", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks. i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks", 
        "intTime": 20090331, 
        "postID": 11, 
        "quote": "Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks.", 
        "reply": " i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 11:59:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy. i looked at fiats, where do you sit? how do you get in and out if over 6'4??", 
        "intTime": 20090331, 
        "postID": 12, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy.", 
        "reply": " i looked at fiats, where do you sit? how do you get in and out if over 6'4??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:00:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: quote: Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks. i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks You asked a question, I answered. That is how it works. not quite, and the bull **** snide comments, but you are a moderator, do as i say not as i do right", 
        "intTime": 20090331, 
        "postID": 13, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: quote: Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks. i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks You asked a question, I answered. That is how it works.", 
        "reply": " not quite, and the bull **** snide comments, but you are a moderator, do as i say not as i do right", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:20:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: but you are a moderator I am??? i thought you were, since i am wrong i apologize but was misinformed or was just wrong", 
        "intTime": 20090331, 
        "postID": 14, 
        "quote": "Originally posted by dmuhler: quote: but you are a moderator I am???", 
        "reply": " i thought you were, since i am wrong i apologize but was misinformed or was just wrong", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:45:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "One way to create more mechanic jobs, all the breakdowns? \"DEATH ON CALL\"", 
        "intTime": 20090331, 
        "postID": 15, 
        "quote": "", 
        "reply": "One way to create more mechanic jobs, all the breakdowns? \"DEATH ON CALL\"", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:54:00", 
        "title": "FIAT???", 
        "userID": "Combatmix"
    }, 
    {
        "content": "This message has been edited. Last edited by: Knele, Tue 31 March 2009 01:39 PM", 
        "intTime": 20090331, 
        "postID": 16, 
        "quote": "", 
        "reply": "This message has been edited. Last edited by: Knele, Tue 31 March 2009 01:39 PM", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:14:00", 
        "title": "FIAT???", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot??", 
        "intTime": 20090331, 
        "postID": 17, 
        "quote": "Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns?", 
        "reply": " do they break down a lot??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:29:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge", 
        "intTime": 20090331, 
        "postID": 18, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot??", 
        "reply": " Not as much as a Dodge", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:32:00", 
        "title": "FIAT???", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****! So are GM and Ford - well Vauxhall/Opel and Ford Europe anyway, it's the US operations of the Detroit dinosaurs that have lost the plot.", 
        "intTime": 20090331, 
        "postID": 19, 
        "quote": "Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "reply": " So are GM and Ford - well Vauxhall/Opel and Ford Europe anyway, it's the US operations of the Detroit dinosaurs that have lost the plot.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:49:00", 
        "title": "FIAT???", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell", 
        "intTime": 20090331, 
        "postID": 20, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge", 
        "reply": " must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 15:18:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell my dodge was a monster... i took that thing about a mile out in the woods of the oclia national forest before and use to live in it...it was real sad to see it go to the junkers..it was a dodge shadow es 1994.. but i got it in 1993,.....", 
        "intTime": 20090331, 
        "postID": 21, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell", 
        "reply": " my dodge was a monster... i took that thing about a mile out in the woods of the oclia national forest before and use to live in it...it was real sad to see it go to the junkers..it was a dodge shadow es 1994.. but i got it in 1993,.....", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 20:21:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Chrysler, Fix It Again Tony. Walter Chrysler is turning over in his grave. When the Chrysler hits the FIAT in the eye, that's Amore.", 
        "intTime": 20090331, 
        "postID": 22, 
        "quote": "", 
        "reply": "Chrysler, Fix It Again Tony. Walter Chrysler is turning over in his grave. When the Chrysler hits the FIAT in the eye, that's Amore.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 20:33:00", 
        "title": "FIAT???", 
        "userID": "Devil_Doggie"
    }, 
    {
        "content": "My parents owned two Fiat 128 (sedan & station wagon). Both were lemons. If Fiats were such good cars why did they stop selling them in 1982?", 
        "intTime": 20090331, 
        "postID": 23, 
        "quote": "", 
        "reply": "My parents owned two Fiat 128 (sedan & station wagon). Both were lemons. If Fiats were such good cars why did they stop selling them in 1982?", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 20:58:00", 
        "title": "FIAT???", 
        "userID": "RBruce"
    }, 
    {
        "content": "because of protectionist trade practices..most of the \"fiats are a piece of crap\" type comments probably come from a time when fiat was in trouble itself. fiat makes a really good 3 cylinder turbo diesel that gets 40 mpg, i have a army buddy still in germany that drives one. fiat is not a bad car. like it was said fiat or bankrupcy. i think they ought to let all safe makes of vehicles into the u.s. no matter where or who makes them..then you will have real competition and the u.s. makers will have to get their heads out of their arses.", 
        "intTime": 20090401, 
        "postID": 24, 
        "quote": "", 
        "reply": "because of protectionist trade practices..most of the \"fiats are a piece of crap\" type comments probably come from a time when fiat was in trouble itself. fiat makes a really good 3 cylinder turbo diesel that gets 40 mpg, i have a army buddy still in germany that drives one. fiat is not a bad car. like it was said fiat or bankrupcy. i think they ought to let all safe makes of vehicles into the u.s. no matter where or who makes them..then you will have real competition and the u.s. makers will have to get their heads out of their arses.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-04-01 01:30:00", 
        "title": "FIAT???", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS??", 
        "intTime": 20090331, 
        "postID": 25, 
        "quote": "", 
        "reply": "Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 05:57:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "intTime": 20090331, 
        "postID": 26, 
        "quote": "", 
        "reply": "When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 06:07:00", 
        "title": "FIAT???", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****! SEZ WHO", 
        "intTime": 20090331, 
        "postID": 27, 
        "quote": "Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "reply": " SEZ WHO", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:04:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Fix It Again Tony...", 
        "intTime": 20090331, 
        "postID": 28, 
        "quote": "", 
        "reply": "Fix It Again Tony...", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:18:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again. yea blame the democrats ...", 
        "intTime": 20090331, 
        "postID": 29, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again.", 
        "reply": " yea blame the democrats ...", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:18:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Chrysler is different than Ford or GM in that it is privately held. (You can't buy Chrysler stock). The merger with Daimler didn't work, and they messed up by dropping Plymouth as an entry level brand. They are in need of small fuel efficient cars, something they are really lacking. Fiat needs a dealer network in order to be more than a novelty in the US. It looks like Fiat will aquire 55% of Chrysler in exchange for retooling Chrysler plants to build Fiat cars.", 
        "intTime": 20090331, 
        "postID": 30, 
        "quote": "", 
        "reply": "Chrysler is different than Ford or GM in that it is privately held. (You can't buy Chrysler stock). The merger with Daimler didn't work, and they messed up by dropping Plymouth as an entry level brand. They are in need of small fuel efficient cars, something they are really lacking. Fiat needs a dealer network in order to be more than a novelty in the US. It looks like Fiat will aquire 55% of Chrysler in exchange for retooling Chrysler plants to build Fiat cars.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:26:00", 
        "title": "FIAT???", 
        "userID": "nspreitler"
    }, 
    {
        "content": "i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design...", 
        "intTime": 20090331, 
        "postID": 31, 
        "quote": "", 
        "reply": "i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design...", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 07:39:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design... I have a 02 Neon 150,000, runs like a champ and hasn't cost me much outside of routine...except a tie rod... <Frantically knocking on wood> \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090331, 
        "postID": 32, 
        "quote": "Originally posted by outlaws93: i just junked my dodge i got it brand new in 1993 and it hasnt ran in 3 years before i canned it... the problems that car had i could list that would take up this forum..... no but there were a ton of problems that car had that was factory defective that it really peed me off.... for one the car was mixed metric and stranded.. that was just the first then the defective alternator belt assembly and flywheels.. its whole configuration was flawed and the belt when wet would fly off..... and what kept it dry was the plastic casing and it was just flawed design...", 
        "reply": " I have a 02 Neon 150,000, runs like a champ and hasn't cost me much outside of routine...except a tie rod... <Frantically knocking on wood> \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 10:03:00", 
        "title": "FIAT???", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again. getting somewhat tired of YOU putting words in my mouth show me where i blamed obama for this??", 
        "intTime": 20090331, 
        "postID": 33, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? WHO'S IDEA IS THIS?? They have floated this idea for some time now (at least since Aug 08), so if you are going to blame Obama, think again.", 
        "reply": " getting somewhat tired of YOU putting words in my mouth show me where i blamed obama for this??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 10:25:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy.", 
        "intTime": 20090331, 
        "postID": 34, 
        "quote": "Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT???", 
        "reply": " Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 10:44:00", 
        "title": "FIAT???", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks. i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks", 
        "intTime": 20090331, 
        "postID": 35, 
        "quote": "Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks.", 
        "reply": " i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 11:59:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy. i looked at fiats, where do you sit? how do you get in and out if over 6'4??", 
        "intTime": 20090331, 
        "postID": 36, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Ira1945: Why would the fate of a US Auto maker be dependent on FIAT??? Because that's the only company left willing to aquire them. quote: WHO'S IDEA IS THIS?? It's been kicked around before. Only thing is now the options are Fiat or Bankruptcy.", 
        "reply": " i looked at fiats, where do you sit? how do you get in and out if over 6'4??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:00:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: quote: Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks. i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks You asked a question, I answered. That is how it works. not quite, and the bull **** snide comments, but you are a moderator, do as i say not as i do right", 
        "intTime": 20090331, 
        "postID": 37, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: quote: Originally posted by dmuhler: Well about 99.99% of your threads are about blame. Blame of the current administration as a matter of fact. So if I got this one wrong, my bad....but it was a good bet. So who are you blaming this one on? Oh and I answered your question and not even a thanks. i asked a question, and why are you so zeroed in on my ass, other intentions? if so forget it enough of the snide remarks You asked a question, I answered. That is how it works.", 
        "reply": " not quite, and the bull **** snide comments, but you are a moderator, do as i say not as i do right", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:20:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: but you are a moderator I am??? i thought you were, since i am wrong i apologize but was misinformed or was just wrong", 
        "intTime": 20090331, 
        "postID": 38, 
        "quote": "Originally posted by dmuhler: quote: but you are a moderator I am???", 
        "reply": " i thought you were, since i am wrong i apologize but was misinformed or was just wrong", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:45:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "One way to create more mechanic jobs, all the breakdowns? \"DEATH ON CALL\"", 
        "intTime": 20090331, 
        "postID": 39, 
        "quote": "", 
        "reply": "One way to create more mechanic jobs, all the breakdowns? \"DEATH ON CALL\"", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 12:54:00", 
        "title": "FIAT???", 
        "userID": "Combatmix"
    }, 
    {
        "content": "This message has been edited. Last edited by: Knele, Tue 31 March 2009 01:39 PM", 
        "intTime": 20090331, 
        "postID": 40, 
        "quote": "", 
        "reply": "This message has been edited. Last edited by: Knele, Tue 31 March 2009 01:39 PM", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:14:00", 
        "title": "FIAT???", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot??", 
        "intTime": 20090331, 
        "postID": 41, 
        "quote": "Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns?", 
        "reply": " do they break down a lot??", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:29:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge", 
        "intTime": 20090331, 
        "postID": 42, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot??", 
        "reply": " Not as much as a Dodge", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:32:00", 
        "title": "FIAT???", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****! So are GM and Ford - well Vauxhall/Opel and Ford Europe anyway, it's the US operations of the Detroit dinosaurs that have lost the plot.", 
        "intTime": 20090331, 
        "postID": 43, 
        "quote": "Originally posted by Knele: When it comes to compact, fuel efficient, sleek looking vehicles…..FIAT is THE ****!", 
        "reply": " So are GM and Ford - well Vauxhall/Opel and Ford Europe anyway, it's the US operations of the Detroit dinosaurs that have lost the plot.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 13:49:00", 
        "title": "FIAT???", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell", 
        "intTime": 20090331, 
        "postID": 44, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge", 
        "reply": " must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 15:18:00", 
        "title": "FIAT???", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell my dodge was a monster... i took that thing about a mile out in the woods of the oclia national forest before and use to live in it...it was real sad to see it go to the junkers..it was a dodge shadow es 1994.. but i got it in 1993,.....", 
        "intTime": 20090331, 
        "postID": 45, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by PhoenixDark: quote: Originally posted by Ira1945: quote: Originally posted by Combatmix: One way to create more mechanic jobs, all the breakdowns? do they break down a lot?? Not as much as a Dodge must have been lucky then.. had a 2000 pick up that got killed when a woman pulled out in front of me and i t boned her at 45mph.. bye bye dodge, almost bye bye me she was on her cell", 
        "reply": " my dodge was a monster... i took that thing about a mile out in the woods of the oclia national forest before and use to live in it...it was real sad to see it go to the junkers..it was a dodge shadow es 1994.. but i got it in 1993,.....", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 20:21:00", 
        "title": "FIAT???", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Chrysler, Fix It Again Tony. Walter Chrysler is turning over in his grave. When the Chrysler hits the FIAT in the eye, that's Amore.", 
        "intTime": 20090331, 
        "postID": 46, 
        "quote": "", 
        "reply": "Chrysler, Fix It Again Tony. Walter Chrysler is turning over in his grave. When the Chrysler hits the FIAT in the eye, that's Amore.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 20:33:00", 
        "title": "FIAT???", 
        "userID": "Devil_Doggie"
    }, 
    {
        "content": "My parents owned two Fiat 128 (sedan & station wagon). Both were lemons. If Fiats were such good cars why did they stop selling them in 1982?", 
        "intTime": 20090331, 
        "postID": 47, 
        "quote": "", 
        "reply": "My parents owned two Fiat 128 (sedan & station wagon). Both were lemons. If Fiats were such good cars why did they stop selling them in 1982?", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-03-31 20:58:00", 
        "title": "FIAT???", 
        "userID": "RBruce"
    }, 
    {
        "content": "because of protectionist trade practices..most of the \"fiats are a piece of crap\" type comments probably come from a time when fiat was in trouble itself. fiat makes a really good 3 cylinder turbo diesel that gets 40 mpg, i have a army buddy still in germany that drives one. fiat is not a bad car. like it was said fiat or bankrupcy. i think they ought to let all safe makes of vehicles into the u.s. no matter where or who makes them..then you will have real competition and the u.s. makers will have to get their heads out of their arses.", 
        "intTime": 20090401, 
        "postID": 48, 
        "quote": "", 
        "reply": "because of protectionist trade practices..most of the \"fiats are a piece of crap\" type comments probably come from a time when fiat was in trouble itself. fiat makes a really good 3 cylinder turbo diesel that gets 40 mpg, i have a army buddy still in germany that drives one. fiat is not a bad car. like it was said fiat or bankrupcy. i think they ought to let all safe makes of vehicles into the u.s. no matter where or who makes them..then you will have real competition and the u.s. makers will have to get their heads out of their arses.", 
        "threadID": "409192893_4860024912001", 
        "time": "2009-04-01 01:30:00", 
        "title": "FIAT???", 
        "userID": "backtoiraq"
    }
]