[
    {
        "content": "Typical of the democratic party - Deceitful - Manipulative - Hypocrisy – are all normal parts of their politics – ya know all politicians are liars so – why not LIE to everyone’s face – while secretly scheming in the background where the public is NOT permitted to see…! oops! If the democrats were so DELIBERATELY DECEITFUL about this hot-topic, just imagine what else they’ve blatantly LIED about…? Pelosi and OTHERS would have allowed those men & women to be PROSECUTED if these “memos” were not made public… What can our military leaders do about schemes like this…? This is collusion – deliberate – calculating – and even at the expense of our own soldiers…? Here are just a few reminders of the comments from this liars and manipulators… What can the American people believe of this leadership – “the war is over, WE LOST,” calling our Gen – General BETRAYUS… yep, Harry Reid, Pelosi, even Clinton, made arrogantly despicable remarks of the Gen. The people are pathetic! Top Pelosi Aide Learned Of Waterboarding in 2003 By Paul Kane Washington Post Staff Writer Saturday, May 9, 2009 A top aide to House Speaker Nancy Pelosi attended a CIA briefing in early 2003 in which it was made clear that waterboarding and other harsh techniques were being used in the interrogation of an alleged al-Qaeda operative, according to documents the CIA released to Congress on Thursday. Pelosi has insisted that she was not directly briefed by Bush administration officials that the practice was being actively employed. But Michael Sheehy, a top Pelosi aide, was present for a classified briefing that included Rep. Jane Harman (D-Calif.), then the ranking minority member of the House intelligence committee, at which agency officials discussed the use of waterboarding on terrorism suspect Abu Zubaida. A Democratic source acknowledged yesterday that it is almost certain that Pelosi would have learned about the use of waterboarding from Sheehy. Pelosi herself acknowledged in a December 2007 statement that she was aware that Harman had learned of the waterboarding and had objected in a letter to the CIA's top counsel. US appears guilty of torture: Pelosi - AFP , October, 2007 WASHINGTON (AFP) — The United States appears to be illegally torturing terror suspects contrary to denials by President George W. Bush, House of Representatives Speaker Nancy Pelosi said Sunday. The country's highest ranking Democrat also said that she still hoped to get most US troops out of Iraq by the end of 2008, despite the party's repeated failure to win over enough Republicans in Congress to an exit strategy. Interviewed on Fox News Sunday, Pelosi said reported interrogation tactics such as simulated drowning, head slapping and exposure to extreme temperatures all amounted to banned torture. \"There is a legal definition of torture that I believe this would fit. The president says it is not,\" she said. But the House speaker said she had received only limited briefings from the Bush administration on its interrogation tactics, and had not seen a controversial memo issued in 2005 by the Justice... ---end snip--- ---snip--- After DNC chairman Howard Dean says \"The idea that we're going to win this war is an idea that unfortunately is just plain wrong,\" ---end snip--- ---snip--- Sept 2006 – “…After Democratic House minority leader Nancy Pelosi said the capture of Osama bin Laden would not make the US any safer…” ---end snip--- She and her democrat buds are bold faced LIARS – KNOWINGLY – DELIBERATELY – misleading the American people – SHE KNEW about the torture – CONDONED the torture – THEN would have allowed those men & women who were directed to use enhanced techniques to be PROSECUTED FOR IT! NOW consider the other LIARS that stood on the Senate FLOOR – deliberately ANNOUNCING to the ENEMY – calculatingly making SURE the pictures and the arrogant LIES were REPEATEDLY proclaimed from the senate floor Remember these…. ---snip--- Ted Kennedy's anti-American slander By Jeff Jacoby, Globe Columnist | May 25, 2004 TWO WEEKS ago Senator Ted Kennedy uttered what may turn out to be the single most disgusting remark made about the United States in the course of the Iraq War. The reaction to his slander - or rather, the lack of reaction - speaks volumes about the moral bankruptcy of the American left. Speaking in the Senate on May 10, Kennedy had this to say about the Abu Ghraib prison scandal: ''On March 19, 2004, President Bush asked, 'Who would prefer that Saddam's torture chambers still be open?' Shamefully, we now learn that Saddam's torture chambers reopened under new management - US management.'' …This was not a blurted, off-the-cuff comment - Kennedy was reading from a prepared text. It was not a shocked first reaction to the abuses at Abu Ghraib - the story had broken more than a week earlier. Incredibly, the senior senator from Massachusetts really was equating the disgraceful mistreatment of a few Iraqi prisoners by a few American troops with the unspeakable sadism, rape, and mass murder that had been routine under Saddam Hussein. ……………..here is another snip from this same article regarding Kennedy’s despicable statements…. “…But even for Kennedy, it crosses a line to claim that US forces in Iraq are no better than the monster they toppled. It suggests that his partisan hunger to defeat President Bush is so great that he would rather see America fail in Iraq than let Bush reap the benefit of success. Which is why the silence of the liberal establishment in the face of Kennedy's terrible falsehood is so ominous...\" ---end snip--- Good ole Ted Kennedy …but this wasn’t the hangover self-induced rant – Kennedy – Pelosi – Reid – Schumer – Durbin – etc… they ALL contributed to the LIES not only about our President (Bush) but even our soldiers…. ---snip --- below comments were for a FUND raiser mail-o-gram wanting 50-75 bucks… Ted Kennedy: Bush 'Poisoned' Americans Tuesday, Sept. 6, 2005 1:03 p.m. EDT Sen. Ted Kennedy has sent out a shrill fundraising letter accusing Republicans of posing an \"imminent danger to the nation.” He even accuses President Bush, along with Dick Cheney and Karl Rove, of \"poisoning” the water and air. The letter, which seeks contributions for the Democratic Senatorial Campaign Committee, begins: \"The reckless abuse of power by George Bush and his right-wing allies is an imminent danger to the nation and must be stopped.” ---end snip--- Here’s Another one Ted Kennedy - Today marks the one year anniversary of the scandal at Abu Ghraib prison. Senator Kennedy made a statement commemorating this sad part of our history, and questioned the Administration’s lack of accountability. You can read the Senator’s full statement below. STATEMENT BY SENATOR EDWARD M. KENNEDY ON ANNIVERSARY OF ABU GHRAIB SCANDAL The sad anniversary of the Abu Ghraib torture scandal is now upon us. It’s an appropriate time to reflect on how well we’ve responded as a nation. ---snip ---- Kennedy’s RANT was just to REMIND the WORLD of how evil the USA is - ...continues below…. \"…The images of cruelty, and perversion are still difficult to look at a year later. An Iraqi prisoner in a dark hood and cape, standing on a cardboard box with electrodes attached to his body. Naked men forced to simulate sex acts on each other. The corpse of a man who had been beaten to death, lying in ice, next to soldiers smiling and giving a “thumbs up” sign. A pool of blood from the wounds of a naked, defenseless prisoner attacked by a military dog.\" \"These images are seared into our collective memory. The reports of widespread abuse by U.S. personnel were initially met with disbelief, then incomprehension. They stand in sharp contrast to the values America has always stood for our belief in the dignity and worth of all people our unequivocal stance against torture and abuse—our commitment to the rule of law. The images horrified us and severely damaged our reputation in the Middle East and around the world.\" Kennedy continued... \"…Where are we a year later? Has this problem been resolved? Has the moral authority of the U.S. been restored? Have we recovered from what is perhaps the steepest and deepest fall from grace in our history?\" \"Sadly, the answer is no, because at every opportunity, the Administration has tried to minimize the problem and avoid responsibility for it. The tone was set at the very start. Senior-level military commanders knew about the problems much earlier. They knew about Abu Ghraib photos as early as January 2004. General Taguba submitted his scathing report on February 26th. Yet rather than deal with the problem honestly, Pentagon officials persuaded CBS News to delay its report while they developed a damage-control plan...\" ---end snip--- NOTE - the pictures were SHOWN again, which al-Jazeer certainly appreciated... Yep, Kennedy didn’t hesitate to constantly remind the enemy and was actually making the rounds across all networks making sure the WORLD knew how EVIL the US is and how badly our SOLDIERS were conducting themselves… And at EVERY opportunity Kennedy’s cheerleading team was right there behind him – Kerry, Reid, Pelosi, Schumer, Durbin, Murtha, etc, etc. Here are a few… July 2005: Senator Dick Durbin states that a description of US interrogation procedures at the Guantanamo Bay detention facility sounds like something \"done by Nazis, Soviets in their gulags, or some mad regime -- Pol Pot or others.\" Presidential adviser Karl Rove responds by suggesting that Durbin and other liberals seek to put US troops in danger, saying that \"Al Jazeera now broadcasts the words of Senator Durbin to the Mideast, certainly putting our troops in greater danger. No more needs to be said about the motives of liberals.\" March 2006: Senator Russ Feingold introduces a motion to censure President Bush. In response, Republicans suggest that he is harming national security and endangering US troops. RNC chairman Ken Mehlman says that \"Democrat leaders never miss an opportunity to put politics before our nation's security\" and that they would \"would rather censure the President for doing his job than actually fight the War on Terror,\" refers to \"repeated Democrat attempts to weaken these efforts to fight the terrorists and keep American families safe,\" and states that \"Democrats should to be focused on winning the War on Terror, not undermining it with political axe-grinding of the ugliest kind.\" Senator John Cornyn adds that the resolution would \"make the jobs of our soldiers and diplomats harder and place them at greater risk.\" -----end snip---- What else have they LIED about regarding the wars – our President – terrorism…? What else have deliberately manipulated and skewed to WIN THE WHITE HOUSE…? What else have these arrogant selfish LIARS compromised that may COST American lives…? This message has been edited. Last edited by: GlassOnion, Sun 10 May 2009 02:51 PM", 
        "intTime": 20090510, 
        "postID": 1, 
        "quote": "", 
        "reply": "Typical of the democratic party - Deceitful - Manipulative - Hypocrisy – are all normal parts of their politics – ya know all politicians are liars so – why not LIE to everyone’s face – while secretly scheming in the background where the public is NOT permitted to see…! oops! If the democrats were so DELIBERATELY DECEITFUL about this hot-topic, just imagine what else they’ve blatantly LIED about…? Pelosi and OTHERS would have allowed those men & women to be PROSECUTED if these “memos” were not made public… What can our military leaders do about schemes like this…? This is collusion – deliberate – calculating – and even at the expense of our own soldiers…? Here are just a few reminders of the comments from this liars and manipulators… What can the American people believe of this leadership – “the war is over, WE LOST,” calling our Gen – General BETRAYUS… yep, Harry Reid, Pelosi, even Clinton, made arrogantly despicable remarks of the Gen. The people are pathetic! Top Pelosi Aide Learned Of Waterboarding in 2003 By Paul Kane Washington Post Staff Writer Saturday, May 9, 2009 A top aide to House Speaker Nancy Pelosi attended a CIA briefing in early 2003 in which it was made clear that waterboarding and other harsh techniques were being used in the interrogation of an alleged al-Qaeda operative, according to documents the CIA released to Congress on Thursday. Pelosi has insisted that she was not directly briefed by Bush administration officials that the practice was being actively employed. But Michael Sheehy, a top Pelosi aide, was present for a classified briefing that included Rep. Jane Harman (D-Calif.), then the ranking minority member of the House intelligence committee, at which agency officials discussed the use of waterboarding on terrorism suspect Abu Zubaida. A Democratic source acknowledged yesterday that it is almost certain that Pelosi would have learned about the use of waterboarding from Sheehy. Pelosi herself acknowledged in a December 2007 statement that she was aware that Harman had learned of the waterboarding and had objected in a letter to the CIA's top counsel. US appears guilty of torture: Pelosi - AFP , October, 2007 WASHINGTON (AFP) — The United States appears to be illegally torturing terror suspects contrary to denials by President George W. Bush, House of Representatives Speaker Nancy Pelosi said Sunday. The country's highest ranking Democrat also said that she still hoped to get most US troops out of Iraq by the end of 2008, despite the party's repeated failure to win over enough Republicans in Congress to an exit strategy. Interviewed on Fox News Sunday, Pelosi said reported interrogation tactics such as simulated drowning, head slapping and exposure to extreme temperatures all amounted to banned torture. \"There is a legal definition of torture that I believe this would fit. The president says it is not,\" she said. But the House speaker said she had received only limited briefings from the Bush administration on its interrogation tactics, and had not seen a controversial memo issued in 2005 by the Justice... ---end snip--- ---snip--- After DNC chairman Howard Dean says \"The idea that we're going to win this war is an idea that unfortunately is just plain wrong,\" ---end snip--- ---snip--- Sept 2006 – “…After Democratic House minority leader Nancy Pelosi said the capture of Osama bin Laden would not make the US any safer…” ---end snip--- She and her democrat buds are bold faced LIARS – KNOWINGLY – DELIBERATELY – misleading the American people – SHE KNEW about the torture – CONDONED the torture – THEN would have allowed those men & women who were directed to use enhanced techniques to be PROSECUTED FOR IT! NOW consider the other LIARS that stood on the Senate FLOOR – deliberately ANNOUNCING to the ENEMY – calculatingly making SURE the pictures and the arrogant LIES were REPEATEDLY proclaimed from the senate floor Remember these…. ---snip--- Ted Kennedy's anti-American slander By Jeff Jacoby, Globe Columnist | May 25, 2004 TWO WEEKS ago Senator Ted Kennedy uttered what may turn out to be the single most disgusting remark made about the United States in the course of the Iraq War. The reaction to his slander - or rather, the lack of reaction - speaks volumes about the moral bankruptcy of the American left. Speaking in the Senate on May 10, Kennedy had this to say about the Abu Ghraib prison scandal: ''On March 19, 2004, President Bush asked, 'Who would prefer that Saddam's torture chambers still be open?' Shamefully, we now learn that Saddam's torture chambers reopened under new management - US management.'' …This was not a blurted, off-the-cuff comment - Kennedy was reading from a prepared text. It was not a shocked first reaction to the abuses at Abu Ghraib - the story had broken more than a week earlier. Incredibly, the senior senator from Massachusetts really was equating the disgraceful mistreatment of a few Iraqi prisoners by a few American troops with the unspeakable sadism, rape, and mass murder that had been routine under Saddam Hussein. ……………..here is another snip from this same article regarding Kennedy’s despicable statements…. “…But even for Kennedy, it crosses a line to claim that US forces in Iraq are no better than the monster they toppled. It suggests that his partisan hunger to defeat President Bush is so great that he would rather see America fail in Iraq than let Bush reap the benefit of success. Which is why the silence of the liberal establishment in the face of Kennedy's terrible falsehood is so ominous...\" ---end snip--- Good ole Ted Kennedy …but this wasn’t the hangover self-induced rant – Kennedy – Pelosi – Reid – Schumer – Durbin – etc… they ALL contributed to the LIES not only about our President (Bush) but even our soldiers…. ---snip --- below comments were for a FUND raiser mail-o-gram wanting 50-75 bucks… Ted Kennedy: Bush 'Poisoned' Americans Tuesday, Sept. 6, 2005 1:03 p.m. EDT Sen. Ted Kennedy has sent out a shrill fundraising letter accusing Republicans of posing an \"imminent danger to the nation.” He even accuses President Bush, along with Dick Cheney and Karl Rove, of \"poisoning” the water and air. The letter, which seeks contributions for the Democratic Senatorial Campaign Committee, begins: \"The reckless abuse of power by George Bush and his right-wing allies is an imminent danger to the nation and must be stopped.” ---end snip--- Here’s Another one Ted Kennedy - Today marks the one year anniversary of the scandal at Abu Ghraib prison. Senator Kennedy made a statement commemorating this sad part of our history, and questioned the Administration’s lack of accountability. You can read the Senator’s full statement below. STATEMENT BY SENATOR EDWARD M. KENNEDY ON ANNIVERSARY OF ABU GHRAIB SCANDAL The sad anniversary of the Abu Ghraib torture scandal is now upon us. It’s an appropriate time to reflect on how well we’ve responded as a nation. ---snip ---- Kennedy’s RANT was just to REMIND the WORLD of how evil the USA is - ...continues below…. \"…The images of cruelty, and perversion are still difficult to look at a year later. An Iraqi prisoner in a dark hood and cape, standing on a cardboard box with electrodes attached to his body. Naked men forced to simulate sex acts on each other. The corpse of a man who had been beaten to death, lying in ice, next to soldiers smiling and giving a “thumbs up” sign. A pool of blood from the wounds of a naked, defenseless prisoner attacked by a military dog.\" \"These images are seared into our collective memory. The reports of widespread abuse by U.S. personnel were initially met with disbelief, then incomprehension. They stand in sharp contrast to the values America has always stood for our belief in the dignity and worth of all people our unequivocal stance against torture and abuse—our commitment to the rule of law. The images horrified us and severely damaged our reputation in the Middle East and around the world.\" Kennedy continued... \"…Where are we a year later? Has this problem been resolved? Has the moral authority of the U.S. been restored? Have we recovered from what is perhaps the steepest and deepest fall from grace in our history?\" \"Sadly, the answer is no, because at every opportunity, the Administration has tried to minimize the problem and avoid responsibility for it. The tone was set at the very start. Senior-level military commanders knew about the problems much earlier. They knew about Abu Ghraib photos as early as January 2004. General Taguba submitted his scathing report on February 26th. Yet rather than deal with the problem honestly, Pentagon officials persuaded CBS News to delay its report while they developed a damage-control plan...\" ---end snip--- NOTE - the pictures were SHOWN again, which al-Jazeer certainly appreciated... Yep, Kennedy didn’t hesitate to constantly remind the enemy and was actually making the rounds across all networks making sure the WORLD knew how EVIL the US is and how badly our SOLDIERS were conducting themselves… And at EVERY opportunity Kennedy’s cheerleading team was right there behind him – Kerry, Reid, Pelosi, Schumer, Durbin, Murtha, etc, etc. Here are a few… July 2005: Senator Dick Durbin states that a description of US interrogation procedures at the Guantanamo Bay detention facility sounds like something \"done by Nazis, Soviets in their gulags, or some mad regime -- Pol Pot or others.\" Presidential adviser Karl Rove responds by suggesting that Durbin and other liberals seek to put US troops in danger, saying that \"Al Jazeera now broadcasts the words of Senator Durbin to the Mideast, certainly putting our troops in greater danger. No more needs to be said about the motives of liberals.\" March 2006: Senator Russ Feingold introduces a motion to censure President Bush. In response, Republicans suggest that he is harming national security and endangering US troops. RNC chairman Ken Mehlman says that \"Democrat leaders never miss an opportunity to put politics before our nation's security\" and that they would \"would rather censure the President for doing his job than actually fight the War on Terror,\" refers to \"repeated Democrat attempts to weaken these efforts to fight the terrorists and keep American families safe,\" and states that \"Democrats should to be focused on winning the War on Terror, not undermining it with political axe-grinding of the ugliest kind.\" Senator John Cornyn adds that the resolution would \"make the jobs of our soldiers and diplomats harder and place them at greater risk.\" -----end snip---- What else have they LIED about regarding the wars – our President – terrorism…? What else have deliberately manipulated and skewed to WIN THE WHITE HOUSE…? What else have these arrogant selfish LIARS compromised that may COST American lives…? This message has been edited. Last edited by: GlassOnion, Sun 10 May 2009 02:51 PM", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 10:37:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Notice the left rushing to defend... cricket... echo ... Ferris?", 
        "intTime": 20090510, 
        "postID": 2, 
        "quote": "", 
        "reply": "Notice the left rushing to defend... cricket... echo ... Ferris?", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 12:53:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Notice the left rushing to defend... cricket... echo ... Ferris? Sad, isn't it - Harry Reid, Pelosi, and the whole bunch - blatant LIARS! They spit in the face of our military leaders - slander our President - slander our soldiers - use Lady Liberty as a sex-slave to the highest campaign donor - total disregard for America and her citizens!!! This nation was birthed from a conviction founded upon independence! That independence was not to escape British taxes or break away from the Brits just so they could create “another” country. It certainly was NOT just so they could create another overbearing monolithic government or an opportunity to establish mini-monarchies and kings. The liberals and progressive socialists are attempting to inculcate us with their perverted form of simulated-quasi-democracy and convince the American people that our wonderful unique form of government (soon to be dictatorship) is what grants us the “right” to enjoy our individual independence i.e. freedom. THAT IS BASS-AKWARDS and a perversion of the truth. The fact of the matter is – this GOVERNMENT is given its power and borrows its independence BY THE (governed) PEOPLE. That is what makes our country so unique – and GREAT! This was their fundamental conviction. That conviction is evidenced by their compulsion to ultimately deliver the Declaration of Independence. Therefore they wrote: ”…We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness. That to secure these rights, governments are instituted among men, deriving their just powers from the consent of the governed. The government is to reflect the will of the people from where it borrows its authority to govern. Further, the founders reaffirm this conviction when they wrote in that same document: “…But when a long train of abuses and usurpations, pursuing invariably the same object evinces a design to reduce them under absolute despotism, it is their right, it is their duty, to throw off such government, and to provide new guards for their future security…” The liberals & progressive socialists – called democrats – want us to believe that our rights – our independence – our freedom – is BORROWED from the government – consequently can also be taken away! This is the fundamental rationale for their persistence to BRIBE the people with entitlements, which ultimately destroys our “individual” independence and forces us to become “dependent” upon THEM. The more the gov controls – the more the people depend upon it. This is a PERVERSION of AMERICA and the fundamental convictions & beliefs for her original birth! Liberalism – Progressive Democrats with their audacious silent socialism is unquestionably UNAMERICAN! In fact, it is ANTI-AMERICAN… Am I wrong? ...let the flames begin...", 
        "intTime": 20090510, 
        "postID": 3, 
        "quote": "Originally posted by threerings: Notice the left rushing to defend... cricket... echo ... Ferris?", 
        "reply": " Sad, isn't it - Harry Reid, Pelosi, and the whole bunch - blatant LIARS! They spit in the face of our military leaders - slander our President - slander our soldiers - use Lady Liberty as a sex-slave to the highest campaign donor - total disregard for America and her citizens!!! This nation was birthed from a conviction founded upon independence! That independence was not to escape British taxes or break away from the Brits just so they could create “another” country. It certainly was NOT just so they could create another overbearing monolithic government or an opportunity to establish mini-monarchies and kings. The liberals and progressive socialists are attempting to inculcate us with their perverted form of simulated-quasi-democracy and convince the American people that our wonderful unique form of government (soon to be dictatorship) is what grants us the “right” to enjoy our individual independence i.e. freedom. THAT IS BASS-AKWARDS and a perversion of the truth. The fact of the matter is – this GOVERNMENT is given its power and borrows its independence BY THE (governed) PEOPLE. That is what makes our country so unique – and GREAT! This was their fundamental conviction. That conviction is evidenced by their compulsion to ultimately deliver the Declaration of Independence. Therefore they wrote: ”…We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness. That to secure these rights, governments are instituted among men, deriving their just powers from the consent of the governed. The government is to reflect the will of the people from where it borrows its authority to govern. Further, the founders reaffirm this conviction when they wrote in that same document: “…But when a long train of abuses and usurpations, pursuing invariably the same object evinces a design to reduce them under absolute despotism, it is their right, it is their duty, to throw off such government, and to provide new guards for their future security…” The liberals & progressive socialists – called democrats – want us to believe that our rights – our independence – our freedom – is BORROWED from the government – consequently can also be taken away! This is the fundamental rationale for their persistence to BRIBE the people with entitlements, which ultimately destroys our “individual” independence and forces us to become “dependent” upon THEM. The more the gov controls – the more the people depend upon it. This is a PERVERSION of AMERICA and the fundamental convictions & beliefs for her original birth! Liberalism – Progressive Democrats with their audacious silent socialism is unquestionably UNAMERICAN! In fact, it is ANTI-AMERICAN… Am I wrong? ...let the flames begin...", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 14:21:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "And this is news to whom???? Only the fawning MSM and the simpering sycophants on this forum haven't been willing to admit, right from the start, that Pelosi was lying through her bowtox frozen face.", 
        "intTime": 20090510, 
        "postID": 4, 
        "quote": "", 
        "reply": "And this is news to whom???? Only the fawning MSM and the simpering sycophants on this forum haven't been willing to admit, right from the start, that Pelosi was lying through her bowtox frozen face.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 14:35:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "They ALL lie. If they didn't then they might actually be accountable for something. And, what is the trend on politician accountability?", 
        "intTime": 20090510, 
        "postID": 5, 
        "quote": "", 
        "reply": "They ALL lie. If they didn't then they might actually be accountable for something. And, what is the trend on politician accountability?", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 15:10:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Proving that the Speaker is a liar is akin to \"proving\" that water is wet.", 
        "intTime": 20090510, 
        "postID": 6, 
        "quote": "", 
        "reply": "Proving that the Speaker is a liar is akin to \"proving\" that water is wet.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 18:44:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "If Pelosi lied, I assure you it's Bush's fault. No one from the left will admit she lied, they'll come out and say blah, blah, blah George Bush this, Dick Cheney that and on and on and on and on.", 
        "intTime": 20090510, 
        "postID": 7, 
        "quote": "", 
        "reply": "If Pelosi lied, I assure you it's Bush's fault. No one from the left will admit she lied, they'll come out and say blah, blah, blah George Bush this, Dick Cheney that and on and on and on and on.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 20:04:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Strange isn’t it – it doesn’t surprise anyone that Pelosi is not only lying but making accusations and would have used her authority to prosecute others for the very same thing she was doing. Her position allowed her to stop the enhanced procedures. Typical of liberal ethics – make someone else do their dirty work – relish in the fruits of their efforts – then stab them in the back and leave them hang for doing it. I hope our military feels violated somewhat because she would have prosecuted anyone to string Bush & Cheney up – even when she was doing the same thing… I guess that explains volumes why she didn’t expel William Jefferson for his 90k cold-cash bribery money. Odd – it doesn’t seem to matter that they have probably destroyed lives & families all for their job-security. So, where might this little line fit – Declaration of Independence… “…That whenever any form of government becomes destructive to these ends, it is the right of the people to alter or to abolish it, and to institute new government..” or does it really matter any more…? What does it say about a society so apathetic it is willing to accept such hypocritical disgrace – and worse – simply ignore it because they ALL DO IT…? If they are so arrogantly devious to blindly prostitute this country’s security, what have they done we have yet to learn about…?", 
        "intTime": 20090510, 
        "postID": 8, 
        "quote": "", 
        "reply": "Strange isn’t it – it doesn’t surprise anyone that Pelosi is not only lying but making accusations and would have used her authority to prosecute others for the very same thing she was doing. Her position allowed her to stop the enhanced procedures. Typical of liberal ethics – make someone else do their dirty work – relish in the fruits of their efforts – then stab them in the back and leave them hang for doing it. I hope our military feels violated somewhat because she would have prosecuted anyone to string Bush & Cheney up – even when she was doing the same thing… I guess that explains volumes why she didn’t expel William Jefferson for his 90k cold-cash bribery money. Odd – it doesn’t seem to matter that they have probably destroyed lives & families all for their job-security. So, where might this little line fit – Declaration of Independence… “…That whenever any form of government becomes destructive to these ends, it is the right of the people to alter or to abolish it, and to institute new government..” or does it really matter any more…? What does it say about a society so apathetic it is willing to accept such hypocritical disgrace – and worse – simply ignore it because they ALL DO IT…? If they are so arrogantly devious to blindly prostitute this country’s security, what have they done we have yet to learn about…?", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-10 20:33:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "When your a liberal/democrat it's different.", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "", 
        "reply": "When your a liberal/democrat it's different.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 03:49:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "I hope they leave her in place as Speaker. She certainly does a lot of speaking. . . . but not too well. Were she a man, she'd likely catch more grief and maybe be fired from the job. Her constituents surely deserve her dishonesty.", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "", 
        "reply": "I hope they leave her in place as Speaker. She certainly does a lot of speaking. . . . but not too well. Were she a man, she'd likely catch more grief and maybe be fired from the job. Her constituents surely deserve her dishonesty.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 07:49:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "RRR52"
    }, 
    {
        "content": "Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What?", 
        "intTime": 20090520, 
        "postID": 11, 
        "quote": "", 
        "reply": "Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What?", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 08:56:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What? Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda...", 
        "intTime": 20090520, 
        "postID": 12, 
        "quote": "Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What?", 
        "reply": " Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda...", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 09:55:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Far off the mark friend...the Democratic Party in all its glory and power is still have trouble herding it's cats... That is the motto of the DNC...\"Cat herders wanted\"...you are putting neo-con attibutes on a non-functional organization with confused leadership... try as you might it will not stick to the wall...but it could smell", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "", 
        "reply": "Far off the mark friend...the Democratic Party in all its glory and power is still have trouble herding it's cats... That is the motto of the DNC...\"Cat herders wanted\"...you are putting neo-con attibutes on a non-functional organization with confused leadership... try as you might it will not stick to the wall...but it could smell", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 10:08:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: quote: Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What? Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda... There is plenty wrong with that picture and much more is wrong with Nancy Pelosi than her lying about what she knew about torture. She, nor anyone else, will be able to prosecute anyone for the policy of torture that the Bush Administration carried out. She did not lie under oath, so there is no crime. She has lost power because her credibility is now in question. And the Republican base has something legitimate to b tch about (instead of making things up.) Now what? The Republicans going after Pelosi helps President Obama. She is too divisive and even more liberal than President Obama. She has got in the way of several Obama proposals, or made it more difficult for him to further his agenda. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be.", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Originally posted by GlassOnion: quote: Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What? Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda...", 
        "reply": " There is plenty wrong with that picture and much more is wrong with Nancy Pelosi than her lying about what she knew about torture. She, nor anyone else, will be able to prosecute anyone for the policy of torture that the Bush Administration carried out. She did not lie under oath, so there is no crime. She has lost power because her credibility is now in question. And the Republican base has something legitimate to b tch about (instead of making things up.) Now what? The Republicans going after Pelosi helps President Obama. She is too divisive and even more liberal than President Obama. She has got in the way of several Obama proposals, or made it more difficult for him to further his agenda. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 10:27:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: Typical of the democratic party - Deceitful - Manipulative - Hypocrisy – are all normal parts of their politics – ya know all politicians are liars so – Typical of politicians, regardless of party. Republicans have their fair percentage of BS'ers. That said, Pelosi's glory days are on the glide slope, IMO. Except for her loyal constituents, there aren't many Americans who think she's an asset to her party. Her approval numbers are tanking, and with good reason. She's just looking desperate now. I'm curious to see how low she'll go, and how many lies she will tell, before she is finally given a clue by her fellow democrats, and shuts her mouth. JMHO, but I think with Pelosi as Speaker of the House, the democrats are in danger of \"1994 Redux.\" This message has been edited. Last edited by: 1WW, Wed 20 May 2009 10:51 AM", 
        "intTime": 20090520, 
        "postID": 15, 
        "quote": "Originally posted by GlassOnion: Typical of the democratic party - Deceitful - Manipulative - Hypocrisy – are all normal parts of their politics – ya know all politicians are liars so –", 
        "reply": " Typical of politicians, regardless of party. Republicans have their fair percentage of BS'ers. That said, Pelosi's glory days are on the glide slope, IMO. Except for her loyal constituents, there aren't many Americans who think she's an asset to her party. Her approval numbers are tanking, and with good reason. She's just looking desperate now. I'm curious to see how low she'll go, and how many lies she will tell, before she is finally given a clue by her fellow democrats, and shuts her mouth. JMHO, but I think with Pelosi as Speaker of the House, the democrats are in danger of \"1994 Redux.\" This message has been edited. Last edited by: 1WW, Wed 20 May 2009 10:51 AM", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 10:28:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "1WW"
    }, 
    {
        "content": "Oh my GOD, the speaker of the house lied?!!!!. Never happen, it must be one of Bush's tricks again. Not our speaker of the house, no way. It can't be... What are those people in Ca going to do? They voted for her...Hey maybe, Just maybe, whats her name can beat her in the elections coming up....what was that name again?", 
        "intTime": 20090520, 
        "postID": 16, 
        "quote": "", 
        "reply": "Oh my GOD, the speaker of the house lied?!!!!. Never happen, it must be one of Bush's tricks again. Not our speaker of the house, no way. It can't be... What are those people in Ca going to do? They voted for her...Hey maybe, Just maybe, whats her name can beat her in the elections coming up....what was that name again?", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 10:46:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "dman1948"
    }, 
    {
        "content": "Sheehan", 
        "intTime": 20090520, 
        "postID": 17, 
        "quote": "", 
        "reply": "Sheehan", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 11:07:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by GlassOnion: quote: Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What? Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda... There is plenty wrong with that picture and much more is wrong with Nancy Pelosi than her lying about what she knew about torture. She, nor anyone else, will be able to prosecute anyone for the policy of torture that the Bush Administration carried out. She did not lie under oath, so there is no crime. She has lost power because her credibility is now in question. And the Republican base has something legitimate to b tch about (instead of making things up.) Now what? The Republicans going after Pelosi helps President Obama. She is too divisive and even more liberal than President Obama. She has got in the way of several Obama proposals, or made it more difficult for him to further his agenda. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be. I agree with that - though it's a little scary to think she is third in line for the captain seat... I agree though - politically, they should beat her up - then save all the footage for reruns later when it becomes useful artillery...", 
        "intTime": 20090520, 
        "postID": 18, 
        "quote": "Originally posted by xerello: quote: Originally posted by GlassOnion: quote: Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What? Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda... There is plenty wrong with that picture and much more is wrong with Nancy Pelosi than her lying about what she knew about torture. She, nor anyone else, will be able to prosecute anyone for the policy of torture that the Bush Administration carried out. She did not lie under oath, so there is no crime. She has lost power because her credibility is now in question. And the Republican base has something legitimate to b tch about (instead of making things up.) Now what? The Republicans going after Pelosi helps President Obama. She is too divisive and even more liberal than President Obama. She has got in the way of several Obama proposals, or made it more difficult for him to further his agenda. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be.", 
        "reply": " I agree with that - though it's a little scary to think she is third in line for the captain seat... I agree though - politically, they should beat her up - then save all the footage for reruns later when it becomes useful artillery...", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 11:15:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: quote: Originally posted by xerello: quote: Originally posted by GlassOnion: quote: Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What? Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda... There is plenty wrong with that picture and much more is wrong with Nancy Pelosi than her lying about what she knew about torture. She, nor anyone else, will be able to prosecute anyone for the policy of torture that the Bush Administration carried out. She did not lie under oath, so there is no crime. She has lost power because her credibility is now in question. And the Republican base has something legitimate to b tch about (instead of making things up.) Now what? The Republicans going after Pelosi helps President Obama. She is too divisive and even more liberal than President Obama. She has got in the way of several Obama proposals, or made it more difficult for him to further his agenda. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be. I agree with that - though it's a little scary to think she is third in line for the captain seat... I agree though - politically, they should beat her up - then save all the footage for reruns later when it becomes useful artillery... Scary is that President Obama has an agenda that is as radical as that of FDR - the difference is there is no effective Republican Party to oppose him. Now there are some good ideas in that agenda. Health care must be fixed and it takes a strong leader to get it done. But Republicans should have an effective voice in that policy. The Republicans in the '30s were organized in their opposition to some of the more outrages FDR policies and managed to tone some others down. Today, the Republican Party is too disorganized, too petty and many of the “base” want someone who is like the average Joe the plumber for a leader - someone who is not smart enough to push back on the Obama agenda. Those who say that President Obama is an empty suit are just foolishly repeating what Rush told them. President Obama is very smart and while he may do much good for the country, too much power without opposition is not good. The Pelosi thing is just a distraction – red meat for the Republican Base. Meanwhile, the President has managed to pass fuel standards that would have been unthinkable four years ago. After a while, the Republicans will be chewing on some bones that have been tossed to them and becoming less and less relevant. To the detriment of the country.", 
        "intTime": 20090520, 
        "postID": 19, 
        "quote": "Originally posted by GlassOnion: quote: Originally posted by xerello: quote: Originally posted by GlassOnion: quote: Originally posted by xerello: Not being a liberal or a Democrat, but just saying... OK, Pelosi lied to the press and the American public. Politicians lying is not a crime. Now What? Doesn't it strike you as a little wrong for Pelosi to try and prosecute those she sent to do her dirty work... all the while knowing she and the others agreed - but because it is a top secret meeting - she didn't think anyone would find out... Come-on - what's wrong with that picture... and just think - what else has she deliberately lied about - skewed and twisted for liberal agenda... There is plenty wrong with that picture and much more is wrong with Nancy Pelosi than her lying about what she knew about torture. She, nor anyone else, will be able to prosecute anyone for the policy of torture that the Bush Administration carried out. She did not lie under oath, so there is no crime. She has lost power because her credibility is now in question. And the Republican base has something legitimate to b tch about (instead of making things up.) Now what? The Republicans going after Pelosi helps President Obama. She is too divisive and even more liberal than President Obama. She has got in the way of several Obama proposals, or made it more difficult for him to further his agenda. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be. I agree with that - though it's a little scary to think she is third in line for the captain seat... I agree though - politically, they should beat her up - then save all the footage for reruns later when it becomes useful artillery...", 
        "reply": " Scary is that President Obama has an agenda that is as radical as that of FDR - the difference is there is no effective Republican Party to oppose him. Now there are some good ideas in that agenda. Health care must be fixed and it takes a strong leader to get it done. But Republicans should have an effective voice in that policy. The Republicans in the '30s were organized in their opposition to some of the more outrages FDR policies and managed to tone some others down. Today, the Republican Party is too disorganized, too petty and many of the “base” want someone who is like the average Joe the plumber for a leader - someone who is not smart enough to push back on the Obama agenda. Those who say that President Obama is an empty suit are just foolishly repeating what Rush told them. President Obama is very smart and while he may do much good for the country, too much power without opposition is not good. The Pelosi thing is just a distraction – red meat for the Republican Base. Meanwhile, the President has managed to pass fuel standards that would have been unthinkable four years ago. After a while, the Republicans will be chewing on some bones that have been tossed to them and becoming less and less relevant. To the detriment of the country.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 12:01:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: Scary is that President Obama has an agenda that is as radical as that of FDR - the difference is there is no effective Republican Party to oppose him. Now there are some good ideas in that agenda. Health care must be fixed and it takes a strong leader to get it done. But Republicans should have an effective voice in that policy. The Republicans in the '30s were organized in their opposition to some of the more outrages FDR policies and managed to tone some others down. Today, the Republican Party is too disorganized, too petty and many of the “base” want someone who is like the average Joe the plumber for a leader - someone who is not smart enough to push back on the Obama agenda. Those who say that President Obama is an empty suit are just foolishly repeating what Rush told them. President Obama is very smart and while he may do much good for the country, too much power without opposition is not good. The Pelosi thing is just a distraction – red meat for the Republican Base. Meanwhile, the President has managed to pass fuel standards that would have been unthinkable four years ago. After a while, the Republicans will be chewing on some bones that have been tossed to them and becoming less and less relevant. To the detriment of the country. I think the biggest nightmare lurking is these boneheads are doing all these programs “dreaming” of yester-year believe that somehow it will work out. FDR and freaking basement full cash and an industry just getting primed for a new era. Today we neither the cash nor the industry and we don’t even have a damn pump to PRIME… He can’t pay for what he just borrowed. He borrowed to fix debts that do NOT create jobs. He throws 100s of Billions into fixing roads, remodeling Gov buildings. In the meantime, he’s taken over the car industry – mandated America change her lifestyle so we can start driving mopeds – is about to raise every conceivable tax there is – and doing so in ways to NAIL EVERYBODY at astronomical levels – still hasn’t figured out how they can afford to sustain the freaking monster they are creating – still haven’t figured out how to pay china in 5-yrs, and steadily losing more and more jobs. GM is talking about moving the major portion of their assembly to Mexico. Chrysler is looking to do the same and one of the big supply manufacturers has already moved last month – 1000 jobs – GONE….. The US POSTAL service is laying off 25-thousand people. What happens when what few manufacturers are left in Detroit – are producing 30% of the vehicles they used to…? 70% of those working will be unemployed! That puts them back in the same sinking ship they are now in – and this time the HOLE is much bigger and there are NO FUNDS to buy buckets to bail them out. WHO is Obama’s entire administration has ever OWNED a business? These idiots have never owned anything. Unemployment is steadily going up… When it gets close to the 20% mark, I sure would not want to be living by a city. Things just might start getting a little sensitive… who knows by then maybe Pelosi will have figured out if she was told that she really wasn't told about waterboarding... Let's face - when they said waterboarding she agreed because she they were talking about surfers...", 
        "intTime": 20090520, 
        "postID": 20, 
        "quote": "Originally posted by xerello: Scary is that President Obama has an agenda that is as radical as that of FDR - the difference is there is no effective Republican Party to oppose him. Now there are some good ideas in that agenda. Health care must be fixed and it takes a strong leader to get it done. But Republicans should have an effective voice in that policy. The Republicans in the '30s were organized in their opposition to some of the more outrages FDR policies and managed to tone some others down. Today, the Republican Party is too disorganized, too petty and many of the “base” want someone who is like the average Joe the plumber for a leader - someone who is not smart enough to push back on the Obama agenda. Those who say that President Obama is an empty suit are just foolishly repeating what Rush told them. President Obama is very smart and while he may do much good for the country, too much power without opposition is not good. The Pelosi thing is just a distraction – red meat for the Republican Base. Meanwhile, the President has managed to pass fuel standards that would have been unthinkable four years ago. After a while, the Republicans will be chewing on some bones that have been tossed to them and becoming less and less relevant. To the detriment of the country.", 
        "reply": " I think the biggest nightmare lurking is these boneheads are doing all these programs “dreaming” of yester-year believe that somehow it will work out. FDR and freaking basement full cash and an industry just getting primed for a new era. Today we neither the cash nor the industry and we don’t even have a damn pump to PRIME… He can’t pay for what he just borrowed. He borrowed to fix debts that do NOT create jobs. He throws 100s of Billions into fixing roads, remodeling Gov buildings. In the meantime, he’s taken over the car industry – mandated America change her lifestyle so we can start driving mopeds – is about to raise every conceivable tax there is – and doing so in ways to NAIL EVERYBODY at astronomical levels – still hasn’t figured out how they can afford to sustain the freaking monster they are creating – still haven’t figured out how to pay china in 5-yrs, and steadily losing more and more jobs. GM is talking about moving the major portion of their assembly to Mexico. Chrysler is looking to do the same and one of the big supply manufacturers has already moved last month – 1000 jobs – GONE….. The US POSTAL service is laying off 25-thousand people. What happens when what few manufacturers are left in Detroit – are producing 30% of the vehicles they used to…? 70% of those working will be unemployed! That puts them back in the same sinking ship they are now in – and this time the HOLE is much bigger and there are NO FUNDS to buy buckets to bail them out. WHO is Obama’s entire administration has ever OWNED a business? These idiots have never owned anything. Unemployment is steadily going up… When it gets close to the 20% mark, I sure would not want to be living by a city. Things just might start getting a little sensitive… who knows by then maybe Pelosi will have figured out if she was told that she really wasn't told about waterboarding... Let's face - when they said waterboarding she agreed because she they were talking about surfers...", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 14:11:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Well, I see a lot of people blow it off as oh well they all do it. Nobody has a problem what she lied about who she lied about. But the standard has really been lowered. Hell, why cant we hold her to the Trent Lott standard he made an off the cuff remark at a dinner and had to step down. But this hack Pelosi outright lies and lies about the CIA in a press conference and it's, oh well no biggy. It's not like it was something important like Nat'l security or impugning a Govt agency that has died defending us. Some of you people are pathetic.", 
        "intTime": 20090520, 
        "postID": 21, 
        "quote": "", 
        "reply": "Well, I see a lot of people blow it off as oh well they all do it. Nobody has a problem what she lied about who she lied about. But the standard has really been lowered. Hell, why cant we hold her to the Trent Lott standard he made an off the cuff remark at a dinner and had to step down. But this hack Pelosi outright lies and lies about the CIA in a press conference and it's, oh well no biggy. It's not like it was something important like Nat'l security or impugning a Govt agency that has died defending us. Some of you people are pathetic.", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 20:18:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Well, I see a lot of people blow it off as oh well they all do it. Nobody has a problem what she lied about who she lied about. But the standard has really been lowered. Hell, why cant we hold her to the Trent Lott standard he made an off the cuff remark at a dinner and had to step down. But this hack Pelosi outright lies and lies about the CIA in a press conference and it's, oh well no biggy. It's not like it was something important like Nat'l security or impugning a Govt agency that has died defending us. Some of you people are pathetic. Affirmative Gunny, Semper Fi, Marine LIAR is freely used by the LIBs, until their liars are revealed . . .", 
        "intTime": 20090520, 
        "postID": 22, 
        "quote": "Originally posted by GunnyRet03: Well, I see a lot of people blow it off as oh well they all do it. Nobody has a problem what she lied about who she lied about. But the standard has really been lowered. Hell, why cant we hold her to the Trent Lott standard he made an off the cuff remark at a dinner and had to step down. But this hack Pelosi outright lies and lies about the CIA in a press conference and it's, oh well no biggy. It's not like it was something important like Nat'l security or impugning a Govt agency that has died defending us. Some of you people are pathetic.", 
        "reply": " Affirmative Gunny, Semper Fi, Marine LIAR is freely used by the LIBs, until their liars are revealed . . .", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-20 20:38:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "Oh, but the Democratic Party is so perfect. They are as pure as the driven snow. They are the birds singing on a spring morning. Riiiiiiiiiiight!!", 
        "intTime": 20090521, 
        "postID": 23, 
        "quote": "", 
        "reply": "Oh, but the Democratic Party is so perfect. They are as pure as the driven snow. They are the birds singing on a spring morning. Riiiiiiiiiiight!!", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-21 05:34:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "The CIA can't get the names or the dates right, but Nancy Pelosi is the liar because she didn't get the facts right on something that occurred seven years ago? LOL", 
        "intTime": 20090521, 
        "postID": 24, 
        "quote": "", 
        "reply": "The CIA can't get the names or the dates right, but Nancy Pelosi is the liar because she didn't get the facts right on something that occurred seven years ago? LOL", 
        "threadID": "409192893_5420079222001", 
        "time": "2009-05-21 06:13:00", 
        "title": "TOP AID FOR PELOSI PROVES PELOSI IS A LIAR!", 
        "userID": "SeaWitch1220"
    }
]