[
    {
        "content": "genetic possibility of homosexuality from their language?", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "", 
        "reply": "genetic possibility of homosexuality from their language?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-13 18:29:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "transport1"
    }, 
    {
        "content": "and Obama is backing away from support of gay marriage. I hear it's gone from his home page's agenda.", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "", 
        "reply": "and Obama is backing away from support of gay marriage. I hear it's gone from his home page's agenda.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-13 18:47:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "transport1"
    }, 
    {
        "content": "Sexual orientation is a mystery. In some cultures one does not know their orientation until after childhood! Never-the-less, in this democracy that emphasizes free choice, even if there was not a 'genetic' basis for homosexuality, and it was a choice, how would that be wrong? Homosexuality is not considered a mental illness. Nor is it illegal. Therefore what people do with their sex lives within the law is no one else business. On what grounds in this free society could someone condemn them except on personal bias and prejudices? And that attitude a law does not make.", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "", 
        "reply": "Sexual orientation is a mystery. In some cultures one does not know their orientation until after childhood! Never-the-less, in this democracy that emphasizes free choice, even if there was not a 'genetic' basis for homosexuality, and it was a choice, how would that be wrong? Homosexuality is not considered a mental illness. Nor is it illegal. Therefore what people do with their sex lives within the law is no one else business. On what grounds in this free society could someone condemn them except on personal bias and prejudices? And that attitude a law does not make.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-13 19:35:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "reducetension"
    }, 
    {
        "content": "As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots.", 
        "intTime": 20090514, 
        "postID": 4, 
        "quote": "", 
        "reply": "As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 03:44:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: and Obama is backing away from support of gay marriage. he never supported gay marriage. He's always said he would only support civil unions.", 
        "intTime": 20090514, 
        "postID": 5, 
        "quote": "and Obama is backing away from support of gay marriage.", 
        "reply": " he never supported gay marriage. He's always said he would only support civil unions.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 04:45:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots. Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "intTime": 20090514, 
        "postID": 6, 
        "quote": "Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots.", 
        "reply": " Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 05:04:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!!", 
        "intTime": 20090514, 
        "postID": 7, 
        "quote": "", 
        "reply": "There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!!", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 05:04:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots. Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "intTime": 20090514, 
        "postID": 8, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots. Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "reply": " The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:13:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!! There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents.", 
        "intTime": 20090514, 
        "postID": 9, 
        "quote": "Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!!", 
        "reply": " There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:19:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical...", 
        "intTime": 20090514, 
        "postID": 10, 
        "quote": "Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "reply": " LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical...", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:21:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. to put it into perspective...would it be \"right\" or legal to ban men from marrying red heads? or even something else that isn't genetic...say...fat or skinny women?", 
        "intTime": 20090514, 
        "postID": 11, 
        "quote": "Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance.", 
        "reply": " to put it into perspective...would it be \"right\" or legal to ban men from marrying red heads? or even something else that isn't genetic...say...fat or skinny women?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:22:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "", 
        "intTime": 20090514, 
        "postID": 12, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:26:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical... Apparently the definition of \"mounting\" has been amended to include \"reacting to hysterical ranting\". What a caricature!", 
        "intTime": 20090514, 
        "postID": 13, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical...", 
        "reply": " Apparently the definition of \"mounting\" has been amended to include \"reacting to hysterical ranting\". What a caricature!", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:43:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "I just think it's funny that \"mounting\" is being used so much in a gay thread.", 
        "intTime": 20090514, 
        "postID": 14, 
        "quote": "", 
        "reply": "I just think it's funny that \"mounting\" is being used so much in a gay thread.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 07:15:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!! There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents. Those folks were just practicing their Freedom of Speech and right to peacefully assemble and protest. Many in the Gay community don't condone the behavior that some of the youngsters were displaying after Prop 8 passed in California but personally I thought those protesters were rather mild, no rioting in the streets with shops being looted or burned to the ground, no police cars turned upside down and set afire or physical attacks on unsuspecting passersby. On the other hand, I don't believe such activism does much good other than further galvanize and entrenchment both sides in this struggle. The fight will be won thru Legislation and the Court system.", 
        "intTime": 20090514, 
        "postID": 15, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!! There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents.", 
        "reply": " Those folks were just practicing their Freedom of Speech and right to peacefully assemble and protest. Many in the Gay community don't condone the behavior that some of the youngsters were displaying after Prop 8 passed in California but personally I thought those protesters were rather mild, no rioting in the streets with shops being looted or burned to the ground, no police cars turned upside down and set afire or physical attacks on unsuspecting passersby. On the other hand, I don't believe such activism does much good other than further galvanize and entrenchment both sides in this struggle. The fight will be won thru Legislation and the Court system.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 07:17:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation.", 
        "intTime": 20090514, 
        "postID": 16, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "reply": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific)  So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 09:46:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "DaleU"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation. Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so.", 
        "intTime": 20090514, 
        "postID": 17, 
        "quote": "Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation.", 
        "reply": " Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 10:59:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: I just think it's funny that \"mounting\" is being used so much in a gay thread. How can one tell that it is a \"gay\" thread?", 
        "intTime": 20090514, 
        "postID": 18, 
        "quote": "Originally posted by karlhungusjr: I just think it's funny that \"mounting\" is being used so much in a gay thread.", 
        "reply": " How can one tell that it is a \"gay\" thread?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 11:04:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet.", 
        "intTime": 20090514, 
        "postID": 19, 
        "quote": "Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so.", 
        "reply": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific)  Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 11:47:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "DaleU"
    }, 
    {
        "content": "", 
        "intTime": 20090514, 
        "postID": 20, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 12:08:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD This message has been edited. Last edited by: adminnco1, Thu 14 May 2009 01:01 PM", 
        "intTime": 20090514, 
        "postID": 21, 
        "quote": "Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet.", 
        "reply": " What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD This message has been edited. Last edited by: adminnco1, Thu 14 May 2009 01:01 PM", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 12:44:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think?", 
        "intTime": 20090514, 
        "postID": 22, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD", 
        "reply": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific)  I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 13:18:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "DaleU"
    }, 
    {
        "content": "The APA said this?!? Why, they need to have their HEADS EXAMINED!!!!!!!\\\\", 
        "intTime": 20090514, 
        "postID": 23, 
        "quote": "", 
        "reply": "The APA said this?!? Why, they need to have their HEADS EXAMINED!!!!!!!\\\\", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 13:31:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them...", 
        "intTime": 20090514, 
        "postID": 24, 
        "quote": "Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet.", 
        "reply": " What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them...", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 16:05:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry? Why on earth do minority groups scream and whine bigotry and intolerance whenever any contradictory position is advanced? Why do minorities begin this whine about/against any and all who will not cheer or support preferential treatment for these minorities? Where is it stipulated that any behavior or activity no matter how deviant or obtuse to the parent society/culture should be made the law of the land. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090514, 
        "postID": 25, 
        "quote": "Originally posted by SeaWitch1220: Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "reply": " Why on earth do minority groups scream and whine bigotry and intolerance whenever any contradictory position is advanced? Why do minorities begin this whine about/against any and all who will not cheer or support preferential treatment for these minorities? Where is it stipulated that any behavior or activity no matter how deviant or obtuse to the parent society/culture should be made the law of the land. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 18:24:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them... All the discussion in the world will not eradicate that fact that the science is still ambiguous. Perhaps it's a choice, perhaps it isn't, personally I really don't care. What people do in their private lives is their business. If a gay couple wants to marry as far as I'm concerned they should be allowed to do so. The only thing I resent is when I am told I must accept a non-empirical conclusion simply because it is PC to do so.", 
        "intTime": 20090514, 
        "postID": 26, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them...", 
        "reply": " All the discussion in the world will not eradicate that fact that the science is still ambiguous. Perhaps it's a choice, perhaps it isn't, personally I really don't care. What people do in their private lives is their business. If a gay couple wants to marry as far as I'm concerned they should be allowed to do so. The only thing I resent is when I am told I must accept a non-empirical conclusion simply because it is PC to do so.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 18:54:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think? Please pester someone else. I have no interest in your opinion and have absolutely no desire to interact with you in any manner what so ever.", 
        "intTime": 20090514, 
        "postID": 27, 
        "quote": "Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think?", 
        "reply": " Please pester someone else. I have no interest in your opinion and have absolutely no desire to interact with you in any manner what so ever.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 18:57:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "genetic possibility of homosexuality from their language?", 
        "intTime": 20090513, 
        "postID": 28, 
        "quote": "", 
        "reply": "genetic possibility of homosexuality from their language?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-13 18:29:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "transport1"
    }, 
    {
        "content": "and Obama is backing away from support of gay marriage. I hear it's gone from his home page's agenda.", 
        "intTime": 20090513, 
        "postID": 29, 
        "quote": "", 
        "reply": "and Obama is backing away from support of gay marriage. I hear it's gone from his home page's agenda.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-13 18:47:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "transport1"
    }, 
    {
        "content": "Sexual orientation is a mystery. In some cultures one does not know their orientation until after childhood! Never-the-less, in this democracy that emphasizes free choice, even if there was not a 'genetic' basis for homosexuality, and it was a choice, how would that be wrong? Homosexuality is not considered a mental illness. Nor is it illegal. Therefore what people do with their sex lives within the law is no one else business. On what grounds in this free society could someone condemn them except on personal bias and prejudices? And that attitude a law does not make.", 
        "intTime": 20090513, 
        "postID": 30, 
        "quote": "", 
        "reply": "Sexual orientation is a mystery. In some cultures one does not know their orientation until after childhood! Never-the-less, in this democracy that emphasizes free choice, even if there was not a 'genetic' basis for homosexuality, and it was a choice, how would that be wrong? Homosexuality is not considered a mental illness. Nor is it illegal. Therefore what people do with their sex lives within the law is no one else business. On what grounds in this free society could someone condemn them except on personal bias and prejudices? And that attitude a law does not make.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-13 19:35:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "reducetension"
    }, 
    {
        "content": "As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots.", 
        "intTime": 20090514, 
        "postID": 31, 
        "quote": "", 
        "reply": "As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 03:44:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: and Obama is backing away from support of gay marriage. he never supported gay marriage. He's always said he would only support civil unions.", 
        "intTime": 20090514, 
        "postID": 32, 
        "quote": "and Obama is backing away from support of gay marriage.", 
        "reply": " he never supported gay marriage. He's always said he would only support civil unions.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 04:45:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots. Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "intTime": 20090514, 
        "postID": 33, 
        "quote": "Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots.", 
        "reply": " Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 05:04:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!!", 
        "intTime": 20090514, 
        "postID": 34, 
        "quote": "", 
        "reply": "There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!!", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 05:04:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots. Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "intTime": 20090514, 
        "postID": 35, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: As the science is, at best, ambiguous regarding the basis for sexual orientation then it follows that there is little, if any, justification for legislating \"gay rights\" based on a choice being akin to ethnicity. All the psycho-rants in the world will not change to fact that the empirical evidence just isn't there to support treating a choice to be gay the same as being black or oriental. Therefore, not supporting such legislation can hardly make someone a \"homophobe\" and in fact those making such allegations are themselves the intolerant bigots. Despite not yet finding a definitive cause for human sexuality, the \"choice\" argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive \"cause\" for human sexuality is never found, that certainly does not give ANY credence to the \"choice\" contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their \"homosexuality is a choice\" (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a \"root cause\" for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "reply": " The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:13:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!! There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents.", 
        "intTime": 20090514, 
        "postID": 36, 
        "quote": "Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!!", 
        "reply": " There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:19:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical...", 
        "intTime": 20090514, 
        "postID": 37, 
        "quote": "Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "reply": " LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical...", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:21:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. to put it into perspective...would it be \"right\" or legal to ban men from marrying red heads? or even something else that isn't genetic...say...fat or skinny women?", 
        "intTime": 20090514, 
        "postID": 38, 
        "quote": "Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance.", 
        "reply": " to put it into perspective...would it be \"right\" or legal to ban men from marrying red heads? or even something else that isn't genetic...say...fat or skinny women?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:22:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "", 
        "intTime": 20090514, 
        "postID": 39, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:26:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical... Apparently the definition of \"mounting\" has been amended to include \"reacting to hysterical ranting\". What a caricature!", 
        "intTime": 20090514, 
        "postID": 40, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by adminnco1: Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. LOL...here we go again...what \"more protections\" are being asked for or afforded? Everywhere I look, gays and lesbians are being asked for the SAME \"protections\" that heterosexuals enjoy. \"Faux\" science? Just because the MOUNTING evidence that points to a genetic predisposition and definitely blows the \"choice\" theory out of the water, you decide to label it false. Cheap, but typical...", 
        "reply": " Apparently the definition of \"mounting\" has been amended to include \"reacting to hysterical ranting\". What a caricature!", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 06:43:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "I just think it's funny that \"mounting\" is being used so much in a gay thread.", 
        "intTime": 20090514, 
        "postID": 41, 
        "quote": "", 
        "reply": "I just think it's funny that \"mounting\" is being used so much in a gay thread.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 07:15:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!! There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents. Those folks were just practicing their Freedom of Speech and right to peacefully assemble and protest. Many in the Gay community don't condone the behavior that some of the youngsters were displaying after Prop 8 passed in California but personally I thought those protesters were rather mild, no rioting in the streets with shops being looted or burned to the ground, no police cars turned upside down and set afire or physical attacks on unsuspecting passersby. On the other hand, I don't believe such activism does much good other than further galvanize and entrenchment both sides in this struggle. The fight will be won thru Legislation and the Court system.", 
        "intTime": 20090514, 
        "postID": 42, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by JimCrackCorn: There is more scientific evidence that suggest being Gay or Lesbian is Biologically or Genetically linked than there are studies that suggest otherwise. \"\"http://borngay.procon.org/viewresource.asp?resourceID=6\"\" There are many biological or genetic anomalies that scientist have yet to figure out. Down Syndrome, Autism/Savant, Prader-Willi Syndrome, Tourette Syndrome all exist and scientist don't know what causes them. We shouldn't deny people equality just because we don't have scientific proof of why they are different. There is no link that would suggest a person is homophobic just because they don't support Gay friendly legislation. Personally, I think many people don't support Gay Legislation because they are jealous of our spectacular, colorful, and marvelous personalities!!! There are also many, such as me, who were far more supportive of gay rights prior to all the demonstrations and activism against Proposition 8. The rancor and hatred being hacked up by the gay rights movement tends more to alienate than it does to attract supporters. I find many gay leaders to be intolerant and absolutely offensive and while their antics may not change my vote I will never under any circumstance allow myself to be aligned with such vile hate spewing malcontents.", 
        "reply": " Those folks were just practicing their Freedom of Speech and right to peacefully assemble and protest. Many in the Gay community don't condone the behavior that some of the youngsters were displaying after Prop 8 passed in California but personally I thought those protesters were rather mild, no rioting in the streets with shops being looted or burned to the ground, no police cars turned upside down and set afire or physical attacks on unsuspecting passersby. On the other hand, I don't believe such activism does much good other than further galvanize and entrenchment both sides in this struggle. The fight will be won thru Legislation and the Court system.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 07:17:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation.", 
        "intTime": 20090514, 
        "postID": 43, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact.", 
        "reply": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific)  So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 09:46:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "DaleU"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation. Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so.", 
        "intTime": 20090514, 
        "postID": 44, 
        "quote": "Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 06:13 AM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by SeaWitch1220: Despite not yet finding a definitive cause for human sexuality, the “choice” argument holds no water since there is ZERO evidence of it being a choice. Even if a definitive “cause” for human sexuality is never found, that certainly does not give ANY credence to the “choice” contention and does not justify denying equal rights and benefits to homosexuals. Those that will cling to their “homosexuality is a choice” (baseless) argument are doing it out of intolerance because they want to justify their bigotry, intolerance and homophobia. The scientific community, despite not yet finding a “root cause” for sexuality agrees, in an overwhelming majority, that sexuality is NOT a choice. The American people in a majority believe that sexuality is NOT a choice and the millions of gays and lesbians across the globe will tell you that their sexuality is not a choice. Why on earth would anyone want to cling to the idea that sexuality is a “choice” unless it was to justify their intolerance and bigotry? The choices that people make are on no concern to me. People should be free to sleep/be with whomever makes them happy. Irrationally claiming that in spite of scientific ambiguity on the matter that sexual preference should be accorded more protection than a preference for dating a red head is truly an attempt to justify bigotry and intolerance. Using faux science and emotional appeals will not alter that fact. So I assume you would also support removing special legislation regarding protections and taxation of churches and other religious institutions, since one’s religious beliefs can’t possibly be construed as anything other than choice? Apparently you also missed the last part of Yooper_tj’s quote from the American Psychiatric Association website http://www.apa.org/topics/sorientation.html#whatcauses quote: What causes a person to have a particular sexual orientation? There is no consensus among scientists about the exact reasons that an individual develops a heterosexual, bisexual, gay, or lesbian orientation. Although much research has examined the possible genetic, hormonal, developmental, social, and cultural influences on sexual orientation, no findings have emerged that permit scientists to conclude that sexual orientation is determined by any particular factor or factors. Many think that nature and nurture both play complex roles; most people experience little or no sense of choice about their sexual orientation.", 
        "reply": " Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 10:59:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: I just think it's funny that \"mounting\" is being used so much in a gay thread. How can one tell that it is a \"gay\" thread?", 
        "intTime": 20090514, 
        "postID": 45, 
        "quote": "Originally posted by karlhungusjr: I just think it's funny that \"mounting\" is being used so much in a gay thread.", 
        "reply": " How can one tell that it is a \"gay\" thread?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 11:04:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet.", 
        "intTime": 20090514, 
        "postID": 46, 
        "quote": "Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so.", 
        "reply": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific)  Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 11:47:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "DaleU"
    }, 
    {
        "content": "", 
        "intTime": 20090514, 
        "postID": 47, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 12:08:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD This message has been edited. Last edited by: adminnco1, Thu 14 May 2009 01:01 PM", 
        "intTime": 20090514, 
        "postID": 48, 
        "quote": "Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet.", 
        "reply": " What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD This message has been edited. Last edited by: adminnco1, Thu 14 May 2009 01:01 PM", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 12:44:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think?", 
        "intTime": 20090514, 
        "postID": 49, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD", 
        "reply": "Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific)  I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think?", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 13:18:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "DaleU"
    }, 
    {
        "content": "The APA said this?!? Why, they need to have their HEADS EXAMINED!!!!!!!\\\\", 
        "intTime": 20090514, 
        "postID": 50, 
        "quote": "", 
        "reply": "The APA said this?!? Why, they need to have their HEADS EXAMINED!!!!!!!\\\\", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 13:31:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them...", 
        "intTime": 20090514, 
        "postID": 51, 
        "quote": "Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet.", 
        "reply": " What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them...", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 16:05:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry? Why on earth do minority groups scream and whine bigotry and intolerance whenever any contradictory position is advanced? Why do minorities begin this whine about/against any and all who will not cheer or support preferential treatment for these minorities? Where is it stipulated that any behavior or activity no matter how deviant or obtuse to the parent society/culture should be made the law of the land. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090514, 
        "postID": 52, 
        "quote": "Originally posted by SeaWitch1220: Why on earth would anyone want to cling to the idea that sexuality is a \"choice\" unless it was to justify their intolerance and bigotry?", 
        "reply": " Why on earth do minority groups scream and whine bigotry and intolerance whenever any contradictory position is advanced? Why do minorities begin this whine about/against any and all who will not cheer or support preferential treatment for these minorities? Where is it stipulated that any behavior or activity no matter how deviant or obtuse to the parent society/culture should be made the law of the land. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 18:24:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them... All the discussion in the world will not eradicate that fact that the science is still ambiguous. Perhaps it's a choice, perhaps it isn't, personally I really don't care. What people do in their private lives is their business. If a gay couple wants to marry as far as I'm concerned they should be allowed to do so. The only thing I resent is when I am told I must accept a non-empirical conclusion simply because it is PC to do so.", 
        "intTime": 20090514, 
        "postID": 53, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by DaleU: Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. What is amazing is that they dismiss the millions of gays and lesbians that say that sexuality isn't a choice and the millions upon millions of heterosexuals that say that sexuality wasn't a choice for them...", 
        "reply": " All the discussion in the world will not eradicate that fact that the science is still ambiguous. Perhaps it's a choice, perhaps it isn't, personally I really don't care. What people do in their private lives is their business. If a gay couple wants to marry as far as I'm concerned they should be allowed to do so. The only thing I resent is when I am told I must accept a non-empirical conclusion simply because it is PC to do so.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 18:54:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think? Please pester someone else. I have no interest in your opinion and have absolutely no desire to interact with you in any manner what so ever.", 
        "intTime": 20090514, 
        "postID": 54, 
        "quote": "Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 12:44 PM (Pacific) quote: Originally posted by adminnco1: quote: Originally posted by DaleU: Responding to: adminnco1 Thread: American Psychiatric Association removes Date/Time: Thu 14 May 2009 10:59 AM (Pacific) quote: Originally posted by adminnco1: Setting aside all the silly adolescent drama, it still boils down to the fact that there is no scientific certainty one way or the other. Regarding religion, I have no feelings about it one way or the other but would support taxing church assets as there is no logical reason to not do so. Yes, quite right, there is NO evidence proving that it’s a choice. Of course, there’s NO evidence showing that left or right handedness is anything but choice either. But we know that it’s not, they just haven’t identified the mechanism yet. It’s the same with sexual orientation: far more evidence points to its being hardwired in rather than a choice, but they haven’t identified the triggering mechanism yet. What is up with the childish header and other drama? When you decide to grow up and post like an adult we can have a discussion. Until that happens consider yourself scraped from the bottom of my shoe. EOD I’m sorry that my message style so disturbs you that you can’t concentrate enough to respond with anything other than insults. Though I suspect all of your bluster is nothing more than a way for you to avoid responding to something that you don’t have a logical answer to. But then, maybe that’s just my “childish fantasy”, ya think?", 
        "reply": " Please pester someone else. I have no interest in your opinion and have absolutely no desire to interact with you in any manner what so ever.", 
        "threadID": "409192893_5890042322001", 
        "time": "2009-05-14 18:57:00", 
        "title": "American Psychiatric Association removes", 
        "userID": "adminnco1"
    }
]