[
    {
        "content": "Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama??", 
        "intTime": 20090324, 
        "postID": 1, 
        "quote": "", 
        "reply": "Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama??", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 11:16:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Not I, there is already enough intrusive legislation. Can anyone say Blair Holt", 
        "intTime": 20090324, 
        "postID": 2, 
        "quote": "", 
        "reply": "Not I, there is already enough intrusive legislation. Can anyone say Blair Holt", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 11:19:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "transport1"
    }, 
    {
        "content": "If Gietner and this administration gets this power, they'll have control over the whole financial institution. Do you really want that?", 
        "intTime": 20090324, 
        "postID": 3, 
        "quote": "", 
        "reply": "If Gietner and this administration gets this power, they'll have control over the whole financial institution. Do you really want that?", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 11:46:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. STICK IT WHERE THE SUN DONT SHINE AND YOU GET OVER IT, HAVE YOU NOT LISTENED TO WHAT THIS GUY IS SAYING.. TOTAL CONTROL OF PRIVATE ENTERPRISE, HE WANTS TO TELL YOU WHAT YOU CAN MAKE", 
        "intTime": 20090324, 
        "postID": 4, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it.", 
        "reply": " STICK IT WHERE THE SUN DONT SHINE AND YOU GET OVER IT, HAVE YOU NOT LISTENED TO WHAT THIS GUY IS SAYING.. TOTAL CONTROL OF PRIVATE ENTERPRISE, HE WANTS TO TELL YOU WHAT YOU CAN MAKE", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 12:14:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations.", 
        "intTime": 20090324, 
        "postID": 5, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it.", 
        "reply": " Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations.", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 12:29:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "Vorpal"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations. The last time we were even close to a free market was back in the late 1800's, free speech was not far behind it, nor was the right to bear arms. SO YOU SUPPORT TAKING PUBLIC COMPANIES THAT ARE TRADED ON THE NYSE BEING PUT UNDER THE CONTROL OF ONE POLITICAL PARTY BEING THE SEC TREAS", 
        "intTime": 20090324, 
        "postID": 6, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations. The last time we were even close to a free market was back in the late 1800's, free speech was not far behind it, nor was the right to bear arms.", 
        "reply": " SO YOU SUPPORT TAKING PUBLIC COMPANIES THAT ARE TRADED ON THE NYSE BEING PUT UNDER THE CONTROL OF ONE POLITICAL PARTY BEING THE SEC TREAS", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 14:23:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Wages and Prices under the Pres. Nixon Commission did exactly the same thing. It was called \"Wage and Price Controls\" and it operated out of OMB. A friend of mine was the Director (Bill Geimer) oddly enough out of Chicago.", 
        "intTime": 20090324, 
        "postID": 7, 
        "quote": "", 
        "reply": "Wages and Prices under the Pres. Nixon Commission did exactly the same thing. It was called \"Wage and Price Controls\" and it operated out of OMB. A friend of mine was the Director (Bill Geimer) oddly enough out of Chicago.", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 14:58:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations. The last time we were even close to a free market was back in the late 1800's, free speech was not far behind it, nor was the right to bear arms. Nuff said right there...Mr: I spent 20 years in the military and dont believe in freedom.", 
        "intTime": 20090324, 
        "postID": 8, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations. The last time we were even close to a free market was back in the late 1800's, free speech was not far behind it, nor was the right to bear arms.", 
        "reply": " Nuff said right there...Mr: I spent 20 years in the military and dont believe in freedom.", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 15:21:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations. Concur The Sheeple Nation desires their Shepherd...", 
        "intTime": 20090324, 
        "postID": 9, 
        "quote": "Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations.", 
        "reply": " Concur The Sheeple Nation desires their Shepherd...", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 15:28:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "This is one I don't like the sound of. The AIG bailout I understand, if AIG falls the rest go down with it. The same with Fannie and Freddie. However, giving the Treasury authority to take over corporations that may or may not be able to survive on their own is too much. As much as possible the economy should run itself, but with regulation. The trend in recent years was all short term profit. The financial companies got so big that there was no incentive to keep it going for the long run. The primary shareholders were happy to see it shoot to the moon so they could sell and what happened after that wasn't important. Some companies are the exception, like Microsoft, Apple, Ford, and Berkshire. Since they have people like Gates, Jobs, Buffett, and the Ford family with a vested interest in their success.", 
        "intTime": 20090324, 
        "postID": 10, 
        "quote": "", 
        "reply": "This is one I don't like the sound of. The AIG bailout I understand, if AIG falls the rest go down with it. The same with Fannie and Freddie. However, giving the Treasury authority to take over corporations that may or may not be able to survive on their own is too much. As much as possible the economy should run itself, but with regulation. The trend in recent years was all short term profit. The financial companies got so big that there was no incentive to keep it going for the long run. The primary shareholders were happy to see it shoot to the moon so they could sell and what happened after that wasn't important. Some companies are the exception, like Microsoft, Apple, Ford, and Berkshire. Since they have people like Gates, Jobs, Buffett, and the Ford family with a vested interest in their success.", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-24 17:24:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations. Concur The Sheeple Nation desires their Shepherd... Sheople are bleeting for the Govt to take care of them, correct their mistakes (but don't blame them for making those mistakes or hold them accountable for them), and prefer to be fed at the Govt trough rather than understand people who make poor business decision fail and deserve to; people who don't provide for their own retirement deserve not to have one and folks who live outside their means deserve to go broke.", 
        "intTime": 20090330, 
        "postID": 11, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by Vorpal: quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: Who here wants to enable the US Sec Treas to have the ability to 1. cap wages?? 2. determine whether or not a business is viable and should be taken over by feds. THE LIST GOES ON AND ON AND ON AND ON free market or socialistic engineered market under complete control by Obama?? Didn't you have a problem with Congress giving themselves a pay increase? Also there is no such thing as \"free markets\". Anywhere. Get over it. Soon to be followed by; There is no freedom of speech anywhere, get over it. There is no right to bear arms, get over it. There is no personal property, get over it. and on, and on. It amazes me at the rush that people are in to throw away their freedoms for no other reason than that they harbor an irrational hatred for their own countryman. That class warfare rhetoric would find such fertile soil in America is more disheartening than I can verbalize. I may never make 250,000 a year in my life but if my nieghbor can (without breaking any laws) then God bless him. The idea that a central authority should be granted non-Constitutional powers to cap wages should be abhorrent to all Americans regardless of their affiliations. Concur The Sheeple Nation desires their Shepherd...", 
        "reply": " Sheople are bleeting for the Govt to take care of them, correct their mistakes (but don't blame them for making those mistakes or hold them accountable for them), and prefer to be fed at the Govt trough rather than understand people who make poor business decision fail and deserve to; people who don't provide for their own retirement deserve not to have one and folks who live outside their means deserve to go broke.", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-30 18:22:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Don't you work for the government? Who's putting food on your table?", 
        "intTime": 20090330, 
        "postID": 12, 
        "quote": "", 
        "reply": "Don't you work for the government? Who's putting food on your table?", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-03-30 20:05:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945:SO YOU SUPPORT TAKING PUBLIC COMPANIES THAT ARE TRADED ON THE NYSE BEING PUT UNDER THE CONTROL OF ONE POLITICAL PARTY BEING THE SEC TREAS Yes I support the current policy, but don't get that confused with me liking it. Banks are supposed to minimize risk while maximizing profit. It is clear that the companies involved did neither. AIG was suppose to be run by actuaries, when it appears they were run by folks on the WSOPS. At first I believed the deserved to fail. Now I believe they have done what they believe is the best and I will give them the benefit of the doubt. A slightly better perspective might be that banks are supposed to maximize profit for the level of risk they prudently accept. Little risk = little reward. Thing is--with the Fannie/Freddie fiasco and knowing support from the very people in Congress who now castigate the banks--they fully expected more reward for little risk, since the guvmint was to pick up the tab for all of the lousy, dumb debt that they provided too many who should have remained in apartments and gotten low-limit credit cards, if any. The more the guvmint gets involved, the more it thinks it has to get involved.", 
        "intTime": 20090401, 
        "postID": 13, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945:SO YOU SUPPORT TAKING PUBLIC COMPANIES THAT ARE TRADED ON THE NYSE BEING PUT UNDER THE CONTROL OF ONE POLITICAL PARTY BEING THE SEC TREAS Yes I support the current policy, but don't get that confused with me liking it. Banks are supposed to minimize risk while maximizing profit. It is clear that the companies involved did neither. AIG was suppose to be run by actuaries, when it appears they were run by folks on the WSOPS. At first I believed the deserved to fail. Now I believe they have done what they believe is the best and I will give them the benefit of the doubt.", 
        "reply": " A slightly better perspective might be that banks are supposed to maximize profit for the level of risk they prudently accept. Little risk = little reward. Thing is--with the Fannie/Freddie fiasco and knowing support from the very people in Congress who now castigate the banks--they fully expected more reward for little risk, since the guvmint was to pick up the tab for all of the lousy, dumb debt that they provided too many who should have remained in apartments and gotten low-limit credit cards, if any. The more the guvmint gets involved, the more it thinks it has to get involved.", 
        "threadID": "409192893_7150067812001", 
        "time": "2009-04-01 18:07:00", 
        "title": "SEC TREAS AND SOCIALIZED ECONOMIC AGENDA", 
        "userID": "RRR52"
    }
]