[
    {
        "content": "House Dems eyeing another stimulus bill! By Jared Allen Posted: 03/10/09 12:55 PM [ET] House Democrats are looking at yet another economic stimulus bill beyond the $787 billion one just enacted as investors and consumers continue to show little faith in the economy. At a special meeting of the Democratic Steering and Policy Committee on Tuesday morning, Democrats heard again from their trusted band of economists and came away reinforced that Congress would need to spend billions of additional taxpayer dollars in the coming months to help pull the economy out its severe recession. One proposal being considered is an additional economic stimulus bill. Just last month, President Obama signed a $787 billion stimulus measure that Democrats contended was needed to save or create 3.5 million jobs and that Republicans derided as nothing more than debt-spending on wasteful federal projects. “We are going to need more taxpayer money,” Mark Zandi, the chief economist at Moody’s Economy.com and a key economic adviser to congressional Democrats, said after the meeting. “I think another stimulus package is a reasonable assumption because of the way things are going.” House Speaker Nancy Pelosi (D-Calif.), standing with members of her leadership team by Zandi’s side, said she agreed that another stimulus bill is being considered. “We have to keep the door open,” Pelosi said. “The word of the day is confidence. Confidence in our markets, confidence in lending, confidence in our financial institutions.” Democrats leaned on the same group of economists they heard from before — including Allen Sinai, chief global economist at Decision Economics Inc.; Rebecca M. Blank, Robert S. Kerr senior fellow at the Brookings Institution; and Alan Blinder of Princeton University — to craft a stimulus bill that was $819 billion when it came out of the House before it was scaled back by Senate and House negotiators. Barely a month old, the spending provisions in the massive stimulus bill are just beginning to take effect. And while Democrats and their economic advisers said it was the right prescription for the economy — and that it should be given time to work — they also said that more will be needed. “The bad news is it’s going to get worse,” Blank said. “The good news is there are a whole series of actions being taken [including the stimulus].” “Whether this is enough, I think, is still unknown,” she added. “The risks are all on the side of under-reaching, not overreaching.” The economists and lawmakers made it clear that part of their immediate goal is to inject confidence into the economy — by reaching the psyches of investors and consumers — through words alone. Actions will come quickly, they said, to supplement the confidence they hope to pass on right away. “What characterizes the current environment is a loss of faith,” Zandi said, noting that faith is part of what separates a recession from a depression. “People aren’t convinced yet that this is going to work.” “We have to pay due diligence to what is next for us to do to make sure that we continue to make an advance on turning around this economic downturn,” Steering and Policy Co-Chairman George Miller (D-Calif.) said. “Delaying doing what is necessary is not an option we can afford.” “The policy directions that we have been undertaking along with the Obama administration are the right course,” Miller’s co-chairwoman, Rep. Rosa DeLauro (D-Conn.), said. “Do they need to be adjusted potentially? Yes. We are not frozen in the sand. “We should not be timid in these actions,” DeLauro continued. “When we have the confidence to move to address these problems in a forthright way and not be able to talk about spending dollars, then we will build the confidence in the American public that, in fact, we are doing the job that needs to get done to provide them with the economic security that they need to survive and take care of their families.” +++http://thehill.com/leading-the-news/house-dems-eyeing-another-stimulus-bill-2009-03-10.html -------------------------------------------------- When will this MADNESS end? \"Yes, Virginia, there is a Santa Claus\", and he's the President of the United States! Just make out your list, and Santobama will bring it to you!", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "House Dems eyeing another stimulus bill! By Jared Allen Posted: 03/10/09 12:55 PM [ET] House Democrats are looking at yet another economic stimulus bill beyond the $787 billion one just enacted as investors and consumers continue to show little faith in the economy. At a special meeting of the Democratic Steering and Policy Committee on Tuesday morning, Democrats heard again from their trusted band of economists and came away reinforced that Congress would need to spend billions of additional taxpayer dollars in the coming months to help pull the economy out its severe recession. One proposal being considered is an additional economic stimulus bill. Just last month, President Obama signed a $787 billion stimulus measure that Democrats contended was needed to save or create 3.5 million jobs and that Republicans derided as nothing more than debt-spending on wasteful federal projects. “We are going to need more taxpayer money,” Mark Zandi, the chief economist at Moody’s Economy.com and a key economic adviser to congressional Democrats, said after the meeting. “I think another stimulus package is a reasonable assumption because of the way things are going.” House Speaker Nancy Pelosi (D-Calif.), standing with members of her leadership team by Zandi’s side, said she agreed that another stimulus bill is being considered. “We have to keep the door open,” Pelosi said. “The word of the day is confidence. Confidence in our markets, confidence in lending, confidence in our financial institutions.” Democrats leaned on the same group of economists they heard from before — including Allen Sinai, chief global economist at Decision Economics Inc.; Rebecca M. Blank, Robert S. Kerr senior fellow at the Brookings Institution; and Alan Blinder of Princeton University — to craft a stimulus bill that was $819 billion when it came out of the House before it was scaled back by Senate and House negotiators. Barely a month old, the spending provisions in the massive stimulus bill are just beginning to take effect. And while Democrats and their economic advisers said it was the right prescription for the economy — and that it should be given time to work — they also said that more will be needed. “The bad news is it’s going to get worse,” Blank said. “The good news is there are a whole series of actions being taken [including the stimulus].” “Whether this is enough, I think, is still unknown,” she added. “The risks are all on the side of under-reaching, not overreaching.” The economists and lawmakers made it clear that part of their immediate goal is to inject confidence into the economy — by reaching the psyches of investors and consumers — through words alone. Actions will come quickly, they said, to supplement the confidence they hope to pass on right away. “What characterizes the current environment is a loss of faith,” Zandi said, noting that faith is part of what separates a recession from a depression. “People aren’t convinced yet that this is going to work.” “We have to pay due diligence to what is next for us to do to make sure that we continue to make an advance on turning around this economic downturn,” Steering and Policy Co-Chairman George Miller (D-Calif.) said. “Delaying doing what is necessary is not an option we can afford.” “The policy directions that we have been undertaking along with the Obama administration are the right course,” Miller’s co-chairwoman, Rep. Rosa DeLauro (D-Conn.), said. “Do they need to be adjusted potentially? Yes. We are not frozen in the sand. “We should not be timid in these actions,” DeLauro continued. “When we have the confidence to move to address these problems in a forthright way and not be able to talk about spending dollars, then we will build the confidence in the American public that, in fact, we are doing the job that needs to get done to provide them with the economic security that they need to survive and take care of their families.” +++http://thehill.com/leading-the-news/house-dems-eyeing-another-stimulus-bill-2009-03-10.html -------------------------------------------------- When will this MADNESS end? \"Yes, Virginia, there is a Santa Claus\", and he's the President of the United States! Just make out your list, and Santobama will bring it to you!", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-10 19:16:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-10 20:19:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Just more Monopoly money coming off the press.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "Just more Monopoly money coming off the press.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-10 20:21:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it. How is that? I thought that this whole mess was started by the housing bubble (which was created by just about every politician in Congress since Clinton and idiot consumers who never want to live within their means). Then, all of the mortgages were sold to whatever financial house would buy them. Then, they packaged these mortgages into securities and sold those on the open market. After seeing that they could sell off the risk to somebody else, the information thereof rolled back downhill to the mortgage brokers and small banks who figured out they could just start giving even crappier mortgages because they could just shell the risk to somebody else. \"Just get it signed and get that piece of toilet paper outta here\", they said. Then, after seeing how the mortgage brokers were now selling crappy mortgages up the chain, the big wigs on wall street figured they better do something to make these crappy mortgage backed securities look better. So, they in turn bundled them together with good mortgage backed securities into what is now called Collateralized Debt Obligations and sold those on the market. Then, on the other side of the coin, the buyers said, \"Whoa, these CDOs look too good to be true with their 20% gains and what not. I better insure these investments\". So, the bought Credit Default Swaps from AIG and other insurers to insure not only their CDOs, but their Mortgage Backed Securities, as well. Then, along comes a little whisper from the shadows that says \"hey, I heard Bear Sterns is cooking the books\". I heard it, my cousin heard it, my friends heard it, every investor heard it. And, next thing you know, Bear is the focus of every late night news and business show being asked why they are insolvent (even though, they weren't....Yet). Then, the when crap starts to hit the fan on Bears stock prices as everybody is yelling sell, sell, sell the Fed comes in and says \"Hey, JPM! We'll give you a non-recourse loan of $29 billion if you buy Bear for $1.2 billion, whataya think\"? JPM say \"heck Yes!! Whoohoo!!! I'm rich, Bicht!\" Meanwhile, the can of worms has been opened. The Fed and Treasury finally say that they are going to look into the eye of moral hazard and let Lehman fall to show that they have cajones. Only, it isn't until after they look at the books that they realize how intertwined Lehman was with just about every investment firm and bank on the planet. Next thing you know, the whole thing has broke loose. There is no stopping it. When, in all of this did Congress have a say, or even know what in the hell was going on, before and during the unfolding of this? Sure, the Republicans did it. No, the banks and investment firms did this. Everybody kept shelling risk to save their behind. Never realizing the web that they were spinning. And, quite a web it is. Ever heard of that 'ol 'six degrees of seperation'? Well, there is maybe 2-3 degrees of seperation between just about every major bank and investment firm on the planet in this case. This was all done outside of government. And, one might ask, \"why didn't the government do something?\" Because they had and still have absolutely no idea how this stuff works. Even Allen Greenspan has said he doesn't understand how a CDO works. The guys that were selling these investments don't even know. And, no matter what regulation or law you write, the private sector is always ahead of Congress. Even if Congress (which was Controlled by the Democrats, by the way) had any idea of the scope of this problem, they wouldn't have been able to get legislation drafted, get it through Committee, get it out on the floor of the House, get it out on the floor of the Senate, get it passed in both, and then get it bottom lined by El Presidente. It just doesn't work like that. One would say that we need more regulation. Bullcrap! We are already heavily regulated. Plus, there are countless countries that have even heavier regulation than ours. But, notice that those other countries are in the same boat. And, as is known, the private sector is always ahead of the game. That is capitalism at it's finest. The main problem is that the banks are so interconnected to our economy. Our money is created when somebody borrows. Our money is backed by the debt that we create through the issuing of credit from the banks. As a matter of fact, if everybody in the world were to pay off all of their debt, there would be no money. It is true. So, it goes without saying that it is the FIAT system that is the problem. And, Congress is doing the worst possible thing imaginable. They are increasing the money supply through legislation to insane levels in an attempt to fill the void that public debt obligations left. You see, normally when somebody loses money, somebody else makes money. But, in this case, the money just vanished into thin air. That is only possible in a FIAT money system. And, Congress and the Fed are chasing that void thinking they are going to catch up with it. They may... But, we are going to be bankrupt and owned by the private banks. Another option is to let them all fail. I personally believe this is going to happen anyway. We are chasing something that we do not have the resources to catch. We might, but I doubt it. But, if we do let them fail our entire financial and money system will collapse. The Fed will be gone, the dollar will cease to have value. We will pretty much have to start from scratch. It isn't a pretty thought, but after taking into consideration the alternative, it may be our best bet. It would be nice to not have inflation anymore. It would be nice to do away with the discount window. I would like interest rates to be determine by the market for once. But, we will more than likely fight this to the end and be indebted to our creditors for the unforeseen future. The last option, of which has been only talked about recently in the mainstream (but, has been a conspiracy theory for quite some time) is that all of the Central Banks come together to form a single regulatory and monetary entity. This will probably fix the problem. But, I think most of us are aware of the implications of this. Basically, say goodbye to sovereignty. Say goodbye to the 'American Dream'. Plus, we will still be under a FIAT system. So, the problems of that system will present themselves again as they have in every usage since the Roman Empire. So, before you go pointing fingers, it would be prudent to know what you are talking about in the first place. Carry on. This message has been edited. Last edited by: 10Tenths, Wed 11 March 2009 12:02 AM", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "Originally posted by FrJohn1123: There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it.", 
        "reply": " How is that? I thought that this whole mess was started by the housing bubble (which was created by just about every politician in Congress since Clinton and idiot consumers who never want to live within their means). Then, all of the mortgages were sold to whatever financial house would buy them. Then, they packaged these mortgages into securities and sold those on the open market. After seeing that they could sell off the risk to somebody else, the information thereof rolled back downhill to the mortgage brokers and small banks who figured out they could just start giving even crappier mortgages because they could just shell the risk to somebody else. \"Just get it signed and get that piece of toilet paper outta here\", they said. Then, after seeing how the mortgage brokers were now selling crappy mortgages up the chain, the big wigs on wall street figured they better do something to make these crappy mortgage backed securities look better. So, they in turn bundled them together with good mortgage backed securities into what is now called Collateralized Debt Obligations and sold those on the market. Then, on the other side of the coin, the buyers said, \"Whoa, these CDOs look too good to be true with their 20% gains and what not. I better insure these investments\". So, the bought Credit Default Swaps from AIG and other insurers to insure not only their CDOs, but their Mortgage Backed Securities, as well. Then, along comes a little whisper from the shadows that says \"hey, I heard Bear Sterns is cooking the books\". I heard it, my cousin heard it, my friends heard it, every investor heard it. And, next thing you know, Bear is the focus of every late night news and business show being asked why they are insolvent (even though, they weren't....Yet). Then, the when crap starts to hit the fan on Bears stock prices as everybody is yelling sell, sell, sell the Fed comes in and says \"Hey, JPM! We'll give you a non-recourse loan of $29 billion if you buy Bear for $1.2 billion, whataya think\"? JPM say \"heck Yes!! Whoohoo!!! I'm rich, Bicht!\" Meanwhile, the can of worms has been opened. The Fed and Treasury finally say that they are going to look into the eye of moral hazard and let Lehman fall to show that they have cajones. Only, it isn't until after they look at the books that they realize how intertwined Lehman was with just about every investment firm and bank on the planet. Next thing you know, the whole thing has broke loose. There is no stopping it. When, in all of this did Congress have a say, or even know what in the hell was going on, before and during the unfolding of this? Sure, the Republicans did it. No, the banks and investment firms did this. Everybody kept shelling risk to save their behind. Never realizing the web that they were spinning. And, quite a web it is. Ever heard of that 'ol 'six degrees of seperation'? Well, there is maybe 2-3 degrees of seperation between just about every major bank and investment firm on the planet in this case. This was all done outside of government. And, one might ask, \"why didn't the government do something?\" Because they had and still have absolutely no idea how this stuff works. Even Allen Greenspan has said he doesn't understand how a CDO works. The guys that were selling these investments don't even know. And, no matter what regulation or law you write, the private sector is always ahead of Congress. Even if Congress (which was Controlled by the Democrats, by the way) had any idea of the scope of this problem, they wouldn't have been able to get legislation drafted, get it through Committee, get it out on the floor of the House, get it out on the floor of the Senate, get it passed in both, and then get it bottom lined by El Presidente. It just doesn't work like that. One would say that we need more regulation. Bullcrap! We are already heavily regulated. Plus, there are countless countries that have even heavier regulation than ours. But, notice that those other countries are in the same boat. And, as is known, the private sector is always ahead of the game. That is capitalism at it's finest. The main problem is that the banks are so interconnected to our economy. Our money is created when somebody borrows. Our money is backed by the debt that we create through the issuing of credit from the banks. As a matter of fact, if everybody in the world were to pay off all of their debt, there would be no money. It is true. So, it goes without saying that it is the FIAT system that is the problem. And, Congress is doing the worst possible thing imaginable. They are increasing the money supply through legislation to insane levels in an attempt to fill the void that public debt obligations left. You see, normally when somebody loses money, somebody else makes money. But, in this case, the money just vanished into thin air. That is only possible in a FIAT money system. And, Congress and the Fed are chasing that void thinking they are going to catch up with it. They may... But, we are going to be bankrupt and owned by the private banks. Another option is to let them all fail. I personally believe this is going to happen anyway. We are chasing something that we do not have the resources to catch. We might, but I doubt it. But, if we do let them fail our entire financial and money system will collapse. The Fed will be gone, the dollar will cease to have value. We will pretty much have to start from scratch. It isn't a pretty thought, but after taking into consideration the alternative, it may be our best bet. It would be nice to not have inflation anymore. It would be nice to do away with the discount window. I would like interest rates to be determine by the market for once. But, we will more than likely fight this to the end and be indebted to our creditors for the unforeseen future. The last option, of which has been only talked about recently in the mainstream (but, has been a conspiracy theory for quite some time) is that all of the Central Banks come together to form a single regulatory and monetary entity. This will probably fix the problem. But, I think most of us are aware of the implications of this. Basically, say goodbye to sovereignty. Say goodbye to the 'American Dream'. Plus, we will still be under a FIAT system. So, the problems of that system will present themselves again as they have in every usage since the Roman Empire. So, before you go pointing fingers, it would be prudent to know what you are talking about in the first place. Carry on. This message has been edited. Last edited by: 10Tenths, Wed 11 March 2009 12:02 AM", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-10 23:28:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: One would say that we need more regulation. Bullcrap! We are already heavily regulated. That is your opinion, but one shared by only a few misguided malcontents.....and libertarians.", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "One would say that we need more regulation. Bullcrap! We are already heavily regulated.", 
        "reply": " That is your opinion, but one shared by only a few misguided malcontents.....and libertarians.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 05:39:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Well he got his social engineering bill passed so now he has to try to fix the economy right so why not another since the first one had nothing to do with the economy.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "", 
        "reply": "Well he got his social engineering bill passed so now he has to try to fix the economy right so why not another since the first one had nothing to do with the economy.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 05:49:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering?", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "social engineering bill", 
        "reply": " ???? His first bill was Lilly Ledbetter Act, that is social engineering?", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:12:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about.", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering?", 
        "reply": " OH pls, you know damn well which bill we are talking about.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:14:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it. You mean dumbazzes like Frank and Dod? Dumbazzes like the Democrats that obstructed the proposed regulations by Clinton and Bush? Are you refering to THOSE dumbazzes or just the crowd you hang with?", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Originally posted by FrJohn1123: There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it.", 
        "reply": " You mean dumbazzes like Frank and Dod? Dumbazzes like the Democrats that obstructed the proposed regulations by Clinton and Bush? Are you refering to THOSE dumbazzes or just the crowd you hang with?", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:19:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: You cannot legislate the poor into freedom by legislating the wealthy out of freedom. What one person receives without working for, another person must work for without receiving. The government cannot give to anybody anything that the government does not first take from somebody else. When half of the people get the idea that they do not have to work because the other half is going to take care of them, and when the other half gets the idea that it does no good to work because somebody else is going to get what they work for, that, my dear friend, is about the end of any nation. You cannot multiply wealth by dividing it. Dr. Adrian Pierce Rogers (September 12, 1931 - November 15, 2005) of Love Worth Finding Ministries, Pastor Emeritus of Bellevue Baptist Church. \"The World's Finest\"", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "You cannot legislate the poor into freedom by legislating the wealthy out of freedom. What one person receives without working for, another person must work for without receiving. The government cannot give to anybody anything that the government does not first take from somebody else. When half of the people get the idea that they do not have to work because the other half is going to take care of them, and when the other half gets the idea that it does no good to work because somebody else is going to get what they work for, that, my dear friend, is about the end of any nation. You cannot multiply wealth by dividing it.", 
        "reply": " Dr. Adrian Pierce Rogers (September 12, 1931 - November 15, 2005) of Love Worth Finding Ministries, Pastor Emeritus of Bellevue Baptist Church. \"The World's Finest\"", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:27:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. If you are talking about his stimulus bill, give it a rest. If it fails, we'll talk about, otherwise give it a rest. You guys crack me up. Bush appointed Bernanke and Paulson, it was their pleas that lead the new administration to pass this bill in response to the crash. So it is no wonder that the majority of Americans are backing Obama on this issue.", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about.", 
        "reply": " If you are talking about his stimulus bill, give it a rest. If it fails, we'll talk about, otherwise give it a rest. You guys crack me up. Bush appointed Bernanke and Paulson, it was their pleas that lead the new administration to pass this bill in response to the crash. So it is no wonder that the majority of Americans are backing Obama on this issue.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:28:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it. You mean dumbazzes like Frank and Dod? Dumbazzes like the Democrats that obstructed the proposed regulations by Clinton and Bush? Are you refering to THOSE dumbazzes or just the crowd you hang with? Blame game can go on forever, along with insults. Have fun with that.", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: There will be another, no question. Some will continue to obstruct in spite of all that is at risk. They are the same dumb asses that got us here in the first place and still refuse to get it. You mean dumbazzes like Frank and Dod? Dumbazzes like the Democrats that obstructed the proposed regulations by Clinton and Bush? Are you refering to THOSE dumbazzes or just the crowd you hang with?", 
        "reply": " Blame game can go on forever, along with insults. Have fun with that.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:32:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. If you are talking about his stimulus bill, give it a rest. If it fails, we'll talk about, otherwise give it a rest. You guys crack me up. Bush appointed Bernanke and Paulson, it was their pleas that lead the new administration to pass this bill in response to the crash. So it is no wonder that the majority of Americans are backing Obama on this issue. The dems bailout bill with GB2's signature didnt have social programs on it. And Pelosis and Obama's did. See the difference. besides repubs/conserv were against it. This housing bill, you tink americans are onboard with it, scammers getting over while people who did what was expected of them pay for it? And it is not just people on the right that see a problem with what he has done. quote: First it was that chaotic pig rut of a stimulus package, which let House Democrats throw a thousand crazy kitchen sinks into what should have been a focused blueprint for economic recovery. Then it was the stunt of unnerving Wall Street by sending out a shrill duo of slick geeks (Timothy Geithner and Peter Orszag) as the administration's weirdly adolescent spokesmen on economics. Who could ever have confidence in that sorry pair? 'http://www.salon.com/opinion/paglia/2009/03/11/mercury/' Paglia", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. If you are talking about his stimulus bill, give it a rest. If it fails, we'll talk about, otherwise give it a rest. You guys crack me up. Bush appointed Bernanke and Paulson, it was their pleas that lead the new administration to pass this bill in response to the crash. So it is no wonder that the majority of Americans are backing Obama on this issue.", 
        "reply": " The dems bailout bill with GB2's signature didnt have social programs on it. And Pelosis and Obama's did. See the difference. besides repubs/conserv were against it. This housing bill, you tink americans are onboard with it, scammers getting over while people who did what was expected of them pay for it? And it is not just people on the right that see a problem with what he has done. quote: First it was that chaotic pig rut of a stimulus package, which let House Democrats throw a thousand crazy kitchen sinks into what should have been a focused blueprint for economic recovery. Then it was the stunt of unnerving Wall Street by sending out a shrill duo of slick geeks (Timothy Geithner and Peter Orszag) as the administration's weirdly adolescent spokesmen on economics. Who could ever have confidence in that sorry pair? 'http://www.salon.com/opinion/paglia/2009/03/11/mercury/' Paglia", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:37:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. If you are talking about his stimulus bill, give it a rest. If it fails, we'll talk about, otherwise give it a rest. You guys crack me up. Bush appointed Bernanke and Paulson, it was their pleas that lead the new administration to pass this bill in response to the crash. So it is no wonder that the majority of Americans are backing Obama on this issue. The dems bailout bill with GB2's signature didnt have social programs on it. And Pelosis and Obama's did. See the difference. besides repubs/conserv were against it. This housing bill, you tink americans are onboard with it, scammers getting over while people who did what was expected of them pay for it? See the difference? Yes I do, the republican party is out and yes the American people are on board with it. Their votes prove that.", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. If you are talking about his stimulus bill, give it a rest. If it fails, we'll talk about, otherwise give it a rest. You guys crack me up. Bush appointed Bernanke and Paulson, it was their pleas that lead the new administration to pass this bill in response to the crash. So it is no wonder that the majority of Americans are backing Obama on this issue. The dems bailout bill with GB2's signature didnt have social programs on it. And Pelosis and Obama's did. See the difference. besides repubs/conserv were against it. This housing bill, you tink americans are onboard with it, scammers getting over while people who did what was expected of them pay for it?", 
        "reply": " See the difference? Yes I do, the republican party is out and yes the American people are on board with it. Their votes prove that.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:38:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: See the difference? Yes I do, the republican party is out.", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "See the difference? Yes I do, the republican party is out.", 
        "reply": "", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:41:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. Don't accuse the good friar of acting dumb, it ain't no act.", 
        "intTime": 20090311, 
        "postID": 16, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about.", 
        "reply": " Don't accuse the good friar of acting dumb, it ain't no act.", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 06:57:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. Don't accuse the good friar of acting dumb, it ain't no act. Pretty early for insults? Like second grade early. WWMD? This message has been edited. Last edited by: FrJohn1123, Wed 11 March 2009 07:48 AM", 
        "intTime": 20090311, 
        "postID": 17, 
        "quote": "Originally posted by transport1: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: social engineering bill ???? His first bill was Lilly Ledbetter Act, that is social engineering? OH pls, you know damn well which bill we are talking about. Don't accuse the good friar of acting dumb, it ain't no act.", 
        "reply": " Pretty early for insults? Like second grade early. WWMD? This message has been edited. Last edited by: FrJohn1123, Wed 11 March 2009 07:48 AM", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-11 07:30:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090320, 
        "postID": 18, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_3330005712001", 
        "time": "2009-03-20 09:54:00", 
        "title": "House Dems eyeing another stimulus bill?", 
        "userID": "Kegler300"
    }
]