[
    {
        "content": "Dear Senator Shelby: Thank you for your response to my letter concerning the outsourcing of AIDS-preventing condoms to China and Korea by USAID at the potential expense of 300 jobs at Alatech in Alabama. I expressed disappointment that this was happening even as the objective of Congress and the Administration (at the long term expense of the American taxpayer) is to preserve and increase jobs. I found this paragraph quoted from your response to be of particular interest. quote: I understand your concerns regarding the possibility of a USAID contract being awarded to a foreign company. Outsourcing contracts to foreign countries is often rooted in the fact that Americans tend to receive higher wages than workers in less prosperous nations. Many times foreign-based companies can offer cheaper products simply because wages are significantly lower in foreign nations. No sh*t, Sherlock? Brilliant! Whoever would have thunk it – perhaps you should surrender your seat and go teach economics at the University of Alabama. After carefully considering the quality of your response, the fact that you never addressed my clearly stated concern, and assuming you to be representative of the whole mass of congresscritters, I have come to the conclusion that we should outsource the entirety of the U.S. Congress to the low bidder. Undoubtedly we would get a better product at far less cost. Perhaps we could even get a quantity discount. Regards – A constituent and former supporter", 
        "intTime": 20090412, 
        "postID": 1, 
        "quote": "I understand your concerns regarding the possibility of a USAID contract being awarded to a foreign company. Outsourcing contracts to foreign countries is often rooted in the fact that Americans tend to receive higher wages than workers in less prosperous nations. Many times foreign-based companies can offer cheaper products simply because wages are significantly lower in foreign nations.", 
        "reply": "Dear Senator Shelby: Thank you for your response to my letter concerning the outsourcing of AIDS-preventing condoms to China and Korea by USAID at the potential expense of 300 jobs at Alatech in Alabama. I expressed disappointment that this was happening even as the objective of Congress and the Administration (at the long term expense of the American taxpayer) is to preserve and increase jobs. I found this paragraph quoted from your response to be of particular interest.  No sh*t, Sherlock? Brilliant! Whoever would have thunk it – perhaps you should surrender your seat and go teach economics at the University of Alabama. After carefully considering the quality of your response, the fact that you never addressed my clearly stated concern, and assuming you to be representative of the whole mass of congresscritters, I have come to the conclusion that we should outsource the entirety of the U.S. Congress to the low bidder. Undoubtedly we would get a better product at far less cost. Perhaps we could even get a quantity discount. Regards – A constituent and former supporter", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-12 09:59:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "", 
        "intTime": 20090412, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-12 10:57:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "What kind of representative is he? He stated it in his reply to you. A very POOR ONE and should be voted out of office next election.", 
        "intTime": 20090412, 
        "postID": 3, 
        "quote": "", 
        "reply": "What kind of representative is he? He stated it in his reply to you. A very POOR ONE and should be voted out of office next election.", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-12 11:02:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "9475297"
    }, 
    {
        "content": "quote: What kind of representative is he? Looks like a typical one to me.", 
        "intTime": 20090412, 
        "postID": 4, 
        "quote": "What kind of representative is he?", 
        "reply": " Looks like a typical one to me.", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-12 11:08:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "A typical \"formula letter\" you know the assistant says to the \"intern\" On these, letter A,B and D, on these, letter c, g, d and f all in that order, signature by \"auto pen\", get right on it!\" If you reply that you're no0t an idiot and find the reply non-responsive and insulting, you will find yourself roundfiled from then on.", 
        "intTime": 20090412, 
        "postID": 5, 
        "quote": "", 
        "reply": "A typical \"formula letter\" you know the assistant says to the \"intern\" On these, letter A,B and D, on these, letter c, g, d and f all in that order, signature by \"auto pen\", get right on it!\" If you reply that you're no0t an idiot and find the reply non-responsive and insulting, you will find yourself roundfiled from then on.", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-12 12:25:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: A typical \"formula letter\" you know the assistant says to the \"intern\" On these, letter A,B and D, on these, letter c, g, d and f all in that order, signature by \"auto pen\", get right on it!\" If you reply that you're no0t an idiot and find the reply non-responsive and insulting, you will find yourself roundfiled from then on. I think you nailed that one!", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "Originally posted by peter3_1: A typical \"formula letter\" you know the assistant says to the \"intern\" On these, letter A,B and D, on these, letter c, g, d and f all in that order, signature by \"auto pen\", get right on it!\" If you reply that you're no0t an idiot and find the reply non-responsive and insulting, you will find yourself roundfiled from then on.", 
        "reply": " I think you nailed that one!", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-13 06:31:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Shelby is my senator, too, and he's so out of touch. A real Hoover Republican. He has foreign masters in the auto industry that he cannot offend. That's why Korea got the condom contract and took it away from Ala. He was one of 19 senators to vote AGAINST the expansion of AMERICORPS a few weeks ago. I mean, come on, dude! I hate this guy.", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "", 
        "reply": "Shelby is my senator, too, and he's so out of touch. A real Hoover Republican. He has foreign masters in the auto industry that he cannot offend. That's why Korea got the condom contract and took it away from Ala. He was one of 19 senators to vote AGAINST the expansion of AMERICORPS a few weeks ago. I mean, come on, dude! I hate this guy.", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-13 07:12:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "vsibaby"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: qwert Not sure what you are arguing here. Is it that you are upset at the generic (I should say dumbed down) answer you received? Or that you are speaking of the greater issue of trade (protectionism vs free trade)? Oh and side: what does that DA stand for in the title? LOL Dave ... a little of all of the above. Venting a bit at the non-answer I received, expressing irritation that at the same time we are spending billions of taxpayer dollars to stimulate the economy and, particularly, create jobs, we are sending orders overseas for condoms to send elsewhere overseas ... at the cost of jobs in the U.S. ... DA is dumb-ass ... no shot at Dems here ... he's a Rep.", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "Originally posted by dmuhler: qwert Not sure what you are arguing here. Is it that you are upset at the generic (I should say dumbed down) answer you received? Or that you are speaking of the greater issue of trade (protectionism vs free trade)? Oh and side: what does that DA stand for in the title?", 
        "reply": " LOL Dave ... a little of all of the above. Venting a bit at the non-answer I received, expressing irritation that at the same time we are spending billions of taxpayer dollars to stimulate the economy and, particularly, create jobs, we are sending orders overseas for condoms to send elsewhere overseas ... at the cost of jobs in the U.S. ... DA is dumb-ass ... no shot at Dems here ... he's a Rep.", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-13 13:24:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by vsibaby: Shelby is my senator, too, and he's so out of touch. A real Hoover Republican. He has foreign masters in the auto industry that he cannot offend. That's why Korea got the condom contract and took it away from Ala. He was one of 19 senators to vote AGAINST the expansion of AMERICORPS a few weeks ago. I mean, come on, dude! I hate this guy. He also voted for the Omnibus appropriations bill and was #2 on the pork list ... squarely behind (but closing on) Sen Byrd.", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "Originally posted by vsibaby: Shelby is my senator, too, and he's so out of touch. A real Hoover Republican. He has foreign masters in the auto industry that he cannot offend. That's why Korea got the condom contract and took it away from Ala. He was one of 19 senators to vote AGAINST the expansion of AMERICORPS a few weeks ago. I mean, come on, dude! I hate this guy.", 
        "reply": " He also voted for the Omnibus appropriations bill and was #2 on the pork list ... squarely behind (but closing on) Sen Byrd.", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-13 13:27:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: What kind of representative is he? Looks like a typical one to me. & that CJ, is the whole problem!", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: quote: What kind of representative is he? Looks like a typical one to me.", 
        "reply": " & that CJ, is the whole problem!", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-13 13:57:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "67NOV"
    }, 
    {
        "content": "Dumb...they are far from it! They're smart enough to have gotten elected and they are now enjoying the gravy train of elected office in the Congress. Those who were not wealthy when they arrived will almost certainly be far wealthier when the finally leave, and those who were already wealthy prior to their arrival in the hallowed halls of Congress will undoubtedly be more wealthy when they depart. Both sides of the aisle...November 2010...nobody in Congress is allowed to run for reelection and all terms end for every member of Congress...only new (not even old ones who have been out of office) candidates can run for Congress... S/F Gordon", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "", 
        "reply": "Dumb...they are far from it! They're smart enough to have gotten elected and they are now enjoying the gravy train of elected office in the Congress. Those who were not wealthy when they arrived will almost certainly be far wealthier when the finally leave, and those who were already wealthy prior to their arrival in the hallowed halls of Congress will undoubtedly be more wealthy when they depart. Both sides of the aisle...November 2010...nobody in Congress is allowed to run for reelection and all terms end for every member of Congress...only new (not even old ones who have been out of office) candidates can run for Congress... S/F Gordon", 
        "threadID": "409192893_6000025022001", 
        "time": "2009-04-13 14:22:00", 
        "title": "An Open Letter to Senator Shelby (DA, AL)", 
        "userID": "uh34d"
    }
]