[
    {
        "content": "+++http://www.realclearpolitics.com/articles/2009/03/president_double_talk.html WASHINGTON -- To those who believe that Barack Obama is a different kind of politician -- more honest, more courageous -- please don't examine his administration's budget. If you do, you may sadly conclude that he resembles presidents stretching back to John Kennedy in one crucial respect. He won't tax voters for all the government services they want. That's the main reason we've run budget deficits in 43 of the past 48 years. Obama is a great pretender. He repeatedly says he's doing things that he isn't, trusting his powerful rhetoric to obscure the difference. He has made \"responsibility\" a personal theme; the budget's cover line is \"A New Era of Responsibility.\" He says the budget begins \"making the tough choices necessary to restore fiscal discipline.\" It doesn't. +++http://www.chicagotribune.com/news/politics/obama/chi-obama-agenda_for_monmar09,0,4721344.story Fissures among Democratic lawmakers have already emerged. Rep. Eric Massa is a Democrat in a rural New York district where dairy farms and wineries have a major presence. The budget blueprint that Obama released last month would phase out subsidies to farmers with sales exceeding $500,000 a year. Rep. Harry Mitchell is a Democrat who represents a predominantly Republican district in suburban Phoenix. Mitchell said he cannot support provisions in Obama's budget that would raise the capital gains tax for couples earning more than $250,000 and halt the repeal of the estate tax in 2010. If the White House won't relent, Mitchell said he would need to think carefully about whether to vote for the president's budget.", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.realclearpolitics.com/articles/2009/03/president_double_talk.html WASHINGTON -- To those who believe that Barack Obama is a different kind of politician -- more honest, more courageous -- please don't examine his administration's budget. If you do, you may sadly conclude that he resembles presidents stretching back to John Kennedy in one crucial respect. He won't tax voters for all the government services they want. That's the main reason we've run budget deficits in 43 of the past 48 years. Obama is a great pretender. He repeatedly says he's doing things that he isn't, trusting his powerful rhetoric to obscure the difference. He has made \"responsibility\" a personal theme; the budget's cover line is \"A New Era of Responsibility.\" He says the budget begins \"making the tough choices necessary to restore fiscal discipline.\" It doesn't. +++http://www.chicagotribune.com/news/politics/obama/chi-obama-agenda_for_monmar09,0,4721344.story Fissures among Democratic lawmakers have already emerged. Rep. Eric Massa is a Democrat in a rural New York district where dairy farms and wineries have a major presence. The budget blueprint that Obama released last month would phase out subsidies to farmers with sales exceeding $500,000 a year. Rep. Harry Mitchell is a Democrat who represents a predominantly Republican district in suburban Phoenix. Mitchell said he cannot support provisions in Obama's budget that would raise the capital gains tax for couples earning more than $250,000 and halt the repeal of the estate tax in 2010. If the White House won't relent, Mitchell said he would need to think carefully about whether to vote for the president's budget.", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 05:57:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "threerings"
    }, 
    {
        "content": "I posted a while back that what the President has to look out for is folks within his own party.", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "", 
        "reply": "I posted a while back that what the President has to look out for is folks within his own party.", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 08:32:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "67NOV"
    }, 
    {
        "content": "Harry and Nancy have been making noises since the election, even before the inauguration, and now they are getting louder. Think they won't get a group of demo senators behind them when needed.", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "", 
        "reply": "Harry and Nancy have been making noises since the election, even before the inauguration, and now they are getting louder. Think they won't get a group of demo senators behind them when needed.", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 08:35:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "transport1"
    }, 
    {
        "content": "The dice have been cast, and Obama has won. He will take what is his and there's little we can do about it--for now. We need to stand in formation and stand fast. We will get hit and we will get hurt--badly. But we need to stand fast and be ready when we're called to man the firing line. Because if we leave it up to Obama's men that line will be deserted. Did I just accuse the POTUS of being a deserter? No, I did not. I'm accusing him of being something far worse. Mr. Obama, you have at your hands the lives of men and women far better than you will ever be. Do not throw those lives away for some sure to be fleeting foreign policy glory. There are those of us who respect those lives and we respect them far more than we respect you....", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "", 
        "reply": "The dice have been cast, and Obama has won. He will take what is his and there's little we can do about it--for now. We need to stand in formation and stand fast. We will get hit and we will get hurt--badly. But we need to stand fast and be ready when we're called to man the firing line. Because if we leave it up to Obama's men that line will be deserted. Did I just accuse the POTUS of being a deserter? No, I did not. I'm accusing him of being something far worse. Mr. Obama, you have at your hands the lives of men and women far better than you will ever be. Do not throw those lives away for some sure to be fleeting foreign policy glory. There are those of us who respect those lives and we respect them far more than we respect you....", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 18:40:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "ipw533"
    }, 
    {
        "content": "I wonder if there is anyone in government who monitors the comments here... as I see it this place is a good barometer of how a vast majority of Americana feels/thinks. Obama was selling ice cream in his campaign, now he's in and like you said ipw... we need to man the trenches, clackers in hand. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "", 
        "reply": "I wonder if there is anyone in government who monitors the comments here... as I see it this place is a good barometer of how a vast majority of Americana feels/thinks. Obama was selling ice cream in his campaign, now he's in and like you said ipw... we need to man the trenches, clackers in hand. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 18:51:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "The liberals on the far end of the scale have been going after him since the first day of his Presidency. These guys want to apply some scorched earth policy toward the Bush Administration, just undo everything he did, throw them all in jail, etc. Silly...", 
        "intTime": 20090309, 
        "postID": 6, 
        "quote": "", 
        "reply": "The liberals on the far end of the scale have been going after him since the first day of his Presidency. These guys want to apply some scorched earth policy toward the Bush Administration, just undo everything he did, throw them all in jail, etc. Silly...", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 19:38:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Guys, stand fast. Now is the time we most need the discipline the military taught us. When this wild ride is over our countrymen will need us to dig them out. I don't have a crystal ball and I don't see where this crap is leading us but I can sense that it's not a good place. When wee eventually land we will need the skills and discipline that military folk have. Stand ready--you will be needed.....", 
        "intTime": 20090309, 
        "postID": 7, 
        "quote": "", 
        "reply": "Guys, stand fast. Now is the time we most need the discipline the military taught us. When this wild ride is over our countrymen will need us to dig them out. I don't have a crystal ball and I don't see where this crap is leading us but I can sense that it's not a good place. When wee eventually land we will need the skills and discipline that military folk have. Stand ready--you will be needed.....", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 19:50:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "ipw533"
    }, 
    {
        "content": "quote: Originally posted by ipw533: The dice have been cast, and Obama has won. He will take what is his and there's little we can do about it--for now. We need to stand in formation and stand fast. We will get hit and we will get hurt--badly. But we need to stand fast and be ready when we're called to man the firing line. Because if we leave it up to Obama's men that line will be deserted. Did I just accuse the POTUS of being a deserter? No, I did not. I'm accusing him of being something far worse. Mr. Obama, you have at your hands the lives of men and women far better than you will ever be. Do not throw those lives away for some sure to be fleeting foreign policy glory. There are those of us who respect those lives and we respect them far more than we respect you.... Did you say that to the last Administration, and the people associated with it? Those guys were so bad, that almost 3/4ths of the ones who rode it out to the end of his last term can't even find a job. I was having lunch with a potential business partner a couple of weeks ago and saw the former AG in the restaurant. That poor guy has an incredible pedigree - Harvard law degree, general counsel to the Governor of Texas, Secretary of the State of Texas, Texas Supreme Court Justice, White House Counsel, and Attorney General of the United States - and he can't even find a job right now. The former Vice President's Chief of Staff can't find a job. And it goes down the line... I find it very troubling that there's so much open talk about opposing this President, and even to the point where (from what I read), there's open discussion about revolt?? Now, many people may not take all this seriously, but there are a million Tim McVeighs out there. Think about what you're doing. Many of you oppose this President for who he is, not what he's done. He hasn't even been office for two months. Most of his policies are typical liberal Democrat policies. The more serious of them are in an attempt to make something out of what has been almost obliterated over the past eight years. Yes, there will be changes, but our form of government won't change, and we certainly won't convert from a capitalist to a socialist society. I find that whole piece of madness to be nothing more than a cover for something more raw and basic. There's no way in Hell that Congress will allow him to do that. He's only one guy. But this \"bubba revolt\" or whatever it is - it's nonsense. You should possess the situation awareness to know by now that the more you talk this kind of crap openly, the greater the odds that some wack job will come out of the woodwork and act on it. And I don't think you really want that. You want to keep the Fed out of your life - stop talking nonsense. I'm really disappointed that the moderators allow this. This is worse than that Bush-era \"no CiC bashing.\" Such a black mark on an otherwise great site.", 
        "intTime": 20090309, 
        "postID": 8, 
        "quote": "Originally posted by ipw533: The dice have been cast, and Obama has won. He will take what is his and there's little we can do about it--for now. We need to stand in formation and stand fast. We will get hit and we will get hurt--badly. But we need to stand fast and be ready when we're called to man the firing line. Because if we leave it up to Obama's men that line will be deserted. Did I just accuse the POTUS of being a deserter? No, I did not. I'm accusing him of being something far worse. Mr. Obama, you have at your hands the lives of men and women far better than you will ever be. Do not throw those lives away for some sure to be fleeting foreign policy glory. There are those of us who respect those lives and we respect them far more than we respect you....", 
        "reply": " Did you say that to the last Administration, and the people associated with it? Those guys were so bad, that almost 3/4ths of the ones who rode it out to the end of his last term can't even find a job. I was having lunch with a potential business partner a couple of weeks ago and saw the former AG in the restaurant. That poor guy has an incredible pedigree - Harvard law degree, general counsel to the Governor of Texas, Secretary of the State of Texas, Texas Supreme Court Justice, White House Counsel, and Attorney General of the United States - and he can't even find a job right now. The former Vice President's Chief of Staff can't find a job. And it goes down the line... I find it very troubling that there's so much open talk about opposing this President, and even to the point where (from what I read), there's open discussion about revolt?? Now, many people may not take all this seriously, but there are a million Tim McVeighs out there. Think about what you're doing. Many of you oppose this President for who he is, not what he's done. He hasn't even been office for two months. Most of his policies are typical liberal Democrat policies. The more serious of them are in an attempt to make something out of what has been almost obliterated over the past eight years. Yes, there will be changes, but our form of government won't change, and we certainly won't convert from a capitalist to a socialist society. I find that whole piece of madness to be nothing more than a cover for something more raw and basic. There's no way in Hell that Congress will allow him to do that. He's only one guy. But this \"bubba revolt\" or whatever it is - it's nonsense. You should possess the situation awareness to know by now that the more you talk this kind of crap openly, the greater the odds that some wack job will come out of the woodwork and act on it. And I don't think you really want that. You want to keep the Fed out of your life - stop talking nonsense. I'm really disappointed that the moderators allow this. This is worse than that Bush-era \"no CiC bashing.\" Such a black mark on an otherwise great site.", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 19:52:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by ipw533: Guys, stand fast. Now is the time we most need the discipline the military taught us. When this wild ride is over our countrymen will need us to dig them out. I don't have a crystal ball and I don't see where this crap is leading us but I can sense that it's not a good place. When wee eventually land we will need the skills and discipline that military folk have. Stand ready--you will be needed..... What the hell does that mean?", 
        "intTime": 20090309, 
        "postID": 9, 
        "quote": "Originally posted by ipw533: Guys, stand fast. Now is the time we most need the discipline the military taught us. When this wild ride is over our countrymen will need us to dig them out. I don't have a crystal ball and I don't see where this crap is leading us but I can sense that it's not a good place. When wee eventually land we will need the skills and discipline that military folk have. Stand ready--you will be needed.....", 
        "reply": " What the hell does that mean?", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 19:56:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "McGreer, I'd like to think you and I are friends. So while I don't always agree with you I will treat you as a friend. That said, I'm gonna have to disagree with you. I'm not advocating revolt in the armed sense--I've studied history and I've seen where the Civil War led us--for good and bad. We're dangerously close to the point where were in the 1850s--if you can't see that maybe you need new glasses. Like it or not--and I don't--there's been a revolution going on in this country since the 1960s. We are now at the endgame stage of that revolution. We either stand up and say \"No more!\" or we aid those who would turn America into what it was meant to oppose---a tyranny. Yeah, I know that by telling the Emperor that he's naked I'm exposing myself to risk. I'm a soldier--what else would I do?....", 
        "intTime": 20090309, 
        "postID": 10, 
        "quote": "", 
        "reply": "McGreer, I'd like to think you and I are friends. So while I don't always agree with you I will treat you as a friend. That said, I'm gonna have to disagree with you. I'm not advocating revolt in the armed sense--I've studied history and I've seen where the Civil War led us--for good and bad. We're dangerously close to the point where were in the 1850s--if you can't see that maybe you need new glasses. Like it or not--and I don't--there's been a revolution going on in this country since the 1960s. We are now at the endgame stage of that revolution. We either stand up and say \"No more!\" or we aid those who would turn America into what it was meant to oppose---a tyranny. Yeah, I know that by telling the Emperor that he's naked I'm exposing myself to risk. I'm a soldier--what else would I do?....", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 20:21:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "ipw533"
    }, 
    {
        "content": "My point here is that there are lots of people who take this kind of stuff to the extreme. It's why I'm cautioning you (as a friend). Please be careful. We have freedom of speech, but that freedom carries responsibility. And consider that, if the previous crew had exercised due diligence (and enabled by their political supporters), we wouldn't be at this point.", 
        "intTime": 20090309, 
        "postID": 11, 
        "quote": "", 
        "reply": "My point here is that there are lots of people who take this kind of stuff to the extreme. It's why I'm cautioning you (as a friend). Please be careful. We have freedom of speech, but that freedom carries responsibility. And consider that, if the previous crew had exercised due diligence (and enabled by their political supporters), we wouldn't be at this point.", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 20:29:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "You're right--a lot of people will get the wrong message. And I do not want to be seen as an advocate of rebellion. But we do seem to be running out of alternatives. In a perfect world I'd advise people to vote, but that was perverted and we now have what we have. We can still correct this by peaceful means. In 2010 we can elect a Congress that will do what we need and not what it wants, and in 2012 we can send Mr. Obama back to Chicago. As long as those mechanisms remain in place I'm willing to play by the rules. Get rid of them then anything goes.....", 
        "intTime": 20090309, 
        "postID": 12, 
        "quote": "", 
        "reply": "You're right--a lot of people will get the wrong message. And I do not want to be seen as an advocate of rebellion. But we do seem to be running out of alternatives. In a perfect world I'd advise people to vote, but that was perverted and we now have what we have. We can still correct this by peaceful means. In 2010 we can elect a Congress that will do what we need and not what it wants, and in 2012 we can send Mr. Obama back to Chicago. As long as those mechanisms remain in place I'm willing to play by the rules. Get rid of them then anything goes.....", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 20:45:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "ipw533"
    }, 
    {
        "content": "I only have two words to say...TERM LIMITS for all politicians! It's the only way they will stay in touch with Americana! JMHO, I could be wrong...", 
        "intTime": 20090309, 
        "postID": 13, 
        "quote": "", 
        "reply": "I only have two words to say...TERM LIMITS for all politicians! It's the only way they will stay in touch with Americana! JMHO, I could be wrong...", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 22:25:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by ipw533: You're right--a lot of people will get the wrong message. And I do not want to be seen as an advocate of rebellion. But we do seem to be running out of alternatives. In a perfect world I'd advise people to vote, but that was perverted and we now have what we have. We can still correct this by peaceful means. In 2010 we can elect a Congress that will do what we need and not what it wants, and in 2012 we can send Mr. Obama back to Chicago. As long as those mechanisms remain in place I'm willing to play by the rules. Get rid of them then anything goes..... 2010 will be another GOP debacle....8 years of bush...no one has forgotten...no one", 
        "intTime": 20090309, 
        "postID": 14, 
        "quote": "Originally posted by ipw533: You're right--a lot of people will get the wrong message. And I do not want to be seen as an advocate of rebellion. But we do seem to be running out of alternatives. In a perfect world I'd advise people to vote, but that was perverted and we now have what we have. We can still correct this by peaceful means. In 2010 we can elect a Congress that will do what we need and not what it wants, and in 2012 we can send Mr. Obama back to Chicago. As long as those mechanisms remain in place I'm willing to play by the rules. Get rid of them then anything goes.....", 
        "reply": " 2010 will be another GOP debacle....8 years of bush...no one has forgotten...no one", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-09 23:28:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: You're right--a lot of people will get the wrong message. And I do not want to be seen as an advocate of rebellion. But we do seem to be running out of alternatives. In a perfect world I'd advise people to vote, but that was perverted and we now have what we have. We can still correct this by peaceful means. In 2010 we can elect a Congress that will do what we need and not what it wants, and in 2012 we can send Mr. Obama back to Chicago. As long as those mechanisms remain in place I'm willing to play by the rules. Get rid of them then anything goes..... what ever. when November 2012 gets here you'll still be whining on the intratubes just like you are now talking about your \"revolution\" and how the time will be \"soon\". But \"soon\" never gets here and you go to work and pay your taxes just like everyone else.", 
        "intTime": 20090310, 
        "postID": 15, 
        "quote": "You're right--a lot of people will get the wrong message. And I do not want to be seen as an advocate of rebellion. But we do seem to be running out of alternatives. In a perfect world I'd advise people to vote, but that was perverted and we now have what we have. We can still correct this by peaceful means. In 2010 we can elect a Congress that will do what we need and not what it wants, and in 2012 we can send Mr. Obama back to Chicago. As long as those mechanisms remain in place I'm willing to play by the rules. Get rid of them then anything goes.....", 
        "reply": " what ever. when November 2012 gets here you'll still be whining on the intratubes just like you are now talking about your \"revolution\" and how the time will be \"soon\". But \"soon\" never gets here and you go to work and pay your taxes just like everyone else.", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-10 00:46:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Everyone knows Nancy is the one running this country not Obama.", 
        "intTime": 20090310, 
        "postID": 16, 
        "quote": "", 
        "reply": "Everyone knows Nancy is the one running this country not Obama.", 
        "threadID": "409192893_6530023712001", 
        "time": "2009-03-10 03:45:00", 
        "title": "The worm begins to turn... Liberals pushing back against Obama..", 
        "userID": "Duster6"
    }
]