[
    {
        "content": "methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "intTime": 20090330, 
        "postID": 1, 
        "quote": "", 
        "reply": "methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-03-30 17:12:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "skytail"
    }, 
    {
        "content": "quote: Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians I do not think you look at history close enough. Those countries you mentioned do not need any outside influence to have a dislike of Russia, they lived through it. Maybe that is why all the animosity.", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "reply": " I do not think you look at history close enough. Those countries you mentioned do not need any outside influence to have a dislike of Russia, they lived through it. Maybe that is why all the animosity.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-03-30 17:46:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by _cash_: Skytail, A Finnish friend of mine says \"The only good Russians are dead Russians\". Looks like you guys need to do a lot of PR if you want to be loved. I am afraid that Skytail and the other Russian posters and apologists seem constitutionally unable to see why their neighbours might dislike them. Furthermore they compound their error by believing that threats and bullying will draw those countries to them when all it in fact does is drive them further towards countries that they believe will contain Russia. It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Unfortunately all they seem to have done is sulked for a decade or so and then, when they've got some cash together, come out with the intention of treating their neighbours like vassals again.", 
        "intTime": 20090331, 
        "postID": 3, 
        "quote": "Originally posted by _cash_: Skytail, A Finnish friend of mine says \"The only good Russians are dead Russians\". Looks like you guys need to do a lot of PR if you want to be loved.", 
        "reply": " I am afraid that Skytail and the other Russian posters and apologists seem constitutionally unable to see why their neighbours might dislike them. Furthermore they compound their error by believing that threats and bullying will draw those countries to them when all it in fact does is drive them further towards countries that they believe will contain Russia. It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Unfortunately all they seem to have done is sulked for a decade or so and then, when they've got some cash together, come out with the intention of treating their neighbours like vassals again.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-03-31 17:17:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians skytail Again? And what the hell is unfriendly regime? Still feeling sorry for yourself because you are not adored? We do have a good relationship with Russia, but it´s not good enough for you I guess? What do you want from us?", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "reply": " skytail Again? And what the hell is unfriendly regime? Still feeling sorry for yourself because you are not adored? We do have a good relationship with Russia, but it´s not good enough for you I guess? What do you want from us?", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 06:47:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nataly"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate!", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis.", 
        "reply": " Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 08:20:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics.", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate!", 
        "reply": " The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:02:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics. How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)!", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics.", 
        "reply": " How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:20:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression.", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s!", 
        "reply": " Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:27:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "The Russian former USSR states hate the Russians because they were down trodden for so long. Yet, the US and Russia can in my mind work out our relationships (as neighbors)as is Canada, and Mexico. The US and Russia were allies during WWII and then had conflicts during the Cold War. It was a very big chess game.", 
        "intTime": 20090401, 
        "postID": 9, 
        "quote": "", 
        "reply": "The Russian former USSR states hate the Russians because they were down trodden for so long. Yet, the US and Russia can in my mind work out our relationships (as neighbors)as is Canada, and Mexico. The US and Russia were allies during WWII and then had conflicts during the Cold War. It was a very big chess game.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:28:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "dragonfly04"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present!", 
        "intTime": 20090401, 
        "postID": 10, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression.", 
        "reply": " Actions of the past might help understand, but DO NOT justify the present!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:33:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics. How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)! The vast majority of them were planted there in the 40s and 50s while the native populations were sent off to Gulags in Siberia.", 
        "intTime": 20090401, 
        "postID": 11, 
        "quote": "Originally posted by Knele: quote: Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics. How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)!", 
        "reply": " The vast majority of them were planted there in the 40s and 50s while the native populations were sent off to Gulags in Siberia.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:47:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present! They went from Soviet oppression, to Nazi occupation, to Soviet oppression. Considering the numbers of Baltic troops that formed German divisions it is very understandable that they see those Estonians, Latvians, and Lithuanians that fought the Russians either in the Finnish wars or as part of the German Army as national heroes.", 
        "intTime": 20090401, 
        "postID": 12, 
        "quote": "Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present!", 
        "reply": " They went from Soviet oppression, to Nazi occupation, to Soviet oppression. Considering the numbers of Baltic troops that formed German divisions it is very understandable that they see those Estonians, Latvians, and Lithuanians that fought the Russians either in the Finnish wars or as part of the German Army as national heroes.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:50:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present! You're right, it doesn't justify, but look around the world & all you see is a lot of old fueds kept alive for generations.", 
        "intTime": 20090401, 
        "postID": 13, 
        "quote": "Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present!", 
        "reply": " You're right, it doesn't justify, but look around the world & all you see is a lot of old fueds kept alive for generations.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:52:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. But look at government of that countries. They use every opportunity to make Russia feel bad. NAZI vets meetings, gologomor , etc. hell, we live in USSR quite well. I mean - people. And now , look at them? and here, in american forum, you , Nataly, should know that NATION is above NATIONALITY. all of former USSR republics put nationality first. soviet nation is destroyed. Thats the main result of Cold War.", 
        "intTime": 20090401, 
        "postID": 14, 
        "quote": "", 
        "reply": "i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. But look at government of that countries. They use every opportunity to make Russia feel bad. NAZI vets meetings, gologomor , etc. hell, we live in USSR quite well. I mean - people. And now , look at them? and here, in american forum, you , Nataly, should know that NATION is above NATIONALITY. all of former USSR republics put nationality first. soviet nation is destroyed. Thats the main result of Cold War.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 14:41:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "skytail"
    }, 
    {
        "content": "Part of the problem Scytale is that even after it fell Russia never managed to distance itself from the behaviour of the USSR in the way that all the other members did. So the people in those states formerly dominated by the Soviets still see Russians as the agents of their oppression. Knele wrote: quote: Are you serious? Confused Razz Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) might have wanted to undermine Russia?", 
        "intTime": 20090401, 
        "postID": 15, 
        "quote": "Are you serious? Confused Razz Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s!", 
        "reply": "Part of the problem Scytale is that even after it fell Russia never managed to distance itself from the behaviour of the USSR in the way that all the other members did. So the people in those states formerly dominated by the Soviets still see Russians as the agents of their oppression. Knele wrote:  Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) might have wanted to undermine Russia?", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 15:43:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority!", 
        "intTime": 20090401, 
        "postID": 16, 
        "quote": "Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) ..", 
        "reply": " They are free alright, as long as you are not a minority!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 15:50:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority! Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon (a situation exacerbated by Kremlin bluster and threats I'm afraid) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition, effectively outlawing NGOs or harassing foreign ambassadors.", 
        "intTime": 20090401, 
        "postID": 17, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority!", 
        "reply": " Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon (a situation exacerbated by Kremlin bluster and threats I'm afraid) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition, effectively outlawing NGOs or harassing foreign ambassadors.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 16:06:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority! Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon I agree, apartheid is such an ugly word! Plus its already taken……darn it! (a situation exacerbated by Kremlin bluster and threats I'm afraid What does Kremlin have to do with those who were born & live in the Baltic’s? Especially in the 90’s when Jelcin had a hard time finding his bottle, let alone threatening anybody! ) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition,No need to suppress, as such is illegal to begin with! effectively outlawing NGOs or harassing foreign ambassadors. I thought you Brits weren’t all that enthused about playing Europa, and here you are making all kinds of excuses for your brethren!", 
        "intTime": 20090401, 
        "postID": 18, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority! Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon I agree, apartheid is such an ugly word! Plus its already taken……darn it! (a situation exacerbated by Kremlin bluster and threats I'm afraid What does Kremlin have to do with those who were born & live in the Baltic’s? Especially in the 90’s when Jelcin had a hard time finding his bottle, let alone threatening anybody! ) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition,No need to suppress, as such is illegal to begin with! effectively outlawing NGOs or harassing foreign ambassadors.", 
        "reply": " I thought you Brits weren’t all that enthused about playing Europa, and here you are making all kinds of excuses for your brethren!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 17:22:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices.", 
        "intTime": 20090402, 
        "postID": 19, 
        "quote": "", 
        "reply": "Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 04:36:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s!Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law! in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Again; not that it has anything to do with it; Kremlin’s angered reaction came as a result of Baltic countries (mis)treatment of Russian minority! Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices. That’s funny! Baltic’s can flex their illusionary muscles (sadly, under the protection of the EU) for now, but it would be foolish for them to believe this artificial state of affairs will last forever! I’m not taking about an invasion by Russia per se, but sooner or latter France & Germany will get tired of their BS (along with their ever closer ties with Russia), and they will be left out to dry.....", 
        "intTime": 20090402, 
        "postID": 20, 
        "quote": "Originally posted by Bladensburg: Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s!Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law! in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Again; not that it has anything to do with it; Kremlin’s angered reaction came as a result of Baltic countries (mis)treatment of Russian minority! Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices. That’s funny!", 
        "reply": " Baltic’s can flex their illusionary muscles (sadly, under the protection of the EU) for now, but it would be foolish for them to believe this artificial state of affairs will last forever! I’m not taking about an invasion by Russia per se, but sooner or latter France & Germany will get tired of their BS (along with their ever closer ties with Russia), and they will be left out to dry.....", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 05:21:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up.", 
        "intTime": 20090402, 
        "postID": 21, 
        "quote": "Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative.", 
        "reply": " My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 06:32:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s ... How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ... lol", 
        "intTime": 20090402, 
        "postID": 22, 
        "quote": "Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s ... How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ...", 
        "reply": " lol", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 11:22:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.) Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin.", 
        "intTime": 20090402, 
        "postID": 23, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up.", 
        "reply": " Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.) Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 16:30:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today!", 
        "intTime": 20090402, 
        "postID": 24, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today!", 
        "reply": "", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 18:41:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: ... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ... Impressive backpedaling, but still inaccurate. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. In essence, those who got their Estonian citizenship from the Soviet Union, lost it. Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "intTime": 20090403, 
        "postID": 25, 
        "quote": "... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ...", 
        "reply": " Impressive backpedaling, but still inaccurate. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. In essence, those who got their Estonian citizenship from the Soviet Union, lost it. Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 03:42:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: ... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ... Impressive backpedaling, but still inaccurate. Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent In essence, those who got their Estonian citizenship from the Soviet Union, lost it. You haven’t disapproved anything I’ve said! If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! So what was the point of your post again? Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. Please educate me, tell me of one Russian minority party in Estonia! You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "intTime": 20090403, 
        "postID": 26, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: ... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ... Impressive backpedaling, but still inaccurate. Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent In essence, those who got their Estonian citizenship from the Soviet Union, lost it. You haven’t disapproved anything I’ve said! If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! So what was the point of your post again? Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. Please educate me, tell me of one Russian minority party in Estonia! You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "reply": "", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 04:44:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.) This could go down a long, tedious road of debate, I'll leave it alone. Only to say(had to say something, couldn't completely leave it alone! ), something about \"the forest from the trees\" comes to mind.", 
        "intTime": 20090403, 
        "postID": 27, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.)", 
        "reply": " This could go down a long, tedious road of debate, I'll leave it alone. Only to say(had to say something, couldn't completely leave it alone! ), something about \"the forest from the trees\" comes to mind.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 07:39:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? None as far as I know but in my experience those who buy into the Russo-Serb \"poor use, everybody picks on us, boo-hoo\" bollocks is immune to any form of reasoned argument anyway. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? [COLOR:GREEN]\"Fairly sure\" is my way of saying that I'm pretty much certain but can't find a reference because BBC News only stores video reports for a few weeks. And for the record I consider BBC Newsnight to be a reputable current affairs programme (not an entertainment \"show\"), I have almost certainly read articles on the subject but that report happened to stick in my mind as a known source. BTW my knowledge of the Balkans does encompass television news and documentaries but it also includes, newspapers, books and the personal experience of myself and others. An RSM of my aquaintance summed up the Serb PSV myth thus, \"They'd say they'd been victimised by a man if they'd got blood on their boots while kicking him to death.\" According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! But the Russians in the Baltic states didn't think of themselves as Latvians or Estonians or whatever did they? They were Russians or Soviets so when the USSR fell those Russians remaining, even those born there, were in (eg) Estonia but not of Estonia. It is therefore not surprising that Estonia treated them as immigrants when they tried to join its citizenry. I wonder if this test is so onerous as to be too difficult for Russians to take or whether they just don't want to. If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! [/color] The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today! And for the umpteenth time the Russians in the Baltic states were havering back towards the Kremlin as soon as those states got their independence. They'd had the whip hand for half a century don't forget and probably had every reason to feel threatened.", 
        "intTime": 20090403, 
        "postID": 28, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? None as far as I know but in my experience those who buy into the Russo-Serb \"poor use, everybody picks on us, boo-hoo\" bollocks is immune to any form of reasoned argument anyway. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? [COLOR:GREEN]\"Fairly sure\" is my way of saying that I'm pretty much certain but can't find a reference because BBC News only stores video reports for a few weeks. And for the record I consider BBC Newsnight to be a reputable current affairs programme (not an entertainment \"show\"), I have almost certainly read articles on the subject but that report happened to stick in my mind as a known source. BTW my knowledge of the Balkans does encompass television news and documentaries but it also includes, newspapers, books and the personal experience of myself and others. An RSM of my aquaintance summed up the Serb PSV myth thus, \"They'd say they'd been victimised by a man if they'd got blood on their boots while kicking him to death.\" According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! But the Russians in the Baltic states didn't think of themselves as Latvians or Estonians or whatever did they? They were Russians or Soviets so when the USSR fell those Russians remaining, even those born there, were in (eg) Estonia but not of Estonia. It is therefore not surprising that Estonia treated them as immigrants when they tried to join its citizenry. I wonder if this test is so onerous as to be too difficult for Russians to take or whether they just don't want to. If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! [/color] The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today! And for the umpteenth time the Russians in the Baltic states were havering back towards the Kremlin as soon as those states got their independence. They'd had the whip hand for half a century don't forget and probably had every reason to feel threatened.", 
        "reply": "", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 07:47:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Please educate me, tell me of one Russian minority party in Estonia! Estonian united left party", 
        "intTime": 20090403, 
        "postID": 29, 
        "quote": "Please educate me, tell me of one Russian minority party in Estonia!", 
        "reply": " Estonian united left party", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 08:25:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nataly"
    }, 
    {
        "content": "quote: You haven’t disapproved anything I’ve said! lol You said: \"Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s\"They're not forbidden to form political parties (see end of post for more). It's only the stateless persons who cannot participate in politics (8% in Estonia, 16% in Latvia, less than 1% in Lithuania - not even close to a 3rd of the population of the Baltics). You also said: \"How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ...\"Which is just so completely incorrect I'm not sure what to say. quote: If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! True, and that's an injustice in my opinion. Only some 3/5 of stateless persons have received citizenship so far, while the others have not (for various reasons). quote: So what was the point of your post again? To correct some hilariously exaggerated information. quote: Please educate me, tell me of one Russian minority party in Estonia! Sure. Let's see, in Estonia there are only two political parties that say their agenda is the Russian minority's \"cause\": Vene Erakond Eestis (Russian Party of Estonia) and Konstitutsioonierakond (Constitution Party, formerly Russian Unity Party, which is now merged with the Left Party to form the Estonian United Left Party, Eestimaa Ühendatud Vasakpartei). They're just not very popular, even among Russian Estonians who have gained citizenship. I can't find information on how many ethnic Russians are in the Riigikogu from other parties, I'd guess something like 10% based on surnames (but those can be misleading due to marriages and the descendants of the ethnic Russian population from Estonia's previous independence and before). And there are of course ethnic Russian Mayors, City Council and Municipal Council members.", 
        "intTime": 20090403, 
        "postID": 30, 
        "quote": "You haven’t disapproved anything I’ve said!", 
        "reply": " lol You said: \"Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s\"They're not forbidden to form political parties (see end of post for more). It's only the stateless persons who cannot participate in politics (8% in Estonia, 16% in Latvia, less than 1% in Lithuania - not even close to a 3rd of the population of the Baltics). You also said: \"How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ...\"Which is just so completely incorrect I'm not sure what to say. quote: If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! True, and that's an injustice in my opinion. Only some 3/5 of stateless persons have received citizenship so far, while the others have not (for various reasons). quote: So what was the point of your post again? To correct some hilariously exaggerated information. quote: Please educate me, tell me of one Russian minority party in Estonia! Sure. Let's see, in Estonia there are only two political parties that say their agenda is the Russian minority's \"cause\": Vene Erakond Eestis (Russian Party of Estonia) and Konstitutsioonierakond (Constitution Party, formerly Russian Unity Party, which is now merged with the Left Party to form the Estonian United Left Party, Eestimaa Ühendatud Vasakpartei). They're just not very popular, even among Russian Estonians who have gained citizenship. I can't find information on how many ethnic Russians are in the Riigikogu from other parties, I'd guess something like 10% based on surnames (but those can be misleading due to marriages and the descendants of the ethnic Russian population from Estonia's previous independence and before). And there are of course ethnic Russian Mayors, City Council and Municipal Council members.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 09:24:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "intTime": 20090330, 
        "postID": 31, 
        "quote": "", 
        "reply": "methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-03-30 17:12:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "skytail"
    }, 
    {
        "content": "quote: Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians I do not think you look at history close enough. Those countries you mentioned do not need any outside influence to have a dislike of Russia, they lived through it. Maybe that is why all the animosity.", 
        "intTime": 20090330, 
        "postID": 32, 
        "quote": "Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "reply": " I do not think you look at history close enough. Those countries you mentioned do not need any outside influence to have a dislike of Russia, they lived through it. Maybe that is why all the animosity.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-03-30 17:46:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by _cash_: Skytail, A Finnish friend of mine says \"The only good Russians are dead Russians\". Looks like you guys need to do a lot of PR if you want to be loved. I am afraid that Skytail and the other Russian posters and apologists seem constitutionally unable to see why their neighbours might dislike them. Furthermore they compound their error by believing that threats and bullying will draw those countries to them when all it in fact does is drive them further towards countries that they believe will contain Russia. It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Unfortunately all they seem to have done is sulked for a decade or so and then, when they've got some cash together, come out with the intention of treating their neighbours like vassals again.", 
        "intTime": 20090331, 
        "postID": 33, 
        "quote": "Originally posted by _cash_: Skytail, A Finnish friend of mine says \"The only good Russians are dead Russians\". Looks like you guys need to do a lot of PR if you want to be loved.", 
        "reply": " I am afraid that Skytail and the other Russian posters and apologists seem constitutionally unable to see why their neighbours might dislike them. Furthermore they compound their error by believing that threats and bullying will draw those countries to them when all it in fact does is drive them further towards countries that they believe will contain Russia. It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Unfortunately all they seem to have done is sulked for a decade or so and then, when they've got some cash together, come out with the intention of treating their neighbours like vassals again.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-03-31 17:17:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians skytail Again? And what the hell is unfriendly regime? Still feeling sorry for yourself because you are not adored? We do have a good relationship with Russia, but it´s not good enough for you I guess? What do you want from us?", 
        "intTime": 20090401, 
        "postID": 34, 
        "quote": "Originally posted by skytail: methinks - yes. USA have biught many leaders of former USSR, and thats true. GWB street in Tbilisi, Georgia. American wifes of some presidents. So easy. But, you have seen different logic in Georgia conflict. Hope this will ballance us. Estonia, Lithuania, LV, Poland- those are, imho, raw meat- who will be <the first wave> if some Russia-involved conflict will happen, Thats why for now they are propaganded by hatred for russians", 
        "reply": " skytail Again? And what the hell is unfriendly regime? Still feeling sorry for yourself because you are not adored? We do have a good relationship with Russia, but it´s not good enough for you I guess? What do you want from us?", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 06:47:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nataly"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate!", 
        "intTime": 20090401, 
        "postID": 35, 
        "quote": "Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis.", 
        "reply": " Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 08:20:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics.", 
        "intTime": 20090401, 
        "postID": 36, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate!", 
        "reply": " The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:02:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics. How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)!", 
        "intTime": 20090401, 
        "postID": 37, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics.", 
        "reply": " How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:20:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression.", 
        "intTime": 20090401, 
        "postID": 38, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s!", 
        "reply": " Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:27:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "The Russian former USSR states hate the Russians because they were down trodden for so long. Yet, the US and Russia can in my mind work out our relationships (as neighbors)as is Canada, and Mexico. The US and Russia were allies during WWII and then had conflicts during the Cold War. It was a very big chess game.", 
        "intTime": 20090401, 
        "postID": 39, 
        "quote": "", 
        "reply": "The Russian former USSR states hate the Russians because they were down trodden for so long. Yet, the US and Russia can in my mind work out our relationships (as neighbors)as is Canada, and Mexico. The US and Russia were allies during WWII and then had conflicts during the Cold War. It was a very big chess game.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:28:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "dragonfly04"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present!", 
        "intTime": 20090401, 
        "postID": 40, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression.", 
        "reply": " Actions of the past might help understand, but DO NOT justify the present!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:33:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics. How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)! The vast majority of them were planted there in the 40s and 50s while the native populations were sent off to Gulags in Siberia.", 
        "intTime": 20090401, 
        "postID": 41, 
        "quote": "Originally posted by Knele: quote: Originally posted by nspreitler: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Russian minority in the Baltic’s are treated as second class citizens and lets not even talk about the neo-Nazi movement! Even so, it would be the equivalent of US begging Ecuador to be friends.... Ironically, Polish PM was on TV the other day whining how certain Russian protectionist policies (from the past few months) are hurting Polish economy & employment rate! The Baltic states will continue to have a lot of animosity towards Russia. Russia won't even acknowledge that they took the Baltic states by force in 1940, they still claim they voluntarily joined the Soviet Union. The Russians in the Baltics have a vaild complaint, but they are also seen as still being forced transplants from the Soviets. They were put there as part of the Russification of the Baltics. How the Russian minority (their parents, grandparents...etc) ended up in the Baltic’s is debatable, and more importantly irrelevant! More important is their treatment today at the hands of an EU member state(s)!", 
        "reply": " The vast majority of them were planted there in the 40s and 50s while the native populations were sent off to Gulags in Siberia.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:47:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present! They went from Soviet oppression, to Nazi occupation, to Soviet oppression. Considering the numbers of Baltic troops that formed German divisions it is very understandable that they see those Estonians, Latvians, and Lithuanians that fought the Russians either in the Finnish wars or as part of the German Army as national heroes.", 
        "intTime": 20090401, 
        "postID": 42, 
        "quote": "Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present!", 
        "reply": " They went from Soviet oppression, to Nazi occupation, to Soviet oppression. Considering the numbers of Baltic troops that formed German divisions it is very understandable that they see those Estonians, Latvians, and Lithuanians that fought the Russians either in the Finnish wars or as part of the German Army as national heroes.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:50:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present! You're right, it doesn't justify, but look around the world & all you see is a lot of old fueds kept alive for generations.", 
        "intTime": 20090401, 
        "postID": 43, 
        "quote": "Originally posted by Knele: quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: It is a shame really, with the fall of communism and the collapse of the USSR the Russians had the opportunity to try and put history behind them and begin their relationships with the Soviet successors and ex-Warsaw Pact on a \"clean slate\" basis. Are you serious? Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Do you think it may have something to do with the fact that they went from Nazi oppression to communist oppression. Actions of the past might help understand, but DO NOT justify the present!", 
        "reply": " You're right, it doesn't justify, but look around the world & all you see is a lot of old fueds kept alive for generations.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 09:52:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. But look at government of that countries. They use every opportunity to make Russia feel bad. NAZI vets meetings, gologomor , etc. hell, we live in USSR quite well. I mean - people. And now , look at them? and here, in american forum, you , Nataly, should know that NATION is above NATIONALITY. all of former USSR republics put nationality first. soviet nation is destroyed. Thats the main result of Cold War.", 
        "intTime": 20090401, 
        "postID": 44, 
        "quote": "", 
        "reply": "i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. But look at government of that countries. They use every opportunity to make Russia feel bad. NAZI vets meetings, gologomor , etc. hell, we live in USSR quite well. I mean - people. And now , look at them? and here, in american forum, you , Nataly, should know that NATION is above NATIONALITY. all of former USSR republics put nationality first. soviet nation is destroyed. Thats the main result of Cold War.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 14:41:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "skytail"
    }, 
    {
        "content": "Part of the problem Scytale is that even after it fell Russia never managed to distance itself from the behaviour of the USSR in the way that all the other members did. So the people in those states formerly dominated by the Soviets still see Russians as the agents of their oppression. Knele wrote: quote: Are you serious? Confused Razz Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s! Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) might have wanted to undermine Russia?", 
        "intTime": 20090401, 
        "postID": 45, 
        "quote": "Are you serious? Confused Razz Ex-Soviet states (chiefly banana republics in the Baltic & Poland) have done everything in their power to undermine Russia since the 90’s!", 
        "reply": "Part of the problem Scytale is that even after it fell Russia never managed to distance itself from the behaviour of the USSR in the way that all the other members did. So the people in those states formerly dominated by the Soviets still see Russians as the agents of their oppression. Knele wrote:  Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) might have wanted to undermine Russia?", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 15:43:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority!", 
        "intTime": 20090401, 
        "postID": 46, 
        "quote": "Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) ..", 
        "reply": " They are free alright, as long as you are not a minority!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 15:50:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority! Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon (a situation exacerbated by Kremlin bluster and threats I'm afraid) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition, effectively outlawing NGOs or harassing foreign ambassadors.", 
        "intTime": 20090401, 
        "postID": 47, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority!", 
        "reply": " Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon (a situation exacerbated by Kremlin bluster and threats I'm afraid) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition, effectively outlawing NGOs or harassing foreign ambassadors.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 16:06:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority! Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon I agree, apartheid is such an ugly word! Plus its already taken……darn it! (a situation exacerbated by Kremlin bluster and threats I'm afraid What does Kremlin have to do with those who were born & live in the Baltic’s? Especially in the 90’s when Jelcin had a hard time finding his bottle, let alone threatening anybody! ) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition,No need to suppress, as such is illegal to begin with! effectively outlawing NGOs or harassing foreign ambassadors. I thought you Brits weren’t all that enthused about playing Europa, and here you are making all kinds of excuses for your brethren!", 
        "intTime": 20090401, 
        "postID": 48, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Have you ever considered why the so-called \"banana republics\" (who all seem to enjoy a freer political environment than modern Russia by the way) .. They are free alright, as long as you are not a minority! Like, for example, the Chechens are? Anyway while I am aware that the Russian minorities in the Baltic states are somewhat sat upon I agree, apartheid is such an ugly word! Plus its already taken……darn it! (a situation exacerbated by Kremlin bluster and threats I'm afraid What does Kremlin have to do with those who were born & live in the Baltic’s? Especially in the 90’s when Jelcin had a hard time finding his bottle, let alone threatening anybody! ) I wasn't aware of any such issues in Poland despite the place being a bit ultra-Catholic at times. Certainly nothing to the extent of suppressing any real opposition,No need to suppress, as such is illegal to begin with! effectively outlawing NGOs or harassing foreign ambassadors.", 
        "reply": " I thought you Brits weren’t all that enthused about playing Europa, and here you are making all kinds of excuses for your brethren!", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-01 17:22:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices.", 
        "intTime": 20090402, 
        "postID": 49, 
        "quote": "", 
        "reply": "Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 04:36:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s!Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law! in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Again; not that it has anything to do with it; Kremlin’s angered reaction came as a result of Baltic countries (mis)treatment of Russian minority! Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices. That’s funny! Baltic’s can flex their illusionary muscles (sadly, under the protection of the EU) for now, but it would be foolish for them to believe this artificial state of affairs will last forever! I’m not taking about an invasion by Russia per se, but sooner or latter France & Germany will get tired of their BS (along with their ever closer ties with Russia), and they will be left out to dry.....", 
        "intTime": 20090402, 
        "postID": 50, 
        "quote": "Originally posted by Bladensburg: Wow I didn't know that opposition political parties were illegal in Poland and the Baltic states. Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s!Poland just had an election IIRC and the government changed but how could that be if opposition was illegal? Unless you meant that opposition was illegal in Russia which is of course not the case - it's just very, very difficult to access the media or hold rallies or raise money if you aren't a Putinista. I don't think the term \"Apartheid2 is totally accurate, not far off in some instances but it is possible for ethnic Russians to get along by learning to be a local How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law! in a way that a black African could not dye his skin. And the Kremlin emphatically did not help the situation by constantly giving the impression that it was going to \"save\" the ethnic Russians from their \"oppressors\" when it could do no such thing and then belatedly attempting to bully the Baltics into being nice to Russians long after the chance was past. Thus the Russians in the Baltics have spent the last fifteen years constantly looking back to Moscow rather than getting on and trying to integrate. Again; not that it has anything to do with it; Kremlin’s angered reaction came as a result of Baltic countries (mis)treatment of Russian minority! Of course an apology for the sins of the USSR from Moscow might have helped as would a bit of humility from the Russian colonia planted by Moscow and then left to their own devices. That’s funny!", 
        "reply": " Baltic’s can flex their illusionary muscles (sadly, under the protection of the EU) for now, but it would be foolish for them to believe this artificial state of affairs will last forever! I’m not taking about an invasion by Russia per se, but sooner or latter France & Germany will get tired of their BS (along with their ever closer ties with Russia), and they will be left out to dry.....", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 05:21:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up.", 
        "intTime": 20090402, 
        "postID": 51, 
        "quote": "Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative.", 
        "reply": " My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 06:32:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s ... How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ... lol", 
        "intTime": 20090402, 
        "postID": 52, 
        "quote": "Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s ... How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ...", 
        "reply": " lol", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 11:22:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.) Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin.", 
        "intTime": 20090402, 
        "postID": 53, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up.", 
        "reply": " Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.) Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 16:30:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today!", 
        "intTime": 20090402, 
        "postID": 54, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today!", 
        "reply": "", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-02 18:41:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: ... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ... Impressive backpedaling, but still inaccurate. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. In essence, those who got their Estonian citizenship from the Soviet Union, lost it. Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "intTime": 20090403, 
        "postID": 55, 
        "quote": "... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ...", 
        "reply": " Impressive backpedaling, but still inaccurate. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. In essence, those who got their Estonian citizenship from the Soviet Union, lost it. Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 03:42:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: ... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ... Impressive backpedaling, but still inaccurate. Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent In essence, those who got their Estonian citizenship from the Soviet Union, lost it. You haven’t disapproved anything I’ve said! If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! So what was the point of your post again? Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. Please educate me, tell me of one Russian minority party in Estonia! You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "intTime": 20090403, 
        "postID": 56, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: ... According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! ... Impressive backpedaling, but still inaccurate. Estonia's citizenship. Application for a minor born to stateless parents after 1992, can be done separately. Those who emigrated (or were relocated) to Estonia in 1940-1992, and their descendants, have to apply for independent In essence, those who got their Estonian citizenship from the Soviet Union, lost it. You haven’t disapproved anything I’ve said! If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! So what was the point of your post again? Even though some 160,000 have gotten their Estonian citizenship, the interest for getting Estonian citizenship has been very low in the past few years, largely because they have the same rights in EU job markets and no visa requirements to Russia. Oh and minorities do have political parties. Please educate me, tell me of one Russian minority party in Estonia! You know, exaggeration and misinformation doesn't really help the cause of stateless ethnic Russians in the Baltics.", 
        "reply": "", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 04:44:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.) This could go down a long, tedious road of debate, I'll leave it alone. Only to say(had to say something, couldn't completely leave it alone! ), something about \"the forest from the trees\" comes to mind.", 
        "intTime": 20090403, 
        "postID": 57, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by 67NOV: quote: Originally posted by skytail: i have a friend from Ukraine, communicate with girl from Lithuaia, we have no problems. no hatred. nothing negative. My wife is Catholic, from Ireland, a good freind of ours is Protestant from England. (I occasionally instigate between the two! ) Individuals are usually good, i't's groups/governments that tend to screw things up. Can't see how there would be a problem if one was Irish and one English - it's when both are Irish (or from Glasgow)that you get trouble (mainly because the English consider it very bad form to care much about religion.)", 
        "reply": " This could go down a long, tedious road of debate, I'll leave it alone. Only to say(had to say something, couldn't completely leave it alone! ), something about \"the forest from the trees\" comes to mind.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 07:39:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Bladensburg: Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? None as far as I know but in my experience those who buy into the Russo-Serb \"poor use, everybody picks on us, boo-hoo\" bollocks is immune to any form of reasoned argument anyway. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? [COLOR:GREEN]\"Fairly sure\" is my way of saying that I'm pretty much certain but can't find a reference because BBC News only stores video reports for a few weeks. And for the record I consider BBC Newsnight to be a reputable current affairs programme (not an entertainment \"show\"), I have almost certainly read articles on the subject but that report happened to stick in my mind as a known source. BTW my knowledge of the Balkans does encompass television news and documentaries but it also includes, newspapers, books and the personal experience of myself and others. An RSM of my aquaintance summed up the Serb PSV myth thus, \"They'd say they'd been victimised by a man if they'd got blood on their boots while kicking him to death.\" According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! But the Russians in the Baltic states didn't think of themselves as Latvians or Estonians or whatever did they? They were Russians or Soviets so when the USSR fell those Russians remaining, even those born there, were in (eg) Estonia but not of Estonia. It is therefore not surprising that Estonia treated them as immigrants when they tried to join its citizenry. I wonder if this test is so onerous as to be too difficult for Russians to take or whether they just don't want to. If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! [/color] The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today! And for the umpteenth time the Russians in the Baltic states were havering back towards the Kremlin as soon as those states got their independence. They'd had the whip hand for half a century don't forget and probably had every reason to feel threatened.", 
        "intTime": 20090403, 
        "postID": 58, 
        "quote": "Originally posted by Knele: quote: Originally posted by Bladensburg: Knele it seems that you have bought in to that great myth of Pan-Slavic Victimhood sol beloved of Russians and Serbs. Cute! Has this actually won you any arguments? None as far as I know but in my experience those who buy into the Russo-Serb \"poor use, everybody picks on us, boo-hoo\" bollocks is immune to any form of reasoned argument anyway. I am fairly sure that at least one of your claims is untrue because I distinctly remember seeing a BBC report on the tribulations of an ethnic Russian party in (IIRC) Latvia during their last election. They might not have had it easy but they did exist, amongst their major problems was that the government would only allow election materials to be put out in Latvian, which was a problem because most of the Russians (ans stupidly many of the candidates - it's a bit tricky to sit in a parliament that you can't understand) had failed to learn the local language. Of course a platform of reunification with Russia (most of the funding was suspected of coming from the Kremlin) didn't help... You are “fairly sure” and keep referencing “shows” on TV! And you accuse me of falling for myths! Does your knowledge of the Balkans (Serbs) extend as far as your “telly” as well? [COLOR:GREEN]\"Fairly sure\" is my way of saying that I'm pretty much certain but can't find a reference because BBC News only stores video reports for a few weeks. And for the record I consider BBC Newsnight to be a reputable current affairs programme (not an entertainment \"show\"), I have almost certainly read articles on the subject but that report happened to stick in my mind as a known source. BTW my knowledge of the Balkans does encompass television news and documentaries but it also includes, newspapers, books and the personal experience of myself and others. An RSM of my aquaintance summed up the Serb PSV myth thus, \"They'd say they'd been victimised by a man if they'd got blood on their boots while kicking him to death.\" According to Estonian Law (am sure Latvian as well), all minorities who either emigrated to, or were born in Estonia after 1940 MUST take a test in order to become citizens; hence vote & participate in political process! In contrast, all former citizens of USSR can become citizens of RF by simply filling out a request! But the Russians in the Baltic states didn't think of themselves as Latvians or Estonians or whatever did they? They were Russians or Soviets so when the USSR fell those Russians remaining, even those born there, were in (eg) Estonia but not of Estonia. It is therefore not surprising that Estonia treated them as immigrants when they tried to join its citizenry. I wonder if this test is so onerous as to be too difficult for Russians to take or whether they just don't want to. If DC sent me a notice telling me all of the sudden I must take a test to prove I’m worthy of a citizenship, my answer would be short and to the point.....go **** yourself! [/color] The EU has on occasion come down fairly heavily of the Baltics for discrimination however given that much of the agitation is seen as coming from Moscow, and Putin not exactly being seen as a saint (eastern Europe developed a deep loathing for him when people started dying after he cut off the gas last winter) the larger mamber states are unwilling to be seen to do anything that would be seen as a victory by the Kremlin. For the third time; these issues arose as soon as the Baltic states got their independence....long before Putin and assertive Russia of today! And for the umpteenth time the Russians in the Baltic states were havering back towards the Kremlin as soon as those states got their independence. They'd had the whip hand for half a century don't forget and probably had every reason to feel threatened.", 
        "reply": "", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 07:47:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Please educate me, tell me of one Russian minority party in Estonia! Estonian united left party", 
        "intTime": 20090403, 
        "postID": 59, 
        "quote": "Please educate me, tell me of one Russian minority party in Estonia!", 
        "reply": " Estonian united left party", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 08:25:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "nataly"
    }, 
    {
        "content": "quote: You haven’t disapproved anything I’ve said! lol You said: \"Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s\"They're not forbidden to form political parties (see end of post for more). It's only the stateless persons who cannot participate in politics (8% in Estonia, 16% in Latvia, less than 1% in Lithuania - not even close to a 3rd of the population of the Baltics). You also said: \"How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ...\"Which is just so completely incorrect I'm not sure what to say. quote: If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! True, and that's an injustice in my opinion. Only some 3/5 of stateless persons have received citizenship so far, while the others have not (for various reasons). quote: So what was the point of your post again? To correct some hilariously exaggerated information. quote: Please educate me, tell me of one Russian minority party in Estonia! Sure. Let's see, in Estonia there are only two political parties that say their agenda is the Russian minority's \"cause\": Vene Erakond Eestis (Russian Party of Estonia) and Konstitutsioonierakond (Constitution Party, formerly Russian Unity Party, which is now merged with the Left Party to form the Estonian United Left Party, Eestimaa Ühendatud Vasakpartei). They're just not very popular, even among Russian Estonians who have gained citizenship. I can't find information on how many ethnic Russians are in the Riigikogu from other parties, I'd guess something like 10% based on surnames (but those can be misleading due to marriages and the descendants of the ethnic Russian population from Estonia's previous independence and before). And there are of course ethnic Russian Mayors, City Council and Municipal Council members.", 
        "intTime": 20090403, 
        "postID": 60, 
        "quote": "You haven’t disapproved anything I’ve said!", 
        "reply": " lol You said: \"Russian minority (3rd of the population) is forbidden from forming political parties and/or participating in politics altogether in the Baltic’s\"They're not forbidden to form political parties (see end of post for more). It's only the stateless persons who cannot participate in politics (8% in Estonia, 16% in Latvia, less than 1% in Lithuania - not even close to a 3rd of the population of the Baltics). You also said: \"How can they “get along” when they have absolutely no rights under the Estonian, Lithuanian & Latvian law ...\"Which is just so completely incorrect I'm not sure what to say. quote: If you were born in Estonia 1940-92, and lived there your whole life, you still have to apply and take a test in order to become a citizen! True, and that's an injustice in my opinion. Only some 3/5 of stateless persons have received citizenship so far, while the others have not (for various reasons). quote: So what was the point of your post again? To correct some hilariously exaggerated information. quote: Please educate me, tell me of one Russian minority party in Estonia! Sure. Let's see, in Estonia there are only two political parties that say their agenda is the Russian minority's \"cause\": Vene Erakond Eestis (Russian Party of Estonia) and Konstitutsioonierakond (Constitution Party, formerly Russian Unity Party, which is now merged with the Left Party to form the Estonian United Left Party, Eestimaa Ühendatud Vasakpartei). They're just not very popular, even among Russian Estonians who have gained citizenship. I can't find information on how many ethnic Russians are in the Riigikogu from other parties, I'd guess something like 10% based on surnames (but those can be misleading due to marriages and the descendants of the ethnic Russian population from Estonia's previous independence and before). And there are of course ethnic Russian Mayors, City Council and Municipal Council members.", 
        "threadID": "409192893_8660073912001", 
        "time": "2009-04-03 09:24:00", 
        "title": "Do Russia is surrounded by unfriendly regimes?", 
        "userID": "2nd_freedomfighter"
    }
]