[
    {
        "content": "+++http://www.washingtonpost.com/wp-dyn/content/article/2009/04/09/AR2009040903915.html Who Pays Taxes The super-rich can't plug the budget gap on their own. THE CONGRESSIONAL Budget Office recently released some details of U.S. tax liabilities that should dispel myths on both sides of the budget debate. The numbers will be particularly useful in informing the discussion when tax increases for households other than the super-rich are finally on the table -- and like it or not, once the economy has recovered, they will be. In 2006, the top 20 percent of earners paid 70 percent of all federal taxes. On average, they paid 26 percent of their income to the government. The very richest -- the top 1 percent of taxpayers, with household incomes of over $332,000 -- paid 28 percent of all taxes, with an effective tax rate of 31 percent. The middle three quintiles paid rates of 10, 14 and 18 percent. The lowest 20 percent of households paid only 0.8 percent of all federal taxes -- and the bottom 90 percent of households paid only 45 percent. Based on these numbers, it would be hard to argue that the country doesn't already have a significantly progressive tax system. Taxes aren't just for suckers, with cashiers paying more of their income than corporate chief executives. Nor is the system egregiously stacked against the wealthy -- who, after all, receive the bulk of the income. The top quintile earned over 55 percent of the income, and the top 1 percent earned a full 19 percent of all income. This matters because the simple truth is that in the coming years, taxes will have to go up to help close the government's gaping fiscal hole. Much of the budget gap should be covered by spending cuts, but judging from recent budget proposals by both parties, neither has an appetite for reductions anywhere near what will be needed. When taxes go up, they should be increased in a way that makes the tax code more progressive. Income inequality has widened for the past three decades, and it only makes sense for those who have benefited to pay more. But there is a limit to how much the tippy top should bear. President Obama has promised that taxes will not be increased for families making under $250,000. That is a promise that will probably have to be dropped down the road. There just isn't enough revenue to be found above that figure unless we create a system so lopsided that voters would always want more government spending because it would come at such a low price. The commonly used political definition of \"rich\" has crept up in recent years from $100,000 to $250,000. Either that definition is going to have to change again, or we will have to come to terms with the fact that the middle class will have to face higher tax burdens, too.", 
        "intTime": 20090410, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.washingtonpost.com/wp-dyn/content/article/2009/04/09/AR2009040903915.html Who Pays Taxes The super-rich can't plug the budget gap on their own. THE CONGRESSIONAL Budget Office recently released some details of U.S. tax liabilities that should dispel myths on both sides of the budget debate. The numbers will be particularly useful in informing the discussion when tax increases for households other than the super-rich are finally on the table -- and like it or not, once the economy has recovered, they will be. In 2006, the top 20 percent of earners paid 70 percent of all federal taxes. On average, they paid 26 percent of their income to the government. The very richest -- the top 1 percent of taxpayers, with household incomes of over $332,000 -- paid 28 percent of all taxes, with an effective tax rate of 31 percent. The middle three quintiles paid rates of 10, 14 and 18 percent. The lowest 20 percent of households paid only 0.8 percent of all federal taxes -- and the bottom 90 percent of households paid only 45 percent. Based on these numbers, it would be hard to argue that the country doesn't already have a significantly progressive tax system. Taxes aren't just for suckers, with cashiers paying more of their income than corporate chief executives. Nor is the system egregiously stacked against the wealthy -- who, after all, receive the bulk of the income. The top quintile earned over 55 percent of the income, and the top 1 percent earned a full 19 percent of all income. This matters because the simple truth is that in the coming years, taxes will have to go up to help close the government's gaping fiscal hole. Much of the budget gap should be covered by spending cuts, but judging from recent budget proposals by both parties, neither has an appetite for reductions anywhere near what will be needed. When taxes go up, they should be increased in a way that makes the tax code more progressive. Income inequality has widened for the past three decades, and it only makes sense for those who have benefited to pay more. But there is a limit to how much the tippy top should bear. President Obama has promised that taxes will not be increased for families making under $250,000. That is a promise that will probably have to be dropped down the road. There just isn't enough revenue to be found above that figure unless we create a system so lopsided that voters would always want more government spending because it would come at such a low price. The commonly used political definition of \"rich\" has crept up in recent years from $100,000 to $250,000. Either that definition is going to have to change again, or we will have to come to terms with the fact that the middle class will have to face higher tax burdens, too.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-10 13:20:00", 
        "title": "Who pays taxes?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Who pays taxes? I know I do. From income to sales, all the rest tagged on. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090410, 
        "postID": 2, 
        "quote": "Who pays taxes?", 
        "reply": " I know I do. From income to sales, all the rest tagged on. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-10 13:23:00", 
        "title": "Who pays taxes?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Who pays taxes? I know I do. From income to sales, all the rest tagged on. Really is out of hand.", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: quote: Who pays taxes? I know I do. From income to sales, all the rest tagged on.", 
        "reply": " Really is out of hand.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-10 13:24:00", 
        "title": "Who pays taxes?", 
        "userID": "threerings"
    }, 
    {
        "content": "Unkle Barry will be proud of me for sending in the 12% of my company paid (not government paid) disability. Sure glad I don't get $250K+/yr, I'd really have something to worry about.", 
        "intTime": 20090411, 
        "postID": 4, 
        "quote": "", 
        "reply": "Unkle Barry will be proud of me for sending in the 12% of my company paid (not government paid) disability. Sure glad I don't get $250K+/yr, I'd really have something to worry about.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 19:51:00", 
        "title": "Who pays taxes?", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year.", 
        "intTime": 20090411, 
        "postID": 5, 
        "quote": "", 
        "reply": "I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 20:08:00", 
        "title": "Who pays taxes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. Yes, something will have to be done. How about the damned Fed Gubmint spending a hell of a lot less and letting working citizens keep the fruits of their labor? Nah.. that'll never work. We need billions just for ACORN, after all.", 
        "intTime": 20090411, 
        "postID": 6, 
        "quote": "Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year.", 
        "reply": " Yes, something will have to be done. How about the damned Fed Gubmint spending a hell of a lot less and letting working citizens keep the fruits of their labor? Nah.. that'll never work. We need billions just for ACORN, after all.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 20:14:00", 
        "title": "Who pays taxes?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. I am single and usually only pay roughly 5%. I guess if you just work and pay taxes with your personal exemption and don't itemize, then maybe you could get taxed pretty hard. But, I make every dollar with the thought constantly on my mind on how can a reduce my tax burden on that dollar. Then, at the end of the year I itemize like a mo-fo. The lowest effective tax I have ever paid was 2%, the highest was 26% (I was tax-lazy that year). That is just my personal taxes. When my business was booming I think it paid close to 35% when factoring in the payroll taxes, benefits and UI. But, this year, my business was slow, so it only paid 10%. Next year I may have to file it on my personal taxes.", 
        "intTime": 20090411, 
        "postID": 7, 
        "quote": "Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year.", 
        "reply": " I am single and usually only pay roughly 5%. I guess if you just work and pay taxes with your personal exemption and don't itemize, then maybe you could get taxed pretty hard. But, I make every dollar with the thought constantly on my mind on how can a reduce my tax burden on that dollar. Then, at the end of the year I itemize like a mo-fo. The lowest effective tax I have ever paid was 2%, the highest was 26% (I was tax-lazy that year). That is just my personal taxes. When my business was booming I think it paid close to 35% when factoring in the payroll taxes, benefits and UI. But, this year, my business was slow, so it only paid 10%. Next year I may have to file it on my personal taxes.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 20:31:00", 
        "title": "Who pays taxes?", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. Yes, something will have to be done. How about the damned Fed Gubmint spending a hell of a lot less and letting working citizens keep the fruits of their labor? Nah.. that'll never work. We need billions just for ACORN, after all. Where in the budget is the billions for ACORN? I understand your point, but you should debate the issues instead of making stuff up. Everytime somebody screams ACORN it just makes you look dumb. Now honestly much of the deficit this year may end up being recouped since the TARP money and much of the bailout was done in the form of loans. AIG is a prime example since the government holds an 80% interest in the company. If they can recover back to their average 10 year share price that would recover over $100 billion. The same with Fannie and Freddie, Citi, and all the other bailed out financials. The government can spend less, but only about a third of the budget is discretionary spending andhalf of that is on defense. The rest mainly Social Security, Medicare, and Medicaid are mandatory spending. Taxation is not much for the average family. I am married with two kids. Between my wife and I we have a taxable income of around 70,000, but we would pay less than 6% in federal income tax just with standard deductions and reality is far less once education credits, 401K, TSP, and other deductions are taken into account. I don't think paying less than 5% in income tax is unreasonable and we are well above the median household income. Most Americans are not overtaxed.", 
        "intTime": 20090411, 
        "postID": 8, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. Yes, something will have to be done. How about the damned Fed Gubmint spending a hell of a lot less and letting working citizens keep the fruits of their labor? Nah.. that'll never work. We need billions just for ACORN, after all.", 
        "reply": " Where in the budget is the billions for ACORN? I understand your point, but you should debate the issues instead of making stuff up. Everytime somebody screams ACORN it just makes you look dumb. Now honestly much of the deficit this year may end up being recouped since the TARP money and much of the bailout was done in the form of loans. AIG is a prime example since the government holds an 80% interest in the company. If they can recover back to their average 10 year share price that would recover over $100 billion. The same with Fannie and Freddie, Citi, and all the other bailed out financials. The government can spend less, but only about a third of the budget is discretionary spending andhalf of that is on defense. The rest mainly Social Security, Medicare, and Medicaid are mandatory spending. Taxation is not much for the average family. I am married with two kids. Between my wife and I we have a taxable income of around 70,000, but we would pay less than 6% in federal income tax just with standard deductions and reality is far less once education credits, 401K, TSP, and other deductions are taken into account. I don't think paying less than 5% in income tax is unreasonable and we are well above the median household income. Most Americans are not overtaxed.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 21:34:00", 
        "title": "Who pays taxes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Sure glad I don't get $250K+/yr, I'd really have something to worry about. like what? where to summer?", 
        "intTime": 20090411, 
        "postID": 9, 
        "quote": "Sure glad I don't get $250K+/yr, I'd really have something to worry about.", 
        "reply": " like what? where to summer?", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 21:51:00", 
        "title": "Who pays taxes?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by cheapthrills: Unkle Barry will be proud of me for sending in the 12% of my company paid (not government paid) disability. Sure glad I don't get $250K+/yr, I'd really have something to worry about. i'm pretty sure if you made over 250000 dollars a year you'd actually have a lot less to worry about in general", 
        "intTime": 20090411, 
        "postID": 10, 
        "quote": "Originally posted by cheapthrills: Unkle Barry will be proud of me for sending in the 12% of my company paid (not government paid) disability. Sure glad I don't get $250K+/yr, I'd really have something to worry about.", 
        "reply": " i'm pretty sure if you made over 250000 dollars a year you'd actually have a lot less to worry about in general", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 21:58:00", 
        "title": "Who pays taxes?", 
        "userID": "liberal90"
    }, 
    {
        "content": "If you made $250,000 and were single with no dependents and not a single other deduction you would pay $65,000 in federal income tax. Again reality is much less once tax exempt or deferred retirement savings, student loan interest, and any of the dozens of other deductions are taken into account. I feel really bad for the poor people making a quarter million that only really make 200K or so after taxes.", 
        "intTime": 20090411, 
        "postID": 11, 
        "quote": "", 
        "reply": "If you made $250,000 and were single with no dependents and not a single other deduction you would pay $65,000 in federal income tax. Again reality is much less once tax exempt or deferred retirement savings, student loan interest, and any of the dozens of other deductions are taken into account. I feel really bad for the poor people making a quarter million that only really make 200K or so after taxes.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 22:24:00", 
        "title": "Who pays taxes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: I feel really bad for the poor people making a quarter million that only really make 200K or so after taxes. and remember...anything over 250k will get taxed 4% MORE! quite frankly I'm surprised that many of them can make it.", 
        "intTime": 20090411, 
        "postID": 12, 
        "quote": "I feel really bad for the poor people making a quarter million that only really make 200K or so after taxes.", 
        "reply": " and remember...anything over 250k will get taxed 4% MORE! quite frankly I'm surprised that many of them can make it.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-11 22:37:00", 
        "title": "Who pays taxes?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. I'm betting when you consider all types of tax you pay, that your total tax rate is higher then 4%. I'm also betting your spouse does not work?", 
        "intTime": 20090412, 
        "postID": 13, 
        "quote": "Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year.", 
        "reply": " I'm betting when you consider all types of tax you pay, that your total tax rate is higher then 4%. I'm also betting your spouse does not work?", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-12 04:33:00", 
        "title": "Who pays taxes?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: If you made $250,000 and were single with no dependents and not a single other deduction you would pay $65,000 in federal income tax. Again reality is much less once tax exempt or deferred retirement savings, student loan interest, and any of the dozens of other deductions are taken into account. I feel really bad for the poor people making a quarter million that only really make 200K or so after taxes. Again thats FEDERAL tax only.", 
        "intTime": 20090412, 
        "postID": 14, 
        "quote": "Originally posted by nspreitler: If you made $250,000 and were single with no dependents and not a single other deduction you would pay $65,000 in federal income tax. Again reality is much less once tax exempt or deferred retirement savings, student loan interest, and any of the dozens of other deductions are taken into account. I feel really bad for the poor people making a quarter million that only really make 200K or so after taxes.", 
        "reply": " Again thats FEDERAL tax only.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-12 04:35:00", 
        "title": "Who pays taxes?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Again thats FEDERAL tax only. That's exactly what your article was about.", 
        "intTime": 20090412, 
        "postID": 15, 
        "quote": "Again thats FEDERAL tax only.", 
        "reply": " That's exactly what your article was about.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-12 04:40:00", 
        "title": "Who pays taxes?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. I'm betting when you consider all types of tax you pay, that your total tax rate is higher then 4%. I'm also betting your spouse does not work? She works but makes very little, she is an educational assistant at a middle school working with special needs kids. It is a job she took for the experience since she is working on a teaching degree. If you add Social Security and Medicare taxes I do pay about 12% in taxes. I don't pay state income taxes since I am in the military.", 
        "intTime": 20090412, 
        "postID": 16, 
        "quote": "Originally posted by threerings: quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. I'm betting when you consider all types of tax you pay, that your total tax rate is higher then 4%. I'm also betting your spouse does not work?", 
        "reply": " She works but makes very little, she is an educational assistant at a middle school working with special needs kids. It is a job she took for the experience since she is working on a teaching degree. If you add Social Security and Medicare taxes I do pay about 12% in taxes. I don't pay state income taxes since I am in the military.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-12 09:41:00", 
        "title": "Who pays taxes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: The rest mainly Social Security, Medicare, and Medicaid are mandatory spending. Two out of those three aren't general fund budget items ... and have been running a surplus that gets borrowed by the Congress and spent as if it were general fund dollars.", 
        "intTime": 20090412, 
        "postID": 17, 
        "quote": "The rest mainly Social Security, Medicare, and Medicaid are mandatory spending.", 
        "reply": " Two out of those three aren't general fund budget items ... and have been running a surplus that gets borrowed by the Congress and spent as if it were general fund dollars.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-12 10:13:00", 
        "title": "Who pays taxes?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: The rest mainly Social Security, Medicare, and Medicaid are mandatory spending. Two out of those three aren't general fund budget items ... and have been running a surplus that gets borrowed by the Congress and spent as if it were general fund dollars. That is true, which is why nearly 50% of the ntional debt is intragovernmental, meaning it is money the government owes itself.", 
        "intTime": 20090412, 
        "postID": 18, 
        "quote": "Originally posted by I_M_Qwerty: quote: The rest mainly Social Security, Medicare, and Medicaid are mandatory spending. Two out of those three aren't general fund budget items ... and have been running a surplus that gets borrowed by the Congress and spent as if it were general fund dollars.", 
        "reply": " That is true, which is why nearly 50% of the ntional debt is intragovernmental, meaning it is money the government owes itself.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-12 10:40:00", 
        "title": "Who pays taxes?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. I'm betting when you consider all types of tax you pay, that your total tax rate is higher then 4%. I'm also betting your spouse does not work? She works but makes very little, she is an educational assistant at a middle school working with special needs kids. It is a job she took for the experience since she is working on a teaching degree. If you add Social Security and Medicare taxes I do pay about 12% in taxes. I don't pay state income taxes since I am in the military. Fair enough. My wife makes more then me. She also looks better in shorts.", 
        "intTime": 20090412, 
        "postID": 19, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: I pay, not that much though. It is about 5% of my base pay and really less than 4% of my actual income. Being married with two kids really cuts down on tax liability. Something will have to be done, there is no way we can sustain the projected deficits, including the nearly $2 trillion this year. I'm betting when you consider all types of tax you pay, that your total tax rate is higher then 4%. I'm also betting your spouse does not work? She works but makes very little, she is an educational assistant at a middle school working with special needs kids. It is a job she took for the experience since she is working on a teaching degree. If you add Social Security and Medicare taxes I do pay about 12% in taxes. I don't pay state income taxes since I am in the military.", 
        "reply": " Fair enough. My wife makes more then me. She also looks better in shorts.", 
        "threadID": "409192893_9470073022001", 
        "time": "2009-04-12 12:51:00", 
        "title": "Who pays taxes?", 
        "userID": "threerings"
    }
]