[
    {
        "content": "UPDATE, March 27, 2009: \"http://www.boston.com/news/nation/articles/2009/03/27/pa_reverses_convictions_in_judge_case?mode=PF\" quote: Pennsylvania's highest court yesterday overturned hundreds of juvenile convictions issued by a judge accused of taking millions of dollars in kickbacks to send kids to privately owned detention centers. The state Supreme Court ruled that former Luzerne County Judge Mark Ciavarella violated the constitutional rights of youth offenders who appeared in his courtroom without lawyers between 2003 and 2008. \"Today's order is not intended to be a quick fix,\" Chief Justice Ronald Castille said. \"It's going to take some time, but the Supreme Court is committed to righting whatever wrong was perpetrated on Luzerne's juveniles and their families.\" Federal prosecutors have charged Ciavarella and another Luzerne County judge, Michael Conahan, with taking $2.6 million in payoffs to put juvenile offenders in private lockups. The judges pleaded guilty to fraud last month and face more than seven years in prison. The high court approved the recommendations of Berks County Senior Judge Arthur Grim. He advised expunging the records of low-level offenders who appeared in Ciavarella's courtroom without lawyers.", 
        "intTime": 20090327, 
        "postID": 23, 
        "quote": "Pennsylvania's highest court yesterday overturned hundreds of juvenile convictions issued by a judge accused of taking millions of dollars in kickbacks to send kids to privately owned detention centers. The state Supreme Court ruled that former Luzerne County Judge Mark Ciavarella violated the constitutional rights of youth offenders who appeared in his courtroom without lawyers between 2003 and 2008. \"Today's order is not intended to be a quick fix,\" Chief Justice Ronald Castille said. \"It's going to take some time, but the Supreme Court is committed to righting whatever wrong was perpetrated on Luzerne's juveniles and their families.\" Federal prosecutors have charged Ciavarella and another Luzerne County judge, Michael Conahan, with taking $2.6 million in payoffs to put juvenile offenders in private lockups. The judges pleaded guilty to fraud last month and face more than seven years in prison. The high court approved the recommendations of Berks County Senior Judge Arthur Grim. He advised expunging the records of low-level offenders who appeared in Ciavarella's courtroom without lawyers.", 
        "reply": "UPDATE, March 27, 2009: \"http://www.boston.com/news/nation/articles/2009/03/27/pa_reverses_convictions_in_judge_case?mode=PF\" ", 
        "threadID": "409192893_3040022512001", 
        "time": "2009-03-27 05:53:00", 
        "title": "Judges making money sending kids to jail", 
        "userID": "Fightdirector"
    }
]