[
    {
        "content": "The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "intTime": 20090402, 
        "postID": 1, 
        "quote": "", 
        "reply": "The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 14:16:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill?", 
        "intTime": 20090402, 
        "postID": 2, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "reply": " Do you know the name of the bill?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:09:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill? hmm b et it starts HR then some numbers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 3, 
        "quote": "Originally posted by Boospar: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill?", 
        "reply": " hmm b et it starts HR then some numbers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:39:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "intTime": 20090402, 
        "postID": 4, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "reply": " first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:48:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090402, 
        "postID": 5, 
        "quote": "Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:57:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? I am not racist ... I don't care if the individual that is here illegally is pea green; I don't want them getting benefits meant for legal residents. BTW, with regards the your statement \"I say hell yes let them be citizens!\" .... that is a slap in the face to everyone who waits for legal entry into the US or spends years going through the process of legally obtaining citizenship.", 
        "intTime": 20090402, 
        "postID": 6, 
        "quote": "Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " I am not racist ... I don't care if the individual that is here illegally is pea green; I don't want them getting benefits meant for legal residents. BTW, with regards the your statement \"I say hell yes let them be citizens!\" .... that is a slap in the face to everyone who waits for legal entry into the US or spends years going through the process of legally obtaining citizenship.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 16:22:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Boospar"
    }, 
    {
        "content": "first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?[/QUOTE]", 
        "intTime": 20090402, 
        "postID": 7, 
        "quote": "", 
        "reply": "first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?[/QUOTE]", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 17:05:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? The point is that they are not citizens of then US, they are citizens from another country. Why should they get discount rates when someone who is a citizen, but lives in another state, does not? What about the ones who get the education and then leave the US? Where is the return then? We did an amnesty thing back in the 80s. Part of the deal was that congress would fix immigration and the borders would be protected. See how well that has worked. Start giving more and more reasons for people to sneak in and more will sneak in. And not all are skilled or are going to college. I'll pay your tuition if you pay the loans for my kids and the classes I am taking. Deal?", 
        "intTime": 20090402, 
        "postID": 8, 
        "quote": "Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " The point is that they are not citizens of then US, they are citizens from another country. Why should they get discount rates when someone who is a citizen, but lives in another state, does not? What about the ones who get the education and then leave the US? Where is the return then? We did an amnesty thing back in the 80s. Part of the deal was that congress would fix immigration and the borders would be protected. See how well that has worked. Start giving more and more reasons for people to sneak in and more will sneak in. And not all are skilled or are going to college. I'll pay your tuition if you pay the loans for my kids and the classes I am taking. Deal?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 17:54:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "sw614"
    }, 
    {
        "content": "I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? it wouldn't be open to just anyone who decides they want to go to college. and you mentioned not everyone is skilled or college-bound? well obviously you're correct- but the ones going to college are the ones we're talking about. This will have little to no affect on immigrants not planning on going to college. If someone can give me one good, logical reason this would be a bad thing, I'll happily reconsider my opinion. I just don't see any negative consequence of giving college-bound immigrants citizenship or otherwise \"legalize them.\"", 
        "intTime": 20090402, 
        "postID": 9, 
        "quote": "", 
        "reply": "I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? it wouldn't be open to just anyone who decides they want to go to college. and you mentioned not everyone is skilled or college-bound? well obviously you're correct- but the ones going to college are the ones we're talking about. This will have little to no affect on immigrants not planning on going to college. If someone can give me one good, logical reason this would be a bad thing, I'll happily reconsider my opinion. I just don't see any negative consequence of giving college-bound immigrants citizenship or otherwise \"legalize them.\"", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:23:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "intTime": 20090402, 
        "postID": 10, 
        "quote": "Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support.", 
        "reply": " There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:26:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "intTime": 20090402, 
        "postID": 11, 
        "quote": "Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript?", 
        "reply": " What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:39:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "RRR52"
    }, 
    {
        "content": "Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "intTime": 20090402, 
        "postID": 12, 
        "quote": "", 
        "reply": "Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:02:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Oh, and btw numbers...... You are just what I thought, a Mr. \"This Member, considering joining\".", 
        "intTime": 20090402, 
        "postID": 13, 
        "quote": "", 
        "reply": "Oh, and btw numbers...... You are just what I thought, a Mr. \"This Member, considering joining\".", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:10:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "too bad they dont legalize hunting illegals... this is insane what all obama is doing to our country...", 
        "intTime": 20090402, 
        "postID": 14, 
        "quote": "", 
        "reply": "too bad they dont legalize hunting illegals... this is insane what all obama is doing to our country...", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:16:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying..... i'm not sure which post you're referring to. I don't think I referred to illegal immigrants as citizens. And you say if they're here legally you're all for it? Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "intTime": 20090402, 
        "postID": 15, 
        "quote": "Originally posted by Woody_in_La: Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "reply": " i'm not sure which post you're referring to. I don't think I referred to illegal immigrants as citizens. And you say if they're here legally you're all for it? Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:38:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot. Yes, you're an ignorant bigot to people who come her legally. And to citizens who pay full tuition because they're not a resident of a particular state.", 
        "intTime": 20090403, 
        "postID": 16, 
        "quote": "Originally posted by 20292610: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "reply": " Yes, you're an ignorant bigot to people who come her legally. And to citizens who pay full tuition because they're not a resident of a particular state.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:42:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "intTime": 20090403, 
        "postID": 17, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates.", 
        "reply": " Got my Vote!", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:54:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own.", 
        "intTime": 20090403, 
        "postID": 18, 
        "quote": "Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "reply": " A liberal is a man who will give away everything he doesn't own.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:57:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don", 
        "intTime": 20090403, 
        "postID": 19, 
        "quote": "Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "reply": " Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:59:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own. I’m sure you don’t need me to tell you how little I care about your “opinion”! quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don BS! There are so many schools & programs out there today, nobody can honestly say they didn’t finish college because they couldn’t get in (unless you’re talking about Ivy League schools)!", 
        "intTime": 20090403, 
        "postID": 20, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own.", 
        "reply": " I’m sure you don’t need me to tell you how little I care about your “opinion”! quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don BS! There are so many schools & programs out there today, nobody can honestly say they didn’t finish college because they couldn’t get in (unless you’re talking about Ivy League schools)!", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 07:23:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! So you don't have a problem with actual citizens becoming second rate to \"illegals\" being given a free or greatly reduced cost education? I am footing the bill for my own education. I also was limited to in state because I could not afford out of state tuition. Citizens should be preferred over illegals, not the other way around.", 
        "intTime": 20090403, 
        "postID": 21, 
        "quote": "Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "reply": " So you don't have a problem with actual citizens becoming second rate to \"illegals\" being given a free or greatly reduced cost education? I am footing the bill for my own education. I also was limited to in state because I could not afford out of state tuition. Citizens should be preferred over illegals, not the other way around.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 07:37:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here?", 
        "intTime": 20090403, 
        "postID": 22, 
        "quote": "Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support.", 
        "reply": " So what law did the KIDS break when their parents brought them here?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:06:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation. I don't remember you attacking the Bush admin and Repub Congress for dragging their feet at implementing a legally valid worker status checking system even though this allowed businesses to continue hiring illegals for YEARS and ENCOURAGED illegals to come to the US for jobs.", 
        "intTime": 20090403, 
        "postID": 23, 
        "quote": "Originally posted by RRR52: quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "reply": " I don't remember you attacking the Bush admin and Repub Congress for dragging their feet at implementing a legally valid worker status checking system even though this allowed businesses to continue hiring illegals for YEARS and ENCOURAGED illegals to come to the US for jobs.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:10:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "intTime": 20090403, 
        "postID": 24, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here?", 
        "reply": " Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:15:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "intTime": 20090403, 
        "postID": 25, 
        "quote": "Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country...", 
        "reply": " Much better, now.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:17:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. well i am a liberal so.... well a disgruntle liberal... just got to state that disgruntle part...", 
        "intTime": 20090403, 
        "postID": 26, 
        "quote": "Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "reply": " well i am a liberal so.... well a disgruntle liberal... just got to state that disgruntle part...", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:18:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don", 
        "intTime": 20090403, 
        "postID": 27, 
        "quote": "Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "reply": " No bag limit, right? Don", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:29:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management.", 
        "intTime": 20090403, 
        "postID": 28, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don", 
        "reply": " not for at least the first couple of months, gotta thin them out some for proper management.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:31:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals. Thats funny last I checked a lot of states do you just have to follow the rules (which change from state to state) to qualify and stay qualified.", 
        "intTime": 20090403, 
        "postID": 29, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "reply": " Thats funny last I checked a lot of states do you just have to follow the rules (which change from state to state) to qualify and stay qualified.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:51:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management. I can see why conservative leaders whould like that. They would like to reduce the AVERAGE intellegence of the population so more would believe what they say.", 
        "intTime": 20090403, 
        "postID": 30, 
        "quote": "Originally posted by transport1: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management.", 
        "reply": " I can see why conservative leaders whould like that. They would like to reduce the AVERAGE intellegence of the population so more would believe what they say.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:53:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "intTime": 20090402, 
        "postID": 31, 
        "quote": "", 
        "reply": "The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 14:16:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill?", 
        "intTime": 20090402, 
        "postID": 32, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "reply": " Do you know the name of the bill?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:09:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill? hmm b et it starts HR then some numbers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 33, 
        "quote": "Originally posted by Boospar: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill?", 
        "reply": " hmm b et it starts HR then some numbers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:39:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "intTime": 20090402, 
        "postID": 34, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "reply": " first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:48:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090402, 
        "postID": 35, 
        "quote": "Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:57:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? I am not racist ... I don't care if the individual that is here illegally is pea green; I don't want them getting benefits meant for legal residents. BTW, with regards the your statement \"I say hell yes let them be citizens!\" .... that is a slap in the face to everyone who waits for legal entry into the US or spends years going through the process of legally obtaining citizenship.", 
        "intTime": 20090402, 
        "postID": 36, 
        "quote": "Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " I am not racist ... I don't care if the individual that is here illegally is pea green; I don't want them getting benefits meant for legal residents. BTW, with regards the your statement \"I say hell yes let them be citizens!\" .... that is a slap in the face to everyone who waits for legal entry into the US or spends years going through the process of legally obtaining citizenship.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 16:22:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Boospar"
    }, 
    {
        "content": "first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?[/QUOTE]", 
        "intTime": 20090402, 
        "postID": 37, 
        "quote": "", 
        "reply": "first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?[/QUOTE]", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 17:05:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? The point is that they are not citizens of then US, they are citizens from another country. Why should they get discount rates when someone who is a citizen, but lives in another state, does not? What about the ones who get the education and then leave the US? Where is the return then? We did an amnesty thing back in the 80s. Part of the deal was that congress would fix immigration and the borders would be protected. See how well that has worked. Start giving more and more reasons for people to sneak in and more will sneak in. And not all are skilled or are going to college. I'll pay your tuition if you pay the loans for my kids and the classes I am taking. Deal?", 
        "intTime": 20090402, 
        "postID": 38, 
        "quote": "Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " The point is that they are not citizens of then US, they are citizens from another country. Why should they get discount rates when someone who is a citizen, but lives in another state, does not? What about the ones who get the education and then leave the US? Where is the return then? We did an amnesty thing back in the 80s. Part of the deal was that congress would fix immigration and the borders would be protected. See how well that has worked. Start giving more and more reasons for people to sneak in and more will sneak in. And not all are skilled or are going to college. I'll pay your tuition if you pay the loans for my kids and the classes I am taking. Deal?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 17:54:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "sw614"
    }, 
    {
        "content": "I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? it wouldn't be open to just anyone who decides they want to go to college. and you mentioned not everyone is skilled or college-bound? well obviously you're correct- but the ones going to college are the ones we're talking about. This will have little to no affect on immigrants not planning on going to college. If someone can give me one good, logical reason this would be a bad thing, I'll happily reconsider my opinion. I just don't see any negative consequence of giving college-bound immigrants citizenship or otherwise \"legalize them.\"", 
        "intTime": 20090402, 
        "postID": 39, 
        "quote": "", 
        "reply": "I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? it wouldn't be open to just anyone who decides they want to go to college. and you mentioned not everyone is skilled or college-bound? well obviously you're correct- but the ones going to college are the ones we're talking about. This will have little to no affect on immigrants not planning on going to college. If someone can give me one good, logical reason this would be a bad thing, I'll happily reconsider my opinion. I just don't see any negative consequence of giving college-bound immigrants citizenship or otherwise \"legalize them.\"", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:23:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "intTime": 20090402, 
        "postID": 40, 
        "quote": "Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support.", 
        "reply": " There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:26:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "intTime": 20090402, 
        "postID": 41, 
        "quote": "Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript?", 
        "reply": " What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:39:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "RRR52"
    }, 
    {
        "content": "Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "intTime": 20090402, 
        "postID": 42, 
        "quote": "", 
        "reply": "Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:02:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Oh, and btw numbers...... You are just what I thought, a Mr. \"This Member, considering joining\".", 
        "intTime": 20090402, 
        "postID": 43, 
        "quote": "", 
        "reply": "Oh, and btw numbers...... You are just what I thought, a Mr. \"This Member, considering joining\".", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:10:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "too bad they dont legalize hunting illegals... this is insane what all obama is doing to our country...", 
        "intTime": 20090402, 
        "postID": 44, 
        "quote": "", 
        "reply": "too bad they dont legalize hunting illegals... this is insane what all obama is doing to our country...", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:16:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying..... i'm not sure which post you're referring to. I don't think I referred to illegal immigrants as citizens. And you say if they're here legally you're all for it? Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "intTime": 20090402, 
        "postID": 45, 
        "quote": "Originally posted by Woody_in_La: Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "reply": " i'm not sure which post you're referring to. I don't think I referred to illegal immigrants as citizens. And you say if they're here legally you're all for it? Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:38:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot. Yes, you're an ignorant bigot to people who come her legally. And to citizens who pay full tuition because they're not a resident of a particular state.", 
        "intTime": 20090403, 
        "postID": 46, 
        "quote": "Originally posted by 20292610: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "reply": " Yes, you're an ignorant bigot to people who come her legally. And to citizens who pay full tuition because they're not a resident of a particular state.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:42:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "intTime": 20090403, 
        "postID": 47, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates.", 
        "reply": " Got my Vote!", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:54:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own.", 
        "intTime": 20090403, 
        "postID": 48, 
        "quote": "Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "reply": " A liberal is a man who will give away everything he doesn't own.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:57:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don", 
        "intTime": 20090403, 
        "postID": 49, 
        "quote": "Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "reply": " Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:59:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own. I’m sure you don’t need me to tell you how little I care about your “opinion”! quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don BS! There are so many schools & programs out there today, nobody can honestly say they didn’t finish college because they couldn’t get in (unless you’re talking about Ivy League schools)!", 
        "intTime": 20090403, 
        "postID": 50, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own.", 
        "reply": " I’m sure you don’t need me to tell you how little I care about your “opinion”! quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don BS! There are so many schools & programs out there today, nobody can honestly say they didn’t finish college because they couldn’t get in (unless you’re talking about Ivy League schools)!", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 07:23:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! So you don't have a problem with actual citizens becoming second rate to \"illegals\" being given a free or greatly reduced cost education? I am footing the bill for my own education. I also was limited to in state because I could not afford out of state tuition. Citizens should be preferred over illegals, not the other way around.", 
        "intTime": 20090403, 
        "postID": 51, 
        "quote": "Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "reply": " So you don't have a problem with actual citizens becoming second rate to \"illegals\" being given a free or greatly reduced cost education? I am footing the bill for my own education. I also was limited to in state because I could not afford out of state tuition. Citizens should be preferred over illegals, not the other way around.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 07:37:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here?", 
        "intTime": 20090403, 
        "postID": 52, 
        "quote": "Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support.", 
        "reply": " So what law did the KIDS break when their parents brought them here?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:06:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation. I don't remember you attacking the Bush admin and Repub Congress for dragging their feet at implementing a legally valid worker status checking system even though this allowed businesses to continue hiring illegals for YEARS and ENCOURAGED illegals to come to the US for jobs.", 
        "intTime": 20090403, 
        "postID": 53, 
        "quote": "Originally posted by RRR52: quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "reply": " I don't remember you attacking the Bush admin and Repub Congress for dragging their feet at implementing a legally valid worker status checking system even though this allowed businesses to continue hiring illegals for YEARS and ENCOURAGED illegals to come to the US for jobs.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:10:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "intTime": 20090403, 
        "postID": 54, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here?", 
        "reply": " Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:15:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "intTime": 20090403, 
        "postID": 55, 
        "quote": "Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country...", 
        "reply": " Much better, now.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:17:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. well i am a liberal so.... well a disgruntle liberal... just got to state that disgruntle part...", 
        "intTime": 20090403, 
        "postID": 56, 
        "quote": "Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "reply": " well i am a liberal so.... well a disgruntle liberal... just got to state that disgruntle part...", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:18:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don", 
        "intTime": 20090403, 
        "postID": 57, 
        "quote": "Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "reply": " No bag limit, right? Don", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:29:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management.", 
        "intTime": 20090403, 
        "postID": 58, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don", 
        "reply": " not for at least the first couple of months, gotta thin them out some for proper management.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:31:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals. Thats funny last I checked a lot of states do you just have to follow the rules (which change from state to state) to qualify and stay qualified.", 
        "intTime": 20090403, 
        "postID": 59, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "reply": " Thats funny last I checked a lot of states do you just have to follow the rules (which change from state to state) to qualify and stay qualified.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:51:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management. I can see why conservative leaders whould like that. They would like to reduce the AVERAGE intellegence of the population so more would believe what they say.", 
        "intTime": 20090403, 
        "postID": 60, 
        "quote": "Originally posted by transport1: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management.", 
        "reply": " I can see why conservative leaders whould like that. They would like to reduce the AVERAGE intellegence of the population so more would believe what they say.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:53:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "intTime": 20090402, 
        "postID": 61, 
        "quote": "", 
        "reply": "The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 14:16:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill?", 
        "intTime": 20090402, 
        "postID": 62, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "reply": " Do you know the name of the bill?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:09:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill? hmm b et it starts HR then some numbers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 63, 
        "quote": "Originally posted by Boospar: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. Do you know the name of the bill?", 
        "reply": " hmm b et it starts HR then some numbers. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:39:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "intTime": 20090402, 
        "postID": 64, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION.", 
        "reply": " first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:48:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090402, 
        "postID": 65, 
        "quote": "Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 15:57:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? I am not racist ... I don't care if the individual that is here illegally is pea green; I don't want them getting benefits meant for legal residents. BTW, with regards the your statement \"I say hell yes let them be citizens!\" .... that is a slap in the face to everyone who waits for legal entry into the US or spends years going through the process of legally obtaining citizenship.", 
        "intTime": 20090402, 
        "postID": 66, 
        "quote": "Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " I am not racist ... I don't care if the individual that is here illegally is pea green; I don't want them getting benefits meant for legal residents. BTW, with regards the your statement \"I say hell yes let them be citizens!\" .... that is a slap in the face to everyone who waits for legal entry into the US or spends years going through the process of legally obtaining citizenship.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 16:22:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Boospar"
    }, 
    {
        "content": "first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?[/QUOTE]", 
        "intTime": 20090402, 
        "postID": 67, 
        "quote": "", 
        "reply": "first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?[/QUOTE]", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 17:05:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? The point is that they are not citizens of then US, they are citizens from another country. Why should they get discount rates when someone who is a citizen, but lives in another state, does not? What about the ones who get the education and then leave the US? Where is the return then? We did an amnesty thing back in the 80s. Part of the deal was that congress would fix immigration and the borders would be protected. See how well that has worked. Start giving more and more reasons for people to sneak in and more will sneak in. And not all are skilled or are going to college. I'll pay your tuition if you pay the loans for my kids and the classes I am taking. Deal?", 
        "intTime": 20090402, 
        "postID": 68, 
        "quote": "Originally posted by 20292610: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. The ultimate purpose of this absurdity is to allow them to bring in their extended families. The overwhelming preponderance of those families are poorly educated, often not in great health, etc. BOHICA, baby! YOU SHALL PAY, ORDERETH THE NON-REPRESENTATIVE, TAXOPHILE IMPERIAL CONGRESS AND OBAMANATION. first of all, in-state tuition is not a free ride. I'm a college student paying in-state tuition and it's not a handout. Would you like to pay my tuition for a semester? second, these are kids wanting to go to college and make something of their lives. I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation?", 
        "reply": " The point is that they are not citizens of then US, they are citizens from another country. Why should they get discount rates when someone who is a citizen, but lives in another state, does not? What about the ones who get the education and then leave the US? Where is the return then? We did an amnesty thing back in the 80s. Part of the deal was that congress would fix immigration and the borders would be protected. See how well that has worked. Start giving more and more reasons for people to sneak in and more will sneak in. And not all are skilled or are going to college. I'll pay your tuition if you pay the loans for my kids and the classes I am taking. Deal?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 17:54:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "sw614"
    }, 
    {
        "content": "I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? it wouldn't be open to just anyone who decides they want to go to college. and you mentioned not everyone is skilled or college-bound? well obviously you're correct- but the ones going to college are the ones we're talking about. This will have little to no affect on immigrants not planning on going to college. If someone can give me one good, logical reason this would be a bad thing, I'll happily reconsider my opinion. I just don't see any negative consequence of giving college-bound immigrants citizenship or otherwise \"legalize them.\"", 
        "intTime": 20090402, 
        "postID": 69, 
        "quote": "", 
        "reply": "I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? it wouldn't be open to just anyone who decides they want to go to college. and you mentioned not everyone is skilled or college-bound? well obviously you're correct- but the ones going to college are the ones we're talking about. This will have little to no affect on immigrants not planning on going to college. If someone can give me one good, logical reason this would be a bad thing, I'll happily reconsider my opinion. I just don't see any negative consequence of giving college-bound immigrants citizenship or otherwise \"legalize them.\"", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:23:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "intTime": 20090402, 
        "postID": 70, 
        "quote": "Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support.", 
        "reply": " There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:26:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "intTime": 20090402, 
        "postID": 71, 
        "quote": "Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript?", 
        "reply": " What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 19:39:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "RRR52"
    }, 
    {
        "content": "Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "intTime": 20090402, 
        "postID": 72, 
        "quote": "", 
        "reply": "Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:02:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Oh, and btw numbers...... You are just what I thought, a Mr. \"This Member, considering joining\".", 
        "intTime": 20090402, 
        "postID": 73, 
        "quote": "", 
        "reply": "Oh, and btw numbers...... You are just what I thought, a Mr. \"This Member, considering joining\".", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:10:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "too bad they dont legalize hunting illegals... this is insane what all obama is doing to our country...", 
        "intTime": 20090402, 
        "postID": 74, 
        "quote": "", 
        "reply": "too bad they dont legalize hunting illegals... this is insane what all obama is doing to our country...", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:16:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying..... i'm not sure which post you're referring to. I don't think I referred to illegal immigrants as citizens. And you say if they're here legally you're all for it? Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "intTime": 20090402, 
        "postID": 75, 
        "quote": "Originally posted by Woody_in_La: Yo 20292610, from your own post the key word is citizens.... Do we have a problem with understanding the difference of a citizen and a non-citizen which this bill is aimed? I second what Boospar posted. I wouldn't care if you were from Pluto. If here legally, I am all for it. If not, you are pizzing in the face of all of those that are. I really do feel for you (NOT) if you can't grasp what we are saying.....", 
        "reply": " i'm not sure which post you're referring to. I don't think I referred to illegal immigrants as citizens. And you say if they're here legally you're all for it? Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-02 20:38:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "20292610"
    }, 
    {
        "content": "quote: Originally posted by 20292610: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot. Yes, you're an ignorant bigot to people who come her legally. And to citizens who pay full tuition because they're not a resident of a particular state.", 
        "intTime": 20090403, 
        "postID": 76, 
        "quote": "Originally posted by 20292610: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. There's actually a difference between \"tolerant\" and \"liberal.\" I am not a liberal. I'm just not an ignorant bigot.", 
        "reply": " Yes, you're an ignorant bigot to people who come her legally. And to citizens who pay full tuition because they're not a resident of a particular state.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:42:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "intTime": 20090403, 
        "postID": 77, 
        "quote": "Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates.", 
        "reply": " Got my Vote!", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:54:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own.", 
        "intTime": 20090403, 
        "postID": 78, 
        "quote": "Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "reply": " A liberal is a man who will give away everything he doesn't own.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:57:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don", 
        "intTime": 20090403, 
        "postID": 79, 
        "quote": "Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal.", 
        "reply": " Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 06:59:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own. I’m sure you don’t need me to tell you how little I care about your “opinion”! quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don BS! There are so many schools & programs out there today, nobody can honestly say they didn’t finish college because they couldn’t get in (unless you’re talking about Ivy League schools)!", 
        "intTime": 20090403, 
        "postID": 80, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! A liberal is a man who will give away everything he doesn't own.", 
        "reply": " I’m sure you don’t need me to tell you how little I care about your “opinion”! quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by 20292610: Well that's exactly what this is about. A chance for students who want to further their education to become legal. Meanwhile, the illegals taking up classrooms make it harder/more expensive for U.S. Citizen students to get into a college. Don BS! There are so many schools & programs out there today, nobody can honestly say they didn’t finish college because they couldn’t get in (unless you’re talking about Ivy League schools)!", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 07:23:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote! So you don't have a problem with actual citizens becoming second rate to \"illegals\" being given a free or greatly reduced cost education? I am footing the bill for my own education. I also was limited to in state because I could not afford out of state tuition. Citizens should be preferred over illegals, not the other way around.", 
        "intTime": 20090403, 
        "postID": 81, 
        "quote": "Originally posted by Knele: quote: Originally posted by RRR52: The Congress is looking to pass a bill that would legalize illegal kids, so they can attend college on your dime, or, at least, at reduced in-state rates. Got my Vote!", 
        "reply": " So you don't have a problem with actual citizens becoming second rate to \"illegals\" being given a free or greatly reduced cost education? I am footing the bill for my own education. I also was limited to in state because I could not afford out of state tuition. Citizens should be preferred over illegals, not the other way around.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 07:37:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here?", 
        "intTime": 20090403, 
        "postID": 82, 
        "quote": "Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support.", 
        "reply": " So what law did the KIDS break when their parents brought them here?", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:06:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation. I don't remember you attacking the Bush admin and Repub Congress for dragging their feet at implementing a legally valid worker status checking system even though this allowed businesses to continue hiring illegals for YEARS and ENCOURAGED illegals to come to the US for jobs.", 
        "intTime": 20090403, 
        "postID": 83, 
        "quote": "Originally posted by RRR52: quote: Originally posted by 20292610: I'm sure it wouldn't be as simple as \"oh, you want to go to college? ok, you're in.\" they would first have to have an acceptable educational history. what college would accept an applicant without a transcript? What nation would mock its own laws to allow extra people to enter when jobs have already become scarce? It is NOT a matter of what is good for the citizens of America. It is a matter of what the idiot lawmakers think will better solidify their power and control over the nation.", 
        "reply": " I don't remember you attacking the Bush admin and Repub Congress for dragging their feet at implementing a legally valid worker status checking system even though this allowed businesses to continue hiring illegals for YEARS and ENCOURAGED illegals to come to the US for jobs.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:10:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "intTime": 20090403, 
        "postID": 84, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here?", 
        "reply": " Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:15:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "intTime": 20090403, 
        "postID": 85, 
        "quote": "Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country...", 
        "reply": " Much better, now.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:17:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. well i am a liberal so.... well a disgruntle liberal... just got to state that disgruntle part...", 
        "intTime": 20090403, 
        "postID": 86, 
        "quote": "Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "reply": " well i am a liberal so.... well a disgruntle liberal... just got to state that disgruntle part...", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:18:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don", 
        "intTime": 20090403, 
        "postID": 87, 
        "quote": "Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now.", 
        "reply": " No bag limit, right? Don", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:29:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management.", 
        "intTime": 20090403, 
        "postID": 88, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don", 
        "reply": " not for at least the first couple of months, gotta thin them out some for proper management.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:31:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals. Thats funny last I checked a lot of states do you just have to follow the rules (which change from state to state) to qualify and stay qualified.", 
        "intTime": 20090403, 
        "postID": 89, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by rayld2: quote: Originally posted by Drmwvr: quote: Originally posted by 20292610: ....I say hell yes let them be citizens! We need more educated people in this country! Why should we let bigotry and racism prevent us from becoming a more educated nation? Oh God! Just what we need...another idiot liberal on board advocating touchy feely BS for citizens to support. So what law did the KIDS break when their parents brought them here? Ironic that most states dont give military stationed in their states in state tuition but its ok for illegals.", 
        "reply": " Thats funny last I checked a lot of states do you just have to follow the rules (which change from state to state) to qualify and stay qualified.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:51:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management. I can see why conservative leaders whould like that. They would like to reduce the AVERAGE intellegence of the population so more would believe what they say.", 
        "intTime": 20090403, 
        "postID": 90, 
        "quote": "Originally posted by transport1: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by transport1: quote: Originally posted by outlaws93: too bad they dont legalize hunting illegals liberals... this is insane what all obama is doing to our country... Much better, now. No bag limit, right? Don not for at least the first couple of months, gotta thin them out some for proper management.", 
        "reply": " I can see why conservative leaders whould like that. They would like to reduce the AVERAGE intellegence of the population so more would believe what they say.", 
        "threadID": "409192893_6450066912001", 
        "time": "2009-04-03 08:53:00", 
        "title": "Amnesty for Those Who Mock American Law", 
        "userID": "rayld2"
    }
]