[
    {
        "content": "Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "", 
        "reply": "Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 05:54:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Good old Banana Republicans...party of \"what ifs\"", 
        "intTime": 20090429, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good old Banana Republicans...party of \"what ifs\"", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" In his world there is not 'what if's' But then again he was the enemy...a CIA Op.", 
        "intTime": 20090429, 
        "postID": 3, 
        "quote": "Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\"", 
        "reply": " In his world there is not 'what if's' But then again he was the enemy...a CIA Op.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 06:16:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "intTime": 20090429, 
        "postID": 4, 
        "quote": "Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\"", 
        "reply": " That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: In rewatching the old movie \"Manchurian Candidate\", you'd be surprised at the similarities. And to think, the training was in the Halls of Education and Politics. Accusing a sitting President of treason is walking a fine line..........", 
        "intTime": 20090429, 
        "postID": 5, 
        "quote": "Originally posted by klassylady25: In rewatching the old movie \"Manchurian Candidate\", you'd be surprised at the similarities. And to think, the training was in the Halls of Education and Politics.", 
        "reply": " Accusing a sitting President of treason is walking a fine line..........", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Why does it have to be nuclear? What about a car bomb at a nursery? Bombs in a tunnel? Takeover at a school? That stuff start up here, God forbid, and lets see where we all stand. I do not want torture. What we did was not torture. That is the argument. Some say sleep deprivation is torture. Some say not having a TV in the cell with 130 channels is torture. Let us define to the T where every person is happy that the final dealings with the terrorists is not torture.", 
        "intTime": 20090429, 
        "postID": 6, 
        "quote": "", 
        "reply": "Why does it have to be nuclear? What about a car bomb at a nursery? Bombs in a tunnel? Takeover at a school? That stuff start up here, God forbid, and lets see where we all stand. I do not want torture. What we did was not torture. That is the argument. Some say sleep deprivation is torture. Some say not having a TV in the cell with 130 channels is torture. Let us define to the T where every person is happy that the final dealings with the terrorists is not torture.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:25:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\" Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "intTime": 20090429, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "reply": " Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:36:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture...", 
        "intTime": 20090429, 
        "postID": 8, 
        "quote": "", 
        "reply": "Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture...", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:40:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down.", 
        "intTime": 20090429, 
        "postID": 9, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "reply": " There dead, they know it, and just dont have enough sense to lie down.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:44:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down. Could you be a little more melodramatic?", 
        "intTime": 20090429, 
        "postID": 10, 
        "quote": "Originally posted by john2x: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down.", 
        "reply": " Could you be a little more melodramatic?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:53:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "threerings"
    }, 
    {
        "content": "Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "intTime": 20090429, 
        "postID": 11, 
        "quote": "", 
        "reply": "Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:15:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep.", 
        "intTime": 20090429, 
        "postID": 12, 
        "quote": "And only complete AHs are for constitutional violations", 
        "reply": " Where? That is the argument. One side says nope other side says yep.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:20:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "intTime": 20090429, 
        "postID": 13, 
        "quote": "Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "reply": " Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:30:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "intTime": 20090429, 
        "postID": 14, 
        "quote": "Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "reply": " So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:31:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "intTime": 20090429, 
        "postID": 15, 
        "quote": "", 
        "reply": "I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:40:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture Yeh, I have a bunch of torture too, resetting my arm twice with no pain killer. Someone needs to arrest those Navy Docs. And that was the start of my 21yr tortured career.", 
        "intTime": 20090429, 
        "postID": 16, 
        "quote": "Originally posted by ACR26: I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "reply": " Yeh, I have a bunch of torture too, resetting my arm twice with no pain killer. Someone needs to arrest those Navy Docs. And that was the start of my 21yr tortured career.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:44:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "intTime": 20090429, 
        "postID": 17, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:56:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "boy...... after hearing some of youz guys stories I sure am glad the proctologist used numb-zit. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090429, 
        "postID": 18, 
        "quote": "", 
        "reply": "boy...... after hearing some of youz guys stories I sure am glad the proctologist used numb-zit. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:56:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI. Absolutely! They need to replay the 9/11 scenes especially the falling bodies and splattered people on the sidewalks then come back and shed a mother humpin tear for one of those terrorist turd eating fugtools, sinc ethey played loud music, hit them, put insects in their rms, called them mean names, had women talk to them, and waterboarded their azzes. I want to see some aclu azzhole fuile lawsuits against the military for their abuses in SERE and bootcamp, so whats the difference?", 
        "intTime": 20090429, 
        "postID": 19, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "reply": " Absolutely! They need to replay the 9/11 scenes especially the falling bodies and splattered people on the sidewalks then come back and shed a mother humpin tear for one of those terrorist turd eating fugtools, sinc ethey played loud music, hit them, put insects in their rms, called them mean names, had women talk to them, and waterboarded their azzes. I want to see some aclu azzhole fuile lawsuits against the military for their abuses in SERE and bootcamp, so whats the difference?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 16:07:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Author Topic: Say It's Osama. What If He Won't Talk? ACR26 Posted Wed 29 April 2009 02:20 PM quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep. They can argue all the want but article 6 is clear on treatys. dont you agree? So whats the argument when its spelled out? There can be no argument if torture was inflicted. Thats what these documents are meant to prove.", 
        "intTime": 20090429, 
        "postID": 20, 
        "quote": "", 
        "reply": "Author Topic: Say It's Osama. What If He Won't Talk? ACR26 Posted Wed 29 April 2009 02:20 PM quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep. They can argue all the want but article 6 is clear on treatys. dont you agree? So whats the argument when its spelled out? There can be no argument if torture was inflicted. Thats what these documents are meant to prove.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:17:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "what kind of fool wants to base American policy on an event that will NEVER happen?", 
        "intTime": 20090429, 
        "postID": 21, 
        "quote": "", 
        "reply": "what kind of fool wants to base American policy on an event that will NEVER happen?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:29:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. Im not concerned about anyone except the USA our constitution,credibility, and Honor. Why did we sign these international agreements or join world organizations and expect all to follow them and think we can just break them when its convient and enforce them on other nations with supierior force? I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "intTime": 20090429, 
        "postID": 22, 
        "quote": "Originally posted by GunnyRet03: quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. Im not concerned about anyone except the USA our constitution,credibility, and Honor. Why did we sign these international agreements or join world organizations and expect all to follow them and think we can just break them when its convient and enforce them on other nations with supierior force? I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "reply": "", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:32:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Every military has some form of \"boot camp\". But you know this already. SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. but go ahead and make your list. It'll be fun knocking it down.", 
        "intTime": 20090429, 
        "postID": 23, 
        "quote": "So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " I can barley see you past your strawman. Boot camp is voluntary and is not torture. Every military has some form of \"boot camp\". But you know this already. SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. but go ahead and make your list. It'll be fun knocking it down.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:33:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "intTime": 20090429, 
        "postID": 24, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:41:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: No thats training and preparation in survival in case the enemy dont honor international treaties. .......in case? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090429, 
        "postID": 25, 
        "quote": "Originally posted by john2x: No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "reply": " .......in case? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:50:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "ACR26 Posted Wed 29 April 2009 02:40 PM I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture No Novacaine? That would have been a case for the I.G. If it were me saddests. Just because your in the military dont mean you dont have rights or have to follow orders you consider unlawful. Reminds me of a time when I went to the base infirmary with a boil under my armpit the size of a small lemon. They said novacain wouldnt help due to the infection and held me down and just lanced it I let out one yell and thought it was over. That was till he started trying to pack in a yard of gauze drain. Thats when the yelling began and a major came in to see what all the screaming was about. He used physcology He medics and said what are you doing to this poor guy, That incision isnt big enough give me that scalple. I said no no its pleny big he said are you sure I said yes sir, so I gritted my teeth and kept my mouth shut. Never went back removed the drain myself. now that was torture.", 
        "intTime": 20090429, 
        "postID": 26, 
        "quote": "", 
        "reply": "ACR26 Posted Wed 29 April 2009 02:40 PM I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture No Novacaine? That would have been a case for the I.G. If it were me saddests. Just because your in the military dont mean you dont have rights or have to follow orders you consider unlawful. Reminds me of a time when I went to the base infirmary with a boil under my armpit the size of a small lemon. They said novacain wouldnt help due to the infection and held me down and just lanced it I let out one yell and thought it was over. That was till he started trying to pack in a yard of gauze drain. Thats when the yelling began and a major came in to see what all the screaming was about. He used physcology He medics and said what are you doing to this poor guy, That incision isnt big enough give me that scalple. I said no no its pleny big he said are you sure I said yes sir, so I gritted my teeth and kept my mouth shut. Never went back removed the drain myself. now that was torture.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 23:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "What if Santa Claus went rogue? There's a \"what if\" for any statement that can ever be made.", 
        "intTime": 20090430, 
        "postID": 27, 
        "quote": "", 
        "reply": "What if Santa Claus went rogue? There's a \"what if\" for any statement that can ever be made.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-30 05:22:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Terrorism is voluntary. Every military has some form of \"boot camp\". But you know this already. Boot Camp is not voluntary under the draft, and you may remember we had them quite a few times. Nice strawman btw SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. Yup you guessed it, Terrorism is voluntary. but go ahead and make your list. It'll be fun knocking it down.", 
        "intTime": 20090430, 
        "postID": 28, 
        "quote": "Originally posted by karlhungusjr: quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Terrorism is voluntary. Every military has some form of \"boot camp\". But you know this already. Boot Camp is not voluntary under the draft, and you may remember we had them quite a few times. Nice strawman btw SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. Yup you guessed it, Terrorism is voluntary. but go ahead and make your list. It'll be fun knocking it down.", 
        "reply": "", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-30 05:36:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "intTime": 20090429, 
        "postID": 29, 
        "quote": "", 
        "reply": "Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 05:54:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Good old Banana Republicans...party of \"what ifs\"", 
        "intTime": 20090429, 
        "postID": 30, 
        "quote": "", 
        "reply": "Good old Banana Republicans...party of \"what ifs\"", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" In his world there is not 'what if's' But then again he was the enemy...a CIA Op.", 
        "intTime": 20090429, 
        "postID": 31, 
        "quote": "Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\"", 
        "reply": " In his world there is not 'what if's' But then again he was the enemy...a CIA Op.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 06:16:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "intTime": 20090429, 
        "postID": 32, 
        "quote": "Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\"", 
        "reply": " That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: In rewatching the old movie \"Manchurian Candidate\", you'd be surprised at the similarities. And to think, the training was in the Halls of Education and Politics. Accusing a sitting President of treason is walking a fine line..........", 
        "intTime": 20090429, 
        "postID": 33, 
        "quote": "Originally posted by klassylady25: In rewatching the old movie \"Manchurian Candidate\", you'd be surprised at the similarities. And to think, the training was in the Halls of Education and Politics.", 
        "reply": " Accusing a sitting President of treason is walking a fine line..........", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Why does it have to be nuclear? What about a car bomb at a nursery? Bombs in a tunnel? Takeover at a school? That stuff start up here, God forbid, and lets see where we all stand. I do not want torture. What we did was not torture. That is the argument. Some say sleep deprivation is torture. Some say not having a TV in the cell with 130 channels is torture. Let us define to the T where every person is happy that the final dealings with the terrorists is not torture.", 
        "intTime": 20090429, 
        "postID": 34, 
        "quote": "", 
        "reply": "Why does it have to be nuclear? What about a car bomb at a nursery? Bombs in a tunnel? Takeover at a school? That stuff start up here, God forbid, and lets see where we all stand. I do not want torture. What we did was not torture. That is the argument. Some say sleep deprivation is torture. Some say not having a TV in the cell with 130 channels is torture. Let us define to the T where every person is happy that the final dealings with the terrorists is not torture.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:25:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\" Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "intTime": 20090429, 
        "postID": 35, 
        "quote": "Originally posted by GunnyRet03: Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "reply": " Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:36:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture...", 
        "intTime": 20090429, 
        "postID": 36, 
        "quote": "", 
        "reply": "Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture...", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:40:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down.", 
        "intTime": 20090429, 
        "postID": 37, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "reply": " There dead, they know it, and just dont have enough sense to lie down.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:44:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down. Could you be a little more melodramatic?", 
        "intTime": 20090429, 
        "postID": 38, 
        "quote": "Originally posted by john2x: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down.", 
        "reply": " Could you be a little more melodramatic?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:53:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "threerings"
    }, 
    {
        "content": "Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "intTime": 20090429, 
        "postID": 39, 
        "quote": "", 
        "reply": "Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:15:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep.", 
        "intTime": 20090429, 
        "postID": 40, 
        "quote": "And only complete AHs are for constitutional violations", 
        "reply": " Where? That is the argument. One side says nope other side says yep.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:20:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "intTime": 20090429, 
        "postID": 41, 
        "quote": "Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "reply": " Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:30:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "intTime": 20090429, 
        "postID": 42, 
        "quote": "Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "reply": " So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:31:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "intTime": 20090429, 
        "postID": 43, 
        "quote": "", 
        "reply": "I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:40:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture Yeh, I have a bunch of torture too, resetting my arm twice with no pain killer. Someone needs to arrest those Navy Docs. And that was the start of my 21yr tortured career.", 
        "intTime": 20090429, 
        "postID": 44, 
        "quote": "Originally posted by ACR26: I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "reply": " Yeh, I have a bunch of torture too, resetting my arm twice with no pain killer. Someone needs to arrest those Navy Docs. And that was the start of my 21yr tortured career.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:44:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "intTime": 20090429, 
        "postID": 45, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:56:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "boy...... after hearing some of youz guys stories I sure am glad the proctologist used numb-zit. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090429, 
        "postID": 46, 
        "quote": "", 
        "reply": "boy...... after hearing some of youz guys stories I sure am glad the proctologist used numb-zit. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:56:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI. Absolutely! They need to replay the 9/11 scenes especially the falling bodies and splattered people on the sidewalks then come back and shed a mother humpin tear for one of those terrorist turd eating fugtools, sinc ethey played loud music, hit them, put insects in their rms, called them mean names, had women talk to them, and waterboarded their azzes. I want to see some aclu azzhole fuile lawsuits against the military for their abuses in SERE and bootcamp, so whats the difference?", 
        "intTime": 20090429, 
        "postID": 47, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "reply": " Absolutely! They need to replay the 9/11 scenes especially the falling bodies and splattered people on the sidewalks then come back and shed a mother humpin tear for one of those terrorist turd eating fugtools, sinc ethey played loud music, hit them, put insects in their rms, called them mean names, had women talk to them, and waterboarded their azzes. I want to see some aclu azzhole fuile lawsuits against the military for their abuses in SERE and bootcamp, so whats the difference?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 16:07:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Author Topic: Say It's Osama. What If He Won't Talk? ACR26 Posted Wed 29 April 2009 02:20 PM quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep. They can argue all the want but article 6 is clear on treatys. dont you agree? So whats the argument when its spelled out? There can be no argument if torture was inflicted. Thats what these documents are meant to prove.", 
        "intTime": 20090429, 
        "postID": 48, 
        "quote": "", 
        "reply": "Author Topic: Say It's Osama. What If He Won't Talk? ACR26 Posted Wed 29 April 2009 02:20 PM quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep. They can argue all the want but article 6 is clear on treatys. dont you agree? So whats the argument when its spelled out? There can be no argument if torture was inflicted. Thats what these documents are meant to prove.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:17:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "what kind of fool wants to base American policy on an event that will NEVER happen?", 
        "intTime": 20090429, 
        "postID": 49, 
        "quote": "", 
        "reply": "what kind of fool wants to base American policy on an event that will NEVER happen?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:29:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. Im not concerned about anyone except the USA our constitution,credibility, and Honor. Why did we sign these international agreements or join world organizations and expect all to follow them and think we can just break them when its convient and enforce them on other nations with supierior force? I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "intTime": 20090429, 
        "postID": 50, 
        "quote": "Originally posted by GunnyRet03: quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. Im not concerned about anyone except the USA our constitution,credibility, and Honor. Why did we sign these international agreements or join world organizations and expect all to follow them and think we can just break them when its convient and enforce them on other nations with supierior force? I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "reply": "", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:32:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Every military has some form of \"boot camp\". But you know this already. SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. but go ahead and make your list. It'll be fun knocking it down.", 
        "intTime": 20090429, 
        "postID": 51, 
        "quote": "So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " I can barley see you past your strawman. Boot camp is voluntary and is not torture. Every military has some form of \"boot camp\". But you know this already. SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. but go ahead and make your list. It'll be fun knocking it down.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:33:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "intTime": 20090429, 
        "postID": 52, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:41:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: No thats training and preparation in survival in case the enemy dont honor international treaties. .......in case? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090429, 
        "postID": 53, 
        "quote": "Originally posted by john2x: No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "reply": " .......in case? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:50:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "ACR26 Posted Wed 29 April 2009 02:40 PM I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture No Novacaine? That would have been a case for the I.G. If it were me saddests. Just because your in the military dont mean you dont have rights or have to follow orders you consider unlawful. Reminds me of a time when I went to the base infirmary with a boil under my armpit the size of a small lemon. They said novacain wouldnt help due to the infection and held me down and just lanced it I let out one yell and thought it was over. That was till he started trying to pack in a yard of gauze drain. Thats when the yelling began and a major came in to see what all the screaming was about. He used physcology He medics and said what are you doing to this poor guy, That incision isnt big enough give me that scalple. I said no no its pleny big he said are you sure I said yes sir, so I gritted my teeth and kept my mouth shut. Never went back removed the drain myself. now that was torture.", 
        "intTime": 20090429, 
        "postID": 54, 
        "quote": "", 
        "reply": "ACR26 Posted Wed 29 April 2009 02:40 PM I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture No Novacaine? That would have been a case for the I.G. If it were me saddests. Just because your in the military dont mean you dont have rights or have to follow orders you consider unlawful. Reminds me of a time when I went to the base infirmary with a boil under my armpit the size of a small lemon. They said novacain wouldnt help due to the infection and held me down and just lanced it I let out one yell and thought it was over. That was till he started trying to pack in a yard of gauze drain. Thats when the yelling began and a major came in to see what all the screaming was about. He used physcology He medics and said what are you doing to this poor guy, That incision isnt big enough give me that scalple. I said no no its pleny big he said are you sure I said yes sir, so I gritted my teeth and kept my mouth shut. Never went back removed the drain myself. now that was torture.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 23:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "What if Santa Claus went rogue? There's a \"what if\" for any statement that can ever be made.", 
        "intTime": 20090430, 
        "postID": 55, 
        "quote": "", 
        "reply": "What if Santa Claus went rogue? There's a \"what if\" for any statement that can ever be made.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-30 05:22:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Terrorism is voluntary. Every military has some form of \"boot camp\". But you know this already. Boot Camp is not voluntary under the draft, and you may remember we had them quite a few times. Nice strawman btw SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. Yup you guessed it, Terrorism is voluntary. but go ahead and make your list. It'll be fun knocking it down.", 
        "intTime": 20090430, 
        "postID": 56, 
        "quote": "Originally posted by karlhungusjr: quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Terrorism is voluntary. Every military has some form of \"boot camp\". But you know this already. Boot Camp is not voluntary under the draft, and you may remember we had them quite a few times. Nice strawman btw SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. Yup you guessed it, Terrorism is voluntary. but go ahead and make your list. It'll be fun knocking it down.", 
        "reply": "", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-30 05:36:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "intTime": 20090429, 
        "postID": 57, 
        "quote": "", 
        "reply": "Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 05:54:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Good old Banana Republicans...party of \"what ifs\"", 
        "intTime": 20090429, 
        "postID": 58, 
        "quote": "", 
        "reply": "Good old Banana Republicans...party of \"what ifs\"", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" In his world there is not 'what if's' But then again he was the enemy...a CIA Op.", 
        "intTime": 20090429, 
        "postID": 59, 
        "quote": "Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\"", 
        "reply": " In his world there is not 'what if's' But then again he was the enemy...a CIA Op.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 06:16:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "intTime": 20090429, 
        "postID": 60, 
        "quote": "Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\"", 
        "reply": " That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: In rewatching the old movie \"Manchurian Candidate\", you'd be surprised at the similarities. And to think, the training was in the Halls of Education and Politics. Accusing a sitting President of treason is walking a fine line..........", 
        "intTime": 20090429, 
        "postID": 61, 
        "quote": "Originally posted by klassylady25: In rewatching the old movie \"Manchurian Candidate\", you'd be surprised at the similarities. And to think, the training was in the Halls of Education and Politics.", 
        "reply": " Accusing a sitting President of treason is walking a fine line..........", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Why does it have to be nuclear? What about a car bomb at a nursery? Bombs in a tunnel? Takeover at a school? That stuff start up here, God forbid, and lets see where we all stand. I do not want torture. What we did was not torture. That is the argument. Some say sleep deprivation is torture. Some say not having a TV in the cell with 130 channels is torture. Let us define to the T where every person is happy that the final dealings with the terrorists is not torture.", 
        "intTime": 20090429, 
        "postID": 62, 
        "quote": "", 
        "reply": "Why does it have to be nuclear? What about a car bomb at a nursery? Bombs in a tunnel? Takeover at a school? That stuff start up here, God forbid, and lets see where we all stand. I do not want torture. What we did was not torture. That is the argument. Some say sleep deprivation is torture. Some say not having a TV in the cell with 130 channels is torture. Let us define to the T where every person is happy that the final dealings with the terrorists is not torture.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:25:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\" Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "intTime": 20090429, 
        "postID": 63, 
        "quote": "Originally posted by GunnyRet03: Say It's Osama. What If He Won't Talk? By Michael Scheuer 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/24/AR2009042403459_pf.html' In surprisingly good English, the captive quietly answers: 'Yes, all thanks to God, I do know when the mujaheddin will, with God's permission, detonate a nuclear weapon in the United States, and I also know how many and in which cities.\" Startled, the CIA interrogators quickly demand more detail. Smiling his trademark shy smile, the captive says nothing. Reporting the interrogation's results to the White House, the CIA director can only shrug when the president asks: \"What can we do to make Osama bin Laden talk?\" Americans should keep this worst-case scenario in mind as they watch the tragicomic spectacle taking place in the wake of the publication of the Justice Department's interrogation memos. It will help them recognize this episode of political theater as another major step in the bipartisan dismantling of America's defenses based on the requirements of presidential ideology. George W. Bush's democracy-spreading philosophy yielded the invasion of Iraq and set the United States at war with much of the Muslim world. Bush's worldview thereby produced an enemy that quickly outpaced the limited but proven threat-containing capacities of the major U.S. counterterrorism programs -- rendition, interrogation and unmanned aerial vehicle attacks. Now, in a single week, President Obama has eliminated two-thirds of that successful-but-not-sufficient national defense troika because his personal ideology -- a fair gist of which is \"If the world likes us more we are more secure\" -- cannot tolerate harsh interrogation techniques, torture or coercive interviews, call them what you will.<edit> Whereas Bush saw a world of Muslims yearning to betray their God for Western secularism, Obama gazes upon a globe that he regards as largely carnivore-free and believes that remaining threats can be defused by semantic warfare; just stop saying \"War on Terror\" and give talks in Turkey and on al-Arabiyah television, for example. Americans should be clear on what Obama has done. In a breathtaking display of self-righteousness and intellectual arrogance, the president told Americans that his personal beliefs are more important than protecting their country, their homes and their families. The interrogation techniques in question, the president asserted, are a sign that Americans have lost their \"moral compass,\" a compliment similar to Attorney General Eric Holder's identifying them as \"moral cowards.\" Mulling Obama's claim, one can wonder what could be more moral for a president than doing all that is needed to defend America and its citizens? Or, asked another way, is it moral for the president of the United States to abandon intelligence tools that have saved the lives and property of Americans and their allies in favor of his own ideological beliefs? Before enthroning Obama's personal morality as U.S. defense policy, of course, some dirty work had to be done. Last Sunday, Obama's hit man and White House chief of staff Rahm Emanuel led the charge by telling the American people that the interrogation techniques are a major recruiting tool for al-Qaeda and its Islamist partners. Well, no, Mr. Emanuel, that is not at all the case. The techniques surely are not popular with our foes and their supporters -- should that be a concern in any event? -- but they do not even make the Islamists' hit parade of anti-U.S. recruiting tools. That list is headed by Washington's support for Arab tyrannies in Saudi Arabia and Egypt, its presence on the Arabian Peninsula and its unqualified support for Israel. Still, Emanuel's statement surely sounded plausible to Americans who have received no education about our Islamist enemy's true motivation from Obama, George W. Bush, Clinton or George H.W. Bush. Next, the president used his personal popularity and the stature of his office to implicitly identify as liars those former senior U.S. officials who know -- not \"argue\" or \"contend\" or \"assert\" but know -- that the interrogation techniques have yielded intelligence essential to the nation's defense. The integrity, intellect and reputations of Judge Michael Mukasey, Gen. Michael V. Hayden and others have now been besmirched by Obama because their realistic worldview and firsthand experience do not mesh with the president's desire to install his personal \"moral compass\" as the core of U.S. foreign and defense policy. And after visiting CIA headquarters last week, the president made it clear that he rejected statements surely made by CIA officers who risked their careers to tell him how many successful covert operations against al-Qaeda have flowed from interrogation information. As with all Jacobins, Obama cannot allow a hard and often brutal reality -- call it an inconvenient truth -- to impinge on his view of how the world should and must be made to work. And so as the Justice Department memos farce plays out over the coming weeks, Americans can be confident that both parties will play politics to the hilt while letting the nation's safety take the hindmost. Obama and his team will \"reluctantly\" agree to a congressional investigation of former Bush officials and serving CIA officers, politically targeted indictments from Holder's minions and perhaps even a truth commission to prove that even the United States can aspire to be a half-baked Third World country. Republicans will welcome the Democrats' actions as a chance to reclaim their mantle as the most reliable protectors of U.S. national security. They will seek to prove that Obama and his party are eager to persecute the men and women who defend America and will denounce Democratic actions as a \"witch hunt.\" Those words were used last week by Sen. John McCain, a man who seems to have forgotten that as a presidential candidate he, more than anyone, persuaded Americans that the interrogation techniques amounted to torture and gloried in calling the CIA and its officers a \"rogue institution.\" Americans and their country's security will be the losers. The Republicans do not have the votes to stop Obama, and the world will not be safer for America because the president abandons interrogations to please his party's left wing and the European pacifists it so admires. Both are incorrigibly anti-American, oppose the use of force in America's defense and -- like Obama -- naively believe that the West's Islamist foes can be sweet-talked into a future alive with the sound of kumbaya. So if the above worst-case scenario ever comes to pass, Americans will have at least two things from which to take solace, even after the loss of major cities and tens of thousands of countrymen. First, they will know that their president believes that those losses are a small price to pay for stopping interrogations and making foreign peoples like us more. And second, they will see Osama bin Laden's shy smile turn into a calm and beautiful God-is-Great grin. Michael Scheuer, the chief of the CIA's Osama bin Laden unit from 1996 to 1999, is the author of \"Marching Toward Hell: America and Islam After Iraq.\"", 
        "reply": " Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:36:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture...", 
        "intTime": 20090429, 
        "postID": 64, 
        "quote": "", 
        "reply": "Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture...", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:40:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down.", 
        "intTime": 20090429, 
        "postID": 65, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking.", 
        "reply": " There dead, they know it, and just dont have enough sense to lie down.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:44:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down. Could you be a little more melodramatic?", 
        "intTime": 20090429, 
        "postID": 66, 
        "quote": "Originally posted by john2x: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: Good old Banana Republicans...party of \"what ifs\" That's all they have left - they've shown that they can't govern without running it into the ground, and now that they are powerless (take the budget getting passed without a single Republican \"yes\" vote) and you can see why they are throwing their little tantrum like a spoiled 3 year old in need of a spanking. There dead, they know it, and just dont have enough sense to lie down.", 
        "reply": " Could you be a little more melodramatic?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 13:53:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "threerings"
    }, 
    {
        "content": "Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "intTime": 20090429, 
        "postID": 67, 
        "quote": "", 
        "reply": "Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:15:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep.", 
        "intTime": 20090429, 
        "postID": 68, 
        "quote": "And only complete AHs are for constitutional violations", 
        "reply": " Where? That is the argument. One side says nope other side says yep.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:20:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "intTime": 20090429, 
        "postID": 69, 
        "quote": "Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community?", 
        "reply": " Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:30:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "intTime": 20090429, 
        "postID": 70, 
        "quote": "Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations.", 
        "reply": " So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:31:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "intTime": 20090429, 
        "postID": 71, 
        "quote": "", 
        "reply": "I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:40:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture Yeh, I have a bunch of torture too, resetting my arm twice with no pain killer. Someone needs to arrest those Navy Docs. And that was the start of my 21yr tortured career.", 
        "intTime": 20090429, 
        "postID": 72, 
        "quote": "Originally posted by ACR26: I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture", 
        "reply": " Yeh, I have a bunch of torture too, resetting my arm twice with no pain killer. Someone needs to arrest those Navy Docs. And that was the start of my 21yr tortured career.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:44:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "intTime": 20090429, 
        "postID": 73, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:56:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "boy...... after hearing some of youz guys stories I sure am glad the proctologist used numb-zit. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090429, 
        "postID": 74, 
        "quote": "", 
        "reply": "boy...... after hearing some of youz guys stories I sure am glad the proctologist used numb-zit. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 14:56:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI. Absolutely! They need to replay the 9/11 scenes especially the falling bodies and splattered people on the sidewalks then come back and shed a mother humpin tear for one of those terrorist turd eating fugtools, sinc ethey played loud music, hit them, put insects in their rms, called them mean names, had women talk to them, and waterboarded their azzes. I want to see some aclu azzhole fuile lawsuits against the military for their abuses in SERE and bootcamp, so whats the difference?", 
        "intTime": 20090429, 
        "postID": 75, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. Gunny... A couple of individuals posting would scream bloody murder and call the ACLU if they had to endure the daily rigors of Parris Island or San Diego, followed up by a 'trip thru the tulips' on \"Mount Mo Fo (CampPen)\", San Onfere or Camp Geiger/Camp LeJuene...during the late 60s/early 70s. No doubt, the 'fun and games' haven't changed that much these last 40 years since I went thru PI.", 
        "reply": " Absolutely! They need to replay the 9/11 scenes especially the falling bodies and splattered people on the sidewalks then come back and shed a mother humpin tear for one of those terrorist turd eating fugtools, sinc ethey played loud music, hit them, put insects in their rms, called them mean names, had women talk to them, and waterboarded their azzes. I want to see some aclu azzhole fuile lawsuits against the military for their abuses in SERE and bootcamp, so whats the difference?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 16:07:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Author Topic: Say It's Osama. What If He Won't Talk? ACR26 Posted Wed 29 April 2009 02:20 PM quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep. They can argue all the want but article 6 is clear on treatys. dont you agree? So whats the argument when its spelled out? There can be no argument if torture was inflicted. Thats what these documents are meant to prove.", 
        "intTime": 20090429, 
        "postID": 76, 
        "quote": "", 
        "reply": "Author Topic: Say It's Osama. What If He Won't Talk? ACR26 Posted Wed 29 April 2009 02:20 PM quote: And only complete AHs are for constitutional violations Where? That is the argument. One side says nope other side says yep. They can argue all the want but article 6 is clear on treatys. dont you agree? So whats the argument when its spelled out? There can be no argument if torture was inflicted. Thats what these documents are meant to prove.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:17:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "what kind of fool wants to base American policy on an event that will NEVER happen?", 
        "intTime": 20090429, 
        "postID": 77, 
        "quote": "", 
        "reply": "what kind of fool wants to base American policy on an event that will NEVER happen?", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:29:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. Im not concerned about anyone except the USA our constitution,credibility, and Honor. Why did we sign these international agreements or join world organizations and expect all to follow them and think we can just break them when its convient and enforce them on other nations with supierior force? I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "intTime": 20090429, 
        "postID": 78, 
        "quote": "Originally posted by GunnyRet03: quote: Since were playing what ifs, If we had OBL and if he wouldnt talk, what if we withdrew from all our international treaties and obligations, then drilled out his kneecaps, shoved a hot poker up his azz, while his hand bathed in sulfuric acid, and then carved out his eyes one at a time. Then after he talked, rejoin the international community? Most of the Intl community is laughing at us. The above stuff sounds good but its nice to know you are worried about a few in the 'world community' take precedence over out lives and others around the world. Im not concerned about anyone except the USA our constitution,credibility, and Honor. Why did we sign these international agreements or join world organizations and expect all to follow them and think we can just break them when its convient and enforce them on other nations with supierior force? I will bet that if our founding fathers were alive they would really torture the Fug out of him. But lets start with tar and feathers lets get Continental on his azz!", 
        "reply": "", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:32:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Every military has some form of \"boot camp\". But you know this already. SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. but go ahead and make your list. It'll be fun knocking it down.", 
        "intTime": 20090429, 
        "postID": 79, 
        "quote": "So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " I can barley see you past your strawman. Boot camp is voluntary and is not torture. Every military has some form of \"boot camp\". But you know this already. SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. but go ahead and make your list. It'll be fun knocking it down.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:33:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "intTime": 20090429, 
        "postID": 80, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by john2x: Irwin_R_Schyster Posted Wed 29 April 2009 01:40 PM Gunny: You damn well know the response a terrorist will give US forces in the Obama/Liberal administration: \"I'm not saying nothing until we get to New York where I want a lawyer.\" Only the p*ssies are against torture... And only complete AHs are for constitutional violations. So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list.", 
        "reply": " No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:41:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: No thats training and preparation in survival in case the enemy dont honor international treaties. .......in case? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090429, 
        "postID": 81, 
        "quote": "Originally posted by john2x: No thats training and preparation in survival in case the enemy dont honor international treaties.", 
        "reply": " .......in case? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 22:50:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "ACR26 Posted Wed 29 April 2009 02:40 PM I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture No Novacaine? That would have been a case for the I.G. If it were me saddests. Just because your in the military dont mean you dont have rights or have to follow orders you consider unlawful. Reminds me of a time when I went to the base infirmary with a boil under my armpit the size of a small lemon. They said novacain wouldnt help due to the infection and held me down and just lanced it I let out one yell and thought it was over. That was till he started trying to pack in a yard of gauze drain. Thats when the yelling began and a major came in to see what all the screaming was about. He used physcology He medics and said what are you doing to this poor guy, That incision isnt big enough give me that scalple. I said no no its pleny big he said are you sure I said yes sir, so I gritted my teeth and kept my mouth shut. Never went back removed the drain myself. now that was torture.", 
        "intTime": 20090429, 
        "postID": 82, 
        "quote": "", 
        "reply": "ACR26 Posted Wed 29 April 2009 02:40 PM I had to with no exception go to the dentist to get my wisdom teeth pulled to be mobile ready. Pushed so hard on my jaw I passed out (That is my story). Woke up and they were not done. They waited patiently for me to wake up before continuing...Torture No Novacaine? That would have been a case for the I.G. If it were me saddests. Just because your in the military dont mean you dont have rights or have to follow orders you consider unlawful. Reminds me of a time when I went to the base infirmary with a boil under my armpit the size of a small lemon. They said novacain wouldnt help due to the infection and held me down and just lanced it I let out one yell and thought it was over. That was till he started trying to pack in a yard of gauze drain. Thats when the yelling began and a major came in to see what all the screaming was about. He used physcology He medics and said what are you doing to this poor guy, That incision isnt big enough give me that scalple. I said no no its pleny big he said are you sure I said yes sir, so I gritted my teeth and kept my mouth shut. Never went back removed the drain myself. now that was torture.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-29 23:05:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "john2x"
    }, 
    {
        "content": "What if Santa Claus went rogue? There's a \"what if\" for any statement that can ever be made.", 
        "intTime": 20090430, 
        "postID": 83, 
        "quote": "", 
        "reply": "What if Santa Claus went rogue? There's a \"what if\" for any statement that can ever be made.", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-30 05:22:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Terrorism is voluntary. Every military has some form of \"boot camp\". But you know this already. Boot Camp is not voluntary under the draft, and you may remember we had them quite a few times. Nice strawman btw SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. Yup you guessed it, Terrorism is voluntary. but go ahead and make your list. It'll be fun knocking it down.", 
        "intTime": 20090430, 
        "postID": 84, 
        "quote": "Originally posted by karlhungusjr: quote: So SERE Trng is a constitutional violation? How bout boot camp? We could make a whole list. I can barley see you past your strawman. Boot camp is voluntary and is not torture. Terrorism is voluntary. Every military has some form of \"boot camp\". But you know this already. Boot Camp is not voluntary under the draft, and you may remember we had them quite a few times. Nice strawman btw SERE training is...yup, voluntary. and they have to sign a waiver, and its TRAINING to resist ....yup, you guessed it. TORTURE!. Yup you guessed it, Terrorism is voluntary. but go ahead and make your list. It'll be fun knocking it down.", 
        "reply": "", 
        "threadID": "409192893_5410050222001", 
        "time": "2009-04-30 05:36:00", 
        "title": "Say It's Osama. What If He Won't Talk?", 
        "userID": "GunnyRet03"
    }
]