[
    {
        "content": "We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-23 15:44:00", 
        "title": "Change YOU can believe in!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: http://www.msnbc.msn.com/id/29824634/?GT1=43001 Tata! Their stocks made me a little money over the past week. But, as for their vehicles, they are in a niche market in India with the Nano. Don't expect it to be sold here in the States, though.", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "reply": " Tata! Their stocks made me a little money over the past week. But, as for their vehicles, they are in a niche market in India with the Nano. Don't expect it to be sold here in the States, though.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-23 17:21:00", 
        "title": "Change YOU can believe in!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "What we need is a major project Thats what has brought this country out of bad economic times ever time. They produce jobs, jobs produce taxes people develope a positive attitude and spend money, Buy houses, cars, eat out,remodel, and all kinds of good things. Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed?", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "", 
        "reply": "What we need is a major project Thats what has brought this country out of bad economic times ever time. They produce jobs, jobs produce taxes people develope a positive attitude and spend money, Buy houses, cars, eat out,remodel, and all kinds of good things. Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-23 22:00:00", 
        "title": "Change YOU can believe in!", 
        "userID": "john2x"
    }, 
    {
        "content": "Entire hillsides are covered with wind turbines in Mojave, California quote: US trains green workers of the future But in Tehachapi, California, they mean four seasons in one day. In this remote corner between the Sierra Nevada and the Mojave Desert, it can feel like summer one hour, winter the next. And the weather is propelled by strong winds that man has put to use - entire hillsides are covered by wind turbines. This is a pioneering place for the US's wind power industry and it is where engineers of the future learn their trade. Massive expansion We joined some young students from nearby Cerro Coso Community College as an industry professional guided them on their first climb of an 80ft (27m) wind turbine tower. It is part of a course where they learn the mechanical, practical and safety skills needed to maintain and fix wind turbines. They have each paid around $1,000 (£684): for young men barely out of their teens that is a lot, but they believe it will pay off with stable jobs and salaries that can start at up to three times the national minimum wage. And the jobs will be there. The economic stimulus package recently passed by the US Congress includes money to make people's homes more energy efficient. National benchmark It is part of a much bigger plan: President Obama wants to spend $150bn over 10 years on a massive expansion of renewable energy. He says it will cut the country's dependance on foreign oil, create five \"green-collar\" jobs and help tackle climate change. (....) It's a start..... +http://news.bbc.co.uk/2/hi/americas/7959667.stm", 
        "intTime": 20090324, 
        "postID": 4, 
        "quote": "US trains green workers of the future But in Tehachapi, California, they mean four seasons in one day. In this remote corner between the Sierra Nevada and the Mojave Desert, it can feel like summer one hour, winter the next. And the weather is propelled by strong winds that man has put to use - entire hillsides are covered by wind turbines. This is a pioneering place for the US's wind power industry and it is where engineers of the future learn their trade. Massive expansion We joined some young students from nearby Cerro Coso Community College as an industry professional guided them on their first climb of an 80ft (27m) wind turbine tower. It is part of a course where they learn the mechanical, practical and safety skills needed to maintain and fix wind turbines. They have each paid around $1,000 (£684): for young men barely out of their teens that is a lot, but they believe it will pay off with stable jobs and salaries that can start at up to three times the national minimum wage. And the jobs will be there. The economic stimulus package recently passed by the US Congress includes money to make people's homes more energy efficient. National benchmark It is part of a much bigger plan: President Obama wants to spend $150bn over 10 years on a massive expansion of renewable energy. He says it will cut the country's dependance on foreign oil, create five \"green-collar\" jobs and help tackle climate change. (....)", 
        "reply": "Entire hillsides are covered with wind turbines in Mojave, California  It's a start..... +http://news.bbc.co.uk/2/hi/americas/7959667.stm", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 06:08:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Knele"
    }, 
    {
        "content": "Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life.", 
        "intTime": 20090324, 
        "postID": 5, 
        "quote": "", 
        "reply": "Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 06:36:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "intTime": 20090324, 
        "postID": 6, 
        "quote": "", 
        "reply": "In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 06:38:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "intTime": 20090324, 
        "postID": 7, 
        "quote": "Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "reply": "", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:30:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view.", 
        "intTime": 20090324, 
        "postID": 8, 
        "quote": "Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "reply": " Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:31:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Knele one wind mill does not make a wind farm. What community is that and was a zoning restriction waved for that installation?", 
        "intTime": 20090324, 
        "postID": 9, 
        "quote": "", 
        "reply": "Knele one wind mill does not make a wind farm. What community is that and was a zoning restriction waved for that installation?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:39:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car?", 
        "intTime": 20090324, 
        "postID": 10, 
        "quote": "dmuhler: A Lot of people live without cars.", 
        "reply": " That's just BS. Some people do but not a lot. BTW, when did you give up your car?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:42:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: I bet you want one in your backyard too. Got one: The Robert E. Ginna Nuclear Power Plant is a nuclear power plant located on the southern shore of Lake Ontario, approximately 20 miles northeast of Rochester, New York.", 
        "intTime": 20090324, 
        "postID": 11, 
        "quote": "dmuhler: I bet you want one in your backyard too.", 
        "reply": " Got one: The Robert E. Ginna Nuclear Power Plant is a nuclear power plant located on the southern shore of Lake Ontario, approximately 20 miles northeast of Rochester, New York.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:47:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car? Yeh no shiite, lead by example. Unless you only peddle your azz all over the place and that is your sole transport spare us the bs.", 
        "intTime": 20090324, 
        "postID": 12, 
        "quote": "Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car?", 
        "reply": " Yeh no shiite, lead by example. Unless you only peddle your azz all over the place and that is your sole transport spare us the bs.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 08:04:00", 
        "title": "Change YOU can believe in!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by threerings: We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001 IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.", 
        "intTime": 20090324, 
        "postID": 13, 
        "quote": "Originally posted by threerings: We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "reply": " IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 08:10:00", 
        "title": "Change YOU can believe in!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed? More Nukes, fewer Kooks! I've been saying that for years. To answer your question as to who is stopping them let's go back to who stopped them to begin with. It was President Carter that put the kibosh on the atom. I find that strange considering he was a nuclear engineer and served on atomic submarines. Obviously he knew the benefit of nuclear power and he also knew, properly built and run they're safe. That being the case the only reasonable explanation is that he was swayed by some unknown force. What makes it so sad is that with American know how, had we been allowed to go forward with nuclear power generation, by now the nuclear situation would be very different. Two main factors are most important in considering whether or not to build a grid of nuclear generating stations. The first is safety. Horror stories like The Chernobyl disaster rightfully frighten people. Chernobyl was a poorly built incompletely run accident waiting to happen. There is no comparison between the crude reactors Russia produced and the well designed, carefully built reactors produced here. The very worst incident to take place at any American reactor occurred at the Three Mile Island generating station. There was a small amount of radioactive steam released. The maximum amount of radiation anyone was exposed to was about the amount received during a full set of dental x-rays. Sadly the incident was blown out of proportion by the news hungry media. The second factor is that of “hot ash” disposal. It’s true that our current reactors do produce significant amounts of radioactive waste. Had we been allowed to go forth, by now at the very least we’d be building Breeder reactors that produce no hot ash. It’s even possible that, by now we would have such things as Fusan reactors that would be far more efficient and cheaper to build. All of this was short circuited by President Carter for reasons, unknown. Sorry to be so long winded but y'all hit on one of my pet subjects. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 14, 
        "quote": "Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed?", 
        "reply": " More Nukes, fewer Kooks! I've been saying that for years. To answer your question as to who is stopping them let's go back to who stopped them to begin with. It was President Carter that put the kibosh on the atom. I find that strange considering he was a nuclear engineer and served on atomic submarines. Obviously he knew the benefit of nuclear power and he also knew, properly built and run they're safe. That being the case the only reasonable explanation is that he was swayed by some unknown force. What makes it so sad is that with American know how, had we been allowed to go forward with nuclear power generation, by now the nuclear situation would be very different. Two main factors are most important in considering whether or not to build a grid of nuclear generating stations. The first is safety. Horror stories like The Chernobyl disaster rightfully frighten people. Chernobyl was a poorly built incompletely run accident waiting to happen. There is no comparison between the crude reactors Russia produced and the well designed, carefully built reactors produced here. The very worst incident to take place at any American reactor occurred at the Three Mile Island generating station. There was a small amount of radioactive steam released. The maximum amount of radiation anyone was exposed to was about the amount received during a full set of dental x-rays. Sadly the incident was blown out of proportion by the news hungry media. The second factor is that of “hot ash” disposal. It’s true that our current reactors do produce significant amounts of radioactive waste. Had we been allowed to go forth, by now at the very least we’d be building Breeder reactors that produce no hot ash. It’s even possible that, by now we would have such things as Fusan reactors that would be far more efficient and cheaper to build. All of this was short circuited by President Carter for reasons, unknown. Sorry to be so long winded but y'all hit on one of my pet subjects. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 08:56:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. As a matter of fact my stepson who lives in Chestertown NY. does have one in his back yard and most of the time it produces all the electricity he needs. As a matter of fact he's often able to sell excess electricity to his electric supplier. By law they must buy his surplus electricity. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 15, 
        "quote": "Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "reply": " As a matter of fact my stepson who lives in Chestertown NY. does have one in his back yard and most of the time it produces all the electricity he needs. As a matter of fact he's often able to sell excess electricity to his electric supplier. By law they must buy his surplus electricity. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:01:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Woody_in_La: quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view. I bet you want one in your backyard too. I got one, it is named Grand Gulf. So it looks like two of us do indeed have them. Maybe it is us two that need the at your post?", 
        "intTime": 20090324, 
        "postID": 16, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Woody_in_La: quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view. I bet you want one in your backyard too.", 
        "reply": " I got one, it is named Grand Gulf. So it looks like two of us do indeed have them. Maybe it is us two that need the at your post?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:06:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life. I don't think anyone is saying we should give up our cars. What we should do however is buy cars suitable to our needs. Time after time I see people driving those hugs SUVs and pickups without having any real need for those huge behemoths. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 17, 
        "quote": "Originally posted by bill_kananen: Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life.", 
        "reply": " I don't think anyone is saying we should give up our cars. What we should do however is buy cars suitable to our needs. Time after time I see people driving those hugs SUVs and pickups without having any real need for those huge behemoths. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:08:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Don't forget ol Teddy not wanting them..... Won't have to worry about him much longer. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 18, 
        "quote": "Don't forget ol Teddy not wanting them.....", 
        "reply": " Won't have to worry about him much longer. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:09:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: dmuhler: I guess you don't get out much. Try going overseas where people don't have the money to waste on cars. So if the people in those crap hole countries worship Allah then we should too? Dam lib/socialists want to make everyone equally poor.", 
        "intTime": 20090324, 
        "postID": 19, 
        "quote": "dmuhler: I guess you don't get out much. Try going overseas where people don't have the money to waste on cars.", 
        "reply": " So if the people in those crap hole countries worship Allah then we should too? Dam lib/socialists want to make everyone equally poor.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:12:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car? I guess you don't get out much. Try going overseas where people don't have the money to waste on cars. You are overlooking the fact that most of those folks are living in highly populated areas. The US does not have that problem overall. There, the cars would cause more problems from congested roads than we have nation wide. In essence, you are comparing apples to grapes IMO.", 
        "intTime": 20090324, 
        "postID": 20, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car? I guess you don't get out much. Try going overseas where people don't have the money to waste on cars.", 
        "reply": " You are overlooking the fact that most of those folks are living in highly populated areas. The US does not have that problem overall. There, the cars would cause more problems from congested roads than we have nation wide. In essence, you are comparing apples to grapes IMO.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:13:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's. \"IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.\" The only problem is by the time they add all the stuff required for the American market the price soars out of sight. \"http://www.smartusa.com/\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 21, 
        "quote": "IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.", 
        "reply": " \"IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.\" The only problem is by the time they add all the stuff required for the American market the price soars out of sight. \"http://www.smartusa.com/\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:14:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Nuclear power is too damn expensive....unless we did it the french way and built them all EXACTLY the same(won't happen) One Plant could cost as much as two Nimitz Class Aircraft Carriers AND their airwings...(Maybe more) and take years to finish...", 
        "intTime": 20090324, 
        "postID": 22, 
        "quote": "", 
        "reply": "Nuclear power is too damn expensive....unless we did it the french way and built them all EXACTLY the same(won't happen) One Plant could cost as much as two Nimitz Class Aircraft Carriers AND their airwings...(Maybe more) and take years to finish...", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:14:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Woody_in_La: You are overlooking the fact that most of those folks are living in highly populated areas. And why are the areas highly populated? Because people don't have cars.", 
        "intTime": 20090324, 
        "postID": 23, 
        "quote": "Woody_in_La: You are overlooking the fact that most of those folks are living in highly populated areas.", 
        "reply": " And why are the areas highly populated? Because people don't have cars.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:17:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "This statement from the link is so very true! quote: The Nano should make global automakers stop loading their cars with costly gadgets people don’t really want, he added. I looked at getting a new truck and they don't even offer one with a standard transmission any more. I don't need or want heated leather power seats or power anything. Nore do I want an auto transmission with electric shift for 4 wheel drive. I opted to keep driving the one I have with most of the basics only. I refuse to be forced to buy a loaded truck that is used to work instead of play.", 
        "intTime": 20090324, 
        "postID": 24, 
        "quote": "The Nano should make global automakers stop loading their cars with costly gadgets people don’t really want, he added.", 
        "reply": "This statement from the link is so very true!  I looked at getting a new truck and they don't even offer one with a standard transmission any more. I don't need or want heated leather power seats or power anything. Nore do I want an auto transmission with electric shift for 4 wheel drive. I opted to keep driving the one I have with most of the basics only. I refuse to be forced to buy a loaded truck that is used to work instead of play.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:29:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "intTime": 20090323, 
        "postID": 25, 
        "quote": "", 
        "reply": "We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-23 15:44:00", 
        "title": "Change YOU can believe in!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: http://www.msnbc.msn.com/id/29824634/?GT1=43001 Tata! Their stocks made me a little money over the past week. But, as for their vehicles, they are in a niche market in India with the Nano. Don't expect it to be sold here in the States, though.", 
        "intTime": 20090323, 
        "postID": 26, 
        "quote": "http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "reply": " Tata! Their stocks made me a little money over the past week. But, as for their vehicles, they are in a niche market in India with the Nano. Don't expect it to be sold here in the States, though.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-23 17:21:00", 
        "title": "Change YOU can believe in!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "What we need is a major project Thats what has brought this country out of bad economic times ever time. They produce jobs, jobs produce taxes people develope a positive attitude and spend money, Buy houses, cars, eat out,remodel, and all kinds of good things. Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed?", 
        "intTime": 20090323, 
        "postID": 27, 
        "quote": "", 
        "reply": "What we need is a major project Thats what has brought this country out of bad economic times ever time. They produce jobs, jobs produce taxes people develope a positive attitude and spend money, Buy houses, cars, eat out,remodel, and all kinds of good things. Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-23 22:00:00", 
        "title": "Change YOU can believe in!", 
        "userID": "john2x"
    }, 
    {
        "content": "Entire hillsides are covered with wind turbines in Mojave, California quote: US trains green workers of the future But in Tehachapi, California, they mean four seasons in one day. In this remote corner between the Sierra Nevada and the Mojave Desert, it can feel like summer one hour, winter the next. And the weather is propelled by strong winds that man has put to use - entire hillsides are covered by wind turbines. This is a pioneering place for the US's wind power industry and it is where engineers of the future learn their trade. Massive expansion We joined some young students from nearby Cerro Coso Community College as an industry professional guided them on their first climb of an 80ft (27m) wind turbine tower. It is part of a course where they learn the mechanical, practical and safety skills needed to maintain and fix wind turbines. They have each paid around $1,000 (£684): for young men barely out of their teens that is a lot, but they believe it will pay off with stable jobs and salaries that can start at up to three times the national minimum wage. And the jobs will be there. The economic stimulus package recently passed by the US Congress includes money to make people's homes more energy efficient. National benchmark It is part of a much bigger plan: President Obama wants to spend $150bn over 10 years on a massive expansion of renewable energy. He says it will cut the country's dependance on foreign oil, create five \"green-collar\" jobs and help tackle climate change. (....) It's a start..... +http://news.bbc.co.uk/2/hi/americas/7959667.stm", 
        "intTime": 20090324, 
        "postID": 28, 
        "quote": "US trains green workers of the future But in Tehachapi, California, they mean four seasons in one day. In this remote corner between the Sierra Nevada and the Mojave Desert, it can feel like summer one hour, winter the next. And the weather is propelled by strong winds that man has put to use - entire hillsides are covered by wind turbines. This is a pioneering place for the US's wind power industry and it is where engineers of the future learn their trade. Massive expansion We joined some young students from nearby Cerro Coso Community College as an industry professional guided them on their first climb of an 80ft (27m) wind turbine tower. It is part of a course where they learn the mechanical, practical and safety skills needed to maintain and fix wind turbines. They have each paid around $1,000 (£684): for young men barely out of their teens that is a lot, but they believe it will pay off with stable jobs and salaries that can start at up to three times the national minimum wage. And the jobs will be there. The economic stimulus package recently passed by the US Congress includes money to make people's homes more energy efficient. National benchmark It is part of a much bigger plan: President Obama wants to spend $150bn over 10 years on a massive expansion of renewable energy. He says it will cut the country's dependance on foreign oil, create five \"green-collar\" jobs and help tackle climate change. (....)", 
        "reply": "Entire hillsides are covered with wind turbines in Mojave, California  It's a start..... +http://news.bbc.co.uk/2/hi/americas/7959667.stm", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 06:08:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Knele"
    }, 
    {
        "content": "Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life.", 
        "intTime": 20090324, 
        "postID": 29, 
        "quote": "", 
        "reply": "Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 06:36:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "intTime": 20090324, 
        "postID": 30, 
        "quote": "", 
        "reply": "In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 06:38:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "intTime": 20090324, 
        "postID": 31, 
        "quote": "Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "reply": "", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:30:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view.", 
        "intTime": 20090324, 
        "postID": 32, 
        "quote": "Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "reply": " Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:31:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Knele one wind mill does not make a wind farm. What community is that and was a zoning restriction waved for that installation?", 
        "intTime": 20090324, 
        "postID": 33, 
        "quote": "", 
        "reply": "Knele one wind mill does not make a wind farm. What community is that and was a zoning restriction waved for that installation?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:39:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car?", 
        "intTime": 20090324, 
        "postID": 34, 
        "quote": "dmuhler: A Lot of people live without cars.", 
        "reply": " That's just BS. Some people do but not a lot. BTW, when did you give up your car?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:42:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: dmuhler: I bet you want one in your backyard too. Got one: The Robert E. Ginna Nuclear Power Plant is a nuclear power plant located on the southern shore of Lake Ontario, approximately 20 miles northeast of Rochester, New York.", 
        "intTime": 20090324, 
        "postID": 35, 
        "quote": "dmuhler: I bet you want one in your backyard too.", 
        "reply": " Got one: The Robert E. Ginna Nuclear Power Plant is a nuclear power plant located on the southern shore of Lake Ontario, approximately 20 miles northeast of Rochester, New York.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 07:47:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car? Yeh no shiite, lead by example. Unless you only peddle your azz all over the place and that is your sole transport spare us the bs.", 
        "intTime": 20090324, 
        "postID": 36, 
        "quote": "Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car?", 
        "reply": " Yeh no shiite, lead by example. Unless you only peddle your azz all over the place and that is your sole transport spare us the bs.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 08:04:00", 
        "title": "Change YOU can believe in!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by threerings: We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001 IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.", 
        "intTime": 20090324, 
        "postID": 37, 
        "quote": "Originally posted by threerings: We cant drive our gas hog auto's anymore! NO SIR! What would the rest of the world think! +++http://www.msnbc.msn.com/id/29824634/?GT1=43001", 
        "reply": " IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 08:10:00", 
        "title": "Change YOU can believe in!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed? More Nukes, fewer Kooks! I've been saying that for years. To answer your question as to who is stopping them let's go back to who stopped them to begin with. It was President Carter that put the kibosh on the atom. I find that strange considering he was a nuclear engineer and served on atomic submarines. Obviously he knew the benefit of nuclear power and he also knew, properly built and run they're safe. That being the case the only reasonable explanation is that he was swayed by some unknown force. What makes it so sad is that with American know how, had we been allowed to go forward with nuclear power generation, by now the nuclear situation would be very different. Two main factors are most important in considering whether or not to build a grid of nuclear generating stations. The first is safety. Horror stories like The Chernobyl disaster rightfully frighten people. Chernobyl was a poorly built incompletely run accident waiting to happen. There is no comparison between the crude reactors Russia produced and the well designed, carefully built reactors produced here. The very worst incident to take place at any American reactor occurred at the Three Mile Island generating station. There was a small amount of radioactive steam released. The maximum amount of radiation anyone was exposed to was about the amount received during a full set of dental x-rays. Sadly the incident was blown out of proportion by the news hungry media. The second factor is that of “hot ash” disposal. It’s true that our current reactors do produce significant amounts of radioactive waste. Had we been allowed to go forth, by now at the very least we’d be building Breeder reactors that produce no hot ash. It’s even possible that, by now we would have such things as Fusan reactors that would be far more efficient and cheaper to build. All of this was short circuited by President Carter for reasons, unknown. Sorry to be so long winded but y'all hit on one of my pet subjects. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 38, 
        "quote": "Only major project that i see at this time is nuclear power plants across the nation and the permanent jobs they will create. Now who could be stopping that when its so obvious thats whats needed?", 
        "reply": " More Nukes, fewer Kooks! I've been saying that for years. To answer your question as to who is stopping them let's go back to who stopped them to begin with. It was President Carter that put the kibosh on the atom. I find that strange considering he was a nuclear engineer and served on atomic submarines. Obviously he knew the benefit of nuclear power and he also knew, properly built and run they're safe. That being the case the only reasonable explanation is that he was swayed by some unknown force. What makes it so sad is that with American know how, had we been allowed to go forward with nuclear power generation, by now the nuclear situation would be very different. Two main factors are most important in considering whether or not to build a grid of nuclear generating stations. The first is safety. Horror stories like The Chernobyl disaster rightfully frighten people. Chernobyl was a poorly built incompletely run accident waiting to happen. There is no comparison between the crude reactors Russia produced and the well designed, carefully built reactors produced here. The very worst incident to take place at any American reactor occurred at the Three Mile Island generating station. There was a small amount of radioactive steam released. The maximum amount of radiation anyone was exposed to was about the amount received during a full set of dental x-rays. Sadly the incident was blown out of proportion by the news hungry media. The second factor is that of “hot ash” disposal. It’s true that our current reactors do produce significant amounts of radioactive waste. Had we been allowed to go forth, by now at the very least we’d be building Breeder reactors that produce no hot ash. It’s even possible that, by now we would have such things as Fusan reactors that would be far more efficient and cheaper to build. All of this was short circuited by President Carter for reasons, unknown. Sorry to be so long winded but y'all hit on one of my pet subjects. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 08:56:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. As a matter of fact my stepson who lives in Chestertown NY. does have one in his back yard and most of the time it produces all the electricity he needs. As a matter of fact he's often able to sell excess electricity to his electric supplier. By law they must buy his surplus electricity. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 39, 
        "quote": "Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard.", 
        "reply": " As a matter of fact my stepson who lives in Chestertown NY. does have one in his back yard and most of the time it produces all the electricity he needs. As a matter of fact he's often able to sell excess electricity to his electric supplier. By law they must buy his surplus electricity. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:01:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Woody_in_La: quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view. I bet you want one in your backyard too. I got one, it is named Grand Gulf. So it looks like two of us do indeed have them. Maybe it is us two that need the at your post?", 
        "intTime": 20090324, 
        "postID": 40, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Woody_in_La: quote: Originally posted by bill_kananen: In western NY there were several proposals for wind farms. Most couldn't get approval. Seems no one wants those windmills in their back yard. Don't forget ol Teddy not wanting them..... Besides, one Nuclear plant can do way more than these windmills. It is a more stable supply and does not ruin the land use or view. I bet you want one in your backyard too.", 
        "reply": " I got one, it is named Grand Gulf. So it looks like two of us do indeed have them. Maybe it is us two that need the at your post?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:06:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life. I don't think anyone is saying we should give up our cars. What we should do however is buy cars suitable to our needs. Time after time I see people driving those hugs SUVs and pickups without having any real need for those huge behemoths. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 41, 
        "quote": "Originally posted by bill_kananen: Cars? Try living without one. Unless you live in a city with good public transportation it will seriously affect your quality of life.", 
        "reply": " I don't think anyone is saying we should give up our cars. What we should do however is buy cars suitable to our needs. Time after time I see people driving those hugs SUVs and pickups without having any real need for those huge behemoths. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:08:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Don't forget ol Teddy not wanting them..... Won't have to worry about him much longer. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 42, 
        "quote": "Don't forget ol Teddy not wanting them.....", 
        "reply": " Won't have to worry about him much longer. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:09:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: dmuhler: I guess you don't get out much. Try going overseas where people don't have the money to waste on cars. So if the people in those crap hole countries worship Allah then we should too? Dam lib/socialists want to make everyone equally poor.", 
        "intTime": 20090324, 
        "postID": 43, 
        "quote": "dmuhler: I guess you don't get out much. Try going overseas where people don't have the money to waste on cars.", 
        "reply": " So if the people in those crap hole countries worship Allah then we should too? Dam lib/socialists want to make everyone equally poor.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:12:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car? I guess you don't get out much. Try going overseas where people don't have the money to waste on cars. You are overlooking the fact that most of those folks are living in highly populated areas. The US does not have that problem overall. There, the cars would cause more problems from congested roads than we have nation wide. In essence, you are comparing apples to grapes IMO.", 
        "intTime": 20090324, 
        "postID": 44, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by bill_kananen: quote: dmuhler: A Lot of people live without cars. That's just BS. Some people do but not a lot. BTW, when did you give up your car? I guess you don't get out much. Try going overseas where people don't have the money to waste on cars.", 
        "reply": " You are overlooking the fact that most of those folks are living in highly populated areas. The US does not have that problem overall. There, the cars would cause more problems from congested roads than we have nation wide. In essence, you are comparing apples to grapes IMO.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:13:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's. \"IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.\" The only problem is by the time they add all the stuff required for the American market the price soars out of sight. \"http://www.smartusa.com/\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090324, 
        "postID": 45, 
        "quote": "IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.", 
        "reply": " \"IF they keep the price reasonable, I can see cars like this on American streets.It'd be ideal for short hop commuters, a family second car or college students. Sorta like the VW bugs of the 60's.\" The only problem is by the time they add all the stuff required for the American market the price soars out of sight. \"http://www.smartusa.com/\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:14:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Nuclear power is too damn expensive....unless we did it the french way and built them all EXACTLY the same(won't happen) One Plant could cost as much as two Nimitz Class Aircraft Carriers AND their airwings...(Maybe more) and take years to finish...", 
        "intTime": 20090324, 
        "postID": 46, 
        "quote": "", 
        "reply": "Nuclear power is too damn expensive....unless we did it the french way and built them all EXACTLY the same(won't happen) One Plant could cost as much as two Nimitz Class Aircraft Carriers AND their airwings...(Maybe more) and take years to finish...", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:14:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Woody_in_La: You are overlooking the fact that most of those folks are living in highly populated areas. And why are the areas highly populated? Because people don't have cars.", 
        "intTime": 20090324, 
        "postID": 47, 
        "quote": "Woody_in_La: You are overlooking the fact that most of those folks are living in highly populated areas.", 
        "reply": " And why are the areas highly populated? Because people don't have cars.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:17:00", 
        "title": "Change YOU can believe in!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "This statement from the link is so very true! quote: The Nano should make global automakers stop loading their cars with costly gadgets people don’t really want, he added. I looked at getting a new truck and they don't even offer one with a standard transmission any more. I don't need or want heated leather power seats or power anything. Nore do I want an auto transmission with electric shift for 4 wheel drive. I opted to keep driving the one I have with most of the basics only. I refuse to be forced to buy a loaded truck that is used to work instead of play.", 
        "intTime": 20090324, 
        "postID": 48, 
        "quote": "The Nano should make global automakers stop loading their cars with costly gadgets people don’t really want, he added.", 
        "reply": "This statement from the link is so very true!  I looked at getting a new truck and they don't even offer one with a standard transmission any more. I don't need or want heated leather power seats or power anything. Nore do I want an auto transmission with electric shift for 4 wheel drive. I opted to keep driving the one I have with most of the basics only. I refuse to be forced to buy a loaded truck that is used to work instead of play.", 
        "threadID": "409192893_5210096812001", 
        "time": "2009-03-24 09:29:00", 
        "title": "Change YOU can believe in!", 
        "userID": "Woody_in_La"
    }
]