[
    {
        "content": "<SNIP>These steps are all critical to keeping America secure. But I believe with every fiber of my being that in the long run we also cannot keep this country safe unless we enlist the power of our most fundamental values. The documents that we hold in this very hall -- the Declaration of Independence, the Constitution, the Bill of Rights -- these are not simply words written into aging parchment. They are the foundation of liberty and justice in this country, and a light that shines for all who seek freedom, fairness, equality, and dignity around the world. I stand here today as someone whose own life was made possible by these documents. My father came to these shores in search of the promise that they offered. My mother made me rise before dawn to learn their truths when I lived as a child in a foreign land. My own American journey was paved by generations of citizens who gave meaning to those simple words -- \"to form a more perfect union.\" I've studied the Constitution as a student, I've taught it as a teacher, I've been bound by it as a lawyer and a legislator. I took an oath to preserve, protect, and defend the Constitution as Commander-in-Chief, and as a citizen, I know that we must never, ever, turn our back on its enduring principles for expedience sake. I make this claim not simply as a matter of idealism. We uphold our most cherished values not only because doing so is right, but because it strengthens our country and it keeps us safe. Time and again, our values have been our best national security asset -- in war and peace; in times of ease and in eras of upheaval. Fidelity to our values is the reason why the United States of America grew from a small string of colonies under the writ of an empire to the strongest nation in the world. It's the reason why enemy soldiers have surrendered to us in battle, knowing they'd receive better treatment from America's Armed Forces than from their own government. It's the reason why America has benefitted from strong alliances that amplified our power, and drawn a sharp, moral contrast with our adversaries. It's the reason why we've been able to overpower the iron fist of fascism and outlast the iron curtain of communism, and enlist free nations and free peoples everywhere in the common cause and common effort of liberty. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology. After 9/11, we knew that we had entered a new era -- that enemies who did not abide by any law of war would present new challenges to our application of the law; that our government would need new tools to protect the American people, and that these tools would have to allow us to prevent attacks instead of simply prosecuting those who try to carry them out.<SNIP> <SNIP>First, I banned the use of so-called enhanced interrogation techniques by the United States of America. (Applause.) I know some have argued that brutal methods like waterboarding were necessary to keep us safe. I could not disagree more. As Commander-in-Chief, I see the intelligence. I bear the responsibility for keeping this country safe. And I categorically reject the assertion that these are the most effective means of interrogation. (Applause.) What's more, they undermine the rule of law. They alienate us in the world. They serve as a recruitment tool for terrorists, and increase the will of our enemies to fight us, while decreasing the will of others to work with America. They risk the lives of our troops by making it less likely that others will surrender to them in battle, and more likely that Americans will be mistreated if they are captured. In short, they did not advance our war and counterterrorism efforts -- they undermined them, and that is why I ended them once and for all. (Applause.) Now, I should add, the arguments against these techniques did not originate from my administration. As Senator McCain once said, torture \"serves as a great propaganda tool for those who recruit people to fight against us.\" And even under President Bush, there was recognition among members of his own administration -- including a Secretary of State, other senior officials, and many in the military and intelligence community -- that those who argued for these tactics were on the wrong side of the debate, and the wrong side of history. That's why we must leave these methods where they belong -- in the past. They are not who we are, and they are not America. The second decision that I made was to order the closing of the prison camp at Guantanamo Bay. (Applause.)<SNIP> Full Transcript", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "", 
        "reply": "<SNIP>These steps are all critical to keeping America secure. But I believe with every fiber of my being that in the long run we also cannot keep this country safe unless we enlist the power of our most fundamental values. The documents that we hold in this very hall -- the Declaration of Independence, the Constitution, the Bill of Rights -- these are not simply words written into aging parchment. They are the foundation of liberty and justice in this country, and a light that shines for all who seek freedom, fairness, equality, and dignity around the world. I stand here today as someone whose own life was made possible by these documents. My father came to these shores in search of the promise that they offered. My mother made me rise before dawn to learn their truths when I lived as a child in a foreign land. My own American journey was paved by generations of citizens who gave meaning to those simple words -- \"to form a more perfect union.\" I've studied the Constitution as a student, I've taught it as a teacher, I've been bound by it as a lawyer and a legislator. I took an oath to preserve, protect, and defend the Constitution as Commander-in-Chief, and as a citizen, I know that we must never, ever, turn our back on its enduring principles for expedience sake. I make this claim not simply as a matter of idealism. We uphold our most cherished values not only because doing so is right, but because it strengthens our country and it keeps us safe. Time and again, our values have been our best national security asset -- in war and peace; in times of ease and in eras of upheaval. Fidelity to our values is the reason why the United States of America grew from a small string of colonies under the writ of an empire to the strongest nation in the world. It's the reason why enemy soldiers have surrendered to us in battle, knowing they'd receive better treatment from America's Armed Forces than from their own government. It's the reason why America has benefitted from strong alliances that amplified our power, and drawn a sharp, moral contrast with our adversaries. It's the reason why we've been able to overpower the iron fist of fascism and outlast the iron curtain of communism, and enlist free nations and free peoples everywhere in the common cause and common effort of liberty. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology. After 9/11, we knew that we had entered a new era -- that enemies who did not abide by any law of war would present new challenges to our application of the law; that our government would need new tools to protect the American people, and that these tools would have to allow us to prevent attacks instead of simply prosecuting those who try to carry them out.<SNIP> <SNIP>First, I banned the use of so-called enhanced interrogation techniques by the United States of America. (Applause.) I know some have argued that brutal methods like waterboarding were necessary to keep us safe. I could not disagree more. As Commander-in-Chief, I see the intelligence. I bear the responsibility for keeping this country safe. And I categorically reject the assertion that these are the most effective means of interrogation. (Applause.) What's more, they undermine the rule of law. They alienate us in the world. They serve as a recruitment tool for terrorists, and increase the will of our enemies to fight us, while decreasing the will of others to work with America. They risk the lives of our troops by making it less likely that others will surrender to them in battle, and more likely that Americans will be mistreated if they are captured. In short, they did not advance our war and counterterrorism efforts -- they undermined them, and that is why I ended them once and for all. (Applause.) Now, I should add, the arguments against these techniques did not originate from my administration. As Senator McCain once said, torture \"serves as a great propaganda tool for those who recruit people to fight against us.\" And even under President Bush, there was recognition among members of his own administration -- including a Secretary of State, other senior officials, and many in the military and intelligence community -- that those who argued for these tactics were on the wrong side of the debate, and the wrong side of history. That's why we must leave these methods where they belong -- in the past. They are not who we are, and they are not America. The second decision that I made was to order the closing of the prison camp at Guantanamo Bay. (Applause.)<SNIP> Full Transcript", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-21 19:08:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I watched it on the tele. It was an excellent speech! Good on you Mr. President!.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 2, 
        "quote": "", 
        "reply": "I watched it on the tele. It was an excellent speech! Good on you Mr. President!.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 01:08:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Ahhh.....the ol' bait & switch swindle", 
        "intTime": 20090522, 
        "postID": 3, 
        "quote": "", 
        "reply": "Ahhh.....the ol' bait & switch swindle", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 08:53:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response.", 
        "intTime": 20090522, 
        "postID": 4, 
        "quote": "Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle", 
        "reply": " No that was the Repub response.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 09:26:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response. By the break down of the vote against the POTUS seems Repubs weren't alone.", 
        "intTime": 20090522, 
        "postID": 5, 
        "quote": "Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response.", 
        "reply": " By the break down of the vote against the POTUS seems Repubs weren't alone.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 09:36:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response. By the break down of the vote against the POTUS seems Repubs weren't alone. OBAMA: Upholding values will shield us from terror...LMAO, if it wasnt so sad that a grown man could think that terrorist give a shiite about us upholding our values. Habib: Hey look YabadabbaDu Obama sez he will close dont gitmo. YabadabbaDu: Uh Abdul what is a gitmo? Habib: It's where our brothers are in jail. YabadabbaDu: Will they free them? Habib: No, just move them somewhere else. YabadabbaDu: So, what does that mean? Habib: That means we must stop our war against the great satan. YabadabbaDu: Uh that has nothing to do with our war against the US and the West. The campaign is over someone tell Obama and his minions... This message has been edited. Last edited by: GunnyRet03, Fri 22 May 2009 11:22 AM", 
        "intTime": 20090522, 
        "postID": 6, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response. By the break down of the vote against the POTUS seems Repubs weren't alone.", 
        "reply": " OBAMA: Upholding values will shield us from terror...LMAO, if it wasnt so sad that a grown man could think that terrorist give a shiite about us upholding our values. Habib: Hey look YabadabbaDu Obama sez he will close dont gitmo. YabadabbaDu: Uh Abdul what is a gitmo? Habib: It's where our brothers are in jail. YabadabbaDu: Will they free them? Habib: No, just move them somewhere else. YabadabbaDu: So, what does that mean? Habib: That means we must stop our war against the great satan. YabadabbaDu: Uh that has nothing to do with our war against the US and the West. The campaign is over someone tell Obama and his minions... This message has been edited. Last edited by: GunnyRet03, Fri 22 May 2009 11:22 AM", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:00:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Where did you find the clip of the Rush Limbum fans? I love it!!!!", 
        "intTime": 20090522, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03:", 
        "reply": " Where did you find the clip of the Rush Limbum fans? I love it!!!!", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:30:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions... That must be Cheney’s infamous “undisclosed location”.", 
        "intTime": 20090522, 
        "postID": 8, 
        "quote": "Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions...", 
        "reply": " That must be Cheney’s infamous “undisclosed location”.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:35:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "From the UK. Barack Obama's deadly new torture weapon in the war on terror: his oratory James Delingpole <edit> <edit> 'http://blogs.telegraph.co.uk/james_delingpole/blog/2009/05/22/barack_obamas_deadly_new_torture_weapon_in_the_war_on_terror_his_oratory' Watching Obama lose his screen on screen duel with Dick Cheney yesterday I was reminded of some lines from Paradise Lost. \"Thus Belial with words clothed in reason's garb Counselled ignoble ease and peaceful sloth, not peace.\" But while the silver-tongued minor devil Belial would no doubt have approved the President's new surrender-monkey \"realist\" approach to the war on terror, I doubt he would have been so impressed with his oratorical skills. Never mind the bizarre reputation Obama has acquired as a great public speaker: his speeches are fast beginning to sound almost as excruciating as anything in his predecessor's \"enhanced interrogation program.\" Yeah, I know, I know. I too was taken in when I first heard him speak. I remember thinking when I heard that measured, steady voice with its pleasant but authoritative timbre that here was a guy fit to govern the world. He sounded cool. Clint Eastwood \"Make my day\" cool. Now, though, that novelty has worn off. Now, it's becoming clear that this carefully worked, glacial poise is all there is to Obama. He's just a hollow man spouting empty rhetoric. Compare and contrast the flatulent pomposity of Obama's speech with Cheney's angry, from-the-heart, tell-it-like-it-is riposte. No one is accusing Cheney of being the next Marc Antony but as Toby Harnden rightly says, he had some strong points to make and his audience got the message. Obama's speech on the other hand, was the usual grandiloquent exercise in high-sounding nothingness. Apart from the familiar gangsta-rap-style boasting about how big and important he now is (\"I took an oath as your Commander In Chief..\"), all he had to offer were platitudes designed - a la Belial - to make inaction and pusillanimity in the war on terror look the only sensible course. One of his favourite techniques is the false opposition, as here: \"On one side of the spectrum are those who make little allowance for the the unique challenges posed by terrorism and would almost never put national security over transparency. And on the other end of the spectrum are those who can embrace a view that can be summarised in two words: anything goes. Both sides may be sincere in their views. But neither is right.\" Except nobody in the world cleaves to either of these positions. They have been conjured from thin air by Obama - and his trusty teleprompter - in order to make out that anyone who disagrees with his woolly centrist position must perforce be some kind of whacko extremist nut job. Maybe when you're out on the campaign trail there's a certain sense in this kind of airy nonsense: you don't after all want to pin yourself down to a position your opponents can trap you on; you just want to generate a general feeling of benevolence towards you. But when you're president of the USA, this approach really doesn't wash. You have responsibilities. Your words have consequences. A deadpan delivery is no longer enough.", 
        "intTime": 20090522, 
        "postID": 9, 
        "quote": "", 
        "reply": "From the UK. Barack Obama's deadly new torture weapon in the war on terror: his oratory James Delingpole <edit> <edit> 'http://blogs.telegraph.co.uk/james_delingpole/blog/2009/05/22/barack_obamas_deadly_new_torture_weapon_in_the_war_on_terror_his_oratory' Watching Obama lose his screen on screen duel with Dick Cheney yesterday I was reminded of some lines from Paradise Lost. \"Thus Belial with words clothed in reason's garb Counselled ignoble ease and peaceful sloth, not peace.\" But while the silver-tongued minor devil Belial would no doubt have approved the President's new surrender-monkey \"realist\" approach to the war on terror, I doubt he would have been so impressed with his oratorical skills. Never mind the bizarre reputation Obama has acquired as a great public speaker: his speeches are fast beginning to sound almost as excruciating as anything in his predecessor's \"enhanced interrogation program.\" Yeah, I know, I know. I too was taken in when I first heard him speak. I remember thinking when I heard that measured, steady voice with its pleasant but authoritative timbre that here was a guy fit to govern the world. He sounded cool. Clint Eastwood \"Make my day\" cool. Now, though, that novelty has worn off. Now, it's becoming clear that this carefully worked, glacial poise is all there is to Obama. He's just a hollow man spouting empty rhetoric. Compare and contrast the flatulent pomposity of Obama's speech with Cheney's angry, from-the-heart, tell-it-like-it-is riposte. No one is accusing Cheney of being the next Marc Antony but as Toby Harnden rightly says, he had some strong points to make and his audience got the message. Obama's speech on the other hand, was the usual grandiloquent exercise in high-sounding nothingness. Apart from the familiar gangsta-rap-style boasting about how big and important he now is (\"I took an oath as your Commander In Chief..\"), all he had to offer were platitudes designed - a la Belial - to make inaction and pusillanimity in the war on terror look the only sensible course. One of his favourite techniques is the false opposition, as here: \"On one side of the spectrum are those who make little allowance for the the unique challenges posed by terrorism and would almost never put national security over transparency. And on the other end of the spectrum are those who can embrace a view that can be summarised in two words: anything goes. Both sides may be sincere in their views. But neither is right.\" Except nobody in the world cleaves to either of these positions. They have been conjured from thin air by Obama - and his trusty teleprompter - in order to make out that anyone who disagrees with his woolly centrist position must perforce be some kind of whacko extremist nut job. Maybe when you're out on the campaign trail there's a certain sense in this kind of airy nonsense: you don't after all want to pin yourself down to a position your opponents can trap you on; you just want to generate a general feeling of benevolence towards you. But when you're president of the USA, this approach really doesn't wash. You have responsibilities. Your words have consequences. A deadpan delivery is no longer enough.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:40:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: quote: Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions... That must be Cheney’s infamous “undisclosed location”. Well, it does kinda look like somewhere in rural Wyoming....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 10, 
        "quote": "Originally posted by IHAWKER: quote: Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions... That must be Cheney’s infamous “undisclosed location”.", 
        "reply": " Well, it does kinda look like somewhere in rural Wyoming....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 14:52:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Well, it does kinda look like somewhere in rural Wyoming....... It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.", 
        "intTime": 20090522, 
        "postID": 11, 
        "quote": "Well, it does kinda look like somewhere in rural Wyoming.......", 
        "reply": " It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 16:27:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Viva La Obama!!!", 
        "intTime": 20090522, 
        "postID": 12, 
        "quote": "", 
        "reply": "Viva La Obama!!!", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 16:29:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "intTime": 20090522, 
        "postID": 13, 
        "quote": "", 
        "reply": "Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 16:50:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Well, it does kinda look like somewhere in rural Wyoming....... It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it. So, just because you don't subscribe to the policies of the Obama administration, you are right, and everyone else is wrong? It's funny how you have some very highly intelligent people on these boards (no, I'm not of them) who have made a sensible case for Obama'a policies, and yet you and your cohorts keep on repeating like broken records; \"It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.\" One doesn't need horse blinders to subscribe to that statement, because one is already on the yellow brick road........... My way or the highway anyone No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 14, 
        "quote": "Originally posted by soscorpio: quote: Well, it does kinda look like somewhere in rural Wyoming....... It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.", 
        "reply": " So, just because you don't subscribe to the policies of the Obama administration, you are right, and everyone else is wrong? It's funny how you have some very highly intelligent people on these boards (no, I'm not of them) who have made a sensible case for Obama'a policies, and yet you and your cohorts keep on repeating like broken records; \"It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.\" One doesn't need horse blinders to subscribe to that statement, because one is already on the yellow brick road........... My way or the highway anyone No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 17:42:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "intTime": 20090522, 
        "postID": 15, 
        "quote": "Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "reply": " Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 18:20:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Let's hope it plays a little differently this time... and those sentiments is how it (history) repeats. Listen, the times haven't changed but the propaganda tries to convince us it has. so cracker, applaud your silly brains out, I ain't anti-obama I'm pro-truth and history has taught me that those in power always control those that aren't. The founders originally put the people in power, liberalism (in regard to the powers outlined by our constitution) changed that.", 
        "intTime": 20090522, 
        "postID": 16, 
        "quote": "Let's hope it plays a little differently this time...", 
        "reply": " and those sentiments is how it (history) repeats. Listen, the times haven't changed but the propaganda tries to convince us it has. so cracker, applaud your silly brains out, I ain't anti-obama I'm pro-truth and history has taught me that those in power always control those that aren't. The founders originally put the people in power, liberalism (in regard to the powers outlined by our constitution) changed that.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 19:09:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect.", 
        "intTime": 20090522, 
        "postID": 17, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "reply": " You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 19:57:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Viva La Obama!!! agreed Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison. My only regret now is that I didnt vote for him. I wont make that mistake a second time. If he continues on the path that he is taking I predict he will be viewed as one of the greats that restored confidence in government and saved this nation from certain disaster.", 
        "intTime": 20090522, 
        "postID": 18, 
        "quote": "Originally posted by crackerjacks61: Viva La Obama!!!", 
        "reply": " agreed Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison. My only regret now is that I didnt vote for him. I wont make that mistake a second time. If he continues on the path that he is taking I predict he will be viewed as one of the greats that restored confidence in government and saved this nation from certain disaster.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 19:57:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. They already are and thanks to guess who?", 
        "intTime": 20090522, 
        "postID": 19, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "reply": " We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. They already are and thanks to guess who?", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 20:01:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect. Guess what, I did three roations myself... Afghanistan...Mosul, Al Asad, Al Qaim, Ar Ramadi... So yeah, I've earned the right to talk about paying prices...", 
        "intTime": 20090522, 
        "postID": 20, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect.", 
        "reply": " Guess what, I did three roations myself... Afghanistan...Mosul, Al Asad, Al Qaim, Ar Ramadi... So yeah, I've earned the right to talk about paying prices...", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 21:04:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Any way you slice it, it's government spending. Only massive government spending will save us. It's just sad that many would prefer another world war to spend our money on than much needed improvements to our infrastructure.", 
        "intTime": 20090522, 
        "postID": 21, 
        "quote": "Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "reply": " Any way you slice it, it's government spending. Only massive government spending will save us. It's just sad that many would prefer another world war to spend our money on than much needed improvements to our infrastructure.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 22:01:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. If I'm not mistaken Jesus was responding to the religious conservatives of his day.", 
        "intTime": 20090522, 
        "postID": 22, 
        "quote": "Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "reply": " If I'm not mistaken Jesus was responding to the religious conservatives of his day.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 22:12:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: If I'm not mistaken Jesus was responding to the religious conservatives of his day. That begs the question...who would Jesus torture?", 
        "intTime": 20090523, 
        "postID": 23, 
        "quote": "Originally posted by reducetension: If I'm not mistaken Jesus was responding to the religious conservatives of his day.", 
        "reply": " That begs the question...who would Jesus torture?", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 05:51:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: who would Jesus torture? It's early, your brain probably just hasn't woke up yet. btw: all that you hate about the administration, you will have to come to terms with during this one. They are both puppets for the council on foreign relations that was financed and boarded by the int'l bankers. When you finally realize the federal reserve doesn't care about your laws you will finally begin to see the change you seek. This black man is merely a puppet, it's a shame because he could be so much more.", 
        "intTime": 20090523, 
        "postID": 24, 
        "quote": "who would Jesus torture?", 
        "reply": " It's early, your brain probably just hasn't woke up yet. btw: all that you hate about the administration, you will have to come to terms with during this one. They are both puppets for the council on foreign relations that was financed and boarded by the int'l bankers. When you finally realize the federal reserve doesn't care about your laws you will finally begin to see the change you seek. This black man is merely a puppet, it's a shame because he could be so much more.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 07:46:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: who would Jesus torture? It's early, your brain probably just hasn't woke up yet. Can't answer the question? As to the rest...yeah, yeah, the sky is falling...we get it.", 
        "intTime": 20090523, 
        "postID": 25, 
        "quote": "Originally posted by soscorpio: quote: who would Jesus torture? It's early, your brain probably just hasn't woke up yet.", 
        "reply": " Can't answer the question? As to the rest...yeah, yeah, the sky is falling...we get it.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 07:59:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Seawitch...soscorpio his hitting some of the nails in the coffin of \"change\" that a number of people of both parties have begun to point out... not a happy or welcome story but one that is fleshing out.", 
        "intTime": 20090523, 
        "postID": 26, 
        "quote": "", 
        "reply": "Seawitch...soscorpio his hitting some of the nails in the coffin of \"change\" that a number of people of both parties have begun to point out... not a happy or welcome story but one that is fleshing out.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 09:05:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!!", 
        "intTime": 20090526, 
        "postID": 27, 
        "quote": "", 
        "reply": "Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!!", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-26 21:19:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "tawodi"
    }, 
    {
        "content": "tawodi Posted Tue 26 May 2009 09:19 PM Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!! Thats not completely true. Its the best of times and the worst of times depending on where you sit. Here on LI I cant see how anything has changed drastically except for maybe gas and cigarettes. The roads, parks, restraunts, beaches, shopping malls, are crowded as usual and people are spending like drunken sailors on shore leave. The market these past months have been making some a small fortune and recouping the losses. Stcks are moving and when someone is selling someone is buying. Its been a great opportunity to make some real money for those who were able. Unfortunately most people were conned and did this to themselves by over extended and buying things they didnt need and could not afford living a fairy tale lifestyle on credit. Bad position to be in when the bottom drops out and it always does. When all is said and done the rich will be far richer and the poor will be far poorer. But saddly the worst part is they wont have learned a thing.", 
        "intTime": 20090526, 
        "postID": 28, 
        "quote": "", 
        "reply": "tawodi Posted Tue 26 May 2009 09:19 PM Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!! Thats not completely true. Its the best of times and the worst of times depending on where you sit. Here on LI I cant see how anything has changed drastically except for maybe gas and cigarettes. The roads, parks, restraunts, beaches, shopping malls, are crowded as usual and people are spending like drunken sailors on shore leave. The market these past months have been making some a small fortune and recouping the losses. Stcks are moving and when someone is selling someone is buying. Its been a great opportunity to make some real money for those who were able. Unfortunately most people were conned and did this to themselves by over extended and buying things they didnt need and could not afford living a fairy tale lifestyle on credit. Bad position to be in when the bottom drops out and it always does. When all is said and done the rich will be far richer and the poor will be far poorer. But saddly the worst part is they wont have learned a thing.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-26 22:02:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison. A person disagrees with Obama so they're either a \"Bushie\" or KKK. When you post stuff like this John, you come off as an idiot. I thought you were a better person then this, even though there are various points on different matters that we disagree on, guess I was wrong.", 
        "intTime": 20090527, 
        "postID": 29, 
        "quote": "Originally posted by john2x: Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison.", 
        "reply": " A person disagrees with Obama so they're either a \"Bushie\" or KKK. When you post stuff like this John, you come off as an idiot. I thought you were a better person then this, even though there are various points on different matters that we disagree on, guess I was wrong.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-27 07:37:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "67NOV"
    }, 
    {
        "content": "ProgMod...your Von Clusewitz quote speaks volumes about GWB...", 
        "intTime": 20090527, 
        "postID": 30, 
        "quote": "", 
        "reply": "ProgMod...your Von Clusewitz quote speaks volumes about GWB...", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-27 07:54:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "<SNIP>These steps are all critical to keeping America secure. But I believe with every fiber of my being that in the long run we also cannot keep this country safe unless we enlist the power of our most fundamental values. The documents that we hold in this very hall -- the Declaration of Independence, the Constitution, the Bill of Rights -- these are not simply words written into aging parchment. They are the foundation of liberty and justice in this country, and a light that shines for all who seek freedom, fairness, equality, and dignity around the world. I stand here today as someone whose own life was made possible by these documents. My father came to these shores in search of the promise that they offered. My mother made me rise before dawn to learn their truths when I lived as a child in a foreign land. My own American journey was paved by generations of citizens who gave meaning to those simple words -- \"to form a more perfect union.\" I've studied the Constitution as a student, I've taught it as a teacher, I've been bound by it as a lawyer and a legislator. I took an oath to preserve, protect, and defend the Constitution as Commander-in-Chief, and as a citizen, I know that we must never, ever, turn our back on its enduring principles for expedience sake. I make this claim not simply as a matter of idealism. We uphold our most cherished values not only because doing so is right, but because it strengthens our country and it keeps us safe. Time and again, our values have been our best national security asset -- in war and peace; in times of ease and in eras of upheaval. Fidelity to our values is the reason why the United States of America grew from a small string of colonies under the writ of an empire to the strongest nation in the world. It's the reason why enemy soldiers have surrendered to us in battle, knowing they'd receive better treatment from America's Armed Forces than from their own government. It's the reason why America has benefitted from strong alliances that amplified our power, and drawn a sharp, moral contrast with our adversaries. It's the reason why we've been able to overpower the iron fist of fascism and outlast the iron curtain of communism, and enlist free nations and free peoples everywhere in the common cause and common effort of liberty. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology. After 9/11, we knew that we had entered a new era -- that enemies who did not abide by any law of war would present new challenges to our application of the law; that our government would need new tools to protect the American people, and that these tools would have to allow us to prevent attacks instead of simply prosecuting those who try to carry them out.<SNIP> <SNIP>First, I banned the use of so-called enhanced interrogation techniques by the United States of America. (Applause.) I know some have argued that brutal methods like waterboarding were necessary to keep us safe. I could not disagree more. As Commander-in-Chief, I see the intelligence. I bear the responsibility for keeping this country safe. And I categorically reject the assertion that these are the most effective means of interrogation. (Applause.) What's more, they undermine the rule of law. They alienate us in the world. They serve as a recruitment tool for terrorists, and increase the will of our enemies to fight us, while decreasing the will of others to work with America. They risk the lives of our troops by making it less likely that others will surrender to them in battle, and more likely that Americans will be mistreated if they are captured. In short, they did not advance our war and counterterrorism efforts -- they undermined them, and that is why I ended them once and for all. (Applause.) Now, I should add, the arguments against these techniques did not originate from my administration. As Senator McCain once said, torture \"serves as a great propaganda tool for those who recruit people to fight against us.\" And even under President Bush, there was recognition among members of his own administration -- including a Secretary of State, other senior officials, and many in the military and intelligence community -- that those who argued for these tactics were on the wrong side of the debate, and the wrong side of history. That's why we must leave these methods where they belong -- in the past. They are not who we are, and they are not America. The second decision that I made was to order the closing of the prison camp at Guantanamo Bay. (Applause.)<SNIP> Full Transcript", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "", 
        "reply": "<SNIP>These steps are all critical to keeping America secure. But I believe with every fiber of my being that in the long run we also cannot keep this country safe unless we enlist the power of our most fundamental values. The documents that we hold in this very hall -- the Declaration of Independence, the Constitution, the Bill of Rights -- these are not simply words written into aging parchment. They are the foundation of liberty and justice in this country, and a light that shines for all who seek freedom, fairness, equality, and dignity around the world. I stand here today as someone whose own life was made possible by these documents. My father came to these shores in search of the promise that they offered. My mother made me rise before dawn to learn their truths when I lived as a child in a foreign land. My own American journey was paved by generations of citizens who gave meaning to those simple words -- \"to form a more perfect union.\" I've studied the Constitution as a student, I've taught it as a teacher, I've been bound by it as a lawyer and a legislator. I took an oath to preserve, protect, and defend the Constitution as Commander-in-Chief, and as a citizen, I know that we must never, ever, turn our back on its enduring principles for expedience sake. I make this claim not simply as a matter of idealism. We uphold our most cherished values not only because doing so is right, but because it strengthens our country and it keeps us safe. Time and again, our values have been our best national security asset -- in war and peace; in times of ease and in eras of upheaval. Fidelity to our values is the reason why the United States of America grew from a small string of colonies under the writ of an empire to the strongest nation in the world. It's the reason why enemy soldiers have surrendered to us in battle, knowing they'd receive better treatment from America's Armed Forces than from their own government. It's the reason why America has benefitted from strong alliances that amplified our power, and drawn a sharp, moral contrast with our adversaries. It's the reason why we've been able to overpower the iron fist of fascism and outlast the iron curtain of communism, and enlist free nations and free peoples everywhere in the common cause and common effort of liberty. From Europe to the Pacific, we've been the nation that has shut down torture chambers and replaced tyranny with the rule of law. That is who we are. And where terrorists offer only the injustice of disorder and destruction, America must demonstrate that our values and our institutions are more resilient than a hateful ideology. After 9/11, we knew that we had entered a new era -- that enemies who did not abide by any law of war would present new challenges to our application of the law; that our government would need new tools to protect the American people, and that these tools would have to allow us to prevent attacks instead of simply prosecuting those who try to carry them out.<SNIP> <SNIP>First, I banned the use of so-called enhanced interrogation techniques by the United States of America. (Applause.) I know some have argued that brutal methods like waterboarding were necessary to keep us safe. I could not disagree more. As Commander-in-Chief, I see the intelligence. I bear the responsibility for keeping this country safe. And I categorically reject the assertion that these are the most effective means of interrogation. (Applause.) What's more, they undermine the rule of law. They alienate us in the world. They serve as a recruitment tool for terrorists, and increase the will of our enemies to fight us, while decreasing the will of others to work with America. They risk the lives of our troops by making it less likely that others will surrender to them in battle, and more likely that Americans will be mistreated if they are captured. In short, they did not advance our war and counterterrorism efforts -- they undermined them, and that is why I ended them once and for all. (Applause.) Now, I should add, the arguments against these techniques did not originate from my administration. As Senator McCain once said, torture \"serves as a great propaganda tool for those who recruit people to fight against us.\" And even under President Bush, there was recognition among members of his own administration -- including a Secretary of State, other senior officials, and many in the military and intelligence community -- that those who argued for these tactics were on the wrong side of the debate, and the wrong side of history. That's why we must leave these methods where they belong -- in the past. They are not who we are, and they are not America. The second decision that I made was to order the closing of the prison camp at Guantanamo Bay. (Applause.)<SNIP> Full Transcript", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-21 19:08:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I watched it on the tele. It was an excellent speech! Good on you Mr. President!.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 32, 
        "quote": "", 
        "reply": "I watched it on the tele. It was an excellent speech! Good on you Mr. President!.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 01:08:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Ahhh.....the ol' bait & switch swindle", 
        "intTime": 20090522, 
        "postID": 33, 
        "quote": "", 
        "reply": "Ahhh.....the ol' bait & switch swindle", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 08:53:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response.", 
        "intTime": 20090522, 
        "postID": 34, 
        "quote": "Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle", 
        "reply": " No that was the Repub response.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 09:26:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response. By the break down of the vote against the POTUS seems Repubs weren't alone.", 
        "intTime": 20090522, 
        "postID": 35, 
        "quote": "Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response.", 
        "reply": " By the break down of the vote against the POTUS seems Repubs weren't alone.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 09:36:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response. By the break down of the vote against the POTUS seems Repubs weren't alone. OBAMA: Upholding values will shield us from terror...LMAO, if it wasnt so sad that a grown man could think that terrorist give a shiite about us upholding our values. Habib: Hey look YabadabbaDu Obama sez he will close dont gitmo. YabadabbaDu: Uh Abdul what is a gitmo? Habib: It's where our brothers are in jail. YabadabbaDu: Will they free them? Habib: No, just move them somewhere else. YabadabbaDu: So, what does that mean? Habib: That means we must stop our war against the great satan. YabadabbaDu: Uh that has nothing to do with our war against the US and the West. The campaign is over someone tell Obama and his minions... This message has been edited. Last edited by: GunnyRet03, Fri 22 May 2009 11:22 AM", 
        "intTime": 20090522, 
        "postID": 36, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by rayld2: quote: Originally posted by soscorpio: Ahhh.....the ol' bait & switch swindle No that was the Repub response. By the break down of the vote against the POTUS seems Repubs weren't alone.", 
        "reply": " OBAMA: Upholding values will shield us from terror...LMAO, if it wasnt so sad that a grown man could think that terrorist give a shiite about us upholding our values. Habib: Hey look YabadabbaDu Obama sez he will close dont gitmo. YabadabbaDu: Uh Abdul what is a gitmo? Habib: It's where our brothers are in jail. YabadabbaDu: Will they free them? Habib: No, just move them somewhere else. YabadabbaDu: So, what does that mean? Habib: That means we must stop our war against the great satan. YabadabbaDu: Uh that has nothing to do with our war against the US and the West. The campaign is over someone tell Obama and his minions... This message has been edited. Last edited by: GunnyRet03, Fri 22 May 2009 11:22 AM", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:00:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Where did you find the clip of the Rush Limbum fans? I love it!!!!", 
        "intTime": 20090522, 
        "postID": 37, 
        "quote": "Originally posted by GunnyRet03:", 
        "reply": " Where did you find the clip of the Rush Limbum fans? I love it!!!!", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:30:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions... That must be Cheney’s infamous “undisclosed location”.", 
        "intTime": 20090522, 
        "postID": 38, 
        "quote": "Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions...", 
        "reply": " That must be Cheney’s infamous “undisclosed location”.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:35:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "From the UK. Barack Obama's deadly new torture weapon in the war on terror: his oratory James Delingpole <edit> <edit> 'http://blogs.telegraph.co.uk/james_delingpole/blog/2009/05/22/barack_obamas_deadly_new_torture_weapon_in_the_war_on_terror_his_oratory' Watching Obama lose his screen on screen duel with Dick Cheney yesterday I was reminded of some lines from Paradise Lost. \"Thus Belial with words clothed in reason's garb Counselled ignoble ease and peaceful sloth, not peace.\" But while the silver-tongued minor devil Belial would no doubt have approved the President's new surrender-monkey \"realist\" approach to the war on terror, I doubt he would have been so impressed with his oratorical skills. Never mind the bizarre reputation Obama has acquired as a great public speaker: his speeches are fast beginning to sound almost as excruciating as anything in his predecessor's \"enhanced interrogation program.\" Yeah, I know, I know. I too was taken in when I first heard him speak. I remember thinking when I heard that measured, steady voice with its pleasant but authoritative timbre that here was a guy fit to govern the world. He sounded cool. Clint Eastwood \"Make my day\" cool. Now, though, that novelty has worn off. Now, it's becoming clear that this carefully worked, glacial poise is all there is to Obama. He's just a hollow man spouting empty rhetoric. Compare and contrast the flatulent pomposity of Obama's speech with Cheney's angry, from-the-heart, tell-it-like-it-is riposte. No one is accusing Cheney of being the next Marc Antony but as Toby Harnden rightly says, he had some strong points to make and his audience got the message. Obama's speech on the other hand, was the usual grandiloquent exercise in high-sounding nothingness. Apart from the familiar gangsta-rap-style boasting about how big and important he now is (\"I took an oath as your Commander In Chief..\"), all he had to offer were platitudes designed - a la Belial - to make inaction and pusillanimity in the war on terror look the only sensible course. One of his favourite techniques is the false opposition, as here: \"On one side of the spectrum are those who make little allowance for the the unique challenges posed by terrorism and would almost never put national security over transparency. And on the other end of the spectrum are those who can embrace a view that can be summarised in two words: anything goes. Both sides may be sincere in their views. But neither is right.\" Except nobody in the world cleaves to either of these positions. They have been conjured from thin air by Obama - and his trusty teleprompter - in order to make out that anyone who disagrees with his woolly centrist position must perforce be some kind of whacko extremist nut job. Maybe when you're out on the campaign trail there's a certain sense in this kind of airy nonsense: you don't after all want to pin yourself down to a position your opponents can trap you on; you just want to generate a general feeling of benevolence towards you. But when you're president of the USA, this approach really doesn't wash. You have responsibilities. Your words have consequences. A deadpan delivery is no longer enough.", 
        "intTime": 20090522, 
        "postID": 39, 
        "quote": "", 
        "reply": "From the UK. Barack Obama's deadly new torture weapon in the war on terror: his oratory James Delingpole <edit> <edit> 'http://blogs.telegraph.co.uk/james_delingpole/blog/2009/05/22/barack_obamas_deadly_new_torture_weapon_in_the_war_on_terror_his_oratory' Watching Obama lose his screen on screen duel with Dick Cheney yesterday I was reminded of some lines from Paradise Lost. \"Thus Belial with words clothed in reason's garb Counselled ignoble ease and peaceful sloth, not peace.\" But while the silver-tongued minor devil Belial would no doubt have approved the President's new surrender-monkey \"realist\" approach to the war on terror, I doubt he would have been so impressed with his oratorical skills. Never mind the bizarre reputation Obama has acquired as a great public speaker: his speeches are fast beginning to sound almost as excruciating as anything in his predecessor's \"enhanced interrogation program.\" Yeah, I know, I know. I too was taken in when I first heard him speak. I remember thinking when I heard that measured, steady voice with its pleasant but authoritative timbre that here was a guy fit to govern the world. He sounded cool. Clint Eastwood \"Make my day\" cool. Now, though, that novelty has worn off. Now, it's becoming clear that this carefully worked, glacial poise is all there is to Obama. He's just a hollow man spouting empty rhetoric. Compare and contrast the flatulent pomposity of Obama's speech with Cheney's angry, from-the-heart, tell-it-like-it-is riposte. No one is accusing Cheney of being the next Marc Antony but as Toby Harnden rightly says, he had some strong points to make and his audience got the message. Obama's speech on the other hand, was the usual grandiloquent exercise in high-sounding nothingness. Apart from the familiar gangsta-rap-style boasting about how big and important he now is (\"I took an oath as your Commander In Chief..\"), all he had to offer were platitudes designed - a la Belial - to make inaction and pusillanimity in the war on terror look the only sensible course. One of his favourite techniques is the false opposition, as here: \"On one side of the spectrum are those who make little allowance for the the unique challenges posed by terrorism and would almost never put national security over transparency. And on the other end of the spectrum are those who can embrace a view that can be summarised in two words: anything goes. Both sides may be sincere in their views. But neither is right.\" Except nobody in the world cleaves to either of these positions. They have been conjured from thin air by Obama - and his trusty teleprompter - in order to make out that anyone who disagrees with his woolly centrist position must perforce be some kind of whacko extremist nut job. Maybe when you're out on the campaign trail there's a certain sense in this kind of airy nonsense: you don't after all want to pin yourself down to a position your opponents can trap you on; you just want to generate a general feeling of benevolence towards you. But when you're president of the USA, this approach really doesn't wash. You have responsibilities. Your words have consequences. A deadpan delivery is no longer enough.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 11:40:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: quote: Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions... That must be Cheney’s infamous “undisclosed location”. Well, it does kinda look like somewhere in rural Wyoming....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 40, 
        "quote": "Originally posted by IHAWKER: quote: Originally posted by GunnyRet03: The campaign is over someone tell Obama and his minions... That must be Cheney’s infamous “undisclosed location”.", 
        "reply": " Well, it does kinda look like somewhere in rural Wyoming....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 14:52:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Well, it does kinda look like somewhere in rural Wyoming....... It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.", 
        "intTime": 20090522, 
        "postID": 41, 
        "quote": "Well, it does kinda look like somewhere in rural Wyoming.......", 
        "reply": " It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 16:27:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Viva La Obama!!!", 
        "intTime": 20090522, 
        "postID": 42, 
        "quote": "", 
        "reply": "Viva La Obama!!!", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 16:29:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "intTime": 20090522, 
        "postID": 43, 
        "quote": "", 
        "reply": "Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 16:50:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Well, it does kinda look like somewhere in rural Wyoming....... It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it. So, just because you don't subscribe to the policies of the Obama administration, you are right, and everyone else is wrong? It's funny how you have some very highly intelligent people on these boards (no, I'm not of them) who have made a sensible case for Obama'a policies, and yet you and your cohorts keep on repeating like broken records; \"It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.\" One doesn't need horse blinders to subscribe to that statement, because one is already on the yellow brick road........... My way or the highway anyone No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090522, 
        "postID": 44, 
        "quote": "Originally posted by soscorpio: quote: Well, it does kinda look like somewhere in rural Wyoming....... It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.", 
        "reply": " So, just because you don't subscribe to the policies of the Obama administration, you are right, and everyone else is wrong? It's funny how you have some very highly intelligent people on these boards (no, I'm not of them) who have made a sensible case for Obama'a policies, and yet you and your cohorts keep on repeating like broken records; \"It's where the elites would prefer and are leading us to be.....in their sphincter. History repeats for those who don't know it.\" One doesn't need horse blinders to subscribe to that statement, because one is already on the yellow brick road........... My way or the highway anyone No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 17:42:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "intTime": 20090522, 
        "postID": 45, 
        "quote": "Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "reply": " Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 18:20:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Let's hope it plays a little differently this time... and those sentiments is how it (history) repeats. Listen, the times haven't changed but the propaganda tries to convince us it has. so cracker, applaud your silly brains out, I ain't anti-obama I'm pro-truth and history has taught me that those in power always control those that aren't. The founders originally put the people in power, liberalism (in regard to the powers outlined by our constitution) changed that.", 
        "intTime": 20090522, 
        "postID": 46, 
        "quote": "Let's hope it plays a little differently this time...", 
        "reply": " and those sentiments is how it (history) repeats. Listen, the times haven't changed but the propaganda tries to convince us it has. so cracker, applaud your silly brains out, I ain't anti-obama I'm pro-truth and history has taught me that those in power always control those that aren't. The founders originally put the people in power, liberalism (in regard to the powers outlined by our constitution) changed that.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 19:09:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect.", 
        "intTime": 20090522, 
        "postID": 47, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "reply": " You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 19:57:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Viva La Obama!!! agreed Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison. My only regret now is that I didnt vote for him. I wont make that mistake a second time. If he continues on the path that he is taking I predict he will be viewed as one of the greats that restored confidence in government and saved this nation from certain disaster.", 
        "intTime": 20090522, 
        "postID": 48, 
        "quote": "Originally posted by crackerjacks61: Viva La Obama!!!", 
        "reply": " agreed Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison. My only regret now is that I didnt vote for him. I wont make that mistake a second time. If he continues on the path that he is taking I predict he will be viewed as one of the greats that restored confidence in government and saved this nation from certain disaster.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 19:57:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. They already are and thanks to guess who?", 
        "intTime": 20090522, 
        "postID": 49, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that.", 
        "reply": " We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. They already are and thanks to guess who?", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 20:01:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect. Guess what, I did three roations myself... Afghanistan...Mosul, Al Asad, Al Qaim, Ar Ramadi... So yeah, I've earned the right to talk about paying prices...", 
        "intTime": 20090522, 
        "postID": 50, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Another huge War, not the cake walk in Iraq...is coming.. The United States, Britain, Canada, Korea, Israel Vs. Iran, Afghanisan, Pakistan, Iraq and every terrorist organization in the world along with every covert group from Russia and China... It's probably coming next year, Israel isn't stupid enough to listen to President Obama, and therefore will slam Iran igniting the region... We have one chance to ensure the middle east does not become a nuclear armed region, and I am willing to pay an incredibly high price for that. You are willing to pay a price for that? What are you willing to pay? I am guessing it isn't one that involves you actually fighting or dying for it, but rather you would be willing to let people like me and my Soldiers pay it for you. Why don't you go tell the families of the 113 people who had their names were added to the 4th ID memorial yesterday about the \"Iraq cakewalk\". You need to learn some respect.", 
        "reply": " Guess what, I did three roations myself... Afghanistan...Mosul, Al Asad, Al Qaim, Ar Ramadi... So yeah, I've earned the right to talk about paying prices...", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 21:04:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. Any way you slice it, it's government spending. Only massive government spending will save us. It's just sad that many would prefer another world war to spend our money on than much needed improvements to our infrastructure.", 
        "intTime": 20090522, 
        "postID": 51, 
        "quote": "Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "reply": " Any way you slice it, it's government spending. Only massive government spending will save us. It's just sad that many would prefer another world war to spend our money on than much needed improvements to our infrastructure.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 22:01:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand. If I'm not mistaken Jesus was responding to the religious conservatives of his day.", 
        "intTime": 20090522, 
        "postID": 52, 
        "quote": "Originally posted by strobelvets: Seems as crazy as the Roosevelt Days to me... If I remember my history...all was tried and nothing restored the economy as well as the next global War... Let's hope it plays a little differently this time...as our Enemies use these times to undermine us...economically, politically and militarily... Matthew 13:13: Therefore I speak to them in parables: because they seeing see not; and hearing they hear not, neither do they understand.", 
        "reply": " If I'm not mistaken Jesus was responding to the religious conservatives of his day.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-22 22:12:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: If I'm not mistaken Jesus was responding to the religious conservatives of his day. That begs the question...who would Jesus torture?", 
        "intTime": 20090523, 
        "postID": 53, 
        "quote": "Originally posted by reducetension: If I'm not mistaken Jesus was responding to the religious conservatives of his day.", 
        "reply": " That begs the question...who would Jesus torture?", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 05:51:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: who would Jesus torture? It's early, your brain probably just hasn't woke up yet. btw: all that you hate about the administration, you will have to come to terms with during this one. They are both puppets for the council on foreign relations that was financed and boarded by the int'l bankers. When you finally realize the federal reserve doesn't care about your laws you will finally begin to see the change you seek. This black man is merely a puppet, it's a shame because he could be so much more.", 
        "intTime": 20090523, 
        "postID": 54, 
        "quote": "who would Jesus torture?", 
        "reply": " It's early, your brain probably just hasn't woke up yet. btw: all that you hate about the administration, you will have to come to terms with during this one. They are both puppets for the council on foreign relations that was financed and boarded by the int'l bankers. When you finally realize the federal reserve doesn't care about your laws you will finally begin to see the change you seek. This black man is merely a puppet, it's a shame because he could be so much more.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 07:46:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: who would Jesus torture? It's early, your brain probably just hasn't woke up yet. Can't answer the question? As to the rest...yeah, yeah, the sky is falling...we get it.", 
        "intTime": 20090523, 
        "postID": 55, 
        "quote": "Originally posted by soscorpio: quote: who would Jesus torture? It's early, your brain probably just hasn't woke up yet.", 
        "reply": " Can't answer the question? As to the rest...yeah, yeah, the sky is falling...we get it.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 07:59:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Seawitch...soscorpio his hitting some of the nails in the coffin of \"change\" that a number of people of both parties have begun to point out... not a happy or welcome story but one that is fleshing out.", 
        "intTime": 20090523, 
        "postID": 56, 
        "quote": "", 
        "reply": "Seawitch...soscorpio his hitting some of the nails in the coffin of \"change\" that a number of people of both parties have begun to point out... not a happy or welcome story but one that is fleshing out.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-23 09:05:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!!", 
        "intTime": 20090526, 
        "postID": 57, 
        "quote": "", 
        "reply": "Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!!", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-26 21:19:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "tawodi"
    }, 
    {
        "content": "tawodi Posted Tue 26 May 2009 09:19 PM Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!! Thats not completely true. Its the best of times and the worst of times depending on where you sit. Here on LI I cant see how anything has changed drastically except for maybe gas and cigarettes. The roads, parks, restraunts, beaches, shopping malls, are crowded as usual and people are spending like drunken sailors on shore leave. The market these past months have been making some a small fortune and recouping the losses. Stcks are moving and when someone is selling someone is buying. Its been a great opportunity to make some real money for those who were able. Unfortunately most people were conned and did this to themselves by over extended and buying things they didnt need and could not afford living a fairy tale lifestyle on credit. Bad position to be in when the bottom drops out and it always does. When all is said and done the rich will be far richer and the poor will be far poorer. But saddly the worst part is they wont have learned a thing.", 
        "intTime": 20090526, 
        "postID": 58, 
        "quote": "", 
        "reply": "tawodi Posted Tue 26 May 2009 09:19 PM Change we can believe in....it's just too bad all the machinery doesn't take change anymore, isn't it?? They only take dollars and not many of us have those any more!! Thats not completely true. Its the best of times and the worst of times depending on where you sit. Here on LI I cant see how anything has changed drastically except for maybe gas and cigarettes. The roads, parks, restraunts, beaches, shopping malls, are crowded as usual and people are spending like drunken sailors on shore leave. The market these past months have been making some a small fortune and recouping the losses. Stcks are moving and when someone is selling someone is buying. Its been a great opportunity to make some real money for those who were able. Unfortunately most people were conned and did this to themselves by over extended and buying things they didnt need and could not afford living a fairy tale lifestyle on credit. Bad position to be in when the bottom drops out and it always does. When all is said and done the rich will be far richer and the poor will be far poorer. But saddly the worst part is they wont have learned a thing.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-26 22:02:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison. A person disagrees with Obama so they're either a \"Bushie\" or KKK. When you post stuff like this John, you come off as an idiot. I thought you were a better person then this, even though there are various points on different matters that we disagree on, guess I was wrong.", 
        "intTime": 20090527, 
        "postID": 59, 
        "quote": "Originally posted by john2x: Seems like some dont want to hear what this nation is all about and its foundation, Makes them uncomfortable I guess. Or is it just a few die hard Bushies and the KKK who cant accept the fact that a black man is running this nation now and making the past administration look so bad by comparison.", 
        "reply": " A person disagrees with Obama so they're either a \"Bushie\" or KKK. When you post stuff like this John, you come off as an idiot. I thought you were a better person then this, even though there are various points on different matters that we disagree on, guess I was wrong.", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-27 07:37:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "67NOV"
    }, 
    {
        "content": "ProgMod...your Von Clusewitz quote speaks volumes about GWB...", 
        "intTime": 20090527, 
        "postID": 60, 
        "quote": "", 
        "reply": "ProgMod...your Von Clusewitz quote speaks volumes about GWB...", 
        "threadID": "409192893_6480029322001", 
        "time": "2009-05-27 07:54:00", 
        "title": "This had me openly cheering on my drive home from work...", 
        "userID": "dragonflyer04"
    }
]