[
    {
        "content": "+++http://www.realclearpolitics.com/articles/2009/03/pitchfork_time.html Obama Has No Mandate For Radicalism By Patrick Buchanan In his campaign and inaugural address, Barack Obama cast himself as a moderate man seeking common ground with conservatives. Yet, his budget calls for the radical restructuring of the U.S. economy, a sweeping redistribution of power and wealth to government and Democratic constituencies. It is a declaration of war on the Right. The real Obama has stood up, and lived up to his ranking as the most left-wing member of the United States Senate. Barack has no mandate for this. He was even behind McCain when the decisive event that gave him the presidency occurred -- the September collapse of Lehman Brothers and the market crash. Republicans are under no obligation to render bipartisan support to this statist coup d'etat. For what is going down is a leftist power grab that is anathema to their principles and philosophy. Where the U.S. government usually consumes 21 percent of gross domestic product, this Obama budget spends 28 percent in 2009 and runs a deficit of $1.75 trillion, or 12.7 percent of GDP. That is four times the largest deficit of George W. Bush and twice as large a share of the economy as any deficit run since World War II. Add that 28 percent of GDP spent by the U.S. government to the 12 percent spent by states, counties and cities, and government will consume 40 percent of the economy in 2009. We are not \"headed down the road to socialism.\" We are there. Since the budget was released, word has come that the U.S. economy did not shrink by 3.8 percent in the fourth quarter, but 6.2 percent. All the assumptions in Obama's budget about growth in 2009 and 2010 need to be revised downward, and the deficits revised upward. Look for the deficit for 2009 to cross $2 trillion. Who abroad is going to lend us the trillions to finance our deficits without demanding higher interest rates on the U.S. bonds they are being asked to hold? And if we must revert to the printing press to create the money, what happens to the dollar? As Americans save only a pittance and have lost -- in the value of homes, stocks, bonds and other assets -- $15 trillion to $20 trillion since 2007, how can the people provide the feds with the needed money? In his speech to Congress, Obama promised new investments in energy, education and health care. Every kid is going to get a college degree. We're going to find a cure for cancer. Who is going to pay for all this? The top 2 percent, the filthy rich who got all those Bush tax breaks, say Democrats. But the top 5 percent of income earners already pay 60 percent of U.S. income taxes, while the bottom 40 percent pays nothing. Those paying a federal tax rate of 35 percent will see it rise to near 40 percent and will lose a fifth of the value of their deductions for taxes, mortgage interest and charitable contributions. Yet, two-thirds of small businesses are taxed at the same rate as individuals. Consider what this means to the owner of a restaurant and bar in Los Angeles open from noon to midnight, where a husband and wife each put in 80 hours a week. At year's end, the couple finds they have actually made a profit of $500,000 that they can take home in salary. What is the Obama-Schwarzenegger tax take on that salary? Their U.S. tax rate will have hit 39.6 percent. Their California income tax will have hit 9.55 percent. Medicare payroll taxes on the proprietor as both employer and salaried employee will be $14,500. Social Security payroll taxes for the proprietor as both employer and employee will be $13,243. In short, U.S. and state income and payroll taxes will consume half of all the pair earned for some 8,000 hours of work. From that ravaged salary they must pay a state sales tax of 8.25 percent, gas taxes for the 50-mile commute, and tens of thousands in property taxes on both their restaurant and home. And, after being pilloried by politicians for having feasted in the Bush era, they are now told the tax deduction they get for contributing to the church is to be cut 20 percent, while millions of Obama voters, who paid no U.S. income tax at all, will be getting a tax cut -- i.e., a fat little check -- in April. Any wonder native-born Californians are fleeing the Golden Land? Markets are not infallible. But the stock market has long been a \"lead indicator\" of where the economy will be six months from now. What are the markets, the collective decisions of millions of investors, saying? Having fallen every month since Obama's election, with January and February the worst two months in history, they are telling us the stimulus package will not work, that Tim Geithner is clueless about how to save the banks, that the Obama budget portends disaster for the republic. The president says he is gearing up for a fight on his budget. Good. Let's give him one.", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.realclearpolitics.com/articles/2009/03/pitchfork_time.html Obama Has No Mandate For Radicalism By Patrick Buchanan In his campaign and inaugural address, Barack Obama cast himself as a moderate man seeking common ground with conservatives. Yet, his budget calls for the radical restructuring of the U.S. economy, a sweeping redistribution of power and wealth to government and Democratic constituencies. It is a declaration of war on the Right. The real Obama has stood up, and lived up to his ranking as the most left-wing member of the United States Senate. Barack has no mandate for this. He was even behind McCain when the decisive event that gave him the presidency occurred -- the September collapse of Lehman Brothers and the market crash. Republicans are under no obligation to render bipartisan support to this statist coup d'etat. For what is going down is a leftist power grab that is anathema to their principles and philosophy. Where the U.S. government usually consumes 21 percent of gross domestic product, this Obama budget spends 28 percent in 2009 and runs a deficit of $1.75 trillion, or 12.7 percent of GDP. That is four times the largest deficit of George W. Bush and twice as large a share of the economy as any deficit run since World War II. Add that 28 percent of GDP spent by the U.S. government to the 12 percent spent by states, counties and cities, and government will consume 40 percent of the economy in 2009. We are not \"headed down the road to socialism.\" We are there. Since the budget was released, word has come that the U.S. economy did not shrink by 3.8 percent in the fourth quarter, but 6.2 percent. All the assumptions in Obama's budget about growth in 2009 and 2010 need to be revised downward, and the deficits revised upward. Look for the deficit for 2009 to cross $2 trillion. Who abroad is going to lend us the trillions to finance our deficits without demanding higher interest rates on the U.S. bonds they are being asked to hold? And if we must revert to the printing press to create the money, what happens to the dollar? As Americans save only a pittance and have lost -- in the value of homes, stocks, bonds and other assets -- $15 trillion to $20 trillion since 2007, how can the people provide the feds with the needed money? In his speech to Congress, Obama promised new investments in energy, education and health care. Every kid is going to get a college degree. We're going to find a cure for cancer. Who is going to pay for all this? The top 2 percent, the filthy rich who got all those Bush tax breaks, say Democrats. But the top 5 percent of income earners already pay 60 percent of U.S. income taxes, while the bottom 40 percent pays nothing. Those paying a federal tax rate of 35 percent will see it rise to near 40 percent and will lose a fifth of the value of their deductions for taxes, mortgage interest and charitable contributions. Yet, two-thirds of small businesses are taxed at the same rate as individuals. Consider what this means to the owner of a restaurant and bar in Los Angeles open from noon to midnight, where a husband and wife each put in 80 hours a week. At year's end, the couple finds they have actually made a profit of $500,000 that they can take home in salary. What is the Obama-Schwarzenegger tax take on that salary? Their U.S. tax rate will have hit 39.6 percent. Their California income tax will have hit 9.55 percent. Medicare payroll taxes on the proprietor as both employer and salaried employee will be $14,500. Social Security payroll taxes for the proprietor as both employer and employee will be $13,243. In short, U.S. and state income and payroll taxes will consume half of all the pair earned for some 8,000 hours of work. From that ravaged salary they must pay a state sales tax of 8.25 percent, gas taxes for the 50-mile commute, and tens of thousands in property taxes on both their restaurant and home. And, after being pilloried by politicians for having feasted in the Bush era, they are now told the tax deduction they get for contributing to the church is to be cut 20 percent, while millions of Obama voters, who paid no U.S. income tax at all, will be getting a tax cut -- i.e., a fat little check -- in April. Any wonder native-born Californians are fleeing the Golden Land? Markets are not infallible. But the stock market has long been a \"lead indicator\" of where the economy will be six months from now. What are the markets, the collective decisions of millions of investors, saying? Having fallen every month since Obama's election, with January and February the worst two months in history, they are telling us the stimulus package will not work, that Tim Geithner is clueless about how to save the banks, that the Obama budget portends disaster for the republic. The president says he is gearing up for a fight on his budget. Good. Let's give him one.", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 11:42:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "threerings"
    }, 
    {
        "content": "Uh OH, the Obamies are going to get mad at you.", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "", 
        "reply": "Uh OH, the Obamies are going to get mad at you.", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 11:46:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts beign handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism.", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "", 
        "reply": "Theres an aspect of all this spending that I haven't seen brought up. With all the bailouts beign handed out, the govt can (and has) started handing out conditions for getting the money. For example, limiting CEO's compensations. While o-bots may say \"Oh goodie!!!\" to that one, ask yourself this, do you REALLY want to live in a country where the govt can dictate / control private enterprise in such intimate details? It, in effect, is a de facto nationalization of several industries from banking to automaking. It's possible that a mandate can come out bannig SUVs for instance. Again, THINK of the ramifactions before you flame SUVs and thier owners. Yes, it's time to fight this \"back door\" communionism.", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 12:02:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by threerings: The real Obama has stood up, and lived up to his ranking as the most left-wing member of the United States Senate. Barack has no mandate for this. He was even behind McCain when the decisive event that gave him the presidency occurred -- the September collapse of Lehman Brothers and the market crash. Actually, he does. He received a clear majority of the popular vote and (obviously) the electoral vote. I don't like it either, but a majority of Americans have chosen socialism. Enough of them have chosen it to place a filibuster-proof majority in the House and a mere 1 seat away from putting one in the Senate. Just like pain is the most effective instructor for your 4 year old, so it will be with the electorate. They don't understand that taxing the evil rich people and big businesses into submission will only result in a permanent level of high unemployment. They don't understand that the most successful economies are those where the government is in favor of business success. Personally, I hope I'm wrong. I hope that Obama's plan does work. I hope this massive spending bill will get paid for by wealth created from the most optimistic economic rebound ever. I hope we all wind up driving to a campfire in our zero-emission car that runs off free energy so we can hold hands and sing kum bay yah. Because, if it doesn't work, it isn't Obama that will be left holding the bag. About the only thing the right can hope for is that the bill for Obama's package comes due before the economy rebounds, and the demmos are left explaining that at the end of the day, the middle class are gonna have to pay for a sh**load of socialist programs that don't benefit them one iota after all. Just like it took a Carter to give the GOP its Reagan, so will an Obama give the GOP its next leader.", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "Originally posted by threerings: The real Obama has stood up, and lived up to his ranking as the most left-wing member of the United States Senate. Barack has no mandate for this. He was even behind McCain when the decisive event that gave him the presidency occurred -- the September collapse of Lehman Brothers and the market crash.", 
        "reply": " Actually, he does. He received a clear majority of the popular vote and (obviously) the electoral vote. I don't like it either, but a majority of Americans have chosen socialism. Enough of them have chosen it to place a filibuster-proof majority in the House and a mere 1 seat away from putting one in the Senate. Just like pain is the most effective instructor for your 4 year old, so it will be with the electorate. They don't understand that taxing the evil rich people and big businesses into submission will only result in a permanent level of high unemployment. They don't understand that the most successful economies are those where the government is in favor of business success. Personally, I hope I'm wrong. I hope that Obama's plan does work. I hope this massive spending bill will get paid for by wealth created from the most optimistic economic rebound ever. I hope we all wind up driving to a campfire in our zero-emission car that runs off free energy so we can hold hands and sing kum bay yah. Because, if it doesn't work, it isn't Obama that will be left holding the bag. About the only thing the right can hope for is that the bill for Obama's package comes due before the economy rebounds, and the demmos are left explaining that at the end of the day, the middle class are gonna have to pay for a sh**load of socialist programs that don't benefit them one iota after all. Just like it took a Carter to give the GOP its Reagan, so will an Obama give the GOP its next leader.", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 12:10:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "jwr6"
    }, 
    {
        "content": "I don't like obamies. Dey uggy and smell like poop!", 
        "intTime": 20090304, 
        "postID": 5, 
        "quote": "", 
        "reply": "I don't like obamies. Dey uggy and smell like poop!", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 12:12:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "Phaedrus51"
    }, 
    {
        "content": "I'm with Limbaugh, I seriously want to see Obama fall on his sword. The 47% that voted for him, if fraud wasn't involved, will regret their foolishness in the next couple of years. I believe in the short sightedness of the American people, before Obama's policies can show an uptrend, the American voter will bolt and vote in a Republican Congress in the next cycle. Then time table on his rediculous fiscal plan will speed up when he's fighting an unfriendly Congress, and there's no upswing for the economy in sight. History will show him as tho one who failed. In my several tours in overseas locations, Socialist countries, where the government owns all the means of production, look good from the outside, but inside are corrupt, and the average person can't get the goods and services they need, when they need them. That's what the American voter put into office, the advocate for big Government. Who pays the freight? It happens at the expense of the taxpaying entrepreneur, and middle class. I think it a great injustice that people that never paid a cent into the system, will be the one's who most benefit from it. OK, I'm done ranting. What were we talking about?", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "", 
        "reply": "I'm with Limbaugh, I seriously want to see Obama fall on his sword. The 47% that voted for him, if fraud wasn't involved, will regret their foolishness in the next couple of years. I believe in the short sightedness of the American people, before Obama's policies can show an uptrend, the American voter will bolt and vote in a Republican Congress in the next cycle. Then time table on his rediculous fiscal plan will speed up when he's fighting an unfriendly Congress, and there's no upswing for the economy in sight. History will show him as tho one who failed. In my several tours in overseas locations, Socialist countries, where the government owns all the means of production, look good from the outside, but inside are corrupt, and the average person can't get the goods and services they need, when they need them. That's what the American voter put into office, the advocate for big Government. Who pays the freight? It happens at the expense of the taxpaying entrepreneur, and middle class. I think it a great injustice that people that never paid a cent into the system, will be the one's who most benefit from it. OK, I'm done ranting. What were we talking about?", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 12:32:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "Phaedrus51"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Uh OH, the Obamies are going to get mad at you. Without a doubt. That article is full of actual facts, after all.", 
        "intTime": 20090304, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: Uh OH, the Obamies are going to get mad at you.", 
        "reply": " Without a doubt. That article is full of actual facts, after all.", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 12:44:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "The tax scheme will cause high earners to manage their income. Maybe take some off shore. Maybe voluntarily accept a pay cut. Maybe take a year or two off to figure the new mountanious law's rules. Maybe buy Euros, gold, silver etc etc. Maybe they'll \"move\" their businesses to the UAE or other capital / business friendly enviornments. Then who will pay for your \"free\" lunch?", 
        "intTime": 20090304, 
        "postID": 8, 
        "quote": "", 
        "reply": "The tax scheme will cause high earners to manage their income. Maybe take some off shore. Maybe voluntarily accept a pay cut. Maybe take a year or two off to figure the new mountanious law's rules. Maybe buy Euros, gold, silver etc etc. Maybe they'll \"move\" their businesses to the UAE or other capital / business friendly enviornments. Then who will pay for your \"free\" lunch?", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 12:52:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: The tax scheme will cause high earners to manage their income. Maybe take some off shore. Maybe voluntarily accept a pay cut. Maybe take a year or two off to figure the new mountanious law's rules. Maybe buy Euros, gold, silver etc etc. Maybe they'll \"move\" their businesses to the UAE or other capital / business friendly enviornments. Then who will pay for your \"free\" lunch? Praying for an upswing to take my stuff and put it in gold. right now I dont have squat to xfer. I'll be having a lot of worthless paper soon. Irish Miracle, Obama....", 
        "intTime": 20090304, 
        "postID": 9, 
        "quote": "Originally posted by peter3_1: The tax scheme will cause high earners to manage their income. Maybe take some off shore. Maybe voluntarily accept a pay cut. Maybe take a year or two off to figure the new mountanious law's rules. Maybe buy Euros, gold, silver etc etc. Maybe they'll \"move\" their businesses to the UAE or other capital / business friendly enviornments. Then who will pay for your \"free\" lunch?", 
        "reply": " Praying for an upswing to take my stuff and put it in gold. right now I dont have squat to xfer. I'll be having a lot of worthless paper soon. Irish Miracle, Obama....", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 13:03:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "heard this on the news this morning... housing bailouts so folks won't lose their homes and be able to refinance even if the refinance was greater then the value of the house... BUT there was a condition... Now get this... the house could not be valued LESS then $750,000. Now maybe I've just been a poor schmuck all my life but my mind says if you were able to get into a 750K house and you need help then maybe you should start looking for something smaller. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090304, 
        "postID": 10, 
        "quote": "", 
        "reply": "heard this on the news this morning... housing bailouts so folks won't lose their homes and be able to refinance even if the refinance was greater then the value of the house... BUT there was a condition... Now get this... the house could not be valued LESS then $750,000. Now maybe I've just been a poor schmuck all my life but my mind says if you were able to get into a 750K house and you need help then maybe you should start looking for something smaller. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 13:27:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Awesome.", 
        "intTime": 20090304, 
        "postID": 11, 
        "quote": "", 
        "reply": "Awesome.", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 14:47:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.realclearpolitics.com/articles/2009/03/pitchfork_time.html Obama Has No Mandate For Radicalism By Patrick Buchanan In his campaign and inaugural address, Barack Obama cast himself as a moderate man seeking common ground with conservatives. Yet, his budget calls for the radical restructuring of the U.S. economy, a sweeping redistribution of power and wealth to government and Democratic constituencies. It is a declaration of war on the Right. The real Obama has stood up, and lived up to his ranking as the most left-wing member of the United States Senate. Barack has no mandate for this. He was even behind McCain when the decisive event that gave him the presidency occurred -- the September collapse of Lehman Brothers and the market crash. Republicans are under no obligation to render bipartisan support to this statist coup d'etat. For what is going down is a leftist power grab that is anathema to their principles and philosophy. Where the U.S. government usually consumes 21 percent of gross domestic product, this Obama budget spends 28 percent in 2009 and runs a deficit of $1.75 trillion, or 12.7 percent of GDP. That is four times the largest deficit of George W. Bush and twice as large a share of the economy as any deficit run since World War II. Add that 28 percent of GDP spent by the U.S. government to the 12 percent spent by states, counties and cities, and government will consume 40 percent of the economy in 2009. We are not \"headed down the road to socialism.\" We are there. Since the budget was released, word has come that the U.S. economy did not shrink by 3.8 percent in the fourth quarter, but 6.2 percent. All the assumptions in Obama's budget about growth in 2009 and 2010 need to be revised downward, and the deficits revised upward. Look for the deficit for 2009 to cross $2 trillion. Who abroad is going to lend us the trillions to finance our deficits without demanding higher interest rates on the U.S. bonds they are being asked to hold? And if we must revert to the printing press to create the money, what happens to the dollar? As Americans save only a pittance and have lost -- in the value of homes, stocks, bonds and other assets -- $15 trillion to $20 trillion since 2007, how can the people provide the feds with the needed money? In his speech to Congress, Obama promised new investments in energy, education and health care. Every kid is going to get a college degree. We're going to find a cure for cancer. Who is going to pay for all this? The top 2 percent, the filthy rich who got all those Bush tax breaks, say Democrats. But the top 5 percent of income earners already pay 60 percent of U.S. income taxes, while the bottom 40 percent pays nothing. Those paying a federal tax rate of 35 percent will see it rise to near 40 percent and will lose a fifth of the value of their deductions for taxes, mortgage interest and charitable contributions. Yet, two-thirds of small businesses are taxed at the same rate as individuals. Consider what this means to the owner of a restaurant and bar in Los Angeles open from noon to midnight, where a husband and wife each put in 80 hours a week. At year's end, the couple finds they have actually made a profit of $500,000 that they can take home in salary. What is the Obama-Schwarzenegger tax take on that salary? Their U.S. tax rate will have hit 39.6 percent. Their California income tax will have hit 9.55 percent. Medicare payroll taxes on the proprietor as both employer and salaried employee will be $14,500. Social Security payroll taxes for the proprietor as both employer and employee will be $13,243. In short, U.S. and state income and payroll taxes will consume half of all the pair earned for some 8,000 hours of work. From that ravaged salary they must pay a state sales tax of 8.25 percent, gas taxes for the 50-mile commute, and tens of thousands in property taxes on both their restaurant and home. And, after being pilloried by politicians for having feasted in the Bush era, they are now told the tax deduction they get for contributing to the church is to be cut 20 percent, while millions of Obama voters, who paid no U.S. income tax at all, will be getting a tax cut -- i.e., a fat little check -- in April. Any wonder native-born Californians are fleeing the Golden Land? Markets are not infallible. But the stock market has long been a \"lead indicator\" of where the economy will be six months from now. What are the markets, the collective decisions of millions of investors, saying? Having fallen every month since Obama's election, with January and February the worst two months in history, they are telling us the stimulus package will not work, that Tim Geithner is clueless about how to save the banks, that the Obama budget portends disaster for the republic. The president says he is gearing up for a fight on his budget. Good. Let's give him one. He's a Chicago politican thru and thru!", 
        "intTime": 20090304, 
        "postID": 12, 
        "quote": "Originally posted by threerings: +++http://www.realclearpolitics.com/articles/2009/03/pitchfork_time.html Obama Has No Mandate For Radicalism By Patrick Buchanan In his campaign and inaugural address, Barack Obama cast himself as a moderate man seeking common ground with conservatives. Yet, his budget calls for the radical restructuring of the U.S. economy, a sweeping redistribution of power and wealth to government and Democratic constituencies. It is a declaration of war on the Right. The real Obama has stood up, and lived up to his ranking as the most left-wing member of the United States Senate. Barack has no mandate for this. He was even behind McCain when the decisive event that gave him the presidency occurred -- the September collapse of Lehman Brothers and the market crash. Republicans are under no obligation to render bipartisan support to this statist coup d'etat. For what is going down is a leftist power grab that is anathema to their principles and philosophy. Where the U.S. government usually consumes 21 percent of gross domestic product, this Obama budget spends 28 percent in 2009 and runs a deficit of $1.75 trillion, or 12.7 percent of GDP. That is four times the largest deficit of George W. Bush and twice as large a share of the economy as any deficit run since World War II. Add that 28 percent of GDP spent by the U.S. government to the 12 percent spent by states, counties and cities, and government will consume 40 percent of the economy in 2009. We are not \"headed down the road to socialism.\" We are there. Since the budget was released, word has come that the U.S. economy did not shrink by 3.8 percent in the fourth quarter, but 6.2 percent. All the assumptions in Obama's budget about growth in 2009 and 2010 need to be revised downward, and the deficits revised upward. Look for the deficit for 2009 to cross $2 trillion. Who abroad is going to lend us the trillions to finance our deficits without demanding higher interest rates on the U.S. bonds they are being asked to hold? And if we must revert to the printing press to create the money, what happens to the dollar? As Americans save only a pittance and have lost -- in the value of homes, stocks, bonds and other assets -- $15 trillion to $20 trillion since 2007, how can the people provide the feds with the needed money? In his speech to Congress, Obama promised new investments in energy, education and health care. Every kid is going to get a college degree. We're going to find a cure for cancer. Who is going to pay for all this? The top 2 percent, the filthy rich who got all those Bush tax breaks, say Democrats. But the top 5 percent of income earners already pay 60 percent of U.S. income taxes, while the bottom 40 percent pays nothing. Those paying a federal tax rate of 35 percent will see it rise to near 40 percent and will lose a fifth of the value of their deductions for taxes, mortgage interest and charitable contributions. Yet, two-thirds of small businesses are taxed at the same rate as individuals. Consider what this means to the owner of a restaurant and bar in Los Angeles open from noon to midnight, where a husband and wife each put in 80 hours a week. At year's end, the couple finds they have actually made a profit of $500,000 that they can take home in salary. What is the Obama-Schwarzenegger tax take on that salary? Their U.S. tax rate will have hit 39.6 percent. Their California income tax will have hit 9.55 percent. Medicare payroll taxes on the proprietor as both employer and salaried employee will be $14,500. Social Security payroll taxes for the proprietor as both employer and employee will be $13,243. In short, U.S. and state income and payroll taxes will consume half of all the pair earned for some 8,000 hours of work. From that ravaged salary they must pay a state sales tax of 8.25 percent, gas taxes for the 50-mile commute, and tens of thousands in property taxes on both their restaurant and home. And, after being pilloried by politicians for having feasted in the Bush era, they are now told the tax deduction they get for contributing to the church is to be cut 20 percent, while millions of Obama voters, who paid no U.S. income tax at all, will be getting a tax cut -- i.e., a fat little check -- in April. Any wonder native-born Californians are fleeing the Golden Land? Markets are not infallible. But the stock market has long been a \"lead indicator\" of where the economy will be six months from now. What are the markets, the collective decisions of millions of investors, saying? Having fallen every month since Obama's election, with January and February the worst two months in history, they are telling us the stimulus package will not work, that Tim Geithner is clueless about how to save the banks, that the Obama budget portends disaster for the republic. The president says he is gearing up for a fight on his budget. Good. Let's give him one.", 
        "reply": " He's a Chicago politican thru and thru!", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 18:12:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: heard this on the news this morning... housing bailouts so folks won't lose their homes and be able to refinance even if the refinance was greater then the value of the house... BUT there was a condition... Now get this... the house could not be valued LESS then $750,000. Now maybe I've just been a poor schmuck all my life but my mind says if you were able to get into a 750K house and you need help then maybe you should start looking for something smaller. Check your information ... Only some homeowners will be eligible. To qualify: You must live in your house, condo, or co-op. (Manufactured homes not attached to a foundation don’t qualify.) If you’ve abandoned your home or rented it out to help make your mortgage payments, you won’t be eligible. You’ll have to verify it’s your primary residence with a tax return, credit report, utility bill or other document. Borrowers in bankruptcy may be eligible. Your loan has to be less than $729,750 for a single family house; for multifamily homes the cap rises to $1.4 million for a four-unit house.There are no limits on the ratio of the size of your loan to the current market value of your house: Homeowners who are substantially “underwater” can apply. You also have to show that you’re either in default or about to face default. And you’ll have to sign an affidavit saying you can’t afford your mortgage It always helps to read the full story.", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "Originally posted by m551sheridan: heard this on the news this morning... housing bailouts so folks won't lose their homes and be able to refinance even if the refinance was greater then the value of the house... BUT there was a condition... Now get this... the house could not be valued LESS then $750,000. Now maybe I've just been a poor schmuck all my life but my mind says if you were able to get into a 750K house and you need help then maybe you should start looking for something smaller.", 
        "reply": " Check your information ... Only some homeowners will be eligible. To qualify: You must live in your house, condo, or co-op. (Manufactured homes not attached to a foundation don’t qualify.) If you’ve abandoned your home or rented it out to help make your mortgage payments, you won’t be eligible. You’ll have to verify it’s your primary residence with a tax return, credit report, utility bill or other document. Borrowers in bankruptcy may be eligible. Your loan has to be less than $729,750 for a single family house; for multifamily homes the cap rises to $1.4 million for a four-unit house.There are no limits on the ratio of the size of your loan to the current market value of your house: Homeowners who are substantially “underwater” can apply. You also have to show that you’re either in default or about to face default. And you’ll have to sign an affidavit saying you can’t afford your mortgage It always helps to read the full story.", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-04 20:24:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by Phaedrus51: I'm with Limbaugh, I seriously want to see Obama fall on his sword. The 47% that voted for him, if fraud wasn't involved, will regret their foolishness in the next couple of years. I believe in the short sightedness of the American people, before Obama's policies can show an uptrend, the American voter will bolt and vote in a Republican Congress in the next cycle. Then time table on his rediculous fiscal plan will speed up when he's fighting an unfriendly Congress, and there's no upswing for the economy in sight. History will show him as tho one who failed. In my several tours in overseas locations, Socialist countries, where the government owns all the means of production, look good from the outside, but inside are corrupt, and the average person can't get the goods and services they need, when they need them. That's what the American voter put into office, the advocate for big Government. Who pays the freight? It happens at the expense of the taxpaying entrepreneur, and middle class. I think it a great injustice that people that never paid a cent into the system, will be the one's who most benefit from it. OK, I'm done ranting. What were we talking about? 47% that voted for him, Barack Obama John McCain Popular vote 69,456,897 59,934,814 Percentage 52.9% 45.7%", 
        "intTime": 20090305, 
        "postID": 14, 
        "quote": "Originally posted by Phaedrus51: I'm with Limbaugh, I seriously want to see Obama fall on his sword. The 47% that voted for him, if fraud wasn't involved, will regret their foolishness in the next couple of years. I believe in the short sightedness of the American people, before Obama's policies can show an uptrend, the American voter will bolt and vote in a Republican Congress in the next cycle. Then time table on his rediculous fiscal plan will speed up when he's fighting an unfriendly Congress, and there's no upswing for the economy in sight. History will show him as tho one who failed. In my several tours in overseas locations, Socialist countries, where the government owns all the means of production, look good from the outside, but inside are corrupt, and the average person can't get the goods and services they need, when they need them. That's what the American voter put into office, the advocate for big Government. Who pays the freight? It happens at the expense of the taxpaying entrepreneur, and middle class. I think it a great injustice that people that never paid a cent into the system, will be the one's who most benefit from it. OK, I'm done ranting. What were we talking about?", 
        "reply": " 47% that voted for him, Barack Obama John McCain Popular vote 69,456,897 59,934,814 Percentage 52.9% 45.7%", 
        "threadID": "409192893_3720009612001", 
        "time": "2009-03-05 02:24:00", 
        "title": "Will the real Obama..please stand up..please stand up..", 
        "userID": "jdksfcret"
    }
]