[
    {
        "content": "This post is sort of a response to GunnyRet03's 9% Union BS thread. The following came across my desk this morning and I wanted to pass it along before it gets dropped from my screen. This is the reason and NOT Unions that is behind 80% of the problems. Gunny's statement of $15 vs. $35 per hour is disingenuous at best... Specifically if taken over to the Manufacturing Industrial sectors. Our crap is in the wind because all sectors that can be off-shored ARE being off-shored piecemeal. I am looking at a MAJOR Technology firm that is privately hiring the below FOR Indonesia. Now the High Technology sector has never been Unionized... yet they are permanently shedding jobs and positions even faster than the so called Unionized non-tech shops. Are you people just going to make the silly statement that it's because the American worker wants too much money for his/her services? If you do... please explain how THIS COUNTRY could ever hope to move forward if EVERYONE took a 90% pay cut? All across the board. Just for your information... no one here could even BEGIN to afford goods made in China even if you took a US wide 50% paycut. Some of you simply are angry for the wrong reasons and taking your anger out on the wrong targets... quote: These positions are ALL for Senior experienced people at the upper 30% of their fields and require a MINIMUM of 7 years direct related experience. This is a summary without position details. The employer HAS to remain confidential. Mar 24, 3:00 PM PLEASE NOTE: These positions will be based in Indonesia and be paid as follows: Engineering Team Lead: Salary = $1000 USD PER MONTH Software Team Lead : Salary = $950 USD PER MONTH Senior Software Engineers: Salary = $850 USD PER MONTH Assistant Financial Controller: Salary = $950 USD PER MONTH These positions will be based in Pakistan and be paid in Indian Rupees (PKR) as follows: Graphic Designer: Salary = 45,000 - 60,000 PKR per month Software Team Lead: Salary = 150,000 PKR per month(negotiable) Senior Software Engineers: Salary = 60,000 PKR - 80,000 PKR (PER MONTH) BTW... I will be more than happy to give you all the US equivalent salaries for the above... or you can seek them yourself from this website. >http://www.salary.com<", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "These positions are ALL for Senior experienced people at the upper 30% of their fields and require a MINIMUM of 7 years direct related experience. This is a summary without position details. The employer HAS to remain confidential. Mar 24, 3:00 PM PLEASE NOTE: These positions will be based in Indonesia and be paid as follows: Engineering Team Lead: Salary = $1000 USD PER MONTH Software Team Lead : Salary = $950 USD PER MONTH Senior Software Engineers: Salary = $850 USD PER MONTH Assistant Financial Controller: Salary = $950 USD PER MONTH These positions will be based in Pakistan and be paid in Indian Rupees (PKR) as follows: Graphic Designer: Salary = 45,000 - 60,000 PKR per month Software Team Lead: Salary = 150,000 PKR per month(negotiable) Senior Software Engineers: Salary = 60,000 PKR - 80,000 PKR (PER MONTH)", 
        "reply": "This post is sort of a response to GunnyRet03's 9% Union BS thread. The following came across my desk this morning and I wanted to pass it along before it gets dropped from my screen. This is the reason and NOT Unions that is behind 80% of the problems. Gunny's statement of $15 vs. $35 per hour is disingenuous at best... Specifically if taken over to the Manufacturing Industrial sectors. Our crap is in the wind because all sectors that can be off-shored ARE being off-shored piecemeal. I am looking at a MAJOR Technology firm that is privately hiring the below FOR Indonesia. Now the High Technology sector has never been Unionized... yet they are permanently shedding jobs and positions even faster than the so called Unionized non-tech shops. Are you people just going to make the silly statement that it's because the American worker wants too much money for his/her services? If you do... please explain how THIS COUNTRY could ever hope to move forward if EVERYONE took a 90% pay cut? All across the board. Just for your information... no one here could even BEGIN to afford goods made in China even if you took a US wide 50% paycut. Some of you simply are angry for the wrong reasons and taking your anger out on the wrong targets...  BTW... I will be more than happy to give you all the US equivalent salaries for the above... or you can seek them yourself from this website. >http://www.salary.com<", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 12:00:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "BTW: I also do not see anyone bidding for placing these positions as well... the company is only offering $150 to $750 total commissions for each position. That places whoever accepts the work at below minimum wage and not able to meet their own expenses. You cannot pay $2000-$2500 per month in expenses on $75 to $375 of pay. Not and stay afloat", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "BTW: I also do not see anyone bidding for placing these positions as well... the company is only offering $150 to $750 total commissions for each position. That places whoever accepts the work at below minimum wage and not able to meet their own expenses. You cannot pay $2000-$2500 per month in expenses on $75 to $375 of pay. Not and stay afloat", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 12:43:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: This post is sort of a response to GunnyRet03's 9% Union BS thread. The following came across my desk this morning and I wanted to pass it along before it gets dropped from my screen. BS, because the people polled by rasmussen didnt think well of unions and proved that people arent screaming for unions and it hurt union smack-boy feelings here. Nobody is stopping people from unionizing. Just dont force it on others, not that hard to understand. the $15 vs $35 was what a reporter had said reporting on construction from Ca.", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "This post is sort of a response to GunnyRet03's 9% Union BS thread. The following came across my desk this morning and I wanted to pass it along before it gets dropped from my screen.", 
        "reply": " BS, because the people polled by rasmussen didnt think well of unions and proved that people arent screaming for unions and it hurt union smack-boy feelings here. Nobody is stopping people from unionizing. Just dont force it on others, not that hard to understand. the $15 vs $35 was what a reporter had said reporting on construction from Ca.", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 12:56:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Art what does $1,000 USD buy in Pakistan. You seem to confuse our standard of living to be the same as theirs. I had a conversation with a BHL in college about what a shoe company paid its workers in China. He felt they should be making at least the $7.25/hr Illinois workers were getting. He could not see a difference between our two countries. I had one of the other grad students who was from China come over, because I was only spouting BS. I asked Quan how much rice he could buy out at the local Wal-Mart for $5. He said about 5lbs. How long will that last your family? About 4-6 days, because both he and his wife are not home on a consistant basis. I asked now how much rice, how long it will last, and how many people are you feeding? He said he could get at least a 50lbs sack, it would last 10-12 days, and the home had about 10 people living there.", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "", 
        "reply": "Art what does $1,000 USD buy in Pakistan. You seem to confuse our standard of living to be the same as theirs. I had a conversation with a BHL in college about what a shoe company paid its workers in China. He felt they should be making at least the $7.25/hr Illinois workers were getting. He could not see a difference between our two countries. I had one of the other grad students who was from China come over, because I was only spouting BS. I asked Quan how much rice he could buy out at the local Wal-Mart for $5. He said about 5lbs. How long will that last your family? About 4-6 days, because both he and his wife are not home on a consistant basis. I asked now how much rice, how long it will last, and how many people are you feeding? He said he could get at least a 50lbs sack, it would last 10-12 days, and the home had about 10 people living there.", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 18:11:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: Art what does $1,000 USD buy in Pakistan. You seem to confuse our standard of living to be the same as theirs. I had a conversation with a BHL in college about what a shoe company paid its workers in China. He felt they should be making at least the $7.25/hr Illinois workers were getting. He could not see a difference between our two countries. I had one of the other grad students who was from China come over, because I was only spouting BS. I asked Quan how much rice he could buy out at the local Wal-Mart for $5. He said about 5lbs. How long will that last your family? About 4-6 days, because both he and his wife are not home on a consistant basis. I asked now how much rice, how long it will last, and how many people are you feeding? He said he could get at least a 50lbs sack, it would last 10-12 days, and the home had about 10 people living there. Well... The question should be Which buys more $1000 in Indonesia (not Pakistan) or About $10,000 to $12,000 (depending on where you work) in the states? I am willing to place my bet... the states buys more. At least it did in the late 1990s when my own Hi-Tech company offshored. The companies themselves really are not interested in the employee cost of living. They are interested in their own bottom line. And it is because of the bottom line that they move... that and a drastically reduced cost of moving material and goods in and out of this country. BTW: Have you ever seen the AO over there? I have seen Malaysia and i doubt it is all that different than Indonesia", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "Originally posted by sgt_posty: Art what does $1,000 USD buy in Pakistan. You seem to confuse our standard of living to be the same as theirs. I had a conversation with a BHL in college about what a shoe company paid its workers in China. He felt they should be making at least the $7.25/hr Illinois workers were getting. He could not see a difference between our two countries. I had one of the other grad students who was from China come over, because I was only spouting BS. I asked Quan how much rice he could buy out at the local Wal-Mart for $5. He said about 5lbs. How long will that last your family? About 4-6 days, because both he and his wife are not home on a consistant basis. I asked now how much rice, how long it will last, and how many people are you feeding? He said he could get at least a 50lbs sack, it would last 10-12 days, and the home had about 10 people living there.", 
        "reply": " Well... The question should be Which buys more $1000 in Indonesia (not Pakistan) or About $10,000 to $12,000 (depending on where you work) in the states? I am willing to place my bet... the states buys more. At least it did in the late 1990s when my own Hi-Tech company offshored. The companies themselves really are not interested in the employee cost of living. They are interested in their own bottom line. And it is because of the bottom line that they move... that and a drastically reduced cost of moving material and goods in and out of this country. BTW: Have you ever seen the AO over there? I have seen Malaysia and i doubt it is all that different than Indonesia", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 22:22:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Just dont force it on others no one is ever \"forced\" to join a union.", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "Just dont force it on others", 
        "reply": " no one is ever \"forced\" to join a union.", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 22:28:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Just dont force it on others no one is ever \"forced\" to join a union. Well... if you wish to be technical... you may be right... but there are places that if you wish to have an actual employment... you are forced to go Union... otherwise it is minimum wage for you. Moving for some... isn't always an option But this thread really isn't all that much about Unions", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "Originally posted by karlhungusjr: quote: Just dont force it on others no one is ever \"forced\" to join a union.", 
        "reply": " Well... if you wish to be technical... you may be right... but there are places that if you wish to have an actual employment... you are forced to go Union... otherwise it is minimum wage for you. Moving for some... isn't always an option But this thread really isn't all that much about Unions", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 22:32:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: but there are places that if you wish to have an actual employment... you are forced to go Union... otherwise it is minimum wage for you. well sure. just like there are many many more places where you are \"forced\" to go non union and make minimum wage. quote: But this thread really isn't all that much about Unions The problem is, most companies these days aren't built up by the owner and then passed on to the family. They don't look for good workers who are loyal to the company and are then in turn loyal to them. It's all about the quick buck. a company years ago might find a new process and save a few bucks per product then lower the product price to increase sales. now a company will fire off its older more experienced workers to hire someone either less experienced or from overseas(or both) and instead of using that savings to build up the company, they use that to increase dividends(and that usually means their bonuses as well). combine that with a stock market that demands stocks to outpreform instead of being a steady strong company and you have todays current job market.", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "but there are places that if you wish to have an actual employment... you are forced to go Union... otherwise it is minimum wage for you.", 
        "reply": " well sure. just like there are many many more places where you are \"forced\" to go non union and make minimum wage. quote: But this thread really isn't all that much about Unions The problem is, most companies these days aren't built up by the owner and then passed on to the family. They don't look for good workers who are loyal to the company and are then in turn loyal to them. It's all about the quick buck. a company years ago might find a new process and save a few bucks per product then lower the product price to increase sales. now a company will fire off its older more experienced workers to hire someone either less experienced or from overseas(or both) and instead of using that savings to build up the company, they use that to increase dividends(and that usually means their bonuses as well). combine that with a stock market that demands stocks to outpreform instead of being a steady strong company and you have todays current job market.", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 22:54:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: But this thread really isn't all that much about Unions And yet the title of this thread is, \"What exactly do Unions have to do with it anyway?\" Give me a break!", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "But this thread really isn't all that much about Unions", 
        "reply": " And yet the title of this thread is, \"What exactly do Unions have to do with it anyway?\" Give me a break!", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-25 22:55:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I dont blame Unions. They are and should be looking out for their members ( full disclosure: I worked for a union for 6 years, and know full well some of the bs that goes on there). However, when GM and Ford cannot produce a car for a profit then there is a problem. That problem stems from the unions having too much power with our politcal hacks, and the companies not standing up to the unions. What the unions need to understand is that if they drive the auto makers out of business then NO ONE has a job.", 
        "intTime": 20090326, 
        "postID": 10, 
        "quote": "", 
        "reply": "I dont blame Unions. They are and should be looking out for their members ( full disclosure: I worked for a union for 6 years, and know full well some of the bs that goes on there). However, when GM and Ford cannot produce a car for a profit then there is a problem. That problem stems from the unions having too much power with our politcal hacks, and the companies not standing up to the unions. What the unions need to understand is that if they drive the auto makers out of business then NO ONE has a job.", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-26 05:50:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: But this thread really isn't all that much about Unions And yet the title of this thread is, \"What exactly do Unions have to do with it anyway?\" Give me a break! Scooter... don't mean to stretch your ole IQ but this thread is about Hi Tech... and why a strictly NON-UNION industry still moves off shore and lays off. You are so busy using Unions as scapegoats you cannot even see that Unions in 2009... are trivial. Unions only seem to slow the exodus... and yet you pitch a bitc* about them???? Using Gunny's thread topic as an example... even IF the Union were only paying $15/hour... the jobs and plants would still go overseas because there are those who can work for 75 cents an hour... and still make barely enough to get by. Could you live on 75 cents an hour? Why wouldn't you want to? This message has been edited. Last edited by: ArtMarsh, Thu 26 March 2009 08:11 PM", 
        "intTime": 20090326, 
        "postID": 11, 
        "quote": "Originally posted by scooter_mech: quote: But this thread really isn't all that much about Unions And yet the title of this thread is, \"What exactly do Unions have to do with it anyway?\" Give me a break!", 
        "reply": " Scooter... don't mean to stretch your ole IQ but this thread is about Hi Tech... and why a strictly NON-UNION industry still moves off shore and lays off. You are so busy using Unions as scapegoats you cannot even see that Unions in 2009... are trivial. Unions only seem to slow the exodus... and yet you pitch a bitc* about them???? Using Gunny's thread topic as an example... even IF the Union were only paying $15/hour... the jobs and plants would still go overseas because there are those who can work for 75 cents an hour... and still make barely enough to get by. Could you live on 75 cents an hour? Why wouldn't you want to? This message has been edited. Last edited by: ArtMarsh, Thu 26 March 2009 08:11 PM", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-26 17:05:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "ALOT OF THEM LEAVE BECAUSE THE U.S. HAS THE SECOND HIGHEST TAX ON BUSINESSES IN THE WORLD.", 
        "intTime": 20090326, 
        "postID": 12, 
        "quote": "", 
        "reply": "ALOT OF THEM LEAVE BECAUSE THE U.S. HAS THE SECOND HIGHEST TAX ON BUSINESSES IN THE WORLD.", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-26 21:59:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "quote: Originally posted by backtoiraq: ALOT OF THEM LEAVE BECAUSE THE U.S. HAS THE SECOND HIGHEST TAX ON BUSINESSES IN THE WORLD. Got any links to show us the proof? I know that corporations will do whatever they can to increase profits including making claims about how much they are \"forced\" to pay in taxes. Now the irony is they include the taxes they pay to the government on YOUR wages which is not part of the net profit but they like to make everyone believe it is. I must be broke because I pay taxes on money I was refunded last year that was already taxed the first time I earned it. And the corporate tax rate is half what the middle class tax rate is. If they want to complain then raise their tax rate to what mine is and I'll be sympathetic. Until then STFU and quit exploiting the people who made your company profitable to begin with. OOHHHH! Here's a thought....pay people a higher wage which you can write off as an expense and not be taxed on (because I will be taxed on it) and people will stop looking so closely at your bottom line....????? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090326, 
        "postID": 13, 
        "quote": "Originally posted by backtoiraq: ALOT OF THEM LEAVE BECAUSE THE U.S. HAS THE SECOND HIGHEST TAX ON BUSINESSES IN THE WORLD.", 
        "reply": " Got any links to show us the proof? I know that corporations will do whatever they can to increase profits including making claims about how much they are \"forced\" to pay in taxes. Now the irony is they include the taxes they pay to the government on YOUR wages which is not part of the net profit but they like to make everyone believe it is. I must be broke because I pay taxes on money I was refunded last year that was already taxed the first time I earned it. And the corporate tax rate is half what the middle class tax rate is. If they want to complain then raise their tax rate to what mine is and I'll be sympathetic. Until then STFU and quit exploiting the people who made your company profitable to begin with. OOHHHH! Here's a thought....pay people a higher wage which you can write off as an expense and not be taxed on (because I will be taxed on it) and people will stop looking so closely at your bottom line....????? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-26 22:27:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by backtoiraq: ALOT OF THEM LEAVE BECAUSE THE U.S. HAS THE SECOND HIGHEST TAX ON BUSINESSES IN THE WORLD. WHAT!!!! Not even close dude... not even in the top 10.", 
        "intTime": 20090327, 
        "postID": 14, 
        "quote": "Originally posted by backtoiraq: ALOT OF THEM LEAVE BECAUSE THE U.S. HAS THE SECOND HIGHEST TAX ON BUSINESSES IN THE WORLD.", 
        "reply": " WHAT!!!! Not even close dude... not even in the top 10.", 
        "threadID": "409192893_5110098812001", 
        "time": "2009-03-27 09:33:00", 
        "title": "What exactly do Unions have to do with it anyway?", 
        "userID": "ArtMarsh"
    }
]