[
    {
        "content": "So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "intTime": 20090530, 
        "postID": 1, 
        "quote": "", 
        "reply": "So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 02:03:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "RW60"
    }, 
    {
        "content": "I'll wait until I see Nancy Pelosi buy one and drive it before I even think of buying one. Until then I'll keep my little Toyota Tundra pick-up truck.", 
        "intTime": 20090530, 
        "postID": 2, 
        "quote": "", 
        "reply": "I'll wait until I see Nancy Pelosi buy one and drive it before I even think of buying one. Until then I'll keep my little Toyota Tundra pick-up truck.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 03:09:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "I went with a Ford Ranger 4X4. Damn satisfied with it too. They also didn't take any stimulus money and then file for bankruptcy. All that money, down the drain....for what????", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "", 
        "reply": "I went with a Ford Ranger 4X4. Damn satisfied with it too. They also didn't take any stimulus money and then file for bankruptcy. All that money, down the drain....for what????", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 05:15:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets!", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "", 
        "reply": "RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets!", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:00:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. GM has made massive strides in quality and competitive pricing. The ONLY area in which Ford has a lead on GM is in terms of hybrid vehicles - but then again, GM strategy is that hybrids are only a temporary step towards a vehicle that doesn't use gas at all, so they've been focusing their efforts on the \"no gas\" goal instead. I've had my Chevy for 4 years/45K miles and the ONLY problem I've had with it is recently - and that's only because the \"Roadside Assistance\" guy accidentally shorted my battery to my engine block while installing a new battery. The rest has been routine maintenance - oil changes, wiper blade replacement, and new tires not so long ago. All that and I still get over 35mpg. Not bad for a car I picked up for $10,500 brand new. I can't speak for the rest of Ford, but I know that in terms of the electronics that we supply them, Ford's quality standards are quite lacking when compared even to Chrysler and GM - let alone Honda or Toyota. We've had instances where we've had suspect bad parts on the engine controller and when we set them aside for additional testing that Ford's response has been \"Send them anyway - if they're bad we'll replace them at factory or dealer level!\"", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "", 
        "reply": "Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. GM has made massive strides in quality and competitive pricing. The ONLY area in which Ford has a lead on GM is in terms of hybrid vehicles - but then again, GM strategy is that hybrids are only a temporary step towards a vehicle that doesn't use gas at all, so they've been focusing their efforts on the \"no gas\" goal instead. I've had my Chevy for 4 years/45K miles and the ONLY problem I've had with it is recently - and that's only because the \"Roadside Assistance\" guy accidentally shorted my battery to my engine block while installing a new battery. The rest has been routine maintenance - oil changes, wiper blade replacement, and new tires not so long ago. All that and I still get over 35mpg. Not bad for a car I picked up for $10,500 brand new. I can't speak for the rest of Ford, but I know that in terms of the electronics that we supply them, Ford's quality standards are quite lacking when compared even to Chrysler and GM - let alone Honda or Toyota. We've had instances where we've had suspect bad parts on the engine controller and when we set them aside for additional testing that Ford's response has been \"Send them anyway - if they're bad we'll replace them at factory or dealer level!\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:12:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else. Don't think you're going to get anything like that - I'm fairly sure that's a rebadged Opel and GM are desperately trying to sell Opel to Fiat or a Russian/Canadian partnership. Why I don't know, seeing as how Vauxhall/Opel is one of the most profitable (or at least least loss-making) GM companies and has been consistently producing good cars for several years now. By the way. I think the \"Focus is a clown car\" comment is very telling as to just how massively wonky the US car industry is and just how brainwashed you lot have been into accepting quantity of metal over quality of design.", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "reply": " Don't think you're going to get anything like that - I'm fairly sure that's a rebadged Opel and GM are desperately trying to sell Opel to Fiat or a Russian/Canadian partnership. Why I don't know, seeing as how Vauxhall/Opel is one of the most profitable (or at least least loss-making) GM companies and has been consistently producing good cars for several years now. By the way. I think the \"Focus is a clown car\" comment is very telling as to just how massively wonky the US car industry is and just how brainwashed you lot have been into accepting quantity of metal over quality of design.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:20:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "You can be the first one on your block to own a clown car if you buy now!! Watch out for those kids on skateboards and big wheels! \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "", 
        "reply": "You can be the first one on your block to own a clown car if you buy now!! Watch out for those kids on skateboards and big wheels! \"The World's Finest\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:44:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets! I really like that Ford F-150 Platnum edition but they want $48,000 for it. With that kind of money I could buy a new 2009 Tocoma and a 2009 Toyota Corolla. I drive a Tundra 4x4 Limited by the way. Only cost me $37,000.", 
        "intTime": 20090530, 
        "postID": 8, 
        "quote": "Originally posted by cosmicfish: RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets!", 
        "reply": " I really like that Ford F-150 Platnum edition but they want $48,000 for it. With that kind of money I could buy a new 2009 Tocoma and a 2009 Toyota Corolla. I drive a Tundra 4x4 Limited by the way. Only cost me $37,000.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:51:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else. Wow, Obama and Al Gore designed and built that car in a couple of months? Oh wait, it seems the car made it's debut at an auto show in 2007, and the decision to sell it in the U.S. was made this past January: Chevrolet has confirmed today at the Detroit Auto Show that it will bring a new compact car called the Spark to the United States by 2011. This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here. The Spark was originally shown as the Chevrolet Beat, one of three compact car concepts at the 2007 New York Auto Show but the only one thus far to be given a green light for production. Originally intended for emerging markets and Europe, where small cars are the norm, GM changed its mind about bringing the Spark to the U.S. due to the last fuel price crisis. \"http://www.motorauthority.com/chevy-beat-concept-headed-to-detroit-us-production-possible.html\"", 
        "intTime": 20090530, 
        "postID": 9, 
        "quote": "Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "reply": " Wow, Obama and Al Gore designed and built that car in a couple of months? Oh wait, it seems the car made it's debut at an auto show in 2007, and the decision to sell it in the U.S. was made this past January: Chevrolet has confirmed today at the Detroit Auto Show that it will bring a new compact car called the Spark to the United States by 2011. This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here. The Spark was originally shown as the Chevrolet Beat, one of three compact car concepts at the 2007 New York Auto Show but the only one thus far to be given a green light for production. Originally intended for emerging markets and Europe, where small cars are the norm, GM changed its mind about bringing the Spark to the U.S. due to the last fuel price crisis. \"http://www.motorauthority.com/chevy-beat-concept-headed-to-detroit-us-production-possible.html\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 07:23:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here. You can buy it at the auto sales right next to DisneyWorld in Orlando.", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "Originally posted by esample1: This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here.", 
        "reply": " You can buy it at the auto sales right next to DisneyWorld in Orlando.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 08:05:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I currently own a 2000 Silverado 4x4 regular cab SWB. It is still trouble free other than routine maint. When it comes time to replace it, I dang sure will be eying Ford even though I have always preferred GM trucks.", 
        "intTime": 20090530, 
        "postID": 11, 
        "quote": "", 
        "reply": "I currently own a 2000 Silverado 4x4 regular cab SWB. It is still trouble free other than routine maint. When it comes time to replace it, I dang sure will be eying Ford even though I have always preferred GM trucks.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 12, 
        "quote": "", 
        "reply": "Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 08:32:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either.", 
        "intTime": 20090530, 
        "postID": 13, 
        "quote": "Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring.", 
        "reply": " One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 09:11:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "I drive a 05 Ford 150 PU...my wife a 02 VW Passat and we like them...the VW is a little less dependable but drives well. The VW is sorta like my Harley Road King...touchy but a good ride. Off all the vehicles the Harley gets the best milage about 50 mpg...", 
        "intTime": 20090530, 
        "postID": 14, 
        "quote": "", 
        "reply": "I drive a 05 Ford 150 PU...my wife a 02 VW Passat and we like them...the VW is a little less dependable but drives well. The VW is sorta like my Harley Road King...touchy but a good ride. Off all the vehicles the Harley gets the best milage about 50 mpg...", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 09:16:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either. My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either.", 
        "reply": " My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 09:31:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "L0A1"
    }, 
    {
        "content": "Say no more. My wife wanted one of those Chrysler box cars that looks like it came out of the early 50's. (Can't think of the name of it) So I had to lie to her and tell her that the Camry was cheaper and would save me hundreds on our car insurance. She never checked up on anything.", 
        "intTime": 20090530, 
        "postID": 16, 
        "quote": "", 
        "reply": "Say no more. My wife wanted one of those Chrysler box cars that looks like it came out of the early 50's. (Can't think of the name of it) So I had to lie to her and tell her that the Camry was cheaper and would save me hundreds on our car insurance. She never checked up on anything.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 11:53:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM.", 
        "intTime": 20090530, 
        "postID": 17, 
        "quote": "Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think.", 
        "reply": " They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 12:20:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "RW60"
    }, 
    {
        "content": "quote: Originally posted by RW60: quote: Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM. That car was designed over 2 years ago, and the decision to sell it in the U.S. was considered last July. The final decision was made in Jan. What does the government have to do with it?", 
        "intTime": 20090530, 
        "postID": 18, 
        "quote": "Originally posted by RW60: quote: Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM.", 
        "reply": " That car was designed over 2 years ago, and the decision to sell it in the U.S. was considered last July. The final decision was made in Jan. What does the government have to do with it?", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 12:31:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "Ford has said in the past that it wasn't looking to bring its lovable little Ka subcompact to the United States, but increased demand for fuel efficient transportation has the Dearborn-based automaker rethinking its plans. The Ka is very popular in Europe, where fuel-sipping cars have long been accepted, but the tiny Ka has never been sold here in the States. The new Ka, which was shown off in Paris last week, carries Ford's European Kinetic Design theme that is shared with the larger Fiesta and Focus, but in a much smaller package. Ford CEO Alan Mulally told a local Detroit radio station this morning that many within Ford Motor Company would like to bring the Ka across the pond, and that executives are reassessing the situation. The new Ka hits European showrooms in early 2009, and even if the Ka does come here, we likely won't see the sub-compact until 2011 at the earliest. With fuel prices in constant flux, we're guessing MPG-conscious customers will make the Ka a safe bet for Ford in the U.S. \"http://www.autoblog.com/2008/10/06/mulally-ford-considering-ka-for-us-market/\"", 
        "intTime": 20090530, 
        "postID": 19, 
        "quote": "", 
        "reply": "Ford has said in the past that it wasn't looking to bring its lovable little Ka subcompact to the United States, but increased demand for fuel efficient transportation has the Dearborn-based automaker rethinking its plans. The Ka is very popular in Europe, where fuel-sipping cars have long been accepted, but the tiny Ka has never been sold here in the States. The new Ka, which was shown off in Paris last week, carries Ford's European Kinetic Design theme that is shared with the larger Fiesta and Focus, but in a much smaller package. Ford CEO Alan Mulally told a local Detroit radio station this morning that many within Ford Motor Company would like to bring the Ka across the pond, and that executives are reassessing the situation. The new Ka hits European showrooms in early 2009, and even if the Ka does come here, we likely won't see the sub-compact until 2011 at the earliest. With fuel prices in constant flux, we're guessing MPG-conscious customers will make the Ka a safe bet for Ford in the U.S. \"http://www.autoblog.com/2008/10/06/mulally-ford-considering-ka-for-us-market/\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 12:51:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible.", 
        "intTime": 20090531, 
        "postID": 20, 
        "quote": "", 
        "reply": "Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 05:07:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible. The Fiesta hasn't been sold in the US since the early to mid-90's - and even then I don't think it was the same Fiesta that Britain had. I think the one for the US was made in Korea or Mexico and was a horrid car in every way imaginable - and this is coming from someone who likes smaller cars.", 
        "intTime": 20090531, 
        "postID": 21, 
        "quote": "Originally posted by Bladensburg: Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible.", 
        "reply": " The Fiesta hasn't been sold in the US since the early to mid-90's - and even then I don't think it was the same Fiesta that Britain had. I think the one for the US was made in Korea or Mexico and was a horrid car in every way imaginable - and this is coming from someone who likes smaller cars.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 05:59:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Obama's new GM (Gov't Motors) convinces me to buy a Ford. I've been a Ford guy a long time - - The truck (Turbo Diesel) is got 170000 on it and still going GREAT! Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 22, 
        "quote": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "reply": " I've been a Ford guy a long time - - The truck (Turbo Diesel) is got 170000 on it and still going GREAT! Wandering and Wondering", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 07:08:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Actually, the Fiesta is making a comeback in the U.S. in 2010: The Big Three Detroit carmakers are struggling right now, but their plans for the future are still bright, or at least optimistic - perhaps all the more so thanks to the focusing nature of the current crisis. As part of the Blue Oval's future, the Fiesta small car will finally be making its way back to the U.S. as a 2011 model in early 2010, as confirmed by Ford today. A few weeks ago Ford revealed the key features of the U.S.-spec car via the Fiesta's minisite. A 1.6L four-cylinder with twin independent variable valve timing will offer enough pep for the American palate, while likely planting the Fiesta firmly among the most efficient non-hybrids on offer. The Ford/Microsoft Sync system will be an available option, offering a high degree of technological connectivity - an option which has proven popular on the Focus sedan so far. Other basics include keyless entry, available 16-inch aluminum wheels, a choice of three different cloth or leather upholstery options, plus a 4\" multifunction display, seven airbags and a standard electronic stability control system. Though the car will be among the smallest four-doors on the market when it comes to America, Ford appears to be positioning the car for a rather premium space in the segment. That will give Ford a chance to clear a better profit margin in the notoriously tough small-car arena, but it could also limit volume somewhat. On the other hand, Honda's Fit, which is positioned similarly within the market, is selling strongly even now. Once the current Ford truck line at the Cautitlan, Mexico plant is done retooling for the new minicar, production will start for an expected early 2010 North American debut. The Fiesta is already on sale in Europe, and will be headed to China in 2009. \"http://www.motorauthority.com/2011-ford-fiesta-us-features-revealed.html\" Apparently they're planning a little 'tour' of the new Fiesta: DEARBORN, Mich., May 11, 2009 – Ford is launching an aggressive eight-month consumer grassroots test drive tour as part of the Fiesta Movement, the company’s social media campaign to build awareness for the new Fiesta launching next year. “The Fiesta Movement is about bringing a fuel-efficient, fun new car to the people to experience,” Connie Fontaine, Ford Brand Content and Alliance Manager. “Our goal is to conduct 100,000 consumer test drives by the time that we reveal the North American production version later this year.” From May to December, five regional test drive teams representing the Fiesta Movement will travel across the country to engage consumers with the opportunity to test drive a European-specification Fiesta. The teams will visit at least 100 cities over the eight months, with a goal of 100,000 test drives overall. Stops will be in small towns and big cities, as well as at major and regional events and festivals. \"http://media.ford.com/article_display.cfm?article_id=30344\"", 
        "intTime": 20090531, 
        "postID": 23, 
        "quote": "", 
        "reply": "Actually, the Fiesta is making a comeback in the U.S. in 2010: The Big Three Detroit carmakers are struggling right now, but their plans for the future are still bright, or at least optimistic - perhaps all the more so thanks to the focusing nature of the current crisis. As part of the Blue Oval's future, the Fiesta small car will finally be making its way back to the U.S. as a 2011 model in early 2010, as confirmed by Ford today. A few weeks ago Ford revealed the key features of the U.S.-spec car via the Fiesta's minisite. A 1.6L four-cylinder with twin independent variable valve timing will offer enough pep for the American palate, while likely planting the Fiesta firmly among the most efficient non-hybrids on offer. The Ford/Microsoft Sync system will be an available option, offering a high degree of technological connectivity - an option which has proven popular on the Focus sedan so far. Other basics include keyless entry, available 16-inch aluminum wheels, a choice of three different cloth or leather upholstery options, plus a 4\" multifunction display, seven airbags and a standard electronic stability control system. Though the car will be among the smallest four-doors on the market when it comes to America, Ford appears to be positioning the car for a rather premium space in the segment. That will give Ford a chance to clear a better profit margin in the notoriously tough small-car arena, but it could also limit volume somewhat. On the other hand, Honda's Fit, which is positioned similarly within the market, is selling strongly even now. Once the current Ford truck line at the Cautitlan, Mexico plant is done retooling for the new minicar, production will start for an expected early 2010 North American debut. The Fiesta is already on sale in Europe, and will be headed to China in 2009. \"http://www.motorauthority.com/2011-ford-fiesta-us-features-revealed.html\" Apparently they're planning a little 'tour' of the new Fiesta: DEARBORN, Mich., May 11, 2009 – Ford is launching an aggressive eight-month consumer grassroots test drive tour as part of the Fiesta Movement, the company’s social media campaign to build awareness for the new Fiesta launching next year. “The Fiesta Movement is about bringing a fuel-efficient, fun new car to the people to experience,” Connie Fontaine, Ford Brand Content and Alliance Manager. “Our goal is to conduct 100,000 consumer test drives by the time that we reveal the North American production version later this year.” From May to December, five regional test drive teams representing the Fiesta Movement will travel across the country to engage consumers with the opportunity to test drive a European-specification Fiesta. The teams will visit at least 100 cities over the eight months, with a goal of 100,000 test drives overall. Stops will be in small towns and big cities, as well as at major and regional events and festivals. \"http://media.ford.com/article_display.cfm?article_id=30344\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 08:56:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: \"Marxist POTUS\" Another potentially good topic destroyed by another inflammatory comment in a seemingly never ending series of president bashing topics... Can anyone see the connection to this kind of crap and why the current participation rate is at an all-time low? Does anyone even care anymore?", 
        "intTime": 20090531, 
        "postID": 24, 
        "quote": "\"Marxist POTUS\"", 
        "reply": " Another potentially good topic destroyed by another inflammatory comment in a seemingly never ending series of president bashing topics... Can anyone see the connection to this kind of crap and why the current participation rate is at an all-time low? Does anyone even care anymore?", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 09:12:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "skinman13"
    }, 
    {
        "content": "That's the one I meant Esample, it's not bad as I recall (++http://www.youtube.com/watch?v=2BMmKKCef18 from about 4 minutes and don't miss part two ++http://www.youtube.com/watch?v=vauvmLPOoHo) Phoenix - the late80's/early 90's version wasn't all that good (I learnt to drive in one) but like most Fords (Euro ones anyway) it got a lot better in the late nineties after the Focus was launched. Must say though that the saloon (sedan) version looks a bit odd though. Why would you want something with such a restricted boot?", 
        "intTime": 20090531, 
        "postID": 25, 
        "quote": "", 
        "reply": "That's the one I meant Esample, it's not bad as I recall (++http://www.youtube.com/watch?v=2BMmKKCef18 from about 4 minutes and don't miss part two ++http://www.youtube.com/watch?v=vauvmLPOoHo) Phoenix - the late80's/early 90's version wasn't all that good (I learnt to drive in one) but like most Fords (Euro ones anyway) it got a lot better in the late nineties after the Focus was launched. Must say though that the saloon (sedan) version looks a bit odd though. Why would you want something with such a restricted boot?", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 09:21:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either. My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac. My truck is a Ford F150 Lariat package - hauls hay, horse trailer, feed, groceries and Grandbabies in comfort - took 4 of us to Galveston for a cruise in it and it was a very comfy trip. Good gas milage for a truck. It was a good investment and runs like a top! My everyday car is a 2000 E320 Benz (The good Lord willing I will never need to buy another car) and my toy is a 75 Corvette Stingray", 
        "intTime": 20090531, 
        "postID": 26, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either. My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac.", 
        "reply": " My truck is a Ford F150 Lariat package - hauls hay, horse trailer, feed, groceries and Grandbabies in comfort - took 4 of us to Galveston for a cruise in it and it was a very comfy trip. Good gas milage for a truck. It was a good investment and runs like a top! My everyday car is a 2000 E320 Benz (The good Lord willing I will never need to buy another car) and my toy is a 75 Corvette Stingray", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 11:52:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Ford is still building some decent stuff. I just got the latest issue of Car and Driver. In a three car comparison test Mustang beat out the Camaro and Challanger. Suddenly it's 1970! (again)", 
        "intTime": 20090531, 
        "postID": 27, 
        "quote": "", 
        "reply": "Ford is still building some decent stuff. I just got the latest issue of Car and Driver. In a three car comparison test Mustang beat out the Camaro and Challanger. Suddenly it's 1970! (again)", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 12:45:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\" Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 28, 
        "quote": "", 
        "reply": "I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\" Wandering and Wondering", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 16:10:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\" Same place they hand out the government cheese. I'm hoping to get a Chevy like this.", 
        "intTime": 20090531, 
        "postID": 29, 
        "quote": "Originally posted by greywolfghost: I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\"", 
        "reply": " Same place they hand out the government cheese. I'm hoping to get a Chevy like this.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 16:23:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Where'd it go!?!?!? Somebody stole it already!!! Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 30, 
        "quote": "", 
        "reply": "Where'd it go!?!?!? Somebody stole it already!!! Wandering and Wondering", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 16:27:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "intTime": 20090530, 
        "postID": 31, 
        "quote": "", 
        "reply": "So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 02:03:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "RW60"
    }, 
    {
        "content": "I'll wait until I see Nancy Pelosi buy one and drive it before I even think of buying one. Until then I'll keep my little Toyota Tundra pick-up truck.", 
        "intTime": 20090530, 
        "postID": 32, 
        "quote": "", 
        "reply": "I'll wait until I see Nancy Pelosi buy one and drive it before I even think of buying one. Until then I'll keep my little Toyota Tundra pick-up truck.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 03:09:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "I went with a Ford Ranger 4X4. Damn satisfied with it too. They also didn't take any stimulus money and then file for bankruptcy. All that money, down the drain....for what????", 
        "intTime": 20090530, 
        "postID": 33, 
        "quote": "", 
        "reply": "I went with a Ford Ranger 4X4. Damn satisfied with it too. They also didn't take any stimulus money and then file for bankruptcy. All that money, down the drain....for what????", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 05:15:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets!", 
        "intTime": 20090530, 
        "postID": 34, 
        "quote": "", 
        "reply": "RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets!", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:00:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. GM has made massive strides in quality and competitive pricing. The ONLY area in which Ford has a lead on GM is in terms of hybrid vehicles - but then again, GM strategy is that hybrids are only a temporary step towards a vehicle that doesn't use gas at all, so they've been focusing their efforts on the \"no gas\" goal instead. I've had my Chevy for 4 years/45K miles and the ONLY problem I've had with it is recently - and that's only because the \"Roadside Assistance\" guy accidentally shorted my battery to my engine block while installing a new battery. The rest has been routine maintenance - oil changes, wiper blade replacement, and new tires not so long ago. All that and I still get over 35mpg. Not bad for a car I picked up for $10,500 brand new. I can't speak for the rest of Ford, but I know that in terms of the electronics that we supply them, Ford's quality standards are quite lacking when compared even to Chrysler and GM - let alone Honda or Toyota. We've had instances where we've had suspect bad parts on the engine controller and when we set them aside for additional testing that Ford's response has been \"Send them anyway - if they're bad we'll replace them at factory or dealer level!\"", 
        "intTime": 20090530, 
        "postID": 35, 
        "quote": "", 
        "reply": "Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. GM has made massive strides in quality and competitive pricing. The ONLY area in which Ford has a lead on GM is in terms of hybrid vehicles - but then again, GM strategy is that hybrids are only a temporary step towards a vehicle that doesn't use gas at all, so they've been focusing their efforts on the \"no gas\" goal instead. I've had my Chevy for 4 years/45K miles and the ONLY problem I've had with it is recently - and that's only because the \"Roadside Assistance\" guy accidentally shorted my battery to my engine block while installing a new battery. The rest has been routine maintenance - oil changes, wiper blade replacement, and new tires not so long ago. All that and I still get over 35mpg. Not bad for a car I picked up for $10,500 brand new. I can't speak for the rest of Ford, but I know that in terms of the electronics that we supply them, Ford's quality standards are quite lacking when compared even to Chrysler and GM - let alone Honda or Toyota. We've had instances where we've had suspect bad parts on the engine controller and when we set them aside for additional testing that Ford's response has been \"Send them anyway - if they're bad we'll replace them at factory or dealer level!\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:12:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else. Don't think you're going to get anything like that - I'm fairly sure that's a rebadged Opel and GM are desperately trying to sell Opel to Fiat or a Russian/Canadian partnership. Why I don't know, seeing as how Vauxhall/Opel is one of the most profitable (or at least least loss-making) GM companies and has been consistently producing good cars for several years now. By the way. I think the \"Focus is a clown car\" comment is very telling as to just how massively wonky the US car industry is and just how brainwashed you lot have been into accepting quantity of metal over quality of design.", 
        "intTime": 20090530, 
        "postID": 36, 
        "quote": "Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "reply": " Don't think you're going to get anything like that - I'm fairly sure that's a rebadged Opel and GM are desperately trying to sell Opel to Fiat or a Russian/Canadian partnership. Why I don't know, seeing as how Vauxhall/Opel is one of the most profitable (or at least least loss-making) GM companies and has been consistently producing good cars for several years now. By the way. I think the \"Focus is a clown car\" comment is very telling as to just how massively wonky the US car industry is and just how brainwashed you lot have been into accepting quantity of metal over quality of design.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:20:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "You can be the first one on your block to own a clown car if you buy now!! Watch out for those kids on skateboards and big wheels! \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 37, 
        "quote": "", 
        "reply": "You can be the first one on your block to own a clown car if you buy now!! Watch out for those kids on skateboards and big wheels! \"The World's Finest\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:44:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets! I really like that Ford F-150 Platnum edition but they want $48,000 for it. With that kind of money I could buy a new 2009 Tocoma and a 2009 Toyota Corolla. I drive a Tundra 4x4 Limited by the way. Only cost me $37,000.", 
        "intTime": 20090530, 
        "postID": 38, 
        "quote": "Originally posted by cosmicfish: RW60 - it's amazing, when I bought my current car (a Ford Focus ZX3) my wife's immediate comment was \"it looks like a clown car!\" I too am wishing Ford good luck - I used to work for a Ford dealer and both my cars are Fords. Of the big 3 Ford was advancing a little faster than the rest on fuel economy, producing the Escape Hybrid and actively considering efficiency and economy issues in future designs. So it sounds like Obama is trying to get Chrysler and GM to be a little more Ford-like. Duster - Tacoma is a very nice pick-up. What kept you from buying an American brand this time, and why do you expect anything to change your mind next time? If anything you highlight the issue - American car companies are having increasng trouble competing even in traditional American markets!", 
        "reply": " I really like that Ford F-150 Platnum edition but they want $48,000 for it. With that kind of money I could buy a new 2009 Tocoma and a 2009 Toyota Corolla. I drive a Tundra 4x4 Limited by the way. Only cost me $37,000.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 06:51:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else. Wow, Obama and Al Gore designed and built that car in a couple of months? Oh wait, it seems the car made it's debut at an auto show in 2007, and the decision to sell it in the U.S. was made this past January: Chevrolet has confirmed today at the Detroit Auto Show that it will bring a new compact car called the Spark to the United States by 2011. This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here. The Spark was originally shown as the Chevrolet Beat, one of three compact car concepts at the 2007 New York Auto Show but the only one thus far to be given a green light for production. Originally intended for emerging markets and Europe, where small cars are the norm, GM changed its mind about bringing the Spark to the U.S. due to the last fuel price crisis. \"http://www.motorauthority.com/chevy-beat-concept-headed-to-detroit-us-production-possible.html\"", 
        "intTime": 20090530, 
        "postID": 39, 
        "quote": "Originally posted by RW60: So here's what I was thought it would come to, the Marxist POTUS and his green (but red on the inside) buddies want to force us all into these dangerous and stupid looking eggs on wheels. 15 years ago I said I'd never buy another Ford SUV but I just changed my mind--Ford looks like the only surviving American car company. I wish Ford lots of success in keeping Obama's power-hungry hands off of their business, and I won't be surprized if they begin to prosper against clown cars like this new Chevy: Do Obama, GM, and Al Gore really think average American drivers are going to want this stupid piece of junk? Typical arrogant liberal Dems think they know what's best for everybody else.", 
        "reply": " Wow, Obama and Al Gore designed and built that car in a couple of months? Oh wait, it seems the car made it's debut at an auto show in 2007, and the decision to sell it in the U.S. was made this past January: Chevrolet has confirmed today at the Detroit Auto Show that it will bring a new compact car called the Spark to the United States by 2011. This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here. The Spark was originally shown as the Chevrolet Beat, one of three compact car concepts at the 2007 New York Auto Show but the only one thus far to be given a green light for production. Originally intended for emerging markets and Europe, where small cars are the norm, GM changed its mind about bringing the Spark to the U.S. due to the last fuel price crisis. \"http://www.motorauthority.com/chevy-beat-concept-headed-to-detroit-us-production-possible.html\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 07:23:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here. You can buy it at the auto sales right next to DisneyWorld in Orlando.", 
        "intTime": 20090530, 
        "postID": 40, 
        "quote": "Originally posted by esample1: This will be joined by a seven-seater compact MPV dubbed the Orlando at the same time in an effort to boost Chevrolet’s fuel efficiency ratings. More information on the Orlando can be found here.", 
        "reply": " You can buy it at the auto sales right next to DisneyWorld in Orlando.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 08:05:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I currently own a 2000 Silverado 4x4 regular cab SWB. It is still trouble free other than routine maint. When it comes time to replace it, I dang sure will be eying Ford even though I have always preferred GM trucks.", 
        "intTime": 20090530, 
        "postID": 41, 
        "quote": "", 
        "reply": "I currently own a 2000 Silverado 4x4 regular cab SWB. It is still trouble free other than routine maint. When it comes time to replace it, I dang sure will be eying Ford even though I have always preferred GM trucks.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 42, 
        "quote": "", 
        "reply": "Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 08:32:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either.", 
        "intTime": 20090530, 
        "postID": 43, 
        "quote": "Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring.", 
        "reply": " One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 09:11:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "I drive a 05 Ford 150 PU...my wife a 02 VW Passat and we like them...the VW is a little less dependable but drives well. The VW is sorta like my Harley Road King...touchy but a good ride. Off all the vehicles the Harley gets the best milage about 50 mpg...", 
        "intTime": 20090530, 
        "postID": 44, 
        "quote": "", 
        "reply": "I drive a 05 Ford 150 PU...my wife a 02 VW Passat and we like them...the VW is a little less dependable but drives well. The VW is sorta like my Harley Road King...touchy but a good ride. Off all the vehicles the Harley gets the best milage about 50 mpg...", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 09:16:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either. My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 45, 
        "quote": "Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either.", 
        "reply": " My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 09:31:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "L0A1"
    }, 
    {
        "content": "Say no more. My wife wanted one of those Chrysler box cars that looks like it came out of the early 50's. (Can't think of the name of it) So I had to lie to her and tell her that the Camry was cheaper and would save me hundreds on our car insurance. She never checked up on anything.", 
        "intTime": 20090530, 
        "postID": 46, 
        "quote": "", 
        "reply": "Say no more. My wife wanted one of those Chrysler box cars that looks like it came out of the early 50's. (Can't think of the name of it) So I had to lie to her and tell her that the Camry was cheaper and would save me hundreds on our car insurance. She never checked up on anything.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 11:53:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM.", 
        "intTime": 20090530, 
        "postID": 47, 
        "quote": "Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think.", 
        "reply": " They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 12:20:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "RW60"
    }, 
    {
        "content": "quote: Originally posted by RW60: quote: Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM. That car was designed over 2 years ago, and the decision to sell it in the U.S. was considered last July. The final decision was made in Jan. What does the government have to do with it?", 
        "intTime": 20090530, 
        "postID": 48, 
        "quote": "Originally posted by RW60: quote: Originally posted by PhoenixDark: Ugly as you may think that car is RW60, my bet is that they'll sell a heck of a lot more of them than you think. They'll sell based on fuel economy sure, but people have plenty of other reasons why they buy certain cars, such as safety and looks. The arrogance of our government leaders is in their thinking that they will dictate to the automakers what the people want, not the other way around. The people will decide just like they do when they choose UPS or FedEx over the USPS. This doesn't look good for GM.", 
        "reply": " That car was designed over 2 years ago, and the decision to sell it in the U.S. was considered last July. The final decision was made in Jan. What does the government have to do with it?", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 12:31:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "Ford has said in the past that it wasn't looking to bring its lovable little Ka subcompact to the United States, but increased demand for fuel efficient transportation has the Dearborn-based automaker rethinking its plans. The Ka is very popular in Europe, where fuel-sipping cars have long been accepted, but the tiny Ka has never been sold here in the States. The new Ka, which was shown off in Paris last week, carries Ford's European Kinetic Design theme that is shared with the larger Fiesta and Focus, but in a much smaller package. Ford CEO Alan Mulally told a local Detroit radio station this morning that many within Ford Motor Company would like to bring the Ka across the pond, and that executives are reassessing the situation. The new Ka hits European showrooms in early 2009, and even if the Ka does come here, we likely won't see the sub-compact until 2011 at the earliest. With fuel prices in constant flux, we're guessing MPG-conscious customers will make the Ka a safe bet for Ford in the U.S. \"http://www.autoblog.com/2008/10/06/mulally-ford-considering-ka-for-us-market/\"", 
        "intTime": 20090530, 
        "postID": 49, 
        "quote": "", 
        "reply": "Ford has said in the past that it wasn't looking to bring its lovable little Ka subcompact to the United States, but increased demand for fuel efficient transportation has the Dearborn-based automaker rethinking its plans. The Ka is very popular in Europe, where fuel-sipping cars have long been accepted, but the tiny Ka has never been sold here in the States. The new Ka, which was shown off in Paris last week, carries Ford's European Kinetic Design theme that is shared with the larger Fiesta and Focus, but in a much smaller package. Ford CEO Alan Mulally told a local Detroit radio station this morning that many within Ford Motor Company would like to bring the Ka across the pond, and that executives are reassessing the situation. The new Ka hits European showrooms in early 2009, and even if the Ka does come here, we likely won't see the sub-compact until 2011 at the earliest. With fuel prices in constant flux, we're guessing MPG-conscious customers will make the Ka a safe bet for Ford in the U.S. \"http://www.autoblog.com/2008/10/06/mulally-ford-considering-ka-for-us-market/\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-30 12:51:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible.", 
        "intTime": 20090531, 
        "postID": 50, 
        "quote": "", 
        "reply": "Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 05:07:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible. The Fiesta hasn't been sold in the US since the early to mid-90's - and even then I don't think it was the same Fiesta that Britain had. I think the one for the US was made in Korea or Mexico and was a horrid car in every way imaginable - and this is coming from someone who likes smaller cars.", 
        "intTime": 20090531, 
        "postID": 51, 
        "quote": "Originally posted by Bladensburg: Do Ford sell the Fiesta (sort of between the Ka and the Focus) in the US Esample? If not I'd have thought it would make more sense to start with that before going as small as possible.", 
        "reply": " The Fiesta hasn't been sold in the US since the early to mid-90's - and even then I don't think it was the same Fiesta that Britain had. I think the one for the US was made in Korea or Mexico and was a horrid car in every way imaginable - and this is coming from someone who likes smaller cars.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 05:59:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Obama's new GM (Gov't Motors) convinces me to buy a Ford. I've been a Ford guy a long time - - The truck (Turbo Diesel) is got 170000 on it and still going GREAT! Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 52, 
        "quote": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "reply": " I've been a Ford guy a long time - - The truck (Turbo Diesel) is got 170000 on it and still going GREAT! Wandering and Wondering", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 07:08:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Actually, the Fiesta is making a comeback in the U.S. in 2010: The Big Three Detroit carmakers are struggling right now, but their plans for the future are still bright, or at least optimistic - perhaps all the more so thanks to the focusing nature of the current crisis. As part of the Blue Oval's future, the Fiesta small car will finally be making its way back to the U.S. as a 2011 model in early 2010, as confirmed by Ford today. A few weeks ago Ford revealed the key features of the U.S.-spec car via the Fiesta's minisite. A 1.6L four-cylinder with twin independent variable valve timing will offer enough pep for the American palate, while likely planting the Fiesta firmly among the most efficient non-hybrids on offer. The Ford/Microsoft Sync system will be an available option, offering a high degree of technological connectivity - an option which has proven popular on the Focus sedan so far. Other basics include keyless entry, available 16-inch aluminum wheels, a choice of three different cloth or leather upholstery options, plus a 4\" multifunction display, seven airbags and a standard electronic stability control system. Though the car will be among the smallest four-doors on the market when it comes to America, Ford appears to be positioning the car for a rather premium space in the segment. That will give Ford a chance to clear a better profit margin in the notoriously tough small-car arena, but it could also limit volume somewhat. On the other hand, Honda's Fit, which is positioned similarly within the market, is selling strongly even now. Once the current Ford truck line at the Cautitlan, Mexico plant is done retooling for the new minicar, production will start for an expected early 2010 North American debut. The Fiesta is already on sale in Europe, and will be headed to China in 2009. \"http://www.motorauthority.com/2011-ford-fiesta-us-features-revealed.html\" Apparently they're planning a little 'tour' of the new Fiesta: DEARBORN, Mich., May 11, 2009 – Ford is launching an aggressive eight-month consumer grassroots test drive tour as part of the Fiesta Movement, the company’s social media campaign to build awareness for the new Fiesta launching next year. “The Fiesta Movement is about bringing a fuel-efficient, fun new car to the people to experience,” Connie Fontaine, Ford Brand Content and Alliance Manager. “Our goal is to conduct 100,000 consumer test drives by the time that we reveal the North American production version later this year.” From May to December, five regional test drive teams representing the Fiesta Movement will travel across the country to engage consumers with the opportunity to test drive a European-specification Fiesta. The teams will visit at least 100 cities over the eight months, with a goal of 100,000 test drives overall. Stops will be in small towns and big cities, as well as at major and regional events and festivals. \"http://media.ford.com/article_display.cfm?article_id=30344\"", 
        "intTime": 20090531, 
        "postID": 53, 
        "quote": "", 
        "reply": "Actually, the Fiesta is making a comeback in the U.S. in 2010: The Big Three Detroit carmakers are struggling right now, but their plans for the future are still bright, or at least optimistic - perhaps all the more so thanks to the focusing nature of the current crisis. As part of the Blue Oval's future, the Fiesta small car will finally be making its way back to the U.S. as a 2011 model in early 2010, as confirmed by Ford today. A few weeks ago Ford revealed the key features of the U.S.-spec car via the Fiesta's minisite. A 1.6L four-cylinder with twin independent variable valve timing will offer enough pep for the American palate, while likely planting the Fiesta firmly among the most efficient non-hybrids on offer. The Ford/Microsoft Sync system will be an available option, offering a high degree of technological connectivity - an option which has proven popular on the Focus sedan so far. Other basics include keyless entry, available 16-inch aluminum wheels, a choice of three different cloth or leather upholstery options, plus a 4\" multifunction display, seven airbags and a standard electronic stability control system. Though the car will be among the smallest four-doors on the market when it comes to America, Ford appears to be positioning the car for a rather premium space in the segment. That will give Ford a chance to clear a better profit margin in the notoriously tough small-car arena, but it could also limit volume somewhat. On the other hand, Honda's Fit, which is positioned similarly within the market, is selling strongly even now. Once the current Ford truck line at the Cautitlan, Mexico plant is done retooling for the new minicar, production will start for an expected early 2010 North American debut. The Fiesta is already on sale in Europe, and will be headed to China in 2009. \"http://www.motorauthority.com/2011-ford-fiesta-us-features-revealed.html\" Apparently they're planning a little 'tour' of the new Fiesta: DEARBORN, Mich., May 11, 2009 – Ford is launching an aggressive eight-month consumer grassroots test drive tour as part of the Fiesta Movement, the company’s social media campaign to build awareness for the new Fiesta launching next year. “The Fiesta Movement is about bringing a fuel-efficient, fun new car to the people to experience,” Connie Fontaine, Ford Brand Content and Alliance Manager. “Our goal is to conduct 100,000 consumer test drives by the time that we reveal the North American production version later this year.” From May to December, five regional test drive teams representing the Fiesta Movement will travel across the country to engage consumers with the opportunity to test drive a European-specification Fiesta. The teams will visit at least 100 cities over the eight months, with a goal of 100,000 test drives overall. Stops will be in small towns and big cities, as well as at major and regional events and festivals. \"http://media.ford.com/article_display.cfm?article_id=30344\"", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 08:56:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: \"Marxist POTUS\" Another potentially good topic destroyed by another inflammatory comment in a seemingly never ending series of president bashing topics... Can anyone see the connection to this kind of crap and why the current participation rate is at an all-time low? Does anyone even care anymore?", 
        "intTime": 20090531, 
        "postID": 54, 
        "quote": "\"Marxist POTUS\"", 
        "reply": " Another potentially good topic destroyed by another inflammatory comment in a seemingly never ending series of president bashing topics... Can anyone see the connection to this kind of crap and why the current participation rate is at an all-time low? Does anyone even care anymore?", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 09:12:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "skinman13"
    }, 
    {
        "content": "That's the one I meant Esample, it's not bad as I recall (++http://www.youtube.com/watch?v=2BMmKKCef18 from about 4 minutes and don't miss part two ++http://www.youtube.com/watch?v=vauvmLPOoHo) Phoenix - the late80's/early 90's version wasn't all that good (I learnt to drive in one) but like most Fords (Euro ones anyway) it got a lot better in the late nineties after the Focus was launched. Must say though that the saloon (sedan) version looks a bit odd though. Why would you want something with such a restricted boot?", 
        "intTime": 20090531, 
        "postID": 55, 
        "quote": "", 
        "reply": "That's the one I meant Esample, it's not bad as I recall (++http://www.youtube.com/watch?v=2BMmKKCef18 from about 4 minutes and don't miss part two ++http://www.youtube.com/watch?v=vauvmLPOoHo) Phoenix - the late80's/early 90's version wasn't all that good (I learnt to drive in one) but like most Fords (Euro ones anyway) it got a lot better in the late nineties after the Focus was launched. Must say though that the saloon (sedan) version looks a bit odd though. Why would you want something with such a restricted boot?", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 09:21:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either. My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac. My truck is a Ford F150 Lariat package - hauls hay, horse trailer, feed, groceries and Grandbabies in comfort - took 4 of us to Galveston for a cruise in it and it was a very comfy trip. Good gas milage for a truck. It was a good investment and runs like a top! My everyday car is a 2000 E320 Benz (The good Lord willing I will never need to buy another car) and my toy is a 75 Corvette Stingray", 
        "intTime": 20090531, 
        "postID": 56, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Duster6: quote: Originally posted by L0A1: Let's see. I had a Pontiac Firebird that blew 2 engines due to faulty equiptment. Chrystler Sebring Platinum (great car aside from the problems I have had with it's computer), if it wasn't under warrentee still I would be screwed. MPG sucks as well. 21 mpg My best vehicle by far, as far as value, has been my Ford Explorer. I get the same MPG with my explorer, as I do with the smaller Sebring. One can tell much about a person just by the vehicle one drives. Since you own/owned a Sebring I can tell you have no taste in vehicles and you do not read consumer reports either. My ole lady wanted the Sebring, I am by far a Ford person myself, since my dissapointment with the Pontiac.", 
        "reply": " My truck is a Ford F150 Lariat package - hauls hay, horse trailer, feed, groceries and Grandbabies in comfort - took 4 of us to Galveston for a cruise in it and it was a very comfy trip. Good gas milage for a truck. It was a good investment and runs like a top! My everyday car is a 2000 E320 Benz (The good Lord willing I will never need to buy another car) and my toy is a 75 Corvette Stingray", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 11:52:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Ford is still building some decent stuff. I just got the latest issue of Car and Driver. In a three car comparison test Mustang beat out the Camaro and Challanger. Suddenly it's 1970! (again)", 
        "intTime": 20090531, 
        "postID": 57, 
        "quote": "", 
        "reply": "Ford is still building some decent stuff. I just got the latest issue of Car and Driver. In a three car comparison test Mustang beat out the Camaro and Challanger. Suddenly it's 1970! (again)", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 12:45:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\" Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 58, 
        "quote": "", 
        "reply": "I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\" Wandering and Wondering", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 16:10:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\" Same place they hand out the government cheese. I'm hoping to get a Chevy like this.", 
        "intTime": 20090531, 
        "postID": 59, 
        "quote": "Originally posted by greywolfghost: I and you and every tax payer now owns a piece of GM, so where is all our free Chevys?!?!?!? \"See the USA in your Chevrolette - America is asking you to call....!\"", 
        "reply": " Same place they hand out the government cheese. I'm hoping to get a Chevy like this.", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 16:23:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Where'd it go!?!?!? Somebody stole it already!!! Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 60, 
        "quote": "", 
        "reply": "Where'd it go!?!?!? Somebody stole it already!!! Wandering and Wondering", 
        "threadID": "409192893_6010056422001", 
        "time": "2009-05-31 16:27:00", 
        "title": "Obama's new GM (Gov't Motors) convinces me to buy a Ford.", 
        "userID": "greywolfghost"
    }
]