[
    {
        "content": "We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 06:04:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 11:10:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself. I think it was Alabama SAMSON, Ala. (AP) — The gunman who killed 10 people and committed suicide in a rampage across the Alabama countryside had struggled to keep a job and left behind a list of employers and co-workers he believed had wronged him, authorities said Wednesday. The list, found in his home, included a metals plant that had forced Michael McLendon to resign years ago. Also on the list was a sausage factory where he suddenly quit last week and a poultry plant that suspended his mother, District Attorney Gary McAliley said. McAliley was quoted as telling The Dothan Eagle that McLendon also listed people at the sausage factory who had complained about McLendon for such things as not wearing earplugs and slicing the meat too thin. \"We found a list of people he worked with, people who had done him wrong,\" the district attorney said outside the charred house where the rampage began. But investigators offered no immediate explanation for why he targeted relatives and other people who weren't on the list as he fired more than 200 rounds in a roughly 20-mile trail of carnage across two counties near the Florida state line Tuesday.", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "Originally posted by Thud357L: In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "reply": " I think it was Alabama SAMSON, Ala. (AP) — The gunman who killed 10 people and committed suicide in a rampage across the Alabama countryside had struggled to keep a job and left behind a list of employers and co-workers he believed had wronged him, authorities said Wednesday. The list, found in his home, included a metals plant that had forced Michael McLendon to resign years ago. Also on the list was a sausage factory where he suddenly quit last week and a poultry plant that suspended his mother, District Attorney Gary McAliley said. McAliley was quoted as telling The Dothan Eagle that McLendon also listed people at the sausage factory who had complained about McLendon for such things as not wearing earplugs and slicing the meat too thin. \"We found a list of people he worked with, people who had done him wrong,\" the district attorney said outside the charred house where the rampage began. But investigators offered no immediate explanation for why he targeted relatives and other people who weren't on the list as he fired more than 200 rounds in a roughly 20-mile trail of carnage across two counties near the Florida state line Tuesday.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 17:47:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "", 
        "reply": "Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 20:52:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Fankhouser"
    }, 
    {
        "content": "quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup", 
        "intTime": 20090312, 
        "postID": 5, 
        "quote": "In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " yup", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:12:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:17:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. Your kidding right? If the killer was as you say dingy, they wouldn't care if the other person was armed, it's a silly statement. They never want to get hurt. They want to make their escape. And you of course know this...how??? Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Repeat question above? Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights.Ahh yes right-wing strawman, so what laws are you complaning about? I haven't seen any laws to take away you guns. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. And if they had been armed why they would of rose up and fought back the German army and all would have been right with the world... what a crock. Most of the people in Germany voted Hitler into office and were happy with the way it started out but like with Pres. Bush 2, when the war went bad, they suddenly started to change their tune.", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. Your kidding right? If the killer was as you say dingy, they wouldn't care if the other person was armed, it's a silly statement. They never want to get hurt. They want to make their escape. And you of course know this...how??? Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Repeat question above? Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights.Ahh yes right-wing strawman, so what laws are you complaning about? I haven't seen any laws to take away you guns. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " And if they had been armed why they would of rose up and fought back the German army and all would have been right with the world... what a crock. Most of the people in Germany voted Hitler into office and were happy with the way it started out but like with Pres. Bush 2, when the war went bad, they suddenly started to change their tune.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:27:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Tangler"
    }, 
    {
        "content": "well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "", 
        "reply": "well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:33:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one... Should that be a national plan implemented by the FBI and BATF? Or the NRA even though their records are less secure and their implementation can be spotty.", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "reply": " Should that be a national plan implemented by the FBI and BATF? Or the NRA even though their records are less secure and their implementation can be spotty.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:45:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "local police can do that...", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "", 
        "reply": "local police can do that...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:55:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "", 
        "reply": "Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:07:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... Ahh yes... the famed, revisionist, reading of the Wild Wild West, where men were men, women were fair and sheep err cows were nervous. if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... Ok, lets add a few arm people like you say and we have 2 or 3 people turning the area into a shooting gallery and before you go with the \"I am a crack shot\" so are police and people still die by wild shots the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one... And when the kid(s) decide that they are angry with someone and they need to get back at them... Ooohh, just like any big city \"down in the getto\"... humm, I'm sensing a song title here... Or uptown the need for people to get back at people they perceive to have done me wrong to wit, the nice person down in SAMSON, Ala. Mr. McLendon armed himself with four guns for his rampage and was a weapons aficionado. He then went out in a town that most of the men interviewed here said they too possessed multiple firearms, and several said they recognized the caliber of those fired in the massacre, and kill 9 people. Gee how many shot back? Surly at lest one person ccould have gotten a gun and killed this mad dog? And there is the problem with the story that if only someone was armed this could have been prvented...", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... Ahh yes... the famed, revisionist, reading of the Wild Wild West, where men were men, women were fair and sheep err cows were nervous. if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... Ok, lets add a few arm people like you say and we have 2 or 3 people turning the area into a shooting gallery and before you go with the \"I am a crack shot\" so are police and people still die by wild shots the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "reply": " And when the kid(s) decide that they are angry with someone and they need to get back at them... Ooohh, just like any big city \"down in the getto\"... humm, I'm sensing a song title here... Or uptown the need for people to get back at people they perceive to have done me wrong to wit, the nice person down in SAMSON, Ala. Mr. McLendon armed himself with four guns for his rampage and was a weapons aficionado. He then went out in a town that most of the men interviewed here said they too possessed multiple firearms, and several said they recognized the caliber of those fired in the massacre, and kill 9 people. Gee how many shot back? Surly at lest one person ccould have gotten a gun and killed this mad dog? And there is the problem with the story that if only someone was armed this could have been prvented...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:08:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "reply": " Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:43:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "reply": " I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 23:29:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "intTime": 20090313, 
        "postID": 15, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:06:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Excuse me. Peculiar. How's that? Usually, when people use the word funny in the context that I did, they mean odd, *****, weird, bizarre, extraordinary, etc.", 
        "intTime": 20090313, 
        "postID": 16, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Excuse me. Peculiar. How's that? Usually, when people use the word funny in the context that I did, they mean odd, *****, weird, bizarre, extraordinary, etc.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:23:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "intTime": 20090313, 
        "postID": 17, 
        "quote": "Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "reply": " That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:37:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "thats why people needs to be properly trained... hell with obama and his civilian army we better start get cracking... but i guess it is much better to let unarmed civilians get shot up by some wacko who mommy didnt pay him enough attention as a kid then... see thats called a victim mentality ... ive been a victim before and ill be damn if i am ever one again.... i guess its better to teach kids to thrown books at them and pretend they will repel a gunman but an armed teacher would just create more problems... yea and thats working real well huh.....", 
        "intTime": 20090313, 
        "postID": 18, 
        "quote": "", 
        "reply": "thats why people needs to be properly trained... hell with obama and his civilian army we better start get cracking... but i guess it is much better to let unarmed civilians get shot up by some wacko who mommy didnt pay him enough attention as a kid then... see thats called a victim mentality ... ive been a victim before and ill be damn if i am ever one again.... i guess its better to teach kids to thrown books at them and pretend they will repel a gunman but an armed teacher would just create more problems... yea and thats working real well huh.....", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 01:09:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area. Usually, the guns involved in crimes are stolen and then sold on the black market. So, the gun was initially bought legally. It then changed hands due to the perpetration of a crime (theft). No matter what you do, you will not be able to stop the ability of criminals to get guns in a black market. Even if you made guns completely illegal for any American to own, the criminal element would still be able to get them just as easily as they do now. Most guns used in crimes are acquired by illegal means and that is something that gun control laws cannot control. The best example that the outlawing of guns having no affect on whether they will be attainable by the bad elements of society is the war on drugs. Drugs have been completely illegal for decades (sale, possession and use). But, their sale, possession and use has increased over that same period.", 
        "intTime": 20090313, 
        "postID": 19, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "reply": " Usually, the guns involved in crimes are stolen and then sold on the black market. So, the gun was initially bought legally. It then changed hands due to the perpetration of a crime (theft). No matter what you do, you will not be able to stop the ability of criminals to get guns in a black market. Even if you made guns completely illegal for any American to own, the criminal element would still be able to get them just as easily as they do now. Most guns used in crimes are acquired by illegal means and that is something that gun control laws cannot control. The best example that the outlawing of guns having no affect on whether they will be attainable by the bad elements of society is the war on drugs. Drugs have been completely illegal for decades (sale, possession and use). But, their sale, possession and use has increased over that same period.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 02:10:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly. What a stupid argument. All those items listed, except firearms, are designed,produced and intended for perfectly peaceful and innocent purposes. Guns are designed to kill. Society can go about its daily business without firearms. One question - why did'nt he choose to kill by using a vehicle, or whatever.....?", 
        "intTime": 20090313, 
        "postID": 20, 
        "quote": "Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "reply": " What a stupid argument. All those items listed, except firearms, are designed,produced and intended for perfectly peaceful and innocent purposes. Guns are designed to kill. Society can go about its daily business without firearms. One question - why did'nt he choose to kill by using a vehicle, or whatever.....?", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:26:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "Children all over the world are turning to this type of violence. It is because of their parents not being able to spend time with them because of their work habits and because of our spending habits within the walls of our leaders. Also it is the age of tattoos, drugs, porn, and Muslims wanting to take over the world. Two people are to blame for this world problem. Bush and God.", 
        "intTime": 20090313, 
        "postID": 21, 
        "quote": "", 
        "reply": "Children all over the world are turning to this type of violence. It is because of their parents not being able to spend time with them because of their work habits and because of our spending habits within the walls of our leaders. Also it is the age of tattoos, drugs, porn, and Muslims wanting to take over the world. Two people are to blame for this world problem. Bush and God.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:29:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by samh32: We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said. I find the title of this thread and your cavalier attitude on this subject offensive.", 
        "intTime": 20090313, 
        "postID": 22, 
        "quote": "Originally posted by samh32: We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "reply": " I find the title of this thread and your cavalier attitude on this subject offensive.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:35:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "intTime": 20090313, 
        "postID": 23, 
        "quote": "Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:57:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "ErichG2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "intTime": 20090313, 
        "postID": 24, 
        "quote": "Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup", 
        "reply": " BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 07:50:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Hultberg"
    }, 
    {
        "content": "If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "intTime": 20090313, 
        "postID": 25, 
        "quote": "", 
        "reply": "If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 08:46:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Hultberg: quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military. it sure was germans... german jews gypsies ect... funny now you claiming they wernt germans... germany had millions of jews as citizens back then...", 
        "intTime": 20090313, 
        "postID": 26, 
        "quote": "Originally posted by Hultberg: quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "reply": " it sure was germans... german jews gypsies ect... funny now you claiming they wernt germans... germany had millions of jews as citizens back then...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:36:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by EAG154: If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS! i use to date this german chick her dad was apart of the french resistance back then... after the war he and his wife moved to the states...", 
        "intTime": 20090313, 
        "postID": 27, 
        "quote": "Originally posted by EAG154: If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "reply": " i use to date this german chick her dad was apart of the french resistance back then... after the war he and his wife moved to the states...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:44:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen. well said...", 
        "intTime": 20090313, 
        "postID": 28, 
        "quote": "Originally posted by ErichG2: quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "reply": " well said...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:45:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area. You are correct that things are different out in the boonies as opposed to the cities. However, the gov't won't stop at the city lines. The goverment hasn't secretly tried to take anyone's guns, they've openly tried to do it with lawsuits against the manufacturers, and banning ammo. Most of the cop killer bullets were common hunting bullets. You are also right about guns on the strret. They will always be there. Only the law abiding will be disarmed, as Australia is finding out now. Only their law makers are still baffled at the rising murder rate. You can't fix stupid!", 
        "intTime": 20090313, 
        "postID": 29, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "reply": " You are correct that things are different out in the boonies as opposed to the cities. However, the gov't won't stop at the city lines. The goverment hasn't secretly tried to take anyone's guns, they've openly tried to do it with lawsuits against the manufacturers, and banning ammo. Most of the cop killer bullets were common hunting bullets. You are also right about guns on the strret. They will always be there. Only the law abiding will be disarmed, as Australia is finding out now. Only their law makers are still baffled at the rising murder rate. You can't fix stupid!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 10:00:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! He didn't mean \"funny ha ha\". Maybe you should address the point.", 
        "intTime": 20090313, 
        "postID": 30, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " He didn't mean \"funny ha ha\". Maybe you should address the point.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 13:14:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "foxred03"
    }, 
    {
        "content": "We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "", 
        "reply": "We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 06:04:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "", 
        "reply": "In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 11:10:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself. I think it was Alabama SAMSON, Ala. (AP) — The gunman who killed 10 people and committed suicide in a rampage across the Alabama countryside had struggled to keep a job and left behind a list of employers and co-workers he believed had wronged him, authorities said Wednesday. The list, found in his home, included a metals plant that had forced Michael McLendon to resign years ago. Also on the list was a sausage factory where he suddenly quit last week and a poultry plant that suspended his mother, District Attorney Gary McAliley said. McAliley was quoted as telling The Dothan Eagle that McLendon also listed people at the sausage factory who had complained about McLendon for such things as not wearing earplugs and slicing the meat too thin. \"We found a list of people he worked with, people who had done him wrong,\" the district attorney said outside the charred house where the rampage began. But investigators offered no immediate explanation for why he targeted relatives and other people who weren't on the list as he fired more than 200 rounds in a roughly 20-mile trail of carnage across two counties near the Florida state line Tuesday.", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "Originally posted by Thud357L: In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "reply": " I think it was Alabama SAMSON, Ala. (AP) — The gunman who killed 10 people and committed suicide in a rampage across the Alabama countryside had struggled to keep a job and left behind a list of employers and co-workers he believed had wronged him, authorities said Wednesday. The list, found in his home, included a metals plant that had forced Michael McLendon to resign years ago. Also on the list was a sausage factory where he suddenly quit last week and a poultry plant that suspended his mother, District Attorney Gary McAliley said. McAliley was quoted as telling The Dothan Eagle that McLendon also listed people at the sausage factory who had complained about McLendon for such things as not wearing earplugs and slicing the meat too thin. \"We found a list of people he worked with, people who had done him wrong,\" the district attorney said outside the charred house where the rampage began. But investigators offered no immediate explanation for why he targeted relatives and other people who weren't on the list as he fired more than 200 rounds in a roughly 20-mile trail of carnage across two counties near the Florida state line Tuesday.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 17:47:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "intTime": 20090312, 
        "postID": 34, 
        "quote": "", 
        "reply": "Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 20:52:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Fankhouser"
    }, 
    {
        "content": "quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup", 
        "intTime": 20090312, 
        "postID": 35, 
        "quote": "In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " yup", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:12:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "intTime": 20090312, 
        "postID": 36, 
        "quote": "Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:17:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. Your kidding right? If the killer was as you say dingy, they wouldn't care if the other person was armed, it's a silly statement. They never want to get hurt. They want to make their escape. And you of course know this...how??? Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Repeat question above? Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights.Ahh yes right-wing strawman, so what laws are you complaning about? I haven't seen any laws to take away you guns. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. And if they had been armed why they would of rose up and fought back the German army and all would have been right with the world... what a crock. Most of the people in Germany voted Hitler into office and were happy with the way it started out but like with Pres. Bush 2, when the war went bad, they suddenly started to change their tune.", 
        "intTime": 20090312, 
        "postID": 37, 
        "quote": "Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. Your kidding right? If the killer was as you say dingy, they wouldn't care if the other person was armed, it's a silly statement. They never want to get hurt. They want to make their escape. And you of course know this...how??? Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Repeat question above? Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights.Ahh yes right-wing strawman, so what laws are you complaning about? I haven't seen any laws to take away you guns. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " And if they had been armed why they would of rose up and fought back the German army and all would have been right with the world... what a crock. Most of the people in Germany voted Hitler into office and were happy with the way it started out but like with Pres. Bush 2, when the war went bad, they suddenly started to change their tune.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:27:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Tangler"
    }, 
    {
        "content": "well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "intTime": 20090312, 
        "postID": 38, 
        "quote": "", 
        "reply": "well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:33:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one... Should that be a national plan implemented by the FBI and BATF? Or the NRA even though their records are less secure and their implementation can be spotty.", 
        "intTime": 20090312, 
        "postID": 39, 
        "quote": "Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "reply": " Should that be a national plan implemented by the FBI and BATF? Or the NRA even though their records are less secure and their implementation can be spotty.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:45:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "local police can do that...", 
        "intTime": 20090312, 
        "postID": 40, 
        "quote": "", 
        "reply": "local police can do that...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:55:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "intTime": 20090312, 
        "postID": 41, 
        "quote": "", 
        "reply": "Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:07:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... Ahh yes... the famed, revisionist, reading of the Wild Wild West, where men were men, women were fair and sheep err cows were nervous. if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... Ok, lets add a few arm people like you say and we have 2 or 3 people turning the area into a shooting gallery and before you go with the \"I am a crack shot\" so are police and people still die by wild shots the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one... And when the kid(s) decide that they are angry with someone and they need to get back at them... Ooohh, just like any big city \"down in the getto\"... humm, I'm sensing a song title here... Or uptown the need for people to get back at people they perceive to have done me wrong to wit, the nice person down in SAMSON, Ala. Mr. McLendon armed himself with four guns for his rampage and was a weapons aficionado. He then went out in a town that most of the men interviewed here said they too possessed multiple firearms, and several said they recognized the caliber of those fired in the massacre, and kill 9 people. Gee how many shot back? Surly at lest one person ccould have gotten a gun and killed this mad dog? And there is the problem with the story that if only someone was armed this could have been prvented...", 
        "intTime": 20090312, 
        "postID": 42, 
        "quote": "Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... Ahh yes... the famed, revisionist, reading of the Wild Wild West, where men were men, women were fair and sheep err cows were nervous. if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... Ok, lets add a few arm people like you say and we have 2 or 3 people turning the area into a shooting gallery and before you go with the \"I am a crack shot\" so are police and people still die by wild shots the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "reply": " And when the kid(s) decide that they are angry with someone and they need to get back at them... Ooohh, just like any big city \"down in the getto\"... humm, I'm sensing a song title here... Or uptown the need for people to get back at people they perceive to have done me wrong to wit, the nice person down in SAMSON, Ala. Mr. McLendon armed himself with four guns for his rampage and was a weapons aficionado. He then went out in a town that most of the men interviewed here said they too possessed multiple firearms, and several said they recognized the caliber of those fired in the massacre, and kill 9 people. Gee how many shot back? Surly at lest one person ccould have gotten a gun and killed this mad dog? And there is the problem with the story that if only someone was armed this could have been prvented...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:08:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "intTime": 20090312, 
        "postID": 43, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "reply": " Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:43:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "intTime": 20090312, 
        "postID": 44, 
        "quote": "Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "reply": " I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 23:29:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "intTime": 20090313, 
        "postID": 45, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:06:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Excuse me. Peculiar. How's that? Usually, when people use the word funny in the context that I did, they mean odd, *****, weird, bizarre, extraordinary, etc.", 
        "intTime": 20090313, 
        "postID": 46, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Excuse me. Peculiar. How's that? Usually, when people use the word funny in the context that I did, they mean odd, *****, weird, bizarre, extraordinary, etc.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:23:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "intTime": 20090313, 
        "postID": 47, 
        "quote": "Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "reply": " That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:37:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "thats why people needs to be properly trained... hell with obama and his civilian army we better start get cracking... but i guess it is much better to let unarmed civilians get shot up by some wacko who mommy didnt pay him enough attention as a kid then... see thats called a victim mentality ... ive been a victim before and ill be damn if i am ever one again.... i guess its better to teach kids to thrown books at them and pretend they will repel a gunman but an armed teacher would just create more problems... yea and thats working real well huh.....", 
        "intTime": 20090313, 
        "postID": 48, 
        "quote": "", 
        "reply": "thats why people needs to be properly trained... hell with obama and his civilian army we better start get cracking... but i guess it is much better to let unarmed civilians get shot up by some wacko who mommy didnt pay him enough attention as a kid then... see thats called a victim mentality ... ive been a victim before and ill be damn if i am ever one again.... i guess its better to teach kids to thrown books at them and pretend they will repel a gunman but an armed teacher would just create more problems... yea and thats working real well huh.....", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 01:09:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area. Usually, the guns involved in crimes are stolen and then sold on the black market. So, the gun was initially bought legally. It then changed hands due to the perpetration of a crime (theft). No matter what you do, you will not be able to stop the ability of criminals to get guns in a black market. Even if you made guns completely illegal for any American to own, the criminal element would still be able to get them just as easily as they do now. Most guns used in crimes are acquired by illegal means and that is something that gun control laws cannot control. The best example that the outlawing of guns having no affect on whether they will be attainable by the bad elements of society is the war on drugs. Drugs have been completely illegal for decades (sale, possession and use). But, their sale, possession and use has increased over that same period.", 
        "intTime": 20090313, 
        "postID": 49, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "reply": " Usually, the guns involved in crimes are stolen and then sold on the black market. So, the gun was initially bought legally. It then changed hands due to the perpetration of a crime (theft). No matter what you do, you will not be able to stop the ability of criminals to get guns in a black market. Even if you made guns completely illegal for any American to own, the criminal element would still be able to get them just as easily as they do now. Most guns used in crimes are acquired by illegal means and that is something that gun control laws cannot control. The best example that the outlawing of guns having no affect on whether they will be attainable by the bad elements of society is the war on drugs. Drugs have been completely illegal for decades (sale, possession and use). But, their sale, possession and use has increased over that same period.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 02:10:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly. What a stupid argument. All those items listed, except firearms, are designed,produced and intended for perfectly peaceful and innocent purposes. Guns are designed to kill. Society can go about its daily business without firearms. One question - why did'nt he choose to kill by using a vehicle, or whatever.....?", 
        "intTime": 20090313, 
        "postID": 50, 
        "quote": "Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "reply": " What a stupid argument. All those items listed, except firearms, are designed,produced and intended for perfectly peaceful and innocent purposes. Guns are designed to kill. Society can go about its daily business without firearms. One question - why did'nt he choose to kill by using a vehicle, or whatever.....?", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:26:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "Children all over the world are turning to this type of violence. It is because of their parents not being able to spend time with them because of their work habits and because of our spending habits within the walls of our leaders. Also it is the age of tattoos, drugs, porn, and Muslims wanting to take over the world. Two people are to blame for this world problem. Bush and God.", 
        "intTime": 20090313, 
        "postID": 51, 
        "quote": "", 
        "reply": "Children all over the world are turning to this type of violence. It is because of their parents not being able to spend time with them because of their work habits and because of our spending habits within the walls of our leaders. Also it is the age of tattoos, drugs, porn, and Muslims wanting to take over the world. Two people are to blame for this world problem. Bush and God.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:29:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by samh32: We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said. I find the title of this thread and your cavalier attitude on this subject offensive.", 
        "intTime": 20090313, 
        "postID": 52, 
        "quote": "Originally posted by samh32: We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "reply": " I find the title of this thread and your cavalier attitude on this subject offensive.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:35:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "intTime": 20090313, 
        "postID": 53, 
        "quote": "Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:57:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "ErichG2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "intTime": 20090313, 
        "postID": 54, 
        "quote": "Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup", 
        "reply": " BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 07:50:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Hultberg"
    }, 
    {
        "content": "If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "intTime": 20090313, 
        "postID": 55, 
        "quote": "", 
        "reply": "If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 08:46:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Hultberg: quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military. it sure was germans... german jews gypsies ect... funny now you claiming they wernt germans... germany had millions of jews as citizens back then...", 
        "intTime": 20090313, 
        "postID": 56, 
        "quote": "Originally posted by Hultberg: quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "reply": " it sure was germans... german jews gypsies ect... funny now you claiming they wernt germans... germany had millions of jews as citizens back then...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:36:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by EAG154: If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS! i use to date this german chick her dad was apart of the french resistance back then... after the war he and his wife moved to the states...", 
        "intTime": 20090313, 
        "postID": 57, 
        "quote": "Originally posted by EAG154: If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "reply": " i use to date this german chick her dad was apart of the french resistance back then... after the war he and his wife moved to the states...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:44:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen. well said...", 
        "intTime": 20090313, 
        "postID": 58, 
        "quote": "Originally posted by ErichG2: quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "reply": " well said...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:45:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area. You are correct that things are different out in the boonies as opposed to the cities. However, the gov't won't stop at the city lines. The goverment hasn't secretly tried to take anyone's guns, they've openly tried to do it with lawsuits against the manufacturers, and banning ammo. Most of the cop killer bullets were common hunting bullets. You are also right about guns on the strret. They will always be there. Only the law abiding will be disarmed, as Australia is finding out now. Only their law makers are still baffled at the rising murder rate. You can't fix stupid!", 
        "intTime": 20090313, 
        "postID": 59, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "reply": " You are correct that things are different out in the boonies as opposed to the cities. However, the gov't won't stop at the city lines. The goverment hasn't secretly tried to take anyone's guns, they've openly tried to do it with lawsuits against the manufacturers, and banning ammo. Most of the cop killer bullets were common hunting bullets. You are also right about guns on the strret. They will always be there. Only the law abiding will be disarmed, as Australia is finding out now. Only their law makers are still baffled at the rising murder rate. You can't fix stupid!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 10:00:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! He didn't mean \"funny ha ha\". Maybe you should address the point.", 
        "intTime": 20090313, 
        "postID": 60, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " He didn't mean \"funny ha ha\". Maybe you should address the point.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 13:14:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "foxred03"
    }, 
    {
        "content": "We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "intTime": 20090311, 
        "postID": 61, 
        "quote": "", 
        "reply": "We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 06:04:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "intTime": 20090311, 
        "postID": 62, 
        "quote": "", 
        "reply": "In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 11:10:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself. I think it was Alabama SAMSON, Ala. (AP) — The gunman who killed 10 people and committed suicide in a rampage across the Alabama countryside had struggled to keep a job and left behind a list of employers and co-workers he believed had wronged him, authorities said Wednesday. The list, found in his home, included a metals plant that had forced Michael McLendon to resign years ago. Also on the list was a sausage factory where he suddenly quit last week and a poultry plant that suspended his mother, District Attorney Gary McAliley said. McAliley was quoted as telling The Dothan Eagle that McLendon also listed people at the sausage factory who had complained about McLendon for such things as not wearing earplugs and slicing the meat too thin. \"We found a list of people he worked with, people who had done him wrong,\" the district attorney said outside the charred house where the rampage began. But investigators offered no immediate explanation for why he targeted relatives and other people who weren't on the list as he fired more than 200 rounds in a roughly 20-mile trail of carnage across two counties near the Florida state line Tuesday.", 
        "intTime": 20090311, 
        "postID": 63, 
        "quote": "Originally posted by Thud357L: In Georgia some guy took something he converted to full auto and just murdered 10 people before he shot himself.", 
        "reply": " I think it was Alabama SAMSON, Ala. (AP) — The gunman who killed 10 people and committed suicide in a rampage across the Alabama countryside had struggled to keep a job and left behind a list of employers and co-workers he believed had wronged him, authorities said Wednesday. The list, found in his home, included a metals plant that had forced Michael McLendon to resign years ago. Also on the list was a sausage factory where he suddenly quit last week and a poultry plant that suspended his mother, District Attorney Gary McAliley said. McAliley was quoted as telling The Dothan Eagle that McLendon also listed people at the sausage factory who had complained about McLendon for such things as not wearing earplugs and slicing the meat too thin. \"We found a list of people he worked with, people who had done him wrong,\" the district attorney said outside the charred house where the rampage began. But investigators offered no immediate explanation for why he targeted relatives and other people who weren't on the list as he fired more than 200 rounds in a roughly 20-mile trail of carnage across two counties near the Florida state line Tuesday.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-11 17:47:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "intTime": 20090312, 
        "postID": 64, 
        "quote": "", 
        "reply": "Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 20:52:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Fankhouser"
    }, 
    {
        "content": "quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup", 
        "intTime": 20090312, 
        "postID": 65, 
        "quote": "In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " yup", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:12:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "intTime": 20090312, 
        "postID": 66, 
        "quote": "Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:17:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. Your kidding right? If the killer was as you say dingy, they wouldn't care if the other person was armed, it's a silly statement. They never want to get hurt. They want to make their escape. And you of course know this...how??? Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Repeat question above? Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights.Ahh yes right-wing strawman, so what laws are you complaning about? I haven't seen any laws to take away you guns. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. And if they had been armed why they would of rose up and fought back the German army and all would have been right with the world... what a crock. Most of the people in Germany voted Hitler into office and were happy with the way it started out but like with Pres. Bush 2, when the war went bad, they suddenly started to change their tune.", 
        "intTime": 20090312, 
        "postID": 67, 
        "quote": "Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. Your kidding right? If the killer was as you say dingy, they wouldn't care if the other person was armed, it's a silly statement. They never want to get hurt. They want to make their escape. And you of course know this...how??? Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Repeat question above? Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights.Ahh yes right-wing strawman, so what laws are you complaning about? I haven't seen any laws to take away you guns. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed.", 
        "reply": " And if they had been armed why they would of rose up and fought back the German army and all would have been right with the world... what a crock. Most of the people in Germany voted Hitler into office and were happy with the way it started out but like with Pres. Bush 2, when the war went bad, they suddenly started to change their tune.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:27:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Tangler"
    }, 
    {
        "content": "well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "intTime": 20090312, 
        "postID": 68, 
        "quote": "", 
        "reply": "well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:33:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one... Should that be a national plan implemented by the FBI and BATF? Or the NRA even though their records are less secure and their implementation can be spotty.", 
        "intTime": 20090312, 
        "postID": 69, 
        "quote": "Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "reply": " Should that be a national plan implemented by the FBI and BATF? Or the NRA even though their records are less secure and their implementation can be spotty.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:45:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "local police can do that...", 
        "intTime": 20090312, 
        "postID": 70, 
        "quote": "", 
        "reply": "local police can do that...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 21:55:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "intTime": 20090312, 
        "postID": 71, 
        "quote": "", 
        "reply": "Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:07:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... Ahh yes... the famed, revisionist, reading of the Wild Wild West, where men were men, women were fair and sheep err cows were nervous. if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... Ok, lets add a few arm people like you say and we have 2 or 3 people turning the area into a shooting gallery and before you go with the \"I am a crack shot\" so are police and people still die by wild shots the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one... And when the kid(s) decide that they are angry with someone and they need to get back at them... Ooohh, just like any big city \"down in the getto\"... humm, I'm sensing a song title here... Or uptown the need for people to get back at people they perceive to have done me wrong to wit, the nice person down in SAMSON, Ala. Mr. McLendon armed himself with four guns for his rampage and was a weapons aficionado. He then went out in a town that most of the men interviewed here said they too possessed multiple firearms, and several said they recognized the caliber of those fired in the massacre, and kill 9 people. Gee how many shot back? Surly at lest one person ccould have gotten a gun and killed this mad dog? And there is the problem with the story that if only someone was armed this could have been prvented...", 
        "intTime": 20090312, 
        "postID": 72, 
        "quote": "Originally posted by outlaws93: well actually the old saying is an armed population is a polite one... Ahh yes... the famed, revisionist, reading of the Wild Wild West, where men were men, women were fair and sheep err cows were nervous. if othrs were allowed to be armed it is quite possible for someone to of stop this kid before he was allowed to kill so many people... Ok, lets add a few arm people like you say and we have 2 or 3 people turning the area into a shooting gallery and before you go with the \"I am a crack shot\" so are police and people still die by wild shots the thing is not just the population that needs to be armed but also trained on how to use these firearms... right now in the states they are teaching students to throw books at he shooter and how to hold a few books to stop a bullet... but instead of teaching them to throw books at a shooter they need to allow students and teachers who qualify to be armed and teach them how to property fire a firearm and the respect needed to carry one...", 
        "reply": " And when the kid(s) decide that they are angry with someone and they need to get back at them... Ooohh, just like any big city \"down in the getto\"... humm, I'm sensing a song title here... Or uptown the need for people to get back at people they perceive to have done me wrong to wit, the nice person down in SAMSON, Ala. Mr. McLendon armed himself with four guns for his rampage and was a weapons aficionado. He then went out in a town that most of the men interviewed here said they too possessed multiple firearms, and several said they recognized the caliber of those fired in the massacre, and kill 9 people. Gee how many shot back? Surly at lest one person ccould have gotten a gun and killed this mad dog? And there is the problem with the story that if only someone was armed this could have been prvented...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:08:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "intTime": 20090312, 
        "postID": 73, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA.", 
        "reply": " Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 22:43:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "intTime": 20090312, 
        "postID": 74, 
        "quote": "Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be?", 
        "reply": " I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-12 23:29:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "intTime": 20090313, 
        "postID": 75, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:06:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Excuse me. Peculiar. How's that? Usually, when people use the word funny in the context that I did, they mean odd, *****, weird, bizarre, extraordinary, etc.", 
        "intTime": 20090313, 
        "postID": 76, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Excuse me. Peculiar. How's that? Usually, when people use the word funny in the context that I did, they mean odd, *****, weird, bizarre, extraordinary, etc.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:23:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "intTime": 20090313, 
        "postID": 77, 
        "quote": "Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that.", 
        "reply": " That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 00:37:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "thats why people needs to be properly trained... hell with obama and his civilian army we better start get cracking... but i guess it is much better to let unarmed civilians get shot up by some wacko who mommy didnt pay him enough attention as a kid then... see thats called a victim mentality ... ive been a victim before and ill be damn if i am ever one again.... i guess its better to teach kids to thrown books at them and pretend they will repel a gunman but an armed teacher would just create more problems... yea and thats working real well huh.....", 
        "intTime": 20090313, 
        "postID": 78, 
        "quote": "", 
        "reply": "thats why people needs to be properly trained... hell with obama and his civilian army we better start get cracking... but i guess it is much better to let unarmed civilians get shot up by some wacko who mommy didnt pay him enough attention as a kid then... see thats called a victim mentality ... ive been a victim before and ill be damn if i am ever one again.... i guess its better to teach kids to thrown books at them and pretend they will repel a gunman but an armed teacher would just create more problems... yea and thats working real well huh.....", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 01:09:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area. Usually, the guns involved in crimes are stolen and then sold on the black market. So, the gun was initially bought legally. It then changed hands due to the perpetration of a crime (theft). No matter what you do, you will not be able to stop the ability of criminals to get guns in a black market. Even if you made guns completely illegal for any American to own, the criminal element would still be able to get them just as easily as they do now. Most guns used in crimes are acquired by illegal means and that is something that gun control laws cannot control. The best example that the outlawing of guns having no affect on whether they will be attainable by the bad elements of society is the war on drugs. Drugs have been completely illegal for decades (sale, possession and use). But, their sale, possession and use has increased over that same period.", 
        "intTime": 20090313, 
        "postID": 79, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "reply": " Usually, the guns involved in crimes are stolen and then sold on the black market. So, the gun was initially bought legally. It then changed hands due to the perpetration of a crime (theft). No matter what you do, you will not be able to stop the ability of criminals to get guns in a black market. Even if you made guns completely illegal for any American to own, the criminal element would still be able to get them just as easily as they do now. Most guns used in crimes are acquired by illegal means and that is something that gun control laws cannot control. The best example that the outlawing of guns having no affect on whether they will be attainable by the bad elements of society is the war on drugs. Drugs have been completely illegal for decades (sale, possession and use). But, their sale, possession and use has increased over that same period.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 02:10:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly. What a stupid argument. All those items listed, except firearms, are designed,produced and intended for perfectly peaceful and innocent purposes. Guns are designed to kill. Society can go about its daily business without firearms. One question - why did'nt he choose to kill by using a vehicle, or whatever.....?", 
        "intTime": 20090313, 
        "postID": 80, 
        "quote": "Would it have made you feel better if he had waited for a large crowd of kids to gather after school then ran into them with a large stolen SUV? Maybe several times. Or boarded a bus with fire bombs and burned them to death? Maybe homemade chemicals poisoning everyone in a crowded movie theatre? What would you look to ban or blame then? SUVs, gasoline, house hold chemicals, bottles, school busses? What? Guns have a very legitimate use. Blaming an inanimate object is silly.", 
        "reply": " What a stupid argument. All those items listed, except firearms, are designed,produced and intended for perfectly peaceful and innocent purposes. Guns are designed to kill. Society can go about its daily business without firearms. One question - why did'nt he choose to kill by using a vehicle, or whatever.....?", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:26:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "Children all over the world are turning to this type of violence. It is because of their parents not being able to spend time with them because of their work habits and because of our spending habits within the walls of our leaders. Also it is the age of tattoos, drugs, porn, and Muslims wanting to take over the world. Two people are to blame for this world problem. Bush and God.", 
        "intTime": 20090313, 
        "postID": 81, 
        "quote": "", 
        "reply": "Children all over the world are turning to this type of violence. It is because of their parents not being able to spend time with them because of their work habits and because of our spending habits within the walls of our leaders. Also it is the age of tattoos, drugs, porn, and Muslims wanting to take over the world. Two people are to blame for this world problem. Bush and God.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:29:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by samh32: We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said. I find the title of this thread and your cavalier attitude on this subject offensive.", 
        "intTime": 20090313, 
        "postID": 82, 
        "quote": "Originally posted by samh32: We need better gun control laws!!! WINNENDEN, Germany – State officials say police have slain a 17-year-old gunman who killed 15 people in a school shooting in southwestern Germany. Baden Wuerttemburg governor Guenther Oettinger says police shot the suspect after he fled the school. State Interior Minister Heribert Rech says three teachers were among the 15 dead. Police say at least 10 students were also killed in Wednesday's attack. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. WINNENDEN, Germany (AP) — A 17-year-old gunman dressed in black opened fire at his former high school in southwestern Germany on Wednesday, killing at least 11 people and injuring others before escaping, police said.", 
        "reply": " I find the title of this thread and your cavalier attitude on this subject offensive.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:35:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "intTime": 20090313, 
        "postID": 83, 
        "quote": "Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 04:57:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "ErichG2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "intTime": 20090313, 
        "postID": 84, 
        "quote": "Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup", 
        "reply": " BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 07:50:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "Hultberg"
    }, 
    {
        "content": "If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "intTime": 20090313, 
        "postID": 85, 
        "quote": "", 
        "reply": "If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 08:46:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Hultberg: quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military. it sure was germans... german jews gypsies ect... funny now you claiming they wernt germans... germany had millions of jews as citizens back then...", 
        "intTime": 20090313, 
        "postID": 86, 
        "quote": "Originally posted by Hultberg: quote: Originally posted by outlaws93: quote: In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. yup BS. For one Germany was already under Nazi control when the law was passed. Secondly those millions were mainly not Germans but from neighboring countries who werent effected by German Gun Control Laws as much as the guns of the German military.", 
        "reply": " it sure was germans... german jews gypsies ect... funny now you claiming they wernt germans... germany had millions of jews as citizens back then...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:36:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by EAG154: If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS! i use to date this german chick her dad was apart of the french resistance back then... after the war he and his wife moved to the states...", 
        "intTime": 20090313, 
        "postID": 87, 
        "quote": "Originally posted by EAG154: If I'm gona go down I'm gona go down shootin! If the German citizen had been armed there would have been a lot of dead NAZIS!", 
        "reply": " i use to date this german chick her dad was apart of the french resistance back then... after the war he and his wife moved to the states...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:44:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen. well said...", 
        "intTime": 20090313, 
        "postID": 88, 
        "quote": "Originally posted by ErichG2: quote: Originally posted by samh32: I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! Guilt by association. It's because guns are a novelty to those kids due to the strict laws. In households where they are taught the respect for firearms.....I don't see this happening. Further, kids need to be taught by their parents how to respect people and respect firearms if they are kept around kids. If you make guns a novelty, kids will seek them out. Kids where I live say \"yes sir\" and \"yes maam\" to their elders and open the doors for them, etc. In some parts of our country that has been lost. Doesn't exist in Germany that I have ever seen.", 
        "reply": " well said...", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 09:45:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area. You are correct that things are different out in the boonies as opposed to the cities. However, the gov't won't stop at the city lines. The goverment hasn't secretly tried to take anyone's guns, they've openly tried to do it with lawsuits against the manufacturers, and banning ammo. Most of the cop killer bullets were common hunting bullets. You are also right about guns on the strret. They will always be there. Only the law abiding will be disarmed, as Australia is finding out now. Only their law makers are still baffled at the rising murder rate. You can't fix stupid!", 
        "intTime": 20090313, 
        "postID": 89, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by herd173: quote: Originally posted by Thud357L: quote: Originally posted by Fankhouser: Let's take a look at these killers. Normal people don't do these things. Drugs legal or otherwise for instance Lithium and other psychiatric drugs prescribed by professional psychiatrists who really don't know what these drugs do to your mind. Doctors practice medicine they don't really know how the patient will react to their drugs. So in some cases the patient gets a little dingier than in the beginning and they just fly off the handle. Had the victims been armed the killers would have thought twice. They never want to get hurt. They want to make their escape. Although our police are somewhat decent they don't want to blame anything on legal drugs from a psychiatrist. Big city police chiefs and corrupt politicians always want to blame the NRA and take away the citizen's rights. In Germany Mr Hitler slaughtered millions when the citizens had no rights to be armed. WTF? You start off defending this azzhole by blaming doctors then you end up fighting for the fairytale version of the 2nd amendment and the NRA. Fairy tale of the 2nd Amendment????....The intent of the Founding Fathers is supposed to be the basis of the Constitution. In virtually every letter written by our Founders about firearms was pro gun. In fact, to be a patriotic american, they considered a firearm in the home mandatory. To protect your property, family, and community. The first thing the British did was to head for the guns and powder. The first thing every bloody dictator did was disarm the people. Our founders knew full well what happens to a disarmed people. Almost every state constitution writer had the same feelings. Most everywhere a conceal carry permit is law, crime is down. Australia spent 500 million dollars taking guns from the law abiding people. The murder rate is skyrocketing. As is almost every other type crime. It seems the criminals take particular delight in going after people they know are unarmed, and shy away from those who may have a firearm. Even criminals will tell you that. That's not what I'm talking about. Some people seem to think that gun control means that the government is secretly planning to take everybody's gun and that it's basically illegal. I have never seen a plot to disarm the people but there are too many wild guns on the street and they are too easy for lawless elements to get. The situation for someone who lives out in Wyoming or somewhere fairly remote is a lot different than for the people of a more urban area.", 
        "reply": " You are correct that things are different out in the boonies as opposed to the cities. However, the gov't won't stop at the city lines. The goverment hasn't secretly tried to take anyone's guns, they've openly tried to do it with lawsuits against the manufacturers, and banning ammo. Most of the cop killer bullets were common hunting bullets. You are also right about guns on the strret. They will always be there. Only the law abiding will be disarmed, as Australia is finding out now. Only their law makers are still baffled at the rising murder rate. You can't fix stupid!", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 10:00:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs! He didn't mean \"funny ha ha\". Maybe you should address the point.", 
        "intTime": 20090313, 
        "postID": 90, 
        "quote": "Originally posted by samh32: quote: Originally posted by 10tenths: Here is a funny thing. Germany has some of the toughest gun control laws on the planet. And yet, violent crimes with guns still happen. Why might this be? I don't think it's funny...but the last two Mass shooting sprees (in Germany) were carried out by kids who got the guns from thier parents who were part of gun clubs!", 
        "reply": " He didn't mean \"funny ha ha\". Maybe you should address the point.", 
        "threadID": "409192893_7360015712001", 
        "time": "2009-03-13 13:14:00", 
        "title": "Germany is getting as bad as the states!!", 
        "userID": "foxred03"
    }
]