[
    {
        "content": "'http://washingtontimes.com/news/2009/mar/25/viewing-unions-from-the-right-cautionary-tale-of-c/' Mitt Romney quote: In 2006, my last year as governor of Massachusetts, I vetoed a card-check bill that allowed public workers to organize if a majority signed union authorization cards as opposed to casting a traditional secret ballot. The veto was a gain for the rights of employees and employers to a fair election, but the victory was short-lived. After I left office, organized labor had another run at replacing the secret ballot with a card check. With the support of Democrats in the legislature, that same bill I had vetoed was passed again in 2007 - and my Democratic successor signed it into law. What happened next is a cautionary tale for Congress as it moves toward a vote on national card-check legislation. With this powerful new tool, for the first time ever in Massachusetts, a charter school was unionized. One reason so many parents want their children in charter schools is precisely because they operate free of union contracts, so that when administrators want to try something new, they can implement it quickly. For this, charter schools are fiercely resented by teachers unions as a competitor to failing public schools. Charter schools use a merit system, rewarding teachers according to results in the classroom. They don’t have complicated work rules that smother creativity, nor are they burdened with termination rules that make it almost impossible to dismiss an incompetent teacher. The union drive started last year when the American Federation of Teachers met with a small group of teachers from the Conservatory Lab Charter School in Boston. Throughout the summer, they worked behind the scenes to sign up a majority of the 20 teachers at the school. Administrators learned of the successful organizing effort only after the decision to unionize had been made. For parents who may have liked the idea of a union-free school, there was no chance to be heard. Not surprisingly, the chairman of the school’s trustees is worried that a collective bargaining contract will be loaded with so many workplace restrictions that it will make it harder for the school to fulfill its mission to experiment with new ideas. Conservatives like me are opposed to card check, but not to unions. At their best, labor unions have always fought for the rights of workers, and generations of Americans have been better off for it. But the card-check proposal is not an example of unions at their best - it is a case of union organizers rewriting the rules at the expense of working people. Its advocates claim that card check is a step forward for labor, as if workers should thank them for making unions less democratic. But anyone who would deny a worker's right to vote on unionization by secret ballot is not advancing the cause of labor. They are just expanding the power of labor bosses. No one should be forced to publicly declare their intention before their employers and co-workers. Leaders in the Democratic Party are eager to pay back the union bosses for their campaign support, even if it means selling out the American worker. Responsible members of Congress need to make it clear that Washington will not act to virtually impose unions on businesses. It is undemocratic, and it would devastate business formation and employment, worsening the present economic crisis. This message has been edited. Last edited by: GunnyRet03, Wed 25 March 2009 12:41 PM", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "In 2006, my last year as governor of Massachusetts, I vetoed a card-check bill that allowed public workers to organize if a majority signed union authorization cards as opposed to casting a traditional secret ballot. The veto was a gain for the rights of employees and employers to a fair election, but the victory was short-lived. After I left office, organized labor had another run at replacing the secret ballot with a card check. With the support of Democrats in the legislature, that same bill I had vetoed was passed again in 2007 - and my Democratic successor signed it into law. What happened next is a cautionary tale for Congress as it moves toward a vote on national card-check legislation. With this powerful new tool, for the first time ever in Massachusetts, a charter school was unionized. One reason so many parents want their children in charter schools is precisely because they operate free of union contracts, so that when administrators want to try something new, they can implement it quickly. For this, charter schools are fiercely resented by teachers unions as a competitor to failing public schools. Charter schools use a merit system, rewarding teachers according to results in the classroom. They don’t have complicated work rules that smother creativity, nor are they burdened with termination rules that make it almost impossible to dismiss an incompetent teacher. The union drive started last year when the American Federation of Teachers met with a small group of teachers from the Conservatory Lab Charter School in Boston. Throughout the summer, they worked behind the scenes to sign up a majority of the 20 teachers at the school. Administrators learned of the successful organizing effort only after the decision to unionize had been made. For parents who may have liked the idea of a union-free school, there was no chance to be heard. Not surprisingly, the chairman of the school’s trustees is worried that a collective bargaining contract will be loaded with so many workplace restrictions that it will make it harder for the school to fulfill its mission to experiment with new ideas. Conservatives like me are opposed to card check, but not to unions. At their best, labor unions have always fought for the rights of workers, and generations of Americans have been better off for it. But the card-check proposal is not an example of unions at their best - it is a case of union organizers rewriting the rules at the expense of working people. Its advocates claim that card check is a step forward for labor, as if workers should thank them for making unions less democratic. But anyone who would deny a worker's right to vote on unionization by secret ballot is not advancing the cause of labor. They are just expanding the power of labor bosses. No one should be forced to publicly declare their intention before their employers and co-workers. Leaders in the Democratic Party are eager to pay back the union bosses for their campaign support, even if it means selling out the American worker. Responsible members of Congress need to make it clear that Washington will not act to virtually impose unions on businesses. It is undemocratic, and it would devastate business formation and employment, worsening the present economic crisis.", 
        "reply": "'http://washingtontimes.com/news/2009/mar/25/viewing-unions-from-the-right-cautionary-tale-of-c/' Mitt Romney  This message has been edited. Last edited by: GunnyRet03, Wed 25 March 2009 12:41 PM", 
        "threadID": "409192893_9870078812001", 
        "time": "2009-03-25 10:56:00", 
        "title": "Cautionary Tale of Card Check", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "More.... California's Hefty Union Dues 'http://www.ibdeditorials.com/IBDArticles.aspx?id=322783093626350' By INVESTOR'S BUSINESS DAILY | Posted Tuesday, March 24, 2009 4:20 PM PT Organized Labor: The state that led the way in giving labor push-button power to organize against private-sector taxpayers now stands — if you can call it standing — as a cautionary tale. <edit> Jobs are fleeing the Golden State, where unemployment has spiked well above 10%. Taxes are soaring, and a new budget shortfall of $8 billion, following the $42 billion gap that was patched up earlier this year, could hike them even more. But California is still not a bad place to be — that is, as long as you have a secure job (which most are) on the public payroll. According to the latest salary survey by the American Federation of Teachers, California teachers are the highest paid in the nation. California also has America's highest-paid prison guards. A state agency's study last year found that the maximum pay of California's guards was 40% higher than that of the highest-paid guards in 10 other states and the federal government. Meanwhile, California's public schools have middling results at best. Its prison system is chronically overcrowded, with a hospital system so inadequate that a federal judge has ruled it in violation of constitutional rights. Private-sector workers and business owners in California get the worst of all deals. They pay some of the highest taxes in the country and get no more than mediocre public services. It's not just the unions that have pulled the state into the ditch. Voters share the blame for ill-advised decisions at the ballot box, such as approving too much debt and imposing budget rules that keep tax revenues from going where they are needed most. But public-union muscle has undeniably led the way in tilting the balance of power toward a self-serving, unaccountable governing class. California was a pioneer in push-button public-sector unionization — something like what Big Labor now wants to do in the private sector nationwide. A series of laws passed from the late 1960s to the mid-1970s, with the most sweeping under Gov. Jerry Brown, gave unions collective-bargaining power in local government, schools and the state bureaucracy. Early on, the state granted recognition to unions on a card-check basis, without a requirement for secret-ballot elections. Not surprisingly, California's public-sector work force is now much more unionized than the nation's as a whole. A 2008 UCLA study found that 57% of government workers in the state were union members, compared with 37% for the U.S. And many other public workers who are not union members are represented by unions — and forced to pay at least partial dues — through so-called \"agency shop\" rules. The rise of public-sector unions in California has had an impact beyond just one state. If nothing else, it has added to the ranks of government unions in general and encouraged similar organizing in other union-friendly states. In doing so, it has helped alter the character and ideology of organized labor in general. The labor movement of old was dominated by private-sector unions that, out of necessity, shared some common interests with management. They knew that if they got too greedy, they would put their employers out of business and destroy their members' jobs. (Knowing the risk was not always enough to keep the worst from happening, as in steel and autos.) Public-sector unions are less afraid of killing the goose with the golden eggs because the goose is government and it really does look immortal. And though public union members are taxpayers like everyone else, they can always figure that their own raises or pension boosts will be worth more than the higher taxes they personally have to pay. With nearly half the nation's union members now on the public payroll, this more radical approach is bound to color attitudes at bargaining tables all over. <edit Lookout!>", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "", 
        "reply": "More.... California's Hefty Union Dues 'http://www.ibdeditorials.com/IBDArticles.aspx?id=322783093626350' By INVESTOR'S BUSINESS DAILY | Posted Tuesday, March 24, 2009 4:20 PM PT Organized Labor: The state that led the way in giving labor push-button power to organize against private-sector taxpayers now stands — if you can call it standing — as a cautionary tale. <edit> Jobs are fleeing the Golden State, where unemployment has spiked well above 10%. Taxes are soaring, and a new budget shortfall of $8 billion, following the $42 billion gap that was patched up earlier this year, could hike them even more. But California is still not a bad place to be — that is, as long as you have a secure job (which most are) on the public payroll. According to the latest salary survey by the American Federation of Teachers, California teachers are the highest paid in the nation. California also has America's highest-paid prison guards. A state agency's study last year found that the maximum pay of California's guards was 40% higher than that of the highest-paid guards in 10 other states and the federal government. Meanwhile, California's public schools have middling results at best. Its prison system is chronically overcrowded, with a hospital system so inadequate that a federal judge has ruled it in violation of constitutional rights. Private-sector workers and business owners in California get the worst of all deals. They pay some of the highest taxes in the country and get no more than mediocre public services. It's not just the unions that have pulled the state into the ditch. Voters share the blame for ill-advised decisions at the ballot box, such as approving too much debt and imposing budget rules that keep tax revenues from going where they are needed most. But public-union muscle has undeniably led the way in tilting the balance of power toward a self-serving, unaccountable governing class. California was a pioneer in push-button public-sector unionization — something like what Big Labor now wants to do in the private sector nationwide. A series of laws passed from the late 1960s to the mid-1970s, with the most sweeping under Gov. Jerry Brown, gave unions collective-bargaining power in local government, schools and the state bureaucracy. Early on, the state granted recognition to unions on a card-check basis, without a requirement for secret-ballot elections. Not surprisingly, California's public-sector work force is now much more unionized than the nation's as a whole. A 2008 UCLA study found that 57% of government workers in the state were union members, compared with 37% for the U.S. And many other public workers who are not union members are represented by unions — and forced to pay at least partial dues — through so-called \"agency shop\" rules. The rise of public-sector unions in California has had an impact beyond just one state. If nothing else, it has added to the ranks of government unions in general and encouraged similar organizing in other union-friendly states. In doing so, it has helped alter the character and ideology of organized labor in general. The labor movement of old was dominated by private-sector unions that, out of necessity, shared some common interests with management. They knew that if they got too greedy, they would put their employers out of business and destroy their members' jobs. (Knowing the risk was not always enough to keep the worst from happening, as in steel and autos.) Public-sector unions are less afraid of killing the goose with the golden eggs because the goose is government and it really does look immortal. And though public union members are taxpayers like everyone else, they can always figure that their own raises or pension boosts will be worth more than the higher taxes they personally have to pay. With nearly half the nation's union members now on the public payroll, this more radical approach is bound to color attitudes at bargaining tables all over. <edit Lookout!>", 
        "threadID": "409192893_9870078812001", 
        "time": "2009-03-26 06:00:00", 
        "title": "Cautionary Tale of Card Check", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "IMO ... If your salary is courtesy of the American taxpayer, you should NOT be allowed to unionize.", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "", 
        "reply": "IMO ... If your salary is courtesy of the American taxpayer, you should NOT be allowed to unionize.", 
        "threadID": "409192893_9870078812001", 
        "time": "2009-03-26 06:57:00", 
        "title": "Cautionary Tale of Card Check", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: IMO ... If your salary is courtesy of the American taxpayer, you should NOT be allowed to unionize. I agree... These azzholes cant be fired.", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "Originally posted by 1WW: IMO ... If your salary is courtesy of the American taxpayer, you should NOT be allowed to unionize.", 
        "reply": " I agree... These azzholes cant be fired.", 
        "threadID": "409192893_9870078812001", 
        "time": "2009-03-26 07:29:00", 
        "title": "Cautionary Tale of Card Check", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The charter school issue in this state is amazing... Across the board in every way that can be measured, Charter schools are KILLING regular public schools. Its not even close. And yet, does the state have the honesty to take a step back and try to figure out why? Nope, at every turn the charters are attacked and demonized and money is poured into the blackhole that is the public school system.", 
        "intTime": 20090326, 
        "postID": 5, 
        "quote": "", 
        "reply": "The charter school issue in this state is amazing... Across the board in every way that can be measured, Charter schools are KILLING regular public schools. Its not even close. And yet, does the state have the honesty to take a step back and try to figure out why? Nope, at every turn the charters are attacked and demonized and money is poured into the blackhole that is the public school system.", 
        "threadID": "409192893_9870078812001", 
        "time": "2009-03-26 07:59:00", 
        "title": "Cautionary Tale of Card Check", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: The charter school issue in this state is amazing... Across the board in every way that can be measured, Charter schools are KILLING regular public schools. Its not even close. And yet, does the state have the honesty to take a step back and try to figure out why? Nope, at every turn the charters are attacked and demonized and money is poured into the blackhole that is the public school system. Bottomline: Unions are afraid of competition.", 
        "intTime": 20090326, 
        "postID": 6, 
        "quote": "Originally posted by threerings: The charter school issue in this state is amazing... Across the board in every way that can be measured, Charter schools are KILLING regular public schools. Its not even close. And yet, does the state have the honesty to take a step back and try to figure out why? Nope, at every turn the charters are attacked and demonized and money is poured into the blackhole that is the public school system.", 
        "reply": " Bottomline: Unions are afraid of competition.", 
        "threadID": "409192893_9870078812001", 
        "time": "2009-03-26 08:17:00", 
        "title": "Cautionary Tale of Card Check", 
        "userID": "GunnyRet03"
    }
]