[
    {
        "content": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "", 
        "reply": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:46:00", 
        "title": "How About a Little Respect?", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 3, 
        "quote": "Originally posted by IHAWKER:", 
        "reply": " Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:51:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "intTime": 20090317, 
        "postID": 4, 
        "quote": "", 
        "reply": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 15:55:00", 
        "title": "How About a Little Respect?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "intTime": 20090317, 
        "postID": 5, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "intTime": 20090317, 
        "postID": 6, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "intTime": 20090317, 
        "postID": 7, 
        "quote": "", 
        "reply": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "intTime": 20090317, 
        "postID": 8, 
        "quote": "", 
        "reply": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:05:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "intTime": 20090317, 
        "postID": 9, 
        "quote": "", 
        "reply": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:29:00", 
        "title": "How About a Little Respect?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "intTime": 20090317, 
        "postID": 10, 
        "quote": "", 
        "reply": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:47:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures' Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "intTime": 20090317, 
        "postID": 11, 
        "quote": "Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "reply": " Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:56:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "intTime": 20090317, 
        "postID": 12, 
        "quote": "", 
        "reply": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:15:00", 
        "title": "How About a Little Respect?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals. COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "intTime": 20090317, 
        "postID": 13, 
        "quote": "Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "reply": " COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:31:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 14, 
        "quote": "", 
        "reply": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost. Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 15, 
        "quote": "Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost.", 
        "reply": " Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:48:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 16, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:59:00", 
        "title": "How About a Little Respect?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "intTime": 20090317, 
        "postID": 17, 
        "quote": "", 
        "reply": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "Knele"
    }, 
    {
        "content": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 18, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:19:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 19, 
        "quote": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding", 
        "reply": " Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:22:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\" Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 20, 
        "quote": "Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "reply": " Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:38:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft. What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090317, 
        "postID": 21, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": " What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "A leader has to earn respect, not demand it.", 
        "intTime": 20090317, 
        "postID": 22, 
        "quote": "", 
        "reply": "A leader has to earn respect, not demand it.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:50:00", 
        "title": "How About a Little Respect?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "intTime": 20090317, 
        "postID": 23, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military?", 
        "reply": " Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 21:20:00", 
        "title": "How About a Little Respect?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different. WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "intTime": 20090317, 
        "postID": 24, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "reply": " WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 23:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 25, 
        "quote": "", 
        "reply": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "", 
        "intTime": 20090317, 
        "postID": 26, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:46:00", 
        "title": "How About a Little Respect?", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 27, 
        "quote": "Originally posted by IHAWKER:", 
        "reply": " Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:51:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "intTime": 20090317, 
        "postID": 28, 
        "quote": "", 
        "reply": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 15:55:00", 
        "title": "How About a Little Respect?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "intTime": 20090317, 
        "postID": 29, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "intTime": 20090317, 
        "postID": 30, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "intTime": 20090317, 
        "postID": 31, 
        "quote": "", 
        "reply": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "intTime": 20090317, 
        "postID": 32, 
        "quote": "", 
        "reply": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:05:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "intTime": 20090317, 
        "postID": 33, 
        "quote": "", 
        "reply": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:29:00", 
        "title": "How About a Little Respect?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "intTime": 20090317, 
        "postID": 34, 
        "quote": "", 
        "reply": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:47:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures' Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "intTime": 20090317, 
        "postID": 35, 
        "quote": "Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "reply": " Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:56:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "intTime": 20090317, 
        "postID": 36, 
        "quote": "", 
        "reply": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:15:00", 
        "title": "How About a Little Respect?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals. COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "intTime": 20090317, 
        "postID": 37, 
        "quote": "Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "reply": " COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:31:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 38, 
        "quote": "", 
        "reply": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost. Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 39, 
        "quote": "Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost.", 
        "reply": " Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:48:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 40, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:59:00", 
        "title": "How About a Little Respect?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "intTime": 20090317, 
        "postID": 41, 
        "quote": "", 
        "reply": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "Knele"
    }, 
    {
        "content": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 42, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:19:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 43, 
        "quote": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding", 
        "reply": " Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:22:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\" Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 44, 
        "quote": "Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "reply": " Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:38:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft. What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090317, 
        "postID": 45, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": " What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "A leader has to earn respect, not demand it.", 
        "intTime": 20090317, 
        "postID": 46, 
        "quote": "", 
        "reply": "A leader has to earn respect, not demand it.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:50:00", 
        "title": "How About a Little Respect?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "intTime": 20090317, 
        "postID": 47, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military?", 
        "reply": " Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 21:20:00", 
        "title": "How About a Little Respect?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different. WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "intTime": 20090317, 
        "postID": 48, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "reply": " WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 23:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 49, 
        "quote": "", 
        "reply": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "", 
        "intTime": 20090317, 
        "postID": 50, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:46:00", 
        "title": "How About a Little Respect?", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 51, 
        "quote": "Originally posted by IHAWKER:", 
        "reply": " Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:51:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "intTime": 20090317, 
        "postID": 52, 
        "quote": "", 
        "reply": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 15:55:00", 
        "title": "How About a Little Respect?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "intTime": 20090317, 
        "postID": 53, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "intTime": 20090317, 
        "postID": 54, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "intTime": 20090317, 
        "postID": 55, 
        "quote": "", 
        "reply": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "intTime": 20090317, 
        "postID": 56, 
        "quote": "", 
        "reply": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:05:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "intTime": 20090317, 
        "postID": 57, 
        "quote": "", 
        "reply": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:29:00", 
        "title": "How About a Little Respect?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "intTime": 20090317, 
        "postID": 58, 
        "quote": "", 
        "reply": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:47:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures' Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "intTime": 20090317, 
        "postID": 59, 
        "quote": "Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "reply": " Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:56:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "intTime": 20090317, 
        "postID": 60, 
        "quote": "", 
        "reply": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:15:00", 
        "title": "How About a Little Respect?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals. COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "intTime": 20090317, 
        "postID": 61, 
        "quote": "Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "reply": " COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:31:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 62, 
        "quote": "", 
        "reply": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost. Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 63, 
        "quote": "Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost.", 
        "reply": " Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:48:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 64, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:59:00", 
        "title": "How About a Little Respect?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "intTime": 20090317, 
        "postID": 65, 
        "quote": "", 
        "reply": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "Knele"
    }, 
    {
        "content": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 66, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:19:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 67, 
        "quote": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding", 
        "reply": " Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:22:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\" Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 68, 
        "quote": "Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "reply": " Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:38:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft. What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090317, 
        "postID": 69, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": " What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "A leader has to earn respect, not demand it.", 
        "intTime": 20090317, 
        "postID": 70, 
        "quote": "", 
        "reply": "A leader has to earn respect, not demand it.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:50:00", 
        "title": "How About a Little Respect?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "intTime": 20090317, 
        "postID": 71, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military?", 
        "reply": " Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 21:20:00", 
        "title": "How About a Little Respect?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different. WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "intTime": 20090317, 
        "postID": 72, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "reply": " WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 23:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 73, 
        "quote": "", 
        "reply": "I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this is a sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect any of our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! This message has been edited. Last edited by: Vicdude, Tue 17 March 2009 07:26 PM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "", 
        "intTime": 20090317, 
        "postID": 74, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:46:00", 
        "title": "How About a Little Respect?", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 75, 
        "quote": "Originally posted by IHAWKER:", 
        "reply": " Awww, twisting toe in sand and blushing. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 14:51:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "intTime": 20090317, 
        "postID": 76, 
        "quote": "", 
        "reply": "Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 15:55:00", 
        "title": "How About a Little Respect?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "intTime": 20090317, 
        "postID": 77, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " I hear ya Vic. I posted somethign similar several times. To those who oppose POTUS theories(I am one of them), show some respect, and knock off the juvenile name calling. It's stupid, and detracts from your message.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!! COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "intTime": 20090317, 
        "postID": 78, 
        "quote": "Originally posted by Vicdude: I suppose I'm going to catch some flack over this but I have my Kevlar and dug a foxhole in my back yard. I spent eight years listening to President Bush Jr. denigrated. Before that it was President Regan and before that it Was president Bush Sr and before that President Clinton.(I think I have that order right but if it isn't it's not germane to what I want to say. Now Barack Obama is our president and there is a steady stream of denigration directed at him. I understand that feelings run high and this sensitive topic. There is nothing wrong with disliking the man that is our president and CinC. There is nothing wrong with expressing ones opinions. What bothers me is that the some posters are making broad statements that defile the office of president and CinC. All I'd ask is posters respect the office if not the man. I've been posting here for a while now. No one has seen me disrespect our leaders. I like some of them and dislike some of them but I respectfully refer to them by their titles. You will also notice that I refer to both Republicans and Democrate with the same respect. INCOMING, HIT THE DECK!!", 
        "reply": " COMMENT: On this site, there are those who cannot -- or simply refuse -- to separate the \"personal\" from the substantive issues. To many of those, as all politics was \"local\" to Tip O'Neill, they regard all politics as \"personal\" and somewhat of a blood sport on here. It's why some posters will vigorously defend someone like Sarah Palin against all objective criticism based on her credentials and statements and initiate personal attacks against posters who do. This simply creates a constant state of agitation in which legitimate debate and discussion cannot take place, and it all devolves into a series of personal remarks. Your stance has been offered here several times previously, but there are some who simply make every political observation the subject of a personal vendetta or verbal attack against another poster. Vigorous debate is acceptable; the constant personal hectoring is not. One only needs to look at some of the extreme threads here that are merely a thin veneer for a personal attack against this particular president, i.e., the absurd notion about Mr. Obama's use of a teleprompter, the continued regurgitation about Obama's birth certificate and citizenship, ad nauseum.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:06:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "intTime": 20090317, 
        "postID": 79, 
        "quote": "", 
        "reply": "You won't find much respect here from those on the left, right, or middle. There are good debates and conversations, but many of the posters will say anything and everything about the President. There are people that were very disrespectful of the last President. It has gotten worse since President Obama was sworn in though. It is hard to believe that many of the people on here insulting and name calling the President have served or they are serving in the military. There are good people here, but most only throw out catchy words like Obamanation. There is also a rampant conspiracy group that refuses to believe the President is a citizen. There is no respect for the office in the media either, and I think that yellow journalism has made people forget that the office of the President is one to be respected. The left wing media portrayed President Bush as a chimp (don't try that with Obama). The right wing smears Obama just as bad though. Most people can't debate the issues, they get their opinions given to them by Rush or MSNBC. It is no surprise when the only argument someone has in Bush is bad, or Obama is the anti-christ.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 16:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "intTime": 20090317, 
        "postID": 80, 
        "quote": "", 
        "reply": ",VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:05:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "intTime": 20090317, 
        "postID": 81, 
        "quote": "", 
        "reply": "When you get reality in DC politics you will probably get reality here...hate to say it but it is a contagious element in corruption and defining what \"reality\" is. If you see reality, the make-believe bs is so obvious to everyone they don't want to embarrass themselves in public by saying dumb azz things.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:29:00", 
        "title": "How About a Little Respect?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "intTime": 20090317, 
        "postID": 82, 
        "quote": "", 
        "reply": "Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:47:00", 
        "title": "How About a Little Respect?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures' Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "intTime": 20090317, 
        "postID": 83, 
        "quote": "Originally posted by tawodi: Especially, since active duty uniformed personell are forbidden by the U.C.M.J. from voicing negative or derogatory opinions about political figures'", 
        "reply": " Actually Article 88 only applies to officers, but it is bad form for anyone.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 17:56:00", 
        "title": "How About a Little Respect?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "intTime": 20090317, 
        "postID": 84, 
        "quote": "", 
        "reply": "I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:15:00", 
        "title": "How About a Little Respect?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals. COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "intTime": 20090317, 
        "postID": 85, 
        "quote": "Originally posted by M1Lase_n_Blaze: I think that President Obama is probably a Marxist and definitely espouses some core Marxist ideals.", 
        "reply": " COMMENT: If you truly believe that and are not simply trying to be provocative, state your case specifically. Calling the president a Marxist is about as extreme as one can get; details are needed to make that case.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:31:00", 
        "title": "How About a Little Respect?", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 86, 
        "quote": "", 
        "reply": "None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:40:00", 
        "title": "How About a Little Respect?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost. Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 87, 
        "quote": "Originally posted by dmuhler: Ain't going to happen because the hypocrites rule the roost.", 
        "reply": " Well it saddens me. I'm proud of my country and I'm proud of my fellow Americans. We should be able to rise above such things. It doesn't matter if one likes our elected president or not. They have risen to the highest office in our country. If you cannot respect the person you should darn well respect the office. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:48:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "intTime": 20090317, 
        "postID": 88, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": "", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 18:59:00", 
        "title": "How About a Little Respect?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "intTime": 20090317, 
        "postID": 89, 
        "quote": "", 
        "reply": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding!", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "Knele"
    }, 
    {
        "content": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 90, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by tawodi: ,VIC; I noted your sensible statement and the follow on comments of the people who followed with their opinions. Attacks on the \"messenger\" are the easiest to execute and add nothing to the debate, it is true. Nice post. And NOW!! I think you should be beaten within an inch of your life for trying to inject some sanity here!! What the hell is WRONG with you!!! I couldn't resist....I just couldn't!! T [/QUOT OH. OH! YES! beat me; flog me, I love it! Big Busty blonds with floggers and high leather boots! Oops I think I got a little carried away. Sorry, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:19:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 91, 
        "quote": "The amount of insults aimed at the current POTUS, TOLERATED on these boards is astounding", 
        "reply": " Well the constitution guarantees all of us freedom of speech. Sadly our forefathers forgot to add a codicil about stupid free speech. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:22:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\" Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090317, 
        "postID": 92, 
        "quote": "Originally posted by scooter_mech: Much of this is childish. \"I'm posting bad stuff about(enter name here) 'cause you posted stuff about (enter name here).\"", 
        "reply": " Scooter man: we're supposed to be adults here and above such stuff. What sort of example do we make to the younger people that sign on here? My feelings are as profound as most of the other posters but I try to be fair and respectful. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:38:00", 
        "title": "How About a Little Respect?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft. What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090317, 
        "postID": 93, 
        "quote": "Originally posted by Duster6: None of you would ever make it in SF or Special Opns. You all are too soft.", 
        "reply": " What a truly inspiring addition to this conversation. Where would we all be without your wisdom? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:49:00", 
        "title": "How About a Little Respect?", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "A leader has to earn respect, not demand it.", 
        "intTime": 20090317, 
        "postID": 94, 
        "quote": "", 
        "reply": "A leader has to earn respect, not demand it.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 19:50:00", 
        "title": "How About a Little Respect?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "intTime": 20090317, 
        "postID": 95, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military?", 
        "reply": " Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 21:20:00", 
        "title": "How About a Little Respect?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different. WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "intTime": 20090317, 
        "postID": 96, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by dmuhler: quote: Originally posted by SignalSgtWilliams: A leader has to earn respect, not demand it. That is the way it works in the military? Yep it sure is. Soldiers/Marines/airmen/seamen can feign respect for those of superior rank when it's necessary, but true respect is earned. B.O.'s earned nothing but disdain from me. Ya see, I don't respect liars.. perhaps you're different.", 
        "reply": " WOW soooooooooo harsh!!!!! Well you missed serving under Richard M. Nixon...Now what did he do again???....more CROW???", 
        "threadID": "409192893_5650031812001", 
        "time": "2009-03-17 23:04:00", 
        "title": "How About a Little Respect?", 
        "userID": "scottrj50"
    }
]