[
    {
        "content": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "", 
        "reply": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 08:25:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Dick Cheney is right He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "Dick Cheney is right", 
        "reply": " He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:15:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Dick Cheney is right No way, he didn't shoot the right person.", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "Dick Cheney is right", 
        "reply": " No way, he didn't shoot the right person.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:22:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "intTime": 20090421, 
        "postID": 4, 
        "quote": "", 
        "reply": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:29:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security. This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "intTime": 20090421, 
        "postID": 5, 
        "quote": "Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "reply": " This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "intTime": 20090421, 
        "postID": 6, 
        "quote": "", 
        "reply": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:53:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "intTime": 20090421, 
        "postID": 7, 
        "quote": "Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "reply": " The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:02:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "intTime": 20090421, 
        "postID": 8, 
        "quote": "", 
        "reply": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:03:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "intTime": 20090421, 
        "postID": 9, 
        "quote": "Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "reply": " If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking.... You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "intTime": 20090421, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "reply": " You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:20:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "intTime": 20090421, 
        "postID": 11, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "intTime": 20090421, 
        "postID": 12, 
        "quote": "PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times?", 
        "reply": " He refused to bathe.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "intTime": 20090421, 
        "postID": 13, 
        "quote": "If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI", 
        "reply": " because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:32:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "intTime": 20090421, 
        "postID": 14, 
        "quote": "Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "reply": " yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:35:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 15, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:36:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: How is this not thread disruption and how it not baiting?", 
        "intTime": 20090421, 
        "postID": 16, 
        "quote": "Originally posted by NSNN:", 
        "reply": " How is this not thread disruption and how it not baiting?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:40:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "reply": " How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:43:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops??? Once again you've proven you don't know $hit from shinola.", 
        "intTime": 20090421, 
        "postID": 18, 
        "quote": "Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "reply": " Once again you've proven you don't know $hit from shinola.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:44:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,.... So receiving the wire brush treatment runs in your family huh?", 
        "intTime": 20090421, 
        "postID": 19, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "reply": " So receiving the wire brush treatment runs in your family huh?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "LOL!!!!....about as right as his WMD's....silly old man", 
        "intTime": 20090421, 
        "postID": 20, 
        "quote": "", 
        "reply": "LOL!!!!....about as right as his WMD's....silly old man", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:48:00", 
        "title": "Dick Cheney is right", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090421, 
        "postID": 21, 
        "quote": "Originally posted by NSNN:", 
        "reply": " Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:54:00", 
        "title": "Dick Cheney is right", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done. Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "intTime": 20090421, 
        "postID": 22, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "reply": " Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "intTime": 20090421, 
        "postID": 23, 
        "quote": "", 
        "reply": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:30:00", 
        "title": "Dick Cheney is right", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Where are those charges listed, and what general was court martialed.", 
        "intTime": 20090421, 
        "postID": 24, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Where are those charges listed, and what general was court martialed.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "Whats up with all of these idiotic pictures??", 
        "intTime": 20090421, 
        "postID": 25, 
        "quote": "", 
        "reply": "Whats up with all of these idiotic pictures??", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:33:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "intTime": 20090421, 
        "postID": 26, 
        "quote": "", 
        "reply": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:37:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot... yea one insentience out of some what 70years of him being on the earth...", 
        "intTime": 20090421, 
        "postID": 27, 
        "quote": "Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot...", 
        "reply": " yea one insentience out of some what 70years of him being on the earth...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:47:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "intTime": 20090421, 
        "postID": 28, 
        "quote": "", 
        "reply": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 08:25:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Dick Cheney is right He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 29, 
        "quote": "Dick Cheney is right", 
        "reply": " He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:15:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Dick Cheney is right No way, he didn't shoot the right person.", 
        "intTime": 20090421, 
        "postID": 30, 
        "quote": "Dick Cheney is right", 
        "reply": " No way, he didn't shoot the right person.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:22:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "intTime": 20090421, 
        "postID": 31, 
        "quote": "", 
        "reply": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:29:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security. This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "intTime": 20090421, 
        "postID": 32, 
        "quote": "Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "reply": " This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "intTime": 20090421, 
        "postID": 33, 
        "quote": "", 
        "reply": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:53:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "intTime": 20090421, 
        "postID": 34, 
        "quote": "Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "reply": " The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:02:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "intTime": 20090421, 
        "postID": 35, 
        "quote": "", 
        "reply": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:03:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "intTime": 20090421, 
        "postID": 36, 
        "quote": "Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "reply": " If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking.... You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "intTime": 20090421, 
        "postID": 37, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "reply": " You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:20:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "intTime": 20090421, 
        "postID": 38, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "intTime": 20090421, 
        "postID": 39, 
        "quote": "PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times?", 
        "reply": " He refused to bathe.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "intTime": 20090421, 
        "postID": 40, 
        "quote": "If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI", 
        "reply": " because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:32:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "intTime": 20090421, 
        "postID": 41, 
        "quote": "Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "reply": " yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:35:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 42, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:36:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: How is this not thread disruption and how it not baiting?", 
        "intTime": 20090421, 
        "postID": 43, 
        "quote": "Originally posted by NSNN:", 
        "reply": " How is this not thread disruption and how it not baiting?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:40:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "intTime": 20090421, 
        "postID": 44, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "reply": " How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:43:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops??? Once again you've proven you don't know $hit from shinola.", 
        "intTime": 20090421, 
        "postID": 45, 
        "quote": "Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "reply": " Once again you've proven you don't know $hit from shinola.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:44:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,.... So receiving the wire brush treatment runs in your family huh?", 
        "intTime": 20090421, 
        "postID": 46, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "reply": " So receiving the wire brush treatment runs in your family huh?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "LOL!!!!....about as right as his WMD's....silly old man", 
        "intTime": 20090421, 
        "postID": 47, 
        "quote": "", 
        "reply": "LOL!!!!....about as right as his WMD's....silly old man", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:48:00", 
        "title": "Dick Cheney is right", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090421, 
        "postID": 48, 
        "quote": "Originally posted by NSNN:", 
        "reply": " Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:54:00", 
        "title": "Dick Cheney is right", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done. Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "intTime": 20090421, 
        "postID": 49, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "reply": " Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "intTime": 20090421, 
        "postID": 50, 
        "quote": "", 
        "reply": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:30:00", 
        "title": "Dick Cheney is right", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Where are those charges listed, and what general was court martialed.", 
        "intTime": 20090421, 
        "postID": 51, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Where are those charges listed, and what general was court martialed.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "Whats up with all of these idiotic pictures??", 
        "intTime": 20090421, 
        "postID": 52, 
        "quote": "", 
        "reply": "Whats up with all of these idiotic pictures??", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:33:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "intTime": 20090421, 
        "postID": 53, 
        "quote": "", 
        "reply": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:37:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot... yea one insentience out of some what 70years of him being on the earth...", 
        "intTime": 20090421, 
        "postID": 54, 
        "quote": "Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot...", 
        "reply": " yea one insentience out of some what 70years of him being on the earth...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:47:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "intTime": 20090421, 
        "postID": 55, 
        "quote": "", 
        "reply": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 08:25:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Dick Cheney is right He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 56, 
        "quote": "Dick Cheney is right", 
        "reply": " He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:15:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Dick Cheney is right No way, he didn't shoot the right person.", 
        "intTime": 20090421, 
        "postID": 57, 
        "quote": "Dick Cheney is right", 
        "reply": " No way, he didn't shoot the right person.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:22:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "intTime": 20090421, 
        "postID": 58, 
        "quote": "", 
        "reply": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:29:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security. This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "intTime": 20090421, 
        "postID": 59, 
        "quote": "Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "reply": " This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "intTime": 20090421, 
        "postID": 60, 
        "quote": "", 
        "reply": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:53:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "intTime": 20090421, 
        "postID": 61, 
        "quote": "Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "reply": " The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:02:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "intTime": 20090421, 
        "postID": 62, 
        "quote": "", 
        "reply": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:03:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "intTime": 20090421, 
        "postID": 63, 
        "quote": "Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "reply": " If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking.... You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "intTime": 20090421, 
        "postID": 64, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "reply": " You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:20:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "intTime": 20090421, 
        "postID": 65, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "intTime": 20090421, 
        "postID": 66, 
        "quote": "PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times?", 
        "reply": " He refused to bathe.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "intTime": 20090421, 
        "postID": 67, 
        "quote": "If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI", 
        "reply": " because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:32:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "intTime": 20090421, 
        "postID": 68, 
        "quote": "Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "reply": " yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:35:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 69, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:36:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: How is this not thread disruption and how it not baiting?", 
        "intTime": 20090421, 
        "postID": 70, 
        "quote": "Originally posted by NSNN:", 
        "reply": " How is this not thread disruption and how it not baiting?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:40:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "intTime": 20090421, 
        "postID": 71, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "reply": " How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:43:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops??? Once again you've proven you don't know $hit from shinola.", 
        "intTime": 20090421, 
        "postID": 72, 
        "quote": "Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "reply": " Once again you've proven you don't know $hit from shinola.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:44:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,.... So receiving the wire brush treatment runs in your family huh?", 
        "intTime": 20090421, 
        "postID": 73, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "reply": " So receiving the wire brush treatment runs in your family huh?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "LOL!!!!....about as right as his WMD's....silly old man", 
        "intTime": 20090421, 
        "postID": 74, 
        "quote": "", 
        "reply": "LOL!!!!....about as right as his WMD's....silly old man", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:48:00", 
        "title": "Dick Cheney is right", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090421, 
        "postID": 75, 
        "quote": "Originally posted by NSNN:", 
        "reply": " Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:54:00", 
        "title": "Dick Cheney is right", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done. Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "intTime": 20090421, 
        "postID": 76, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "reply": " Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "intTime": 20090421, 
        "postID": 77, 
        "quote": "", 
        "reply": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:30:00", 
        "title": "Dick Cheney is right", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Where are those charges listed, and what general was court martialed.", 
        "intTime": 20090421, 
        "postID": 78, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Where are those charges listed, and what general was court martialed.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "Whats up with all of these idiotic pictures??", 
        "intTime": 20090421, 
        "postID": 79, 
        "quote": "", 
        "reply": "Whats up with all of these idiotic pictures??", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:33:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "intTime": 20090421, 
        "postID": 80, 
        "quote": "", 
        "reply": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:37:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot... yea one insentience out of some what 70years of him being on the earth...", 
        "intTime": 20090421, 
        "postID": 81, 
        "quote": "Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot...", 
        "reply": " yea one insentience out of some what 70years of him being on the earth...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:47:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "intTime": 20090421, 
        "postID": 82, 
        "quote": "", 
        "reply": "The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 08:25:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Dick Cheney is right He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 83, 
        "quote": "Dick Cheney is right", 
        "reply": " He’s far right! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:15:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Dick Cheney is right No way, he didn't shoot the right person.", 
        "intTime": 20090421, 
        "postID": 84, 
        "quote": "Dick Cheney is right", 
        "reply": " No way, he didn't shoot the right person.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:22:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "intTime": 20090421, 
        "postID": 85, 
        "quote": "", 
        "reply": "Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:29:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security. This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "intTime": 20090421, 
        "postID": 86, 
        "quote": "Originally posted by transport1: Yeah, this administration is cherry-picking the information that they release (deja vu, where have we heard that before) so that it makes them look good. Let's get the rest of the information showing how many attacks were prevented and how many lives were saved by their \"torture\" of these combatants that were held in the interest of national security.", 
        "reply": " This whole fiasco is designed to take attention away from the cold reception the economy is having on President Obamas rescue plan, it is designed to continue to keep the previous administration in the news..etc..etc This is cherry picking pure and simple, if you're going to say this \"torture\" was wrong and didn't do a damn thing positive then release the memos that prove it didnt do anything to protect American interests.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "intTime": 20090421, 
        "postID": 87, 
        "quote": "", 
        "reply": "Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 09:53:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "intTime": 20090421, 
        "postID": 88, 
        "quote": "Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care?", 
        "reply": " The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:02:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "intTime": 20090421, 
        "postID": 89, 
        "quote": "", 
        "reply": "more divide and concur from the obama admin..he is a divider... the greatest we have had in years...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:03:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "intTime": 20090421, 
        "postID": 90, 
        "quote": "Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary.", 
        "reply": " If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking.... You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "intTime": 20090421, 
        "postID": 91, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Thud357L: Well, if releasing the \"most sensitive information surrounding our enhanced interrogation techniques\" (your words) is such a security risk in your mind, why do you thing releasing the results would not be even more of a security risk? Or don't you really care? The damage is done to America, but now the administration is trying to keep itself from getting damaged.. If these perfectly acceptable techniques resulted in intelligence that prevented attacks here or abroad, or resulted in the capture of extremely dangerous individuals then the administration will only prove they are playing politics with national security. The damage, unfortunately; is already done....I want the whole story, this President is cherrying picking....", 
        "reply": " You must have one helluva security clearance. I think the admin is most happy to have this little skirmish with Dick Cheney. The potential gains are large and the risk is minimal. I imagine there will be ample opportunity to force Cheney deeper into this cul-de-sac of his own design. I think Mr. Cheney is running a little bit scared. It will certainly be fun to watch.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:20:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "intTime": 20090421, 
        "postID": 92, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "intTime": 20090421, 
        "postID": 93, 
        "quote": "PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times?", 
        "reply": " He refused to bathe.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "Dick Cheney is right", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "intTime": 20090421, 
        "postID": 94, 
        "quote": "If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI", 
        "reply": " because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:32:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "intTime": 20090421, 
        "postID": 95, 
        "quote": "Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe.", 
        "reply": " yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:35:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 96, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:36:00", 
        "title": "Dick Cheney is right", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: How is this not thread disruption and how it not baiting?", 
        "intTime": 20090421, 
        "postID": 97, 
        "quote": "Originally posted by NSNN:", 
        "reply": " How is this not thread disruption and how it not baiting?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:40:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "intTime": 20090421, 
        "postID": 98, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info)", 
        "reply": " How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:43:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops??? Once again you've proven you don't know $hit from shinola.", 
        "intTime": 20090421, 
        "postID": 99, 
        "quote": "Originally posted by outlaws93: quote: If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWI because they did other stuff to the pow inwhich caused their death... waterboarding was just thrown in because they did it to the pows... but that isnt what they were charged with... stuff that lead to the death of the pows is what they did... if waterboarding was so bad then why is it done to our own troops???", 
        "reply": " Once again you've proven you don't know $hit from shinola.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:44:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,.... So receiving the wire brush treatment runs in your family huh?", 
        "intTime": 20090421, 
        "postID": 100, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by bill_kananen: quote: PhoenixDark: If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? He refused to bathe. yea my dad told me stories about what is done to navy personal in which refuse to take showers ... its not real nice.,.. this was back in ww2 so things were a little different back then... i am sure anyways,....", 
        "reply": " So receiving the wire brush treatment runs in your family huh?", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:46:00", 
        "title": "Dick Cheney is right", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "LOL!!!!....about as right as his WMD's....silly old man", 
        "intTime": 20090421, 
        "postID": 101, 
        "quote": "", 
        "reply": "LOL!!!!....about as right as his WMD's....silly old man", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:48:00", 
        "title": "Dick Cheney is right", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090421, 
        "postID": 102, 
        "quote": "Originally posted by NSNN:", 
        "reply": " Too Funny!!!!!!! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 10:54:00", 
        "title": "Dick Cheney is right", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done. Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "intTime": 20090421, 
        "postID": 103, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Non Sequiter.... My point: Release all the information Your point: It didn't work(even though I don't have the info) How do I know it didn't work? Simple - Where is Osama Bin Laden if waterboarding KSM was so successful.? He sure as he11 ain't in our custody which points to the fact that it didn't work. Why is Al Quaeda still able to mount attacks on our troops in Afghanistan if waterboarding KSM provided so much information? Obama is releasing the info about how and how much we waterboarded for the simple reason that to sincerely make amends for wrongs done, one must first admit what wrongs were done.", 
        "reply": " Ya thats reasonable. No Chance KSM simply didn't know where OBl was...or that OBL knew KSM was taken so he countered.. Nope, none at all.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:18:00", 
        "title": "Dick Cheney is right", 
        "userID": "threerings"
    }, 
    {
        "content": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "intTime": 20090421, 
        "postID": 104, 
        "quote": "", 
        "reply": "Cheney is, was, and always will be a POS. And a bad shot...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 11:30:00", 
        "title": "Dick Cheney is right", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague. Where are those charges listed, and what general was court martialed.", 
        "intTime": 20090421, 
        "postID": 105, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: The Obama administration has decided to release the most sensitive information surrounding our enhanced interrogation techniques(hows the bank bail out working out by the way??) but, like Dick Cheney reiterated yesterday, he has refused to declassifed the information we gained, and the positive impact this had on the security of America... Give us the steak and not just the peas....If waterboarding saved lives...let Americans decided what is right and necessary. If waterboarding was so effective, why did they have to do it to Kalid Sheikh Mohammed 183 times? If it's not torture, then why did we convict Japanese officers for doing it to captured American troops after WWII and why would President Theodore Roosevelt have one of his own Generals court martialed (and subsequently kicked out) for doing it to a Philipine rebel? Dick Cheney is just trying to cover his own azz so he don't end up in front of the Hague.", 
        "reply": " Where are those charges listed, and what general was court martialed.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Dick Cheney is right", 
        "userID": "transport1"
    }, 
    {
        "content": "Whats up with all of these idiotic pictures??", 
        "intTime": 20090421, 
        "postID": 106, 
        "quote": "", 
        "reply": "Whats up with all of these idiotic pictures??", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:33:00", 
        "title": "Dick Cheney is right", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "intTime": 20090421, 
        "postID": 107, 
        "quote": "", 
        "reply": "Looks like Cheney has been caught lying already. He told Fox news that he had requested further files to be released that prove how effective torture is but the CIA says he has made no such request.", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:37:00", 
        "title": "Dick Cheney is right", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot... yea one insentience out of some what 70years of him being on the earth...", 
        "intTime": 20090421, 
        "postID": 108, 
        "quote": "Originally posted by Killswitch_Engage: Cheney is, was, and always will be a POS. And a bad shot...", 
        "reply": " yea one insentience out of some what 70years of him being on the earth...", 
        "threadID": "409192893_1030063122001", 
        "time": "2009-04-21 12:47:00", 
        "title": "Dick Cheney is right", 
        "userID": "outlaws93"
    }
]