[
    {
        "content": "Take the test at \"http://.politicalcompass.org/test\" and see where you stand. What do these words mean anyway? I’ve noticed most “conservatives” here actually seem to be NEOLIBERALS. The main points of neo-liberalism (quoted from corpswatch.org) include: 1. THE RULE OF THE MARKET. Liberating \"free\" enterprise or private enterprise from any bonds imposed by the government (the state) no matter how much social damage this causes. Greater openness to international trade and investment, as in NAFTA. Reduce wages by de-unionizing workers and eliminating workers' rights that had been won over many years of struggle. No more price controls. All in all, total freedom of movement for capital, goods and services. To convince us this is good for us, they say \"an unregulated market is the best way to increase economic growth, which will ultimately benefit everyone.\" It's like Reagan's \"supply-side\" and \"trickle-down\" economics. 2. CUTTING PUBLIC EXPENDITURE FOR SOCIAL SERVICES like education and health care. REDUCING THE SAFETY-NET FOR THE POOR, and even maintenance of roads, bridges, water supply -- again in the name of reducing government's role. Of course, they don't oppose government subsidies and tax benefits for business. 3.DEREGULATION. Reduce government regulation of everything that could diminish profits, including protecting the environment and safety on the job. 4.PRIVATIZATION. Sell state-owned enterprises, goods and services to private investors. This includes banks, key industries, railroads, toll highways, electricity, schools, hospitals and even fresh water. Although usually done in the name of greater efficiency, which is often needed, privatization has mainly had the effect of concentrating wealth even more in a few hands and making the public pay even more for its needs. 5. ELIMINATING THE CONCEPT OF \"THE PUBLIC GOOD\" or \"COMMUNITY\" and replacing it with \"individual responsibility.\" Pressuring the poorest people in a society to find solutions to their lack of health care, education and social security all by themselves -- then blaming them, if they fail, as \"lazy.\"", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "", 
        "reply": "Take the test at \"http://.politicalcompass.org/test\" and see where you stand. What do these words mean anyway? I’ve noticed most “conservatives” here actually seem to be NEOLIBERALS. The main points of neo-liberalism (quoted from corpswatch.org) include: 1. THE RULE OF THE MARKET. Liberating \"free\" enterprise or private enterprise from any bonds imposed by the government (the state) no matter how much social damage this causes. Greater openness to international trade and investment, as in NAFTA. Reduce wages by de-unionizing workers and eliminating workers' rights that had been won over many years of struggle. No more price controls. All in all, total freedom of movement for capital, goods and services. To convince us this is good for us, they say \"an unregulated market is the best way to increase economic growth, which will ultimately benefit everyone.\" It's like Reagan's \"supply-side\" and \"trickle-down\" economics. 2. CUTTING PUBLIC EXPENDITURE FOR SOCIAL SERVICES like education and health care. REDUCING THE SAFETY-NET FOR THE POOR, and even maintenance of roads, bridges, water supply -- again in the name of reducing government's role. Of course, they don't oppose government subsidies and tax benefits for business. 3.DEREGULATION. Reduce government regulation of everything that could diminish profits, including protecting the environment and safety on the job. 4.PRIVATIZATION. Sell state-owned enterprises, goods and services to private investors. This includes banks, key industries, railroads, toll highways, electricity, schools, hospitals and even fresh water. Although usually done in the name of greater efficiency, which is often needed, privatization has mainly had the effect of concentrating wealth even more in a few hands and making the public pay even more for its needs. 5. ELIMINATING THE CONCEPT OF \"THE PUBLIC GOOD\" or \"COMMUNITY\" and replacing it with \"individual responsibility.\" Pressuring the poorest people in a society to find solutions to their lack of health care, education and social security all by themselves -- then blaming them, if they fail, as \"lazy.\"", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-01 15:12:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "ColdWarGranny"
    }, 
    {
        "content": "Very interesting ColdWarGranny. Thanks for posting. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090509, 
        "postID": 2, 
        "quote": "", 
        "reply": "Very interesting ColdWarGranny. Thanks for posting. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-09 19:48:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: http://.politicalcompass.org/test It is a different version of liberal. I am a classical liberal, which is just a fancy way of saying I am a libertarian. Classical liberalism can also be called traditional liberalism. It is neither left nor right. But, it is at the far end of the spectrum furthest away from authoritarian (fascism). And, it is not to be confused with social liberalism, neoliberalism or paleoliberalism. The Democratic and Republican Parties used to be more classical liberal in their early lives, but have leaned more toward social liberal and neoliberal ideas respectively. While they do have differences in the left right paradigm, they both most definitely lean toward an authoritarian ideology. I personally do not like this particular test because many of the questions asked will have two opposing things of which I agree with neither. Also, they equate neo-liberalism with libertarianism, which is not accurate. Because, libertarianism is actually classical liberalism, or traditional liberalism. And, you can tell by reading much of the definitions that there is a bias that is conveyed by the inflection of the words. I think that this quiz is not solely for the American political scale because of the scale and definitions used. This is most definitely a European model. I very much prefer the Nolan chart. It is a far better representation of where a person stands politically. And, it is based on an American model rather than a European model. Plus, it only has 10 questions with defined answers rather than a ton of questions with agree/disagree answers. This message has been edited. Last edited by: 10Tenths, Sun 10 May 2009 02:13 PM", 
        "intTime": 20090510, 
        "postID": 3, 
        "quote": "http://.politicalcompass.org/test", 
        "reply": " It is a different version of liberal. I am a classical liberal, which is just a fancy way of saying I am a libertarian. Classical liberalism can also be called traditional liberalism. It is neither left nor right. But, it is at the far end of the spectrum furthest away from authoritarian (fascism). And, it is not to be confused with social liberalism, neoliberalism or paleoliberalism. The Democratic and Republican Parties used to be more classical liberal in their early lives, but have leaned more toward social liberal and neoliberal ideas respectively. While they do have differences in the left right paradigm, they both most definitely lean toward an authoritarian ideology. I personally do not like this particular test because many of the questions asked will have two opposing things of which I agree with neither. Also, they equate neo-liberalism with libertarianism, which is not accurate. Because, libertarianism is actually classical liberalism, or traditional liberalism. And, you can tell by reading much of the definitions that there is a bias that is conveyed by the inflection of the words. I think that this quiz is not solely for the American political scale because of the scale and definitions used. This is most definitely a European model. I very much prefer the Nolan chart. It is a far better representation of where a person stands politically. And, it is based on an American model rather than a European model. Plus, it only has 10 questions with defined answers rather than a ton of questions with agree/disagree answers. This message has been edited. Last edited by: 10Tenths, Sun 10 May 2009 02:13 PM", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-10 13:45:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Well, I can't say I'm too surprised by the results:", 
        "intTime": 20090510, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well, I can't say I'm too surprised by the results:", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-10 23:38:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I'm ALWAYS a libertarian when I take these tests.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm ALWAYS a libertarian when I take these tests.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-11 00:39:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090511, 
        "postID": 6, 
        "quote": "", 
        "reply": "It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-11 00:56:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "http://politicalcompass.org/facebook/pcgraphpng.php?ec=-5.62&soc=-5.03 hmm. I'm surprised by your chart, Follow Me . I was expecting somn different.", 
        "intTime": 20090511, 
        "postID": 7, 
        "quote": "", 
        "reply": "http://politicalcompass.org/facebook/pcgraphpng.php?ec=-5.62&soc=-5.03 hmm. I'm surprised by your chart, Follow Me . I was expecting somn different.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-11 02:19:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "What were you expecting, sir? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090511, 
        "postID": 8, 
        "quote": "", 
        "reply": "What were you expecting, sir? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-11 02:38:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I want someone to put hard fast definitions on 'left' and 'right' because they seem to get thrown about willy nilly these days and used for everything...except giving directions...", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "", 
        "reply": "I want someone to put hard fast definitions on 'left' and 'right' because they seem to get thrown about willy nilly these days and used for everything...except giving directions...", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-11 05:04:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "godawgz"
    }, 
    {
        "content": "Left - someone who has left the right direction.", 
        "intTime": 20090511, 
        "postID": 10, 
        "quote": "", 
        "reply": "Left - someone who has left the right direction.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-11 05:09:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: Originally posted by seaservicefan: Left - someone who has left the right direction. right - someone who is a right idiot. How about just cutting it out. We can call eachother names until doomsday, and it will not add anything to the debate. regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090518, 
        "postID": 11, 
        "quote": "Originally posted by seaservicefan: Left - someone who has left the right direction.", 
        "reply": " right - someone who is a right idiot. How about just cutting it out. We can call eachother names until doomsday, and it will not add anything to the debate. regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 12:42:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "", 
        "intTime": 20090518, 
        "postID": 12, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 12:53:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "foxred03"
    }, 
    {
        "content": "Your political compass Economic Left/Right: 5.38 Social Libertarian/Authoritarian: 1.74 I was in the upper right corner but my dot layed toward the bottom center. What ever the hell that means. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 13, 
        "quote": "", 
        "reply": "Your political compass Economic Left/Right: 5.38 Social Libertarian/Authoritarian: 1.74 I was in the upper right corner but my dot layed toward the bottom center. What ever the hell that means. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 13:15:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Economic Left/Right: -0.25 Social Libertarian/Authoritarian: 2.15 Almost dead center all around, like I have often said, conservative in the way I live, and middle of the road when it comes to everyone eles on how they want to live. The questions were missing an important option on some of them, namely neither agree or disagree... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090518, 
        "postID": 14, 
        "quote": "", 
        "reply": "Economic Left/Right: -0.25 Social Libertarian/Authoritarian: 2.15 Almost dead center all around, like I have often said, conservative in the way I live, and middle of the road when it comes to everyone eles on how they want to live. The questions were missing an important option on some of them, namely neither agree or disagree... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 13:44:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: http://.politicalcompass.org/test Interesting... my dot is somewhere between Gandhi's and the Dalai Lama's.", 
        "intTime": 20090518, 
        "postID": 15, 
        "quote": "http://.politicalcompass.org/test", 
        "reply": " Interesting... my dot is somewhere between Gandhi's and the Dalai Lama's.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 14:19:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: What were you expecting, sir? I'm actually not surprised. You're an interesting individual who follows his own conscience, not a party line. I really don't think any of these political tests tells us everything. Often, they focus on just a couple of aspects of people's political perspectives, not everything. They don't always reflect which particular issues are MOST important to a person. But your chart... not surprised at all. It's slightly more left and slightly less authoritarian than the Pope's dot. Actually a very Christian perspective. Jesus was certainly not a right-winger, nor did he push a worldly authoritarian perspective. I'm not surprised by mine either. I'm a left-leaning Libertarian by nature: I support social justice and equal rights for all, but I want a small government, moderate control of corporations to prevent abuse but NOT to artificially support business with tax dollars, and the government keeping its nose out of people's private business.", 
        "intTime": 20090518, 
        "postID": 16, 
        "quote": "Originally posted by FollowMeInfantry: What were you expecting, sir?", 
        "reply": " I'm actually not surprised. You're an interesting individual who follows his own conscience, not a party line. I really don't think any of these political tests tells us everything. Often, they focus on just a couple of aspects of people's political perspectives, not everything. They don't always reflect which particular issues are MOST important to a person. But your chart... not surprised at all. It's slightly more left and slightly less authoritarian than the Pope's dot. Actually a very Christian perspective. Jesus was certainly not a right-winger, nor did he push a worldly authoritarian perspective. I'm not surprised by mine either. I'm a left-leaning Libertarian by nature: I support social justice and equal rights for all, but I want a small government, moderate control of corporations to prevent abuse but NOT to artificially support business with tax dollars, and the government keeping its nose out of people's private business.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 14:24:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "I'm in the same quadrant as Hitler, and Margaret thatcher? LOL...", 
        "intTime": 20090518, 
        "postID": 17, 
        "quote": "", 
        "reply": "I'm in the same quadrant as Hitler, and Margaret thatcher? LOL...", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 14:33:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I'm in the same quadrant as Hitler, and Margaret thatcher? LOL... I was a couple clicks to the right of you but on the same first level. Hitler was way up top Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "Originally posted by Irwin_R_Schyster: I'm in the same quadrant as Hitler, and Margaret thatcher? LOL...", 
        "reply": " I was a couple clicks to the right of you but on the same first level. Hitler was way up top Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-18 14:50:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Nope, just an AMERICAN! All this \"what party are you crap\" will be what brings us down.", 
        "intTime": 20090520, 
        "postID": 19, 
        "quote": "", 
        "reply": "Nope, just an AMERICAN! All this \"what party are you crap\" will be what brings us down.", 
        "threadID": "409192893_2500082222001", 
        "time": "2009-05-20 20:28:00", 
        "title": "Liberal, Conservative, Neo-Liberal, or Socialist?", 
        "userID": "Navy_Grunt"
    }
]