[
    {
        "content": "Any of you here anything about this? quote: FEDS GRANT EMINENT DOMAIN AS COLLATERAL TO CHINA FOR U.S. DEBTS! Beijing, China -- Sources at the United States Embassy in Beijing China have just CONFIRMED to me that the United States of America has tendered to China a written agreement which grants to the People's Republic of China, an option to exercise Eminent Domain within the USA, as collateral for China's con More..tinued purchase of US Treasury Notes and existing US Currency reserves! The written agreement was brought to Beijing by Secretary of State Hillary Clinton and was formalized and agreed-to during her recent trip to China. This means that in the event the US Government defaults on its financial obligations to China, the Communist Government of China would be permitted to physically take -- inside the USA -- land, buildings, factories, perhaps even entire cities - to satisfy the financial obligations of the US government. -http://www.liveleak.com/view?i=0f8_1235673139", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "FEDS GRANT EMINENT DOMAIN AS COLLATERAL TO CHINA FOR U.S. DEBTS! Beijing, China -- Sources at the United States Embassy in Beijing China have just CONFIRMED to me that the United States of America has tendered to China a written agreement which grants to the People's Republic of China, an option to exercise Eminent Domain within the USA, as collateral for China's con More..tinued purchase of US Treasury Notes and existing US Currency reserves! The written agreement was brought to Beijing by Secretary of State Hillary Clinton and was formalized and agreed-to during her recent trip to China. This means that in the event the US Government defaults on its financial obligations to China, the Communist Government of China would be permitted to physically take -- inside the USA -- land, buildings, factories, perhaps even entire cities - to satisfy the financial obligations of the US government.", 
        "reply": "Any of you here anything about this?  -http://www.liveleak.com/view?i=0f8_1235673139", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 06:07:00", 
        "title": "Mortgage the USA", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: Any of you here anything about this? quote: FEDS GRANT EMINENT DOMAIN AS COLLATERAL TO CHINA FOR U.S. DEBTS! Beijing, China -- Sources at the United States Embassy in Beijing China have just CONFIRMED to me that the United States of America has tendered to China a written agreement which grants to the People's Republic of China, an option to exercise Eminent Domain within the USA, as collateral for China's con More..tinued purchase of US Treasury Notes and existing US Currency reserves! The written agreement was brought to Beijing by Secretary of State Hillary Clinton and was formalized and agreed-to during her recent trip to China. This means that in the event the US Government defaults on its financial obligations to China, the Communist Government of China would be permitted to physically take -- inside the USA -- land, buildings, factories, perhaps even entire cities - to satisfy the financial obligations of the US government. -http://www.liveleak.com/view?i=0f8_1235673139 COMMENT: First, Let's try a credible source; if this were accurate, the mainstream print and televised media would have already reported it. Secondly, such a proposition would require Congressional approval.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "Originally posted by floersh: Any of you here anything about this? quote: FEDS GRANT EMINENT DOMAIN AS COLLATERAL TO CHINA FOR U.S. DEBTS! Beijing, China -- Sources at the United States Embassy in Beijing China have just CONFIRMED to me that the United States of America has tendered to China a written agreement which grants to the People's Republic of China, an option to exercise Eminent Domain within the USA, as collateral for China's con More..tinued purchase of US Treasury Notes and existing US Currency reserves! The written agreement was brought to Beijing by Secretary of State Hillary Clinton and was formalized and agreed-to during her recent trip to China. This means that in the event the US Government defaults on its financial obligations to China, the Communist Government of China would be permitted to physically take -- inside the USA -- land, buildings, factories, perhaps even entire cities - to satisfy the financial obligations of the US government. -http://www.liveleak.com/view?i=0f8_1235673139", 
        "reply": " COMMENT: First, Let's try a credible source; if this were accurate, the mainstream print and televised media would have already reported it. Secondly, such a proposition would require Congressional approval.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 06:16:00", 
        "title": "Mortgage the USA", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I LOOKED INTO THIS DUE TO THE NATURE OF THIS STORY TO FIND A NEWS SOURCE THAT WE WOULD KNOW IF IT IS TRUE. I TOOK OVER 100 NEWS SOURCES, BUT I FOUND THIS: quote: \"\"\"http://www.liveleak.com/view?i=0f8_1235673139 Feb. 11 (Bloomberg) -- China should seek guarantees that its $682 billion holdings of U.S. government debt won’t be eroded by “reckless policies,” said Yu Yongding, a former adviser to the central bank. The U.S. “should make the Chinese feel confident that the value of the assets at least will not be eroded in a significant way,” Yu, who now heads the World Economics and Politics Institute at the Chinese Academy of Social Sciences, said in response to e-mailed questions yesterday from Beijing. He declined to elaborate on the assurances needed by China, the biggest foreign holder of U.S. government debt. THERE IS MORE ON THE STORY.", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "\"\"\"http://www.liveleak.com/view?i=0f8_1235673139", 
        "reply": "I LOOKED INTO THIS DUE TO THE NATURE OF THIS STORY TO FIND A NEWS SOURCE THAT WE WOULD KNOW IF IT IS TRUE. I TOOK OVER 100 NEWS SOURCES, BUT I FOUND THIS:  Feb. 11 (Bloomberg) -- China should seek guarantees that its $682 billion holdings of U.S. government debt won’t be eroded by “reckless policies,” said Yu Yongding, a former adviser to the central bank. The U.S. “should make the Chinese feel confident that the value of the assets at least will not be eroded in a significant way,” Yu, who now heads the World Economics and Politics Institute at the Chinese Academy of Social Sciences, said in response to e-mailed questions yesterday from Beijing. He declined to elaborate on the assurances needed by China, the biggest foreign holder of U.S. government debt. THERE IS MORE ON THE STORY.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 06:42:00", 
        "title": "Mortgage the USA", 
        "userID": "mainedawg"
    }, 
    {
        "content": "I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "", 
        "reply": "I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 06:45:00", 
        "title": "Mortgage the USA", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it. Your comments have been getting more and more bizarre lately. Are you alright?", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it.", 
        "reply": " Your comments have been getting more and more bizarre lately. Are you alright?", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 06:52:00", 
        "title": "Mortgage the USA", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: EMINENT DOMAIN We can pull it China also after if we wish. What's to stop the goverment from doing Eminent Domain to China in a few years on the US holdings?", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "EMINENT DOMAIN", 
        "reply": " We can pull it China also after if we wish. What's to stop the goverment from doing Eminent Domain to China in a few years on the US holdings?", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 06:53:00", 
        "title": "Mortgage the USA", 
        "userID": "mainedawg"
    }, 
    {
        "content": "\"Neither a borrower nor a lender be.\" Any time someone takes out a loan, they must offer up collateral. That's just good business. We've been borrowing money from the Chinese and Europeans now for years and it's hardly suprising that they want assurances that their investment is sound. I suspect that the heavy involvement of European banks in our economy these days is something like collateral, but that's just my guess. In the case of China, if I were them I'd want the same thing. However, it's a bad idea and shouldn't be allowed. But, even if it is, the Chinese should be forewarned that any move to collect their \"collateral\" would lead in nationalizing Chinese assets in this country, and there are already plenty of them.", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "", 
        "reply": "\"Neither a borrower nor a lender be.\" Any time someone takes out a loan, they must offer up collateral. That's just good business. We've been borrowing money from the Chinese and Europeans now for years and it's hardly suprising that they want assurances that their investment is sound. I suspect that the heavy involvement of European banks in our economy these days is something like collateral, but that's just my guess. In the case of China, if I were them I'd want the same thing. However, it's a bad idea and shouldn't be allowed. But, even if it is, the Chinese should be forewarned that any move to collect their \"collateral\" would lead in nationalizing Chinese assets in this country, and there are already plenty of them.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 07:02:00", 
        "title": "Mortgage the USA", 
        "userID": "stillkit"
    }, 
    {
        "content": "This story is nonsense. There is no authority for the US government to grant foreign power the right of eminent domain.", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "", 
        "reply": "This story is nonsense. There is no authority for the US government to grant foreign power the right of eminent domain.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 07:03:00", 
        "title": "Mortgage the USA", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it. Your comments have been getting more and more bizarre lately. Are you alright? No not really. I have more aches and pains then a few years ago. I've gained weight. My shrink has increased my dosage of Lexipro and I'm just fed up with the direction this country is headed. I'm 60 now and I need to get away to a place that is far away from the daily bad news we hear everyday. Maybe New Zealand? The wife still has 5 years until retirement. By then my electric bill will be $500.00 a month and gas prices will be over $4.00 a gallon once again. We will still be in Iraq and Afghanistan and still be a Trillion or Six in debt. I'm a little depressed. I just need a Rum an Coke I guess.", 
        "intTime": 20090302, 
        "postID": 9, 
        "quote": "Originally posted by soscorpio: quote: I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it. Your comments have been getting more and more bizarre lately. Are you alright?", 
        "reply": " No not really. I have more aches and pains then a few years ago. I've gained weight. My shrink has increased my dosage of Lexipro and I'm just fed up with the direction this country is headed. I'm 60 now and I need to get away to a place that is far away from the daily bad news we hear everyday. Maybe New Zealand? The wife still has 5 years until retirement. By then my electric bill will be $500.00 a month and gas prices will be over $4.00 a gallon once again. We will still be in Iraq and Afghanistan and still be a Trillion or Six in debt. I'm a little depressed. I just need a Rum an Coke I guess.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 07:05:00", 
        "title": "Mortgage the USA", 
        "userID": "Duster6"
    }, 
    {
        "content": "Don't worry, be happy!", 
        "intTime": 20090302, 
        "postID": 10, 
        "quote": "", 
        "reply": "Don't worry, be happy!", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 07:14:00", 
        "title": "Mortgage the USA", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "I have heard rumors of this. I put them in the same category as the \"Fema concentration camps.\"", 
        "intTime": 20090302, 
        "postID": 11, 
        "quote": "", 
        "reply": "I have heard rumors of this. I put them in the same category as the \"Fema concentration camps.\"", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 11:52:00", 
        "title": "Mortgage the USA", 
        "userID": "R102"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by soscorpio: quote: I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it. Your comments have been getting more and more bizarre lately. Are you alright? No not really. I have more aches and pains then a few years ago. I've gained weight. My shrink has increased my dosage of Lexipro and I'm just fed up with the direction this country is headed. I'm 60 now and I need to get away to a place that is far away from the daily bad news we hear everyday. Maybe New Zealand? The wife still has 5 years until retirement. By then my electric bill will be $500.00 a month and gas prices will be over $4.00 a gallon once again. We will still be in Iraq and Afghanistan and still be a Trillion or Six in debt. I'm a little depressed. I just need a Rum an Coke I guess. New Zealand is tanking. I have family there and things are not looking so good. During the last depression NZ's population was just on a million people. There were 50K men traveling the nation looking for work. Even more people were out of work. Those 50k were just the ones wondering up and down the country. New Zealand is in many ways overrated. If I thought things were going to be better there than here I would have been there a year ago. NZ is about a year behind the rest of the world when it comes to the economy.", 
        "intTime": 20090302, 
        "postID": 12, 
        "quote": "Originally posted by Duster6: quote: Originally posted by soscorpio: quote: I would much rather see the Japanese take over the US instead of China. However, I'm sure that life and our Justice system would be much better for many than it is now. We had our shot and we blew it. Your comments have been getting more and more bizarre lately. Are you alright? No not really. I have more aches and pains then a few years ago. I've gained weight. My shrink has increased my dosage of Lexipro and I'm just fed up with the direction this country is headed. I'm 60 now and I need to get away to a place that is far away from the daily bad news we hear everyday. Maybe New Zealand? The wife still has 5 years until retirement. By then my electric bill will be $500.00 a month and gas prices will be over $4.00 a gallon once again. We will still be in Iraq and Afghanistan and still be a Trillion or Six in debt. I'm a little depressed. I just need a Rum an Coke I guess.", 
        "reply": " New Zealand is tanking. I have family there and things are not looking so good. During the last depression NZ's population was just on a million people. There were 50K men traveling the nation looking for work. Even more people were out of work. Those 50k were just the ones wondering up and down the country. New Zealand is in many ways overrated. If I thought things were going to be better there than here I would have been there a year ago. NZ is about a year behind the rest of the world when it comes to the economy.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 11:55:00", 
        "title": "Mortgage the USA", 
        "userID": "R102"
    }, 
    {
        "content": "OK, lets say China owns portions of the country.. and lets say everything continues to go south... and lets say China dedides to come claim what is thiers.... and we say no. What are they going to do? Invade? War? Noper, it is time to tell the world - \"all bets/loans are off - we're starting from scratch\" as should everyone else. The world will continue to turn...... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090302, 
        "postID": 13, 
        "quote": "", 
        "reply": "OK, lets say China owns portions of the country.. and lets say everything continues to go south... and lets say China dedides to come claim what is thiers.... and we say no. What are they going to do? Invade? War? Noper, it is time to tell the world - \"all bets/loans are off - we're starting from scratch\" as should everyone else. The world will continue to turn...... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 12:18:00", 
        "title": "Mortgage the USA", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by R102: quote: Originally posted by Duster6: R102 has a really good map of the planet with all of the various states and their current economic outlook as it relates to this recession. If you're looking for a good uneffected country to run off to and retire you might check it out over in the Economic Doom & Gloom thread.", 
        "intTime": 20090302, 
        "postID": 14, 
        "quote": "Originally posted by R102: quote: Originally posted by Duster6:", 
        "reply": " R102 has a really good map of the planet with all of the various states and their current economic outlook as it relates to this recession. If you're looking for a good uneffected country to run off to and retire you might check it out over in the Economic Doom & Gloom thread.", 
        "threadID": "409192893_4080056612001", 
        "time": "2009-03-02 12:19:00", 
        "title": "Mortgage the USA", 
        "userID": "floersh"
    }
]