[
    {
        "content": "quote: Originally posted by threerings: +++http://www.cnbc.com/id/29434104 Let me be very clear on the economics of President Obama’s State of the Union speech and his budget. He is declaring war on investors, entrepreneurs, small businesses, large corporations, and private-equity and venture-capital funds. We told you so? Color added by me. You believe this stuff right? Wow! So, you believe that President Obama went to Washington, went through all he did, risked his life (how many whackos out there do you think have dreamed of picking him off) so he could go to Washington and destroy the American economy right? Please, arguments should at least pass the common sense test before you embrace them as your own. He is picking up the pieces of a shattered economy left to him by the \"raping and pillaging\" of America by the recent administration. They worked over America like a swarm of locusts in a field. Now, the question is what do you do? Well, you have to get the economy moving and the private sector will not do that right now. The private sector (both the consumer and the companies) have retrenched and are in a spiral downward. Have you heard of the economic theory called \"The paradox of thrift\"? It essentially says that as a policy you want people to save and be thrifty. However, if EVERYONE saves and is thrifty, the economy goes into a depression. That is what we are experiencing here. In September, the banking system came within hours of a complete collapse. Since then, I believe it has barely been on life support. Citi is essentially bankrupt and been taken over by the Government. When the banks are in shambles then the mechanism by which money flows from the Fed to the public is broken. Think of it as a giant pipeline with a huge gash in it. You better think hard on this. The economy is dead and the only one who can save it whether your ideology likes it or not is the Government. Wait until the next shoe: Public Pensions are essentially bankrupt (yes, that means federal a.k.a. military), state and local. All those people who thought they were going to get a pension.. poof.. up in smoke in the last 8 years.", 
        "intTime": 20090301, 
        "postID": 11, 
        "quote": "Originally posted by threerings: +++http://www.cnbc.com/id/29434104 Let me be very clear on the economics of President Obama’s State of the Union speech and his budget. He is declaring war on investors, entrepreneurs, small businesses, large corporations, and private-equity and venture-capital funds. We told you so? Color added by me.", 
        "reply": " You believe this stuff right? Wow! So, you believe that President Obama went to Washington, went through all he did, risked his life (how many whackos out there do you think have dreamed of picking him off) so he could go to Washington and destroy the American economy right? Please, arguments should at least pass the common sense test before you embrace them as your own. He is picking up the pieces of a shattered economy left to him by the \"raping and pillaging\" of America by the recent administration. They worked over America like a swarm of locusts in a field. Now, the question is what do you do? Well, you have to get the economy moving and the private sector will not do that right now. The private sector (both the consumer and the companies) have retrenched and are in a spiral downward. Have you heard of the economic theory called \"The paradox of thrift\"? It essentially says that as a policy you want people to save and be thrifty. However, if EVERYONE saves and is thrifty, the economy goes into a depression. That is what we are experiencing here. In September, the banking system came within hours of a complete collapse. Since then, I believe it has barely been on life support. Citi is essentially bankrupt and been taken over by the Government. When the banks are in shambles then the mechanism by which money flows from the Fed to the public is broken. Think of it as a giant pipeline with a huge gash in it. You better think hard on this. The economy is dead and the only one who can save it whether your ideology likes it or not is the Government. Wait until the next shoe: Public Pensions are essentially bankrupt (yes, that means federal a.k.a. military), state and local. All those people who thought they were going to get a pension.. poof.. up in smoke in the last 8 years.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 16:51:00", 
        "title": "Obama declares war...", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: the obama presidency is turning into a joke with ads like this on the internet the man is a disaster for this country yea those things are all over facebook and myspace....", 
        "intTime": 20090301, 
        "postID": 12, 
        "quote": "Originally posted by Ira1945: the obama presidency is turning into a joke with ads like this on the internet the man is a disaster for this country", 
        "reply": " yea those things are all over facebook and myspace....", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 17:02:00", 
        "title": "Obama declares war...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "True,he is living up to his campaign promises...wow how about that ladies and gentlemen. The guy is doing what he ran on. Good for him... he looks like a stand up guy...even though I did not vote for him or Bush or Clinton", 
        "intTime": 20090301, 
        "postID": 13, 
        "quote": "", 
        "reply": "True,he is living up to his campaign promises...wow how about that ladies and gentlemen. The guy is doing what he ran on. Good for him... he looks like a stand up guy...even though I did not vote for him or Bush or Clinton", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 17:24:00", 
        "title": "Obama declares war...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Hey, I didn't write it Smile nope. An adviser to Ronny raygun did. And a man who said the economic crisis is BS and is \"overblown\". Is that suppose to be funny? Ronny raygun? Somebody needs to shake you out of that tree you're clinging so tightly... JMHO, I could be wrong...", 
        "intTime": 20090301, 
        "postID": 14, 
        "quote": "Originally posted by karlhungusjr: quote: Hey, I didn't write it Smile nope. An adviser to Ronny raygun did. And a man who said the economic crisis is BS and is \"overblown\".", 
        "reply": " Is that suppose to be funny? Ronny raygun? Somebody needs to shake you out of that tree you're clinging so tightly... JMHO, I could be wrong...", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 18:46:00", 
        "title": "Obama declares war...", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Is that suppose to be funny? Ronny raygun? It's not near as funny as the right wing worship of him.", 
        "intTime": 20090301, 
        "postID": 15, 
        "quote": "Is that suppose to be funny? Ronny raygun?", 
        "reply": " It's not near as funny as the right wing worship of him.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 21:15:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them? You gona give up your job for one of them to have a job? A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! Wandering and Wondering", 
        "intTime": 20090301, 
        "postID": 16, 
        "quote": "", 
        "reply": "When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them? You gona give up your job for one of them to have a job? A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! Wandering and Wondering", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 23:00:00", 
        "title": "Obama declares war...", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "yep...they'll be lookin for tories", 
        "intTime": 20090301, 
        "postID": 17, 
        "quote": "", 
        "reply": "yep...they'll be lookin for tories", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 23:05:00", 
        "title": "Obama declares war...", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them? the same place they were before they went to the middle east?", 
        "intTime": 20090301, 
        "postID": 18, 
        "quote": "When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them?", 
        "reply": " the same place they were before they went to the middle east?", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 23:08:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: yep...they'll be lookin for tories Your fascination with liberal veterans taking up arms against conservative veterans to masturbate your in own political suffocation is sickening and has ZERO place on a military-orientated board. You really need to seek some professional, expensive help. And spelling lessons. Seriously, man, that you like that idea of veterans coming home to no jobs because it strokes your conspiracy that all veterans are as disturbed in the mind as you is unhealthy. I'm a veteran, and if they'll be \"looking for tories,\" tell them to start right here at my house. Because political beliefs aside, a veteran is a veteran and they'll get a hug from me right before they fulfill your fascination with leaving my kids standing over my grave wondering why I was murdered over politics and a job I'd have given freely of my own will. While you mock their tears and applaud one less right winger on earth. I'm going to pray HARD for you, man, because prayer is the only hope you have. You should be banned from this board for advocating the murder of veterans. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 19, 
        "quote": "Originally posted by scottrj50: yep...they'll be lookin for tories", 
        "reply": " Your fascination with liberal veterans taking up arms against conservative veterans to masturbate your in own political suffocation is sickening and has ZERO place on a military-orientated board. You really need to seek some professional, expensive help. And spelling lessons. Seriously, man, that you like that idea of veterans coming home to no jobs because it strokes your conspiracy that all veterans are as disturbed in the mind as you is unhealthy. I'm a veteran, and if they'll be \"looking for tories,\" tell them to start right here at my house. Because political beliefs aside, a veteran is a veteran and they'll get a hug from me right before they fulfill your fascination with leaving my kids standing over my grave wondering why I was murdered over politics and a job I'd have given freely of my own will. While you mock their tears and applaud one less right winger on earth. I'm going to pray HARD for you, man, because prayer is the only hope you have. You should be banned from this board for advocating the murder of veterans. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 02:31:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: advocating the murder of veterans. did I miss something? where did you get that from?", 
        "intTime": 20090302, 
        "postID": 20, 
        "quote": "advocating the murder of veterans.", 
        "reply": " did I miss something? where did you get that from?", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 02:42:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: advocating the murder of veterans. did I miss something? where did you get that from? By knowing how to read in context. quote: greywolfghost A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! quote: scottrj50 yep...they'll be lookin for tories The correlation doesn't exactly require a graduate degree, especially if you do a search of his posts and recognize the venom and undertones of a VERY bitter person whose glee is gleaned in ways that men like you and I would never allow to pervade our sense of right and wrong. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "Originally posted by karlhungusjr: quote: advocating the murder of veterans. did I miss something? where did you get that from?", 
        "reply": " By knowing how to read in context. quote: greywolfghost A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! quote: scottrj50 yep...they'll be lookin for tories The correlation doesn't exactly require a graduate degree, especially if you do a search of his posts and recognize the venom and undertones of a VERY bitter person whose glee is gleaned in ways that men like you and I would never allow to pervade our sense of right and wrong. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 02:55:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\"", 
        "intTime": 20090302, 
        "postID": 22, 
        "quote": "", 
        "reply": "there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\"", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:02:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\" You're correct - there is a difference. And what I stated was in context. You failed to follow it, but that is neither my problem or my responsibility to educate you on. As I said, you're welcome to complete your own research. If you choose not to or you derive a different conclusion, then that's fine, too. Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. Regardless, I usually enjoy a bit of bitter discourse - get the blood pumping, fire a little here, fire a little back over there. But ANY avocation, no matter how \"cleverly\" disguised ( ) , of ANY violence against veterans, especially by other veterans, is NOT the military I served in. It's only keeping us all separated and the politicians in complete control, where the (R) and (D) monikers mean nothing in the scope of money and power. But FAR more disturbing than that is the mere suggestion that one veteran uses a smiley face after suggesting that vets are coming for vets - tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) are veterans, too. It's not hard when you take off the partisan glasses. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 23, 
        "quote": "Originally posted by karlhungusjr: there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\"", 
        "reply": " You're correct - there is a difference. And what I stated was in context. You failed to follow it, but that is neither my problem or my responsibility to educate you on. As I said, you're welcome to complete your own research. If you choose not to or you derive a different conclusion, then that's fine, too. Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. Regardless, I usually enjoy a bit of bitter discourse - get the blood pumping, fire a little here, fire a little back over there. But ANY avocation, no matter how \"cleverly\" disguised ( ) , of ANY violence against veterans, especially by other veterans, is NOT the military I served in. It's only keeping us all separated and the politicians in complete control, where the (R) and (D) monikers mean nothing in the scope of money and power. But FAR more disturbing than that is the mere suggestion that one veteran uses a smiley face after suggesting that vets are coming for vets - tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) are veterans, too. It's not hard when you take off the partisan glasses. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:18:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics. I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) And I have no idea what you mean by this.", 
        "intTime": 20090302, 
        "postID": 24, 
        "quote": "Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong.", 
        "reply": " I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics. I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) And I have no idea what you mean by this.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:26:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics. OK, snarky it is! My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps. quote: Originally posted by karlhungusjr: I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. quote: Originally posted by karlhungusjr:Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) quote: Originally posted by karlhungusjr: And I have no idea what you mean by this. Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I envision a civilian reading this crap and thinking, Wow, I guess the rumors are true and people in the military really ARE too stupid to do anything else. Bunch of f-ing baby killing robot morons... A pet peeve, if you will. The ability to articulate isn't hard. I never graduated 7th grade, and I can talk in text just fine. If I can do it, anyone can do it, because I am one dumb SOB. It is pure childishness that someone would use \"DemoRat.\" It just tells me that they have nothing substantial to add and are in the thread to incite slapping contests, rather than working through issues. And while we can't change the world by typing here, we can at LEAST hear each other out and try and work together for our country and our dedication to service of the nation. I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. You are, of course, both welcome to and encouraged to disagree. I can't learn from people that \"mmm hmmm\" me to death. I learn from people who disagree with me and present a rational argument, just as WP swayed my stance on universal health care and (GULP!) took this conservative and made me a supporter. Kind of like you learn to aim by smacking your thumb with a hammer, LOL! Have a great morning, bro, and stay safe! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 25, 
        "quote": "Originally posted by karlhungusjr: quote: Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics.", 
        "reply": " OK, snarky it is! My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps. quote: Originally posted by karlhungusjr: I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. quote: Originally posted by karlhungusjr:Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) quote: Originally posted by karlhungusjr: And I have no idea what you mean by this. Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I envision a civilian reading this crap and thinking, Wow, I guess the rumors are true and people in the military really ARE too stupid to do anything else. Bunch of f-ing baby killing robot morons... A pet peeve, if you will. The ability to articulate isn't hard. I never graduated 7th grade, and I can talk in text just fine. If I can do it, anyone can do it, because I am one dumb SOB. It is pure childishness that someone would use \"DemoRat.\" It just tells me that they have nothing substantial to add and are in the thread to incite slapping contests, rather than working through issues. And while we can't change the world by typing here, we can at LEAST hear each other out and try and work together for our country and our dedication to service of the nation. I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. You are, of course, both welcome to and encouraged to disagree. I can't learn from people that \"mmm hmmm\" me to death. I learn from people who disagree with me and present a rational argument, just as WP swayed my stance on universal health care and (GULP!) took this conservative and made me a supporter. Kind of like you learn to aim by smacking your thumb with a hammer, LOL! Have a great morning, bro, and stay safe! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:52:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps. If the berating was called for I would join in. regardless of what political affiliation the person saying it holds. I enjoy arguing politics/controversial issues/etc.. But I'm not a blind party loyalist. I don't feel that I need to defend or attack someone based on what party they belong to. I like to see other peoples opinions and give my own. Any \"attacks\" by me are when I see BS and I call it BS.Want to debate tax policy? Great! lets do it!. want to claim obama is a secret muslim terrorist? um...no. I'm going to call BS. quote: Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. then it just sounds like you have a personal beef then. Because I sure didn't see that from his comment. you did. fair enough. I don't look up someones posting history before i respond to a comment. I just respond to a comment. If the guy was a ****** before and said things like \"vets should kill vets\" then I'm 100% wrong here and would gladly agree that what he said was wrong. But I haven't seen anything like that. quote: Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I agree 100%. quote: I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. I don't care for trolls either. but again, I don't look up posters history. So unless the post when I'm on (night shift) or post a LOT, I usually won't know. quote: Have a great morning, bro, and stay safe! you too.", 
        "intTime": 20090302, 
        "postID": 26, 
        "quote": "My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps.", 
        "reply": " If the berating was called for I would join in. regardless of what political affiliation the person saying it holds. I enjoy arguing politics/controversial issues/etc.. But I'm not a blind party loyalist. I don't feel that I need to defend or attack someone based on what party they belong to. I like to see other peoples opinions and give my own. Any \"attacks\" by me are when I see BS and I call it BS.Want to debate tax policy? Great! lets do it!. want to claim obama is a secret muslim terrorist? um...no. I'm going to call BS. quote: Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. then it just sounds like you have a personal beef then. Because I sure didn't see that from his comment. you did. fair enough. I don't look up someones posting history before i respond to a comment. I just respond to a comment. If the guy was a ****** before and said things like \"vets should kill vets\" then I'm 100% wrong here and would gladly agree that what he said was wrong. But I haven't seen anything like that. quote: Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I agree 100%. quote: I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. I don't care for trolls either. but again, I don't look up posters history. So unless the post when I'm on (night shift) or post a LOT, I usually won't know. quote: Have a great morning, bro, and stay safe! you too.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 04:10:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt.", 
        "intTime": 20090302, 
        "postID": 27, 
        "quote": "", 
        "reply": "Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 05:49:00", 
        "title": "Obama declares war...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please.", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt.", 
        "reply": " Explain \"gas herad\" please.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 06:05:00", 
        "title": "Obama declares war...", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please. 'Has Heard' anything else?", 
        "intTime": 20090303, 
        "postID": 29, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please.", 
        "reply": " 'Has Heard' anything else?", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-03 08:13:00", 
        "title": "Obama declares war...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please. 'Has Heard' anything else? No, Gunnery Sgt! My only advice would be milk on your Wheaties instead of Jim Beam.", 
        "intTime": 20090303, 
        "postID": 30, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please. 'Has Heard' anything else?", 
        "reply": " No, Gunnery Sgt! My only advice would be milk on your Wheaties instead of Jim Beam.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-03 08:19:00", 
        "title": "Obama declares war...", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.cnbc.com/id/29434104 Let me be very clear on the economics of President Obama’s State of the Union speech and his budget. He is declaring war on investors, entrepreneurs, small businesses, large corporations, and private-equity and venture-capital funds. We told you so? Color added by me. You believe this stuff right? Wow! So, you believe that President Obama went to Washington, went through all he did, risked his life (how many whackos out there do you think have dreamed of picking him off) so he could go to Washington and destroy the American economy right? Please, arguments should at least pass the common sense test before you embrace them as your own. He is picking up the pieces of a shattered economy left to him by the \"raping and pillaging\" of America by the recent administration. They worked over America like a swarm of locusts in a field. Now, the question is what do you do? Well, you have to get the economy moving and the private sector will not do that right now. The private sector (both the consumer and the companies) have retrenched and are in a spiral downward. Have you heard of the economic theory called \"The paradox of thrift\"? It essentially says that as a policy you want people to save and be thrifty. However, if EVERYONE saves and is thrifty, the economy goes into a depression. That is what we are experiencing here. In September, the banking system came within hours of a complete collapse. Since then, I believe it has barely been on life support. Citi is essentially bankrupt and been taken over by the Government. When the banks are in shambles then the mechanism by which money flows from the Fed to the public is broken. Think of it as a giant pipeline with a huge gash in it. You better think hard on this. The economy is dead and the only one who can save it whether your ideology likes it or not is the Government. Wait until the next shoe: Public Pensions are essentially bankrupt (yes, that means federal a.k.a. military), state and local. All those people who thought they were going to get a pension.. poof.. up in smoke in the last 8 years.", 
        "intTime": 20090301, 
        "postID": 41, 
        "quote": "Originally posted by threerings: +++http://www.cnbc.com/id/29434104 Let me be very clear on the economics of President Obama’s State of the Union speech and his budget. He is declaring war on investors, entrepreneurs, small businesses, large corporations, and private-equity and venture-capital funds. We told you so? Color added by me.", 
        "reply": " You believe this stuff right? Wow! So, you believe that President Obama went to Washington, went through all he did, risked his life (how many whackos out there do you think have dreamed of picking him off) so he could go to Washington and destroy the American economy right? Please, arguments should at least pass the common sense test before you embrace them as your own. He is picking up the pieces of a shattered economy left to him by the \"raping and pillaging\" of America by the recent administration. They worked over America like a swarm of locusts in a field. Now, the question is what do you do? Well, you have to get the economy moving and the private sector will not do that right now. The private sector (both the consumer and the companies) have retrenched and are in a spiral downward. Have you heard of the economic theory called \"The paradox of thrift\"? It essentially says that as a policy you want people to save and be thrifty. However, if EVERYONE saves and is thrifty, the economy goes into a depression. That is what we are experiencing here. In September, the banking system came within hours of a complete collapse. Since then, I believe it has barely been on life support. Citi is essentially bankrupt and been taken over by the Government. When the banks are in shambles then the mechanism by which money flows from the Fed to the public is broken. Think of it as a giant pipeline with a huge gash in it. You better think hard on this. The economy is dead and the only one who can save it whether your ideology likes it or not is the Government. Wait until the next shoe: Public Pensions are essentially bankrupt (yes, that means federal a.k.a. military), state and local. All those people who thought they were going to get a pension.. poof.. up in smoke in the last 8 years.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 16:51:00", 
        "title": "Obama declares war...", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: the obama presidency is turning into a joke with ads like this on the internet the man is a disaster for this country yea those things are all over facebook and myspace....", 
        "intTime": 20090301, 
        "postID": 42, 
        "quote": "Originally posted by Ira1945: the obama presidency is turning into a joke with ads like this on the internet the man is a disaster for this country", 
        "reply": " yea those things are all over facebook and myspace....", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 17:02:00", 
        "title": "Obama declares war...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "True,he is living up to his campaign promises...wow how about that ladies and gentlemen. The guy is doing what he ran on. Good for him... he looks like a stand up guy...even though I did not vote for him or Bush or Clinton", 
        "intTime": 20090301, 
        "postID": 43, 
        "quote": "", 
        "reply": "True,he is living up to his campaign promises...wow how about that ladies and gentlemen. The guy is doing what he ran on. Good for him... he looks like a stand up guy...even though I did not vote for him or Bush or Clinton", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 17:24:00", 
        "title": "Obama declares war...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Hey, I didn't write it Smile nope. An adviser to Ronny raygun did. And a man who said the economic crisis is BS and is \"overblown\". Is that suppose to be funny? Ronny raygun? Somebody needs to shake you out of that tree you're clinging so tightly... JMHO, I could be wrong...", 
        "intTime": 20090301, 
        "postID": 44, 
        "quote": "Originally posted by karlhungusjr: quote: Hey, I didn't write it Smile nope. An adviser to Ronny raygun did. And a man who said the economic crisis is BS and is \"overblown\".", 
        "reply": " Is that suppose to be funny? Ronny raygun? Somebody needs to shake you out of that tree you're clinging so tightly... JMHO, I could be wrong...", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 18:46:00", 
        "title": "Obama declares war...", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Is that suppose to be funny? Ronny raygun? It's not near as funny as the right wing worship of him.", 
        "intTime": 20090301, 
        "postID": 45, 
        "quote": "Is that suppose to be funny? Ronny raygun?", 
        "reply": " It's not near as funny as the right wing worship of him.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 21:15:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them? You gona give up your job for one of them to have a job? A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! Wandering and Wondering", 
        "intTime": 20090301, 
        "postID": 46, 
        "quote": "", 
        "reply": "When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them? You gona give up your job for one of them to have a job? A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! Wandering and Wondering", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 23:00:00", 
        "title": "Obama declares war...", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "yep...they'll be lookin for tories", 
        "intTime": 20090301, 
        "postID": 47, 
        "quote": "", 
        "reply": "yep...they'll be lookin for tories", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 23:05:00", 
        "title": "Obama declares war...", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them? the same place they were before they went to the middle east?", 
        "intTime": 20090301, 
        "postID": 48, 
        "quote": "When he brings home the 500,000 to 1,000,000 troops we have in the Middle East, where is he going to put them?", 
        "reply": " the same place they were before they went to the middle east?", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-01 23:08:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: yep...they'll be lookin for tories Your fascination with liberal veterans taking up arms against conservative veterans to masturbate your in own political suffocation is sickening and has ZERO place on a military-orientated board. You really need to seek some professional, expensive help. And spelling lessons. Seriously, man, that you like that idea of veterans coming home to no jobs because it strokes your conspiracy that all veterans are as disturbed in the mind as you is unhealthy. I'm a veteran, and if they'll be \"looking for tories,\" tell them to start right here at my house. Because political beliefs aside, a veteran is a veteran and they'll get a hug from me right before they fulfill your fascination with leaving my kids standing over my grave wondering why I was murdered over politics and a job I'd have given freely of my own will. While you mock their tears and applaud one less right winger on earth. I'm going to pray HARD for you, man, because prayer is the only hope you have. You should be banned from this board for advocating the murder of veterans. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 49, 
        "quote": "Originally posted by scottrj50: yep...they'll be lookin for tories", 
        "reply": " Your fascination with liberal veterans taking up arms against conservative veterans to masturbate your in own political suffocation is sickening and has ZERO place on a military-orientated board. You really need to seek some professional, expensive help. And spelling lessons. Seriously, man, that you like that idea of veterans coming home to no jobs because it strokes your conspiracy that all veterans are as disturbed in the mind as you is unhealthy. I'm a veteran, and if they'll be \"looking for tories,\" tell them to start right here at my house. Because political beliefs aside, a veteran is a veteran and they'll get a hug from me right before they fulfill your fascination with leaving my kids standing over my grave wondering why I was murdered over politics and a job I'd have given freely of my own will. While you mock their tears and applaud one less right winger on earth. I'm going to pray HARD for you, man, because prayer is the only hope you have. You should be banned from this board for advocating the murder of veterans. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 02:31:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: advocating the murder of veterans. did I miss something? where did you get that from?", 
        "intTime": 20090302, 
        "postID": 50, 
        "quote": "advocating the murder of veterans.", 
        "reply": " did I miss something? where did you get that from?", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 02:42:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: advocating the murder of veterans. did I miss something? where did you get that from? By knowing how to read in context. quote: greywolfghost A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! quote: scottrj50 yep...they'll be lookin for tories The correlation doesn't exactly require a graduate degree, especially if you do a search of his posts and recognize the venom and undertones of a VERY bitter person whose glee is gleaned in ways that men like you and I would never allow to pervade our sense of right and wrong. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 51, 
        "quote": "Originally posted by karlhungusjr: quote: advocating the murder of veterans. did I miss something? where did you get that from?", 
        "reply": " By knowing how to read in context. quote: greywolfghost A million young people coming home to no jobs - a million young people who have been taught how to fight and kill, and they end up on the street, and start to get hungry - That is a nasty combination, Obama and Obamaites - - Nasty indeed!! quote: scottrj50 yep...they'll be lookin for tories The correlation doesn't exactly require a graduate degree, especially if you do a search of his posts and recognize the venom and undertones of a VERY bitter person whose glee is gleaned in ways that men like you and I would never allow to pervade our sense of right and wrong. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 02:55:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\"", 
        "intTime": 20090302, 
        "postID": 52, 
        "quote": "", 
        "reply": "there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\"", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:02:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\" You're correct - there is a difference. And what I stated was in context. You failed to follow it, but that is neither my problem or my responsibility to educate you on. As I said, you're welcome to complete your own research. If you choose not to or you derive a different conclusion, then that's fine, too. Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. Regardless, I usually enjoy a bit of bitter discourse - get the blood pumping, fire a little here, fire a little back over there. But ANY avocation, no matter how \"cleverly\" disguised ( ) , of ANY violence against veterans, especially by other veterans, is NOT the military I served in. It's only keeping us all separated and the politicians in complete control, where the (R) and (D) monikers mean nothing in the scope of money and power. But FAR more disturbing than that is the mere suggestion that one veteran uses a smiley face after suggesting that vets are coming for vets - tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) are veterans, too. It's not hard when you take off the partisan glasses. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 53, 
        "quote": "Originally posted by karlhungusjr: there's a difference between context and pulling things out of your a**(or just plain old over reacting.) for the life of me I can't figure out how you got \"liberal veterans taking up arms against conservative veterans\" and \"advocating the murder of veterans.\" from \"yep...they'll be lookin for tories\"", 
        "reply": " You're correct - there is a difference. And what I stated was in context. You failed to follow it, but that is neither my problem or my responsibility to educate you on. As I said, you're welcome to complete your own research. If you choose not to or you derive a different conclusion, then that's fine, too. Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. Regardless, I usually enjoy a bit of bitter discourse - get the blood pumping, fire a little here, fire a little back over there. But ANY avocation, no matter how \"cleverly\" disguised ( ) , of ANY violence against veterans, especially by other veterans, is NOT the military I served in. It's only keeping us all separated and the politicians in complete control, where the (R) and (D) monikers mean nothing in the scope of money and power. But FAR more disturbing than that is the mere suggestion that one veteran uses a smiley face after suggesting that vets are coming for vets - tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) are veterans, too. It's not hard when you take off the partisan glasses. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:18:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics. I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) And I have no idea what you mean by this.", 
        "intTime": 20090302, 
        "postID": 54, 
        "quote": "Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong.", 
        "reply": " I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics. I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) And I have no idea what you mean by this.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:26:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics. OK, snarky it is! My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps. quote: Originally posted by karlhungusjr: I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. quote: Originally posted by karlhungusjr:Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) quote: Originally posted by karlhungusjr: And I have no idea what you mean by this. Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I envision a civilian reading this crap and thinking, Wow, I guess the rumors are true and people in the military really ARE too stupid to do anything else. Bunch of f-ing baby killing robot morons... A pet peeve, if you will. The ability to articulate isn't hard. I never graduated 7th grade, and I can talk in text just fine. If I can do it, anyone can do it, because I am one dumb SOB. It is pure childishness that someone would use \"DemoRat.\" It just tells me that they have nothing substantial to add and are in the thread to incite slapping contests, rather than working through issues. And while we can't change the world by typing here, we can at LEAST hear each other out and try and work together for our country and our dedication to service of the nation. I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. You are, of course, both welcome to and encouraged to disagree. I can't learn from people that \"mmm hmmm\" me to death. I learn from people who disagree with me and present a rational argument, just as WP swayed my stance on universal health care and (GULP!) took this conservative and made me a supporter. Kind of like you learn to aim by smacking your thumb with a hammer, LOL! Have a great morning, bro, and stay safe! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090302, 
        "postID": 55, 
        "quote": "Originally posted by karlhungusjr: quote: Your replies are usually acidic in nature, so I suspect that my political leanings will equate me in your eyes with some perpetual wrong. I prefer the term \"snarky\" over \"acidic\". But either way, my comment has nothing to do with your politics.", 
        "reply": " OK, snarky it is! My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps. quote: Originally posted by karlhungusjr: I'm honestly confused as to how you got \"he wants vets to kill vets!\" from that comment. Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. quote: Originally posted by karlhungusjr:Are you talking about the British political party? Those Americans who remained loyal to the king? What historical incident are you referring to where \"veterans killed veterans\"? Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. quote: tonies (God I had talking like a freaking third grader - doesn't the Navy teach you all anything about the dignity found in adult expression?) quote: Originally posted by karlhungusjr: And I have no idea what you mean by this. Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I envision a civilian reading this crap and thinking, Wow, I guess the rumors are true and people in the military really ARE too stupid to do anything else. Bunch of f-ing baby killing robot morons... A pet peeve, if you will. The ability to articulate isn't hard. I never graduated 7th grade, and I can talk in text just fine. If I can do it, anyone can do it, because I am one dumb SOB. It is pure childishness that someone would use \"DemoRat.\" It just tells me that they have nothing substantial to add and are in the thread to incite slapping contests, rather than working through issues. And while we can't change the world by typing here, we can at LEAST hear each other out and try and work together for our country and our dedication to service of the nation. I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. You are, of course, both welcome to and encouraged to disagree. I can't learn from people that \"mmm hmmm\" me to death. I learn from people who disagree with me and present a rational argument, just as WP swayed my stance on universal health care and (GULP!) took this conservative and made me a supporter. Kind of like you learn to aim by smacking your thumb with a hammer, LOL! Have a great morning, bro, and stay safe! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 03:52:00", 
        "title": "Obama declares war...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps. If the berating was called for I would join in. regardless of what political affiliation the person saying it holds. I enjoy arguing politics/controversial issues/etc.. But I'm not a blind party loyalist. I don't feel that I need to defend or attack someone based on what party they belong to. I like to see other peoples opinions and give my own. Any \"attacks\" by me are when I see BS and I call it BS.Want to debate tax policy? Great! lets do it!. want to claim obama is a secret muslim terrorist? um...no. I'm going to call BS. quote: Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. then it just sounds like you have a personal beef then. Because I sure didn't see that from his comment. you did. fair enough. I don't look up someones posting history before i respond to a comment. I just respond to a comment. If the guy was a ****** before and said things like \"vets should kill vets\" then I'm 100% wrong here and would gladly agree that what he said was wrong. But I haven't seen anything like that. quote: Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I agree 100%. quote: I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. I don't care for trolls either. but again, I don't look up posters history. So unless the post when I'm on (night shift) or post a LOT, I usually won't know. quote: Have a great morning, bro, and stay safe! you too.", 
        "intTime": 20090302, 
        "postID": 56, 
        "quote": "My point was that I doubt there is any way you'd agree with me berating one of your political bedfellows given your posting history. Perhaps I am not correct. I doubt it, but perhaps.", 
        "reply": " If the berating was called for I would join in. regardless of what political affiliation the person saying it holds. I enjoy arguing politics/controversial issues/etc.. But I'm not a blind party loyalist. I don't feel that I need to defend or attack someone based on what party they belong to. I like to see other peoples opinions and give my own. Any \"attacks\" by me are when I see BS and I call it BS.Want to debate tax policy? Great! lets do it!. want to claim obama is a secret muslim terrorist? um...no. I'm going to call BS. quote: Then remain that way and we'll drop it. You don't see what I do, which is fine. But I believe the context of his comments speak very clearly. When you look at what he was replying to, the smiley face he used, the manner in which he worded it, and his history of absolute HATRED of anything on the right side of the scale... well, the jury doesn't need to deliberate for long. If you choose to ignore certain facts to concentrate on others, then that is your choice and you don't have context. All things considered, his intent is crystal clear. Huh? No. I wasn't waxing historical at all. I'll go back and re-read, but I don't recall using anything like \"again\" or \"history\" or anything else relating to the military v. the military. The history I addressed was his, Scott's, posting history to validate his poisonous detest for those that do not agree with his political views. Unless he was a member of the British Political Party, I wasn't in any way attempting to suggest that America has a past of veterans against veterans. then it just sounds like you have a personal beef then. Because I sure didn't see that from his comment. you did. fair enough. I don't look up someones posting history before i respond to a comment. I just respond to a comment. If the guy was a ****** before and said things like \"vets should kill vets\" then I'm 100% wrong here and would gladly agree that what he said was wrong. But I haven't seen anything like that. quote: Sure you do, though I erred when I said \"you all.\" For that I do apologize. It just bugs the ever living crap out me when people act like children and call names like 5th graders in the school sandbox. Dumorat! Tonies! Neocon! Osama! McSame! And on... and on... and on... and on... I agree 100%. quote: I see nothing even remotely similar to that in name calling or in any single Scottrj50 post. Nothing. He is here only to gloat in Mr. Obama's win and stir the pot. And I find that contemptible. I don't care for trolls either. but again, I don't look up posters history. So unless the post when I'm on (night shift) or post a LOT, I usually won't know. quote: Have a great morning, bro, and stay safe! you too.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 04:10:00", 
        "title": "Obama declares war...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt.", 
        "intTime": 20090302, 
        "postID": 57, 
        "quote": "", 
        "reply": "Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 05:49:00", 
        "title": "Obama declares war...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please.", 
        "intTime": 20090302, 
        "postID": 58, 
        "quote": "Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt.", 
        "reply": " Explain \"gas herad\" please.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-02 06:05:00", 
        "title": "Obama declares war...", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please. 'Has Heard' anything else?", 
        "intTime": 20090303, 
        "postID": 59, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please.", 
        "reply": " 'Has Heard' anything else?", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-03 08:13:00", 
        "title": "Obama declares war...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please. 'Has Heard' anything else? No, Gunnery Sgt! My only advice would be milk on your Wheaties instead of Jim Beam.", 
        "intTime": 20090303, 
        "postID": 60, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Thud357L: quote: Originally posted by GunnyRet03: Next up, ending world poverty....more taxes. he is meeting with Brown from GB. I know Brown gas herad of the Irish Miracle, I know Obama hasnt. Explain \"gas herad\" please. 'Has Heard' anything else?", 
        "reply": " No, Gunnery Sgt! My only advice would be milk on your Wheaties instead of Jim Beam.", 
        "threadID": "409192893_3760094612001", 
        "time": "2009-03-03 08:19:00", 
        "title": "Obama declares war...", 
        "userID": "Thud357L"
    }
]