[
    {
        "content": "\"http://www.williamkwolfrum.com/2009/05/27/statement-from-william-k-wolfrum-we-white-men-are-now-an-infinitesimally-oppressed-slightly-less-powerful-majority/\" quote: “My friends, for many years, I have lived a life of divine privilege. By birthright, I was special - white as all get out and as male as could be. Basically, I hit the genetic lottery, and grew to be secure in the fact that all rights available to a human belonged to me. But those days have come to and end, and with them, a tiny percentage of my hopes and dreams. You see, in just over six months, the United States has seen a black man be elected President of the United States, and a Latin woman be nominated for Supreme Court. My friends, these jobs were once the sole property of men like me. White men. White men who didn’t care about non-white men, and didn’t have to because we’re white. But those times are changing. And I am frightened. Now, sure, I understand there are white men out there that will help white men like myself bridge the infinitesimally small new gap. I also understand that white men still make up 90 percent or more of Congress, and roughly 100 percent of the mainstream media. But these privileges are no longer purely a given, and in fact have the unseemly feel of large-partism just thrown our way by the minorly less impotent minority class. Because, you see, not that long ago, when a Supreme Court seat opened up, I had the warm comfort of knowing that I - with no law experience whatsoever - had a much better chance at becoming a Supreme Court Justice than a woman with a Puerto Rican heritage. A woman who would have never even have been given the opportunity to gain law experience not so long ago. But now, I feel the same oppression as the blacks that were enslaved in the U.S., and the Native Americans who were slaughtered. I am now part of an oppressed, negligibly less powerful majority. So what happens to me now? This year the Supreme Court is off limits to a white, non-law-practicing male like myself. And the Presidency is now firmly in the hands of someone who lacks the comforting whiteness that I and my fellow white men have come to accept as the norm. As someone who once had limitless opportunities, I now find the ease of which I could stumble into those opportunities limited ever-so slightly. But I believe that we White men can come back and reclaim the absolute and complete power we once held. We must begin our own civil rights struggle. We must take to the streets. It is time for a white male movement. I believe it is time for white men to get together and form an organization that fights for our needs. In keeping with this new “Enlarge the Gap” movement, we should dress uniformly, perhaps in all white to further enhance our whiteness. Let me tell you, organization is key. And while the triflingly more powerful minorities of this nation may scoff at a large, well-organized group of white men marching the streets dressed in white with torches, for we white males it will be the type of thing that empowers us. Because the ruling, pampered minorities do not understand what an angry group of vaguely oppressed white men can accomplish. They have no historical perspective, at least as far as I learned at the private school I attended. They see us only as extremely powerful, but not God-like any longer. This tiny, almost unnoticeable gap between deity and hyper-powerful is a gap we must close. We must fight. Today, a white male child will be born into an oppressive society where the color of his skin will only be a great advantage, not an incomprehensibly powerful advantage. That child will see that there is now extra competition out there between himself and his dreams. That child will be born into a society that - while understanding his cultural values and belief systems - will no longer automatically fearfully submit to them. That child will be destined for a life of dreams and promises that will only very likely be fulfilled. The guarantee is now gone, and we must get it back. My white male friends, we shall overcome. We are a theoretically oppressed majority, but our voices can be heard. White men, spit the imperceptibly less silver spoon from your mouths and yell to the skies “The White Man will rise again! Power to the white male.” Thank you, and I have retained counsel, several bodyguards, a maid, hairstylist and personal valet on this matter.” Satirical humor from William K. Wolfrum. But remember, in all humor there is an element of truth - and there will be those who will read his comments and say \"He's right\" rather than say \"That's funny\".", 
        "intTime": 20090530, 
        "postID": 1, 
        "quote": "“My friends, for many years, I have lived a life of divine privilege. By birthright, I was special - white as all get out and as male as could be. Basically, I hit the genetic lottery, and grew to be secure in the fact that all rights available to a human belonged to me. But those days have come to and end, and with them, a tiny percentage of my hopes and dreams. You see, in just over six months, the United States has seen a black man be elected President of the United States, and a Latin woman be nominated for Supreme Court. My friends, these jobs were once the sole property of men like me. White men. White men who didn’t care about non-white men, and didn’t have to because we’re white. But those times are changing. And I am frightened. Now, sure, I understand there are white men out there that will help white men like myself bridge the infinitesimally small new gap. I also understand that white men still make up 90 percent or more of Congress, and roughly 100 percent of the mainstream media. But these privileges are no longer purely a given, and in fact have the unseemly feel of large-partism just thrown our way by the minorly less impotent minority class. Because, you see, not that long ago, when a Supreme Court seat opened up, I had the warm comfort of knowing that I - with no law experience whatsoever - had a much better chance at becoming a Supreme Court Justice than a woman with a Puerto Rican heritage. A woman who would have never even have been given the opportunity to gain law experience not so long ago. But now, I feel the same oppression as the blacks that were enslaved in the U.S., and the Native Americans who were slaughtered. I am now part of an oppressed, negligibly less powerful majority. So what happens to me now? This year the Supreme Court is off limits to a white, non-law-practicing male like myself. And the Presidency is now firmly in the hands of someone who lacks the comforting whiteness that I and my fellow white men have come to accept as the norm. As someone who once had limitless opportunities, I now find the ease of which I could stumble into those opportunities limited ever-so slightly. But I believe that we White men can come back and reclaim the absolute and complete power we once held. We must begin our own civil rights struggle. We must take to the streets. It is time for a white male movement. I believe it is time for white men to get together and form an organization that fights for our needs. In keeping with this new “Enlarge the Gap” movement, we should dress uniformly, perhaps in all white to further enhance our whiteness. Let me tell you, organization is key. And while the triflingly more powerful minorities of this nation may scoff at a large, well-organized group of white men marching the streets dressed in white with torches, for we white males it will be the type of thing that empowers us. Because the ruling, pampered minorities do not understand what an angry group of vaguely oppressed white men can accomplish. They have no historical perspective, at least as far as I learned at the private school I attended. They see us only as extremely powerful, but not God-like any longer. This tiny, almost unnoticeable gap between deity and hyper-powerful is a gap we must close. We must fight. Today, a white male child will be born into an oppressive society where the color of his skin will only be a great advantage, not an incomprehensibly powerful advantage. That child will see that there is now extra competition out there between himself and his dreams. That child will be born into a society that - while understanding his cultural values and belief systems - will no longer automatically fearfully submit to them. That child will be destined for a life of dreams and promises that will only very likely be fulfilled. The guarantee is now gone, and we must get it back. My white male friends, we shall overcome. We are a theoretically oppressed majority, but our voices can be heard. White men, spit the imperceptibly less silver spoon from your mouths and yell to the skies “The White Man will rise again! Power to the white male.” Thank you, and I have retained counsel, several bodyguards, a maid, hairstylist and personal valet on this matter.”", 
        "reply": "\"http://www.williamkwolfrum.com/2009/05/27/statement-from-william-k-wolfrum-we-white-men-are-now-an-infinitesimally-oppressed-slightly-less-powerful-majority/\"  Satirical humor from William K. Wolfrum. But remember, in all humor there is an element of truth - and there will be those who will read his comments and say \"He's right\" rather than say \"That's funny\".", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 07:18:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "This is satirical, yes...but some people actually believe this...I heard a few of them calling radio stations yesterday.", 
        "intTime": 20090530, 
        "postID": 2, 
        "quote": "", 
        "reply": "This is satirical, yes...but some people actually believe this...I heard a few of them calling radio stations yesterday.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 07:53:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "", 
        "reply": "I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 07:56:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "I never cared for it, myself, but then again, I don't like reverse discrimination either, in which, I have been a victim. It was called \"affirmitive action\".", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "", 
        "reply": "I never cared for it, myself, but then again, I don't like reverse discrimination either, in which, I have been a victim. It was called \"affirmitive action\".", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:02:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I know Rush Limbaugh thinks conservatives are an opressed minority.", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "", 
        "reply": "I know Rush Limbaugh thinks conservatives are an opressed minority.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:06:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The only real question is why is this race baiting thread being allowed?", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "", 
        "reply": "The only real question is why is this race baiting thread being allowed?", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:08:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. All this sort of race baiting \"humor\" manages to accomplish is to keep things agitated with artificially inflamed passions.", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "", 
        "reply": "Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. All this sort of race baiting \"humor\" manages to accomplish is to keep things agitated with artificially inflamed passions.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:14:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 8, 
        "quote": "Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed?", 
        "reply": " So activist can gloat I guess. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:15:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "intTime": 20090530, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess.", 
        "reply": " If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:17:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No arguement here Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "reply": " No arguement here Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:50:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way.", 
        "intTime": 20090530, 
        "postID": 11, 
        "quote": "", 
        "reply": "HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:04:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male...", 
        "intTime": 20090530, 
        "postID": 12, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "reply": " No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male...", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:06:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Tangler"
    }, 
    {
        "content": "I worked and lived in Africa for more than six months and loved it. 31 white men and more than 600 black men. The only black men that I don't like are politicians who put money in their freezers, those with tattoos in prison, and the ones that wear pink colored Yankee hats sideways or backwards with their pants hanging around their knees. All the rest I can live with.", 
        "intTime": 20090530, 
        "postID": 13, 
        "quote": "", 
        "reply": "I worked and lived in Africa for more than six months and loved it. 31 white men and more than 600 black men. The only black men that I don't like are politicians who put money in their freezers, those with tattoos in prison, and the ones that wear pink colored Yankee hats sideways or backwards with their pants hanging around their knees. All the rest I can live with.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:07:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster...! Growing up in DC my Dad was in the Navy...our neighborhood was 85% black (as is the City of DC)...some Irish, some Italian, some Chinese..some Jewish but mostly a black community. Generally, we all got along fine... but those in charge politically and financially were the black residents (families there for over a 100 years)...they had no concerns about discrimination. However, the other races had to make sure they stroked the right folks the right way if we were to keep good relations. That is civilization on both ends. Most of the black people were down to earth good folks, some were problems but so were some of the other non-black members of the community. DC was and is a unique city in the US. My best friends was a black guy I ran track with... My thought is that politics has created a false status among American citizens that creates friction just to be politically correct. No society is free of faux discrimination for the sake of creating a power base or real discrimination based on racial hatred. In the US most racial discrimination is used to achieve social leverage and used for advancement beyond expectations.", 
        "intTime": 20090530, 
        "postID": 14, 
        "quote": "", 
        "reply": "Duster...! Growing up in DC my Dad was in the Navy...our neighborhood was 85% black (as is the City of DC)...some Irish, some Italian, some Chinese..some Jewish but mostly a black community. Generally, we all got along fine... but those in charge politically and financially were the black residents (families there for over a 100 years)...they had no concerns about discrimination. However, the other races had to make sure they stroked the right folks the right way if we were to keep good relations. That is civilization on both ends. Most of the black people were down to earth good folks, some were problems but so were some of the other non-black members of the community. DC was and is a unique city in the US. My best friends was a black guy I ran track with... My thought is that politics has created a false status among American citizens that creates friction just to be politically correct. No society is free of faux discrimination for the sake of creating a power base or real discrimination based on racial hatred. In the US most racial discrimination is used to achieve social leverage and used for advancement beyond expectations.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:31:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T. Then you got the joke. The whole point is that \"white male persecition\" complex is much ado about nothing.", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "Originally posted by L0A1: I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T.", 
        "reply": " Then you got the joke. The whole point is that \"white male persecition\" complex is much ado about nothing.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:34:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way. His satire was lost on me. Too much of the I'm a poor white man BS in it. Like I said, most folks I know DON'T feel this way, don't agree with his satiric view on things. I think that his comments are just to bait folks, not satire. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 16, 
        "quote": "Originally posted by Whirled_Peas: HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way.", 
        "reply": " His satire was lost on me. Too much of the I'm a poor white man BS in it. Like I said, most folks I know DON'T feel this way, don't agree with his satiric view on things. I think that his comments are just to bait folks, not satire. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:35:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ...", 
        "intTime": 20090530, 
        "postID": 17, 
        "quote": "", 
        "reply": "Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ...", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:38:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ... I want to add that some want an excuse for the behavior as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 18, 
        "quote": "Originally posted by dragonflyer04: Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ...", 
        "reply": " I want to add that some want an excuse for the behavior as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:44:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male... Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\".", 
        "intTime": 20090530, 
        "postID": 19, 
        "quote": "Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male...", 
        "reply": " Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\".", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 11:17:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male... Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\". There you go again, trying to \"bait\" us liberal, but we understand you bitterness and anger... go ahead let it all come out...", 
        "intTime": 20090530, 
        "postID": 20, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male... Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\".", 
        "reply": " There you go again, trying to \"bait\" us liberal, but we understand you bitterness and anger... go ahead let it all come out...", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 11:59:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Tangler"
    }, 
    {
        "content": "Dragonflyer04; I know where your coming from. When I was a kid I lived in a place outside of DC called the Shirley Duke Apartments. They had a few white couples living there too. I don't see Obama ever going on national TV and pleading with the black community to straighten up and fly right. The Black community, IMO needs to forget about this \"My Grandfather was a slave thing\" and pay more attention to getting an education and becoming a father to their children more. My God 100 years is enough.", 
        "intTime": 20090530, 
        "postID": 21, 
        "quote": "", 
        "reply": "Dragonflyer04; I know where your coming from. When I was a kid I lived in a place outside of DC called the Shirley Duke Apartments. They had a few white couples living there too. I don't see Obama ever going on national TV and pleading with the black community to straighten up and fly right. The Black community, IMO needs to forget about this \"My Grandfather was a slave thing\" and pay more attention to getting an education and becoming a father to their children more. My God 100 years is enough.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 12:05:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Duster6"
    }, 
    {
        "content": "adminnco1; quote: Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against..", 
        "intTime": 20090530, 
        "postID": 22, 
        "quote": "Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups.", 
        "reply": "adminnco1;  And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against..", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 12:46:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: adminnco1; quote: Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against.. True. My grandfather told me a story about his grandfather and signs that read \"No Dogs or Irish Allowed\". Dogs were given a higher place than the Irish. Hell, I'm still waiting for my reparations...We and the Chinese built the railroads that made this nation great.", 
        "intTime": 20090530, 
        "postID": 23, 
        "quote": "Originally posted by 3678131: adminnco1; quote: Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against..", 
        "reply": " True. My grandfather told me a story about his grandfather and signs that read \"No Dogs or Irish Allowed\". Dogs were given a higher place than the Irish. Hell, I'm still waiting for my reparations...We and the Chinese built the railroads that made this nation great.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 13:28:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "psychoABN"
    }, 
    {
        "content": "For a second there I thought this was a Rush Limbaugh rant...and his undoing..", 
        "intTime": 20090530, 
        "postID": 24, 
        "quote": "", 
        "reply": "For a second there I thought this was a Rush Limbaugh rant...and his undoing..", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 13:45:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "It is interesting to me that when a white male, such as myself, ceases to recieve special favorable treatment in housing/employment/military and civilian job promotions/admission into college/duty assignments while in the military (i.e. KP, guard duty, etc. **)/etc., some white males feel compelled to whine, \"I'm being discriminated against because I'm a white male!\" All my 57 years of life I know I have received special favorable treatment because I was born a white male. But somehow I just can't feel \"discriminated against\" when I get treated the same as a black male, a Hispanic male, an Asian male or a woman of any ethnic/racial/national background. Guess my white father and my white mother trained me incorrectly... ** I was in the room when a white E-1 tried to use, as a defense for disobeying a direct order and dereliction of duty, the argument that he was being \"discriminated against as a white man\" because he was put on KP duty and he was justified in not showing up to scrub pots and pans when his name came up on the KP duty roster. He actually was stupid enough to tell the Battalion commander that all duty rosters for KP and guard duty should be filled with the non-whites in the Battalion first, since white people were \"too good\" to pull those duties.", 
        "intTime": 20090531, 
        "postID": 25, 
        "quote": "", 
        "reply": "It is interesting to me that when a white male, such as myself, ceases to recieve special favorable treatment in housing/employment/military and civilian job promotions/admission into college/duty assignments while in the military (i.e. KP, guard duty, etc. **)/etc., some white males feel compelled to whine, \"I'm being discriminated against because I'm a white male!\" All my 57 years of life I know I have received special favorable treatment because I was born a white male. But somehow I just can't feel \"discriminated against\" when I get treated the same as a black male, a Hispanic male, an Asian male or a woman of any ethnic/racial/national background. Guess my white father and my white mother trained me incorrectly... ** I was in the room when a white E-1 tried to use, as a defense for disobeying a direct order and dereliction of duty, the argument that he was being \"discriminated against as a white man\" because he was put on KP duty and he was justified in not showing up to scrub pots and pans when his name came up on the KP duty roster. He actually was stupid enough to tell the Battalion commander that all duty rosters for KP and guard duty should be filled with the non-whites in the Battalion first, since white people were \"too good\" to pull those duties.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-31 21:33:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Many of you don't seem to understand what satire is.", 
        "intTime": 20090601, 
        "postID": 26, 
        "quote": "", 
        "reply": "Many of you don't seem to understand what satire is.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:26:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: Many of you don't seem to understand what satire is. It may have begun its life as satire, but the OP altered the intent with the highlighting of specific portions of the piece. So, while I understand satire (such Swift's A Modest Proposal) I also understand race baiting and this thread, Mr Brown, is clearly that.", 
        "intTime": 20090601, 
        "postID": 27, 
        "quote": "Originally posted by karlhungusjr: Many of you don't seem to understand what satire is.", 
        "reply": " It may have begun its life as satire, but the OP altered the intent with the highlighting of specific portions of the piece. So, while I understand satire (such Swift's A Modest Proposal) I also understand race baiting and this thread, Mr Brown, is clearly that.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:41:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: but the OP altered the intent with the highlighting of specific portions of the piece. I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\"", 
        "intTime": 20090601, 
        "postID": 28, 
        "quote": "but the OP altered the intent with the highlighting of specific portions of the piece.", 
        "reply": " I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\"", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:49:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: but the OP altered the intent with the highlighting of specific portions of the piece. I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\" Of course you don't, but then again I never thought that you would.", 
        "intTime": 20090601, 
        "postID": 29, 
        "quote": "Originally posted by karlhungusjr: quote: but the OP altered the intent with the highlighting of specific portions of the piece. I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\"", 
        "reply": " Of course you don't, but then again I never thought that you would.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:54:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Of course you don't, but then again I never thought that you would. well that was sure an intellectually stimulating debate....", 
        "intTime": 20090601, 
        "postID": 30, 
        "quote": "Of course you don't, but then again I never thought that you would.", 
        "reply": " well that was sure an intellectually stimulating debate....", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:58:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"http://www.williamkwolfrum.com/2009/05/27/statement-from-william-k-wolfrum-we-white-men-are-now-an-infinitesimally-oppressed-slightly-less-powerful-majority/\" quote: “My friends, for many years, I have lived a life of divine privilege. By birthright, I was special - white as all get out and as male as could be. Basically, I hit the genetic lottery, and grew to be secure in the fact that all rights available to a human belonged to me. But those days have come to and end, and with them, a tiny percentage of my hopes and dreams. You see, in just over six months, the United States has seen a black man be elected President of the United States, and a Latin woman be nominated for Supreme Court. My friends, these jobs were once the sole property of men like me. White men. White men who didn’t care about non-white men, and didn’t have to because we’re white. But those times are changing. And I am frightened. Now, sure, I understand there are white men out there that will help white men like myself bridge the infinitesimally small new gap. I also understand that white men still make up 90 percent or more of Congress, and roughly 100 percent of the mainstream media. But these privileges are no longer purely a given, and in fact have the unseemly feel of large-partism just thrown our way by the minorly less impotent minority class. Because, you see, not that long ago, when a Supreme Court seat opened up, I had the warm comfort of knowing that I - with no law experience whatsoever - had a much better chance at becoming a Supreme Court Justice than a woman with a Puerto Rican heritage. A woman who would have never even have been given the opportunity to gain law experience not so long ago. But now, I feel the same oppression as the blacks that were enslaved in the U.S., and the Native Americans who were slaughtered. I am now part of an oppressed, negligibly less powerful majority. So what happens to me now? This year the Supreme Court is off limits to a white, non-law-practicing male like myself. And the Presidency is now firmly in the hands of someone who lacks the comforting whiteness that I and my fellow white men have come to accept as the norm. As someone who once had limitless opportunities, I now find the ease of which I could stumble into those opportunities limited ever-so slightly. But I believe that we White men can come back and reclaim the absolute and complete power we once held. We must begin our own civil rights struggle. We must take to the streets. It is time for a white male movement. I believe it is time for white men to get together and form an organization that fights for our needs. In keeping with this new “Enlarge the Gap” movement, we should dress uniformly, perhaps in all white to further enhance our whiteness. Let me tell you, organization is key. And while the triflingly more powerful minorities of this nation may scoff at a large, well-organized group of white men marching the streets dressed in white with torches, for we white males it will be the type of thing that empowers us. Because the ruling, pampered minorities do not understand what an angry group of vaguely oppressed white men can accomplish. They have no historical perspective, at least as far as I learned at the private school I attended. They see us only as extremely powerful, but not God-like any longer. This tiny, almost unnoticeable gap between deity and hyper-powerful is a gap we must close. We must fight. Today, a white male child will be born into an oppressive society where the color of his skin will only be a great advantage, not an incomprehensibly powerful advantage. That child will see that there is now extra competition out there between himself and his dreams. That child will be born into a society that - while understanding his cultural values and belief systems - will no longer automatically fearfully submit to them. That child will be destined for a life of dreams and promises that will only very likely be fulfilled. The guarantee is now gone, and we must get it back. My white male friends, we shall overcome. We are a theoretically oppressed majority, but our voices can be heard. White men, spit the imperceptibly less silver spoon from your mouths and yell to the skies “The White Man will rise again! Power to the white male.” Thank you, and I have retained counsel, several bodyguards, a maid, hairstylist and personal valet on this matter.” Satirical humor from William K. Wolfrum. But remember, in all humor there is an element of truth - and there will be those who will read his comments and say \"He's right\" rather than say \"That's funny\".", 
        "intTime": 20090530, 
        "postID": 31, 
        "quote": "“My friends, for many years, I have lived a life of divine privilege. By birthright, I was special - white as all get out and as male as could be. Basically, I hit the genetic lottery, and grew to be secure in the fact that all rights available to a human belonged to me. But those days have come to and end, and with them, a tiny percentage of my hopes and dreams. You see, in just over six months, the United States has seen a black man be elected President of the United States, and a Latin woman be nominated for Supreme Court. My friends, these jobs were once the sole property of men like me. White men. White men who didn’t care about non-white men, and didn’t have to because we’re white. But those times are changing. And I am frightened. Now, sure, I understand there are white men out there that will help white men like myself bridge the infinitesimally small new gap. I also understand that white men still make up 90 percent or more of Congress, and roughly 100 percent of the mainstream media. But these privileges are no longer purely a given, and in fact have the unseemly feel of large-partism just thrown our way by the minorly less impotent minority class. Because, you see, not that long ago, when a Supreme Court seat opened up, I had the warm comfort of knowing that I - with no law experience whatsoever - had a much better chance at becoming a Supreme Court Justice than a woman with a Puerto Rican heritage. A woman who would have never even have been given the opportunity to gain law experience not so long ago. But now, I feel the same oppression as the blacks that were enslaved in the U.S., and the Native Americans who were slaughtered. I am now part of an oppressed, negligibly less powerful majority. So what happens to me now? This year the Supreme Court is off limits to a white, non-law-practicing male like myself. And the Presidency is now firmly in the hands of someone who lacks the comforting whiteness that I and my fellow white men have come to accept as the norm. As someone who once had limitless opportunities, I now find the ease of which I could stumble into those opportunities limited ever-so slightly. But I believe that we White men can come back and reclaim the absolute and complete power we once held. We must begin our own civil rights struggle. We must take to the streets. It is time for a white male movement. I believe it is time for white men to get together and form an organization that fights for our needs. In keeping with this new “Enlarge the Gap” movement, we should dress uniformly, perhaps in all white to further enhance our whiteness. Let me tell you, organization is key. And while the triflingly more powerful minorities of this nation may scoff at a large, well-organized group of white men marching the streets dressed in white with torches, for we white males it will be the type of thing that empowers us. Because the ruling, pampered minorities do not understand what an angry group of vaguely oppressed white men can accomplish. They have no historical perspective, at least as far as I learned at the private school I attended. They see us only as extremely powerful, but not God-like any longer. This tiny, almost unnoticeable gap between deity and hyper-powerful is a gap we must close. We must fight. Today, a white male child will be born into an oppressive society where the color of his skin will only be a great advantage, not an incomprehensibly powerful advantage. That child will see that there is now extra competition out there between himself and his dreams. That child will be born into a society that - while understanding his cultural values and belief systems - will no longer automatically fearfully submit to them. That child will be destined for a life of dreams and promises that will only very likely be fulfilled. The guarantee is now gone, and we must get it back. My white male friends, we shall overcome. We are a theoretically oppressed majority, but our voices can be heard. White men, spit the imperceptibly less silver spoon from your mouths and yell to the skies “The White Man will rise again! Power to the white male.” Thank you, and I have retained counsel, several bodyguards, a maid, hairstylist and personal valet on this matter.”", 
        "reply": "\"http://www.williamkwolfrum.com/2009/05/27/statement-from-william-k-wolfrum-we-white-men-are-now-an-infinitesimally-oppressed-slightly-less-powerful-majority/\"  Satirical humor from William K. Wolfrum. But remember, in all humor there is an element of truth - and there will be those who will read his comments and say \"He's right\" rather than say \"That's funny\".", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 07:18:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "This is satirical, yes...but some people actually believe this...I heard a few of them calling radio stations yesterday.", 
        "intTime": 20090530, 
        "postID": 32, 
        "quote": "", 
        "reply": "This is satirical, yes...but some people actually believe this...I heard a few of them calling radio stations yesterday.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 07:53:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 33, 
        "quote": "", 
        "reply": "I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 07:56:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "I never cared for it, myself, but then again, I don't like reverse discrimination either, in which, I have been a victim. It was called \"affirmitive action\".", 
        "intTime": 20090530, 
        "postID": 34, 
        "quote": "", 
        "reply": "I never cared for it, myself, but then again, I don't like reverse discrimination either, in which, I have been a victim. It was called \"affirmitive action\".", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:02:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I know Rush Limbaugh thinks conservatives are an opressed minority.", 
        "intTime": 20090530, 
        "postID": 35, 
        "quote": "", 
        "reply": "I know Rush Limbaugh thinks conservatives are an opressed minority.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:06:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The only real question is why is this race baiting thread being allowed?", 
        "intTime": 20090530, 
        "postID": 36, 
        "quote": "", 
        "reply": "The only real question is why is this race baiting thread being allowed?", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:08:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. All this sort of race baiting \"humor\" manages to accomplish is to keep things agitated with artificially inflamed passions.", 
        "intTime": 20090530, 
        "postID": 37, 
        "quote": "", 
        "reply": "Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. All this sort of race baiting \"humor\" manages to accomplish is to keep things agitated with artificially inflamed passions.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:14:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 38, 
        "quote": "Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed?", 
        "reply": " So activist can gloat I guess. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:15:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "intTime": 20090530, 
        "postID": 39, 
        "quote": "Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess.", 
        "reply": " If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:17:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No arguement here Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 40, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "reply": " No arguement here Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 08:50:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way.", 
        "intTime": 20090530, 
        "postID": 41, 
        "quote": "", 
        "reply": "HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:04:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male...", 
        "intTime": 20090530, 
        "postID": 42, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree.", 
        "reply": " No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male...", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:06:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Tangler"
    }, 
    {
        "content": "I worked and lived in Africa for more than six months and loved it. 31 white men and more than 600 black men. The only black men that I don't like are politicians who put money in their freezers, those with tattoos in prison, and the ones that wear pink colored Yankee hats sideways or backwards with their pants hanging around their knees. All the rest I can live with.", 
        "intTime": 20090530, 
        "postID": 43, 
        "quote": "", 
        "reply": "I worked and lived in Africa for more than six months and loved it. 31 white men and more than 600 black men. The only black men that I don't like are politicians who put money in their freezers, those with tattoos in prison, and the ones that wear pink colored Yankee hats sideways or backwards with their pants hanging around their knees. All the rest I can live with.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:07:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster...! Growing up in DC my Dad was in the Navy...our neighborhood was 85% black (as is the City of DC)...some Irish, some Italian, some Chinese..some Jewish but mostly a black community. Generally, we all got along fine... but those in charge politically and financially were the black residents (families there for over a 100 years)...they had no concerns about discrimination. However, the other races had to make sure they stroked the right folks the right way if we were to keep good relations. That is civilization on both ends. Most of the black people were down to earth good folks, some were problems but so were some of the other non-black members of the community. DC was and is a unique city in the US. My best friends was a black guy I ran track with... My thought is that politics has created a false status among American citizens that creates friction just to be politically correct. No society is free of faux discrimination for the sake of creating a power base or real discrimination based on racial hatred. In the US most racial discrimination is used to achieve social leverage and used for advancement beyond expectations.", 
        "intTime": 20090530, 
        "postID": 44, 
        "quote": "", 
        "reply": "Duster...! Growing up in DC my Dad was in the Navy...our neighborhood was 85% black (as is the City of DC)...some Irish, some Italian, some Chinese..some Jewish but mostly a black community. Generally, we all got along fine... but those in charge politically and financially were the black residents (families there for over a 100 years)...they had no concerns about discrimination. However, the other races had to make sure they stroked the right folks the right way if we were to keep good relations. That is civilization on both ends. Most of the black people were down to earth good folks, some were problems but so were some of the other non-black members of the community. DC was and is a unique city in the US. My best friends was a black guy I ran track with... My thought is that politics has created a false status among American citizens that creates friction just to be politically correct. No society is free of faux discrimination for the sake of creating a power base or real discrimination based on racial hatred. In the US most racial discrimination is used to achieve social leverage and used for advancement beyond expectations.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:31:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T. Then you got the joke. The whole point is that \"white male persecition\" complex is much ado about nothing.", 
        "intTime": 20090530, 
        "postID": 45, 
        "quote": "Originally posted by L0A1: I really didn't find much humor or ANY truth in this \"satire\". Maybe I am just slow. All I see is rantings and crying about nothing. Perhaps people want white men to feel this way, but I bet most of us DON'T.", 
        "reply": " Then you got the joke. The whole point is that \"white male persecition\" complex is much ado about nothing.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:34:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way. His satire was lost on me. Too much of the I'm a poor white man BS in it. Like I said, most folks I know DON'T feel this way, don't agree with his satiric view on things. I think that his comments are just to bait folks, not satire. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 46, 
        "quote": "Originally posted by Whirled_Peas: HAHAHAHAAAHAAHA!!! The replies here are even more amusing than the original satire. The sad thing is that while the satirist KNOWS that white men are not oppressed in this country, and that they're only slightly less exclusively privileged than they used to be, the replies indicate that not everyone sees it that way.", 
        "reply": " His satire was lost on me. Too much of the I'm a poor white man BS in it. Like I said, most folks I know DON'T feel this way, don't agree with his satiric view on things. I think that his comments are just to bait folks, not satire. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:35:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ...", 
        "intTime": 20090530, 
        "postID": 47, 
        "quote": "", 
        "reply": "Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ...", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:38:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ... I want to add that some want an excuse for the behavior as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 48, 
        "quote": "Originally posted by dragonflyer04: Answering the question and avoiding the satire \"only if they want to be oppressed\"...some people enjoy being masochists! Some like S & M ...", 
        "reply": " I want to add that some want an excuse for the behavior as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 09:44:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male... Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\".", 
        "intTime": 20090530, 
        "postID": 49, 
        "quote": "Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male...", 
        "reply": " Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\".", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 11:17:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male... Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\". There you go again, trying to \"bait\" us liberal, but we understand you bitterness and anger... go ahead let it all come out...", 
        "intTime": 20090530, 
        "postID": 50, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Tangler: quote: Originally posted by adminnco1: quote: Originally posted by L0A1: quote: Originally posted by adminnco1: The only real question is why is this race baiting thread being allowed? So activist can gloat I guess. If \"activist\" is a synonym for \"race baiting bigot\" I agree. No, No, This is only you making a choice to be a angry, white male. So you can choose to not be a angry, white male... try to just be a happy,white male... Mr Wolfrum is obviously a race baiting bigot who attempts to hide behind what he is pleased to call humor. Personally, I haven't been \"angry\" in decades, but I suppose it is better than \"liberal whack job\".", 
        "reply": " There you go again, trying to \"bait\" us liberal, but we understand you bitterness and anger... go ahead let it all come out...", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 11:59:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Tangler"
    }, 
    {
        "content": "Dragonflyer04; I know where your coming from. When I was a kid I lived in a place outside of DC called the Shirley Duke Apartments. They had a few white couples living there too. I don't see Obama ever going on national TV and pleading with the black community to straighten up and fly right. The Black community, IMO needs to forget about this \"My Grandfather was a slave thing\" and pay more attention to getting an education and becoming a father to their children more. My God 100 years is enough.", 
        "intTime": 20090530, 
        "postID": 51, 
        "quote": "", 
        "reply": "Dragonflyer04; I know where your coming from. When I was a kid I lived in a place outside of DC called the Shirley Duke Apartments. They had a few white couples living there too. I don't see Obama ever going on national TV and pleading with the black community to straighten up and fly right. The Black community, IMO needs to forget about this \"My Grandfather was a slave thing\" and pay more attention to getting an education and becoming a father to their children more. My God 100 years is enough.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 12:05:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Duster6"
    }, 
    {
        "content": "adminnco1; quote: Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against..", 
        "intTime": 20090530, 
        "postID": 52, 
        "quote": "Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups.", 
        "reply": "adminnco1;  And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against..", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 12:46:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: adminnco1; quote: Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against.. True. My grandfather told me a story about his grandfather and signs that read \"No Dogs or Irish Allowed\". Dogs were given a higher place than the Irish. Hell, I'm still waiting for my reparations...We and the Chinese built the railroads that made this nation great.", 
        "intTime": 20090530, 
        "postID": 53, 
        "quote": "Originally posted by 3678131: adminnco1; quote: Morons like this Wolfrum seem to forget, or perhaps be blissfully ignorant of, the fact that most ethnic groups have suffered periods of discrimination. The Irish were once considered sub-human and the term \"No Irish Need Apply\" was commonplace. Italians were accorded similar treatment as were many other groups. And yet THEY are still considered WHITE..and yet many want to say \"white's\" have never been discriminated against..", 
        "reply": " True. My grandfather told me a story about his grandfather and signs that read \"No Dogs or Irish Allowed\". Dogs were given a higher place than the Irish. Hell, I'm still waiting for my reparations...We and the Chinese built the railroads that made this nation great.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 13:28:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "psychoABN"
    }, 
    {
        "content": "For a second there I thought this was a Rush Limbaugh rant...and his undoing..", 
        "intTime": 20090530, 
        "postID": 54, 
        "quote": "", 
        "reply": "For a second there I thought this was a Rush Limbaugh rant...and his undoing..", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-30 13:45:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "It is interesting to me that when a white male, such as myself, ceases to recieve special favorable treatment in housing/employment/military and civilian job promotions/admission into college/duty assignments while in the military (i.e. KP, guard duty, etc. **)/etc., some white males feel compelled to whine, \"I'm being discriminated against because I'm a white male!\" All my 57 years of life I know I have received special favorable treatment because I was born a white male. But somehow I just can't feel \"discriminated against\" when I get treated the same as a black male, a Hispanic male, an Asian male or a woman of any ethnic/racial/national background. Guess my white father and my white mother trained me incorrectly... ** I was in the room when a white E-1 tried to use, as a defense for disobeying a direct order and dereliction of duty, the argument that he was being \"discriminated against as a white man\" because he was put on KP duty and he was justified in not showing up to scrub pots and pans when his name came up on the KP duty roster. He actually was stupid enough to tell the Battalion commander that all duty rosters for KP and guard duty should be filled with the non-whites in the Battalion first, since white people were \"too good\" to pull those duties.", 
        "intTime": 20090531, 
        "postID": 55, 
        "quote": "", 
        "reply": "It is interesting to me that when a white male, such as myself, ceases to recieve special favorable treatment in housing/employment/military and civilian job promotions/admission into college/duty assignments while in the military (i.e. KP, guard duty, etc. **)/etc., some white males feel compelled to whine, \"I'm being discriminated against because I'm a white male!\" All my 57 years of life I know I have received special favorable treatment because I was born a white male. But somehow I just can't feel \"discriminated against\" when I get treated the same as a black male, a Hispanic male, an Asian male or a woman of any ethnic/racial/national background. Guess my white father and my white mother trained me incorrectly... ** I was in the room when a white E-1 tried to use, as a defense for disobeying a direct order and dereliction of duty, the argument that he was being \"discriminated against as a white man\" because he was put on KP duty and he was justified in not showing up to scrub pots and pans when his name came up on the KP duty roster. He actually was stupid enough to tell the Battalion commander that all duty rosters for KP and guard duty should be filled with the non-whites in the Battalion first, since white people were \"too good\" to pull those duties.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-05-31 21:33:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Many of you don't seem to understand what satire is.", 
        "intTime": 20090601, 
        "postID": 56, 
        "quote": "", 
        "reply": "Many of you don't seem to understand what satire is.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:26:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: Many of you don't seem to understand what satire is. It may have begun its life as satire, but the OP altered the intent with the highlighting of specific portions of the piece. So, while I understand satire (such Swift's A Modest Proposal) I also understand race baiting and this thread, Mr Brown, is clearly that.", 
        "intTime": 20090601, 
        "postID": 57, 
        "quote": "Originally posted by karlhungusjr: Many of you don't seem to understand what satire is.", 
        "reply": " It may have begun its life as satire, but the OP altered the intent with the highlighting of specific portions of the piece. So, while I understand satire (such Swift's A Modest Proposal) I also understand race baiting and this thread, Mr Brown, is clearly that.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:41:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: but the OP altered the intent with the highlighting of specific portions of the piece. I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\"", 
        "intTime": 20090601, 
        "postID": 58, 
        "quote": "but the OP altered the intent with the highlighting of specific portions of the piece.", 
        "reply": " I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\"", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:49:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: but the OP altered the intent with the highlighting of specific portions of the piece. I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\" Of course you don't, but then again I never thought that you would.", 
        "intTime": 20090601, 
        "postID": 59, 
        "quote": "Originally posted by karlhungusjr: quote: but the OP altered the intent with the highlighting of specific portions of the piece. I don't see how highlighting something alters intent. It's not like something was omitted. Just highlighted. If you highlighted portions of A Modest Proposal would that somehow \"alter Swifts intent\"? Of course it wouldn't. as for the accusations of race baiting....well...I don't see how the article or the OP used \"racially derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests.\"", 
        "reply": " Of course you don't, but then again I never thought that you would.", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:54:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Of course you don't, but then again I never thought that you would. well that was sure an intellectually stimulating debate....", 
        "intTime": 20090601, 
        "postID": 60, 
        "quote": "Of course you don't, but then again I never thought that you would.", 
        "reply": " well that was sure an intellectually stimulating debate....", 
        "threadID": "409192893_8700076422001", 
        "time": "2009-06-01 02:58:00", 
        "title": "“We White Men are now an oppressed majority”", 
        "userID": "karlhungusjr"
    }
]