[
    {
        "content": "+++http://islaminaction08.blogspot.com/2009/03/obama-top-legal-pick-supports-sharia.html Harol Koh, White House legal counsel pick: Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" No reason..dont let that silly bill of rights stop you!", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://islaminaction08.blogspot.com/2009/03/obama-top-legal-pick-supports-sharia.html Harol Koh, White House legal counsel pick: Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" No reason..dont let that silly bill of rights stop you!", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:41:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "JUDGES should interpret the Constitution according to other nations' legal \"norms.\" Sharia law could apply to disputes in US courts. The United States constitutes an \"axis of disobedience\" along with North Korea and Saddam-era Iraq. Those are the views of the man on track to become one of the US government's top lawyers: Harold Koh. President Obama has nominated Koh -- until last week the dean of Yale Law School -- to be the State Department's legal adviser. In that job, Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice. It's a job where you want a strong defender of America's sovereignty. But that's not Koh. He's a fan of \"transnational legal process,\" arguing that the distinctions between US and international law should vanish. What would this look like in a practical sense? Well, California voters have overruled their courts, which had imposed same-sex marriage on the state. Koh would like to see such matters go up the chain through federal courts -- which, in turn, should look to the rest of the world. If Canada, the European Human Rights Commission and the United Nations all say gay marriage should be legal -- well, then, it should be legal in California too, regardless of what the state's voters and elected representatives might say. He even believes judges should use this \"logic\" to strike down the death penalty, which is clearly permitted in the US Constitution. The primacy of international legal \"norms\" applies even to treaties we reject. For example, Koh believes that the UN Convention on the Rights of the Child -- a problematic document that we haven't ratified -- should dictate the age at which individual US states can execute criminals. Got that? On issues ranging from affirmative action to the interrogation of terrorists, what the rest of the world says, goes. Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" from NY post.com", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "JUDGES should interpret the Constitution according to other nations' legal \"norms.\" Sharia law could apply to disputes in US courts. The United States constitutes an \"axis of disobedience\" along with North Korea and Saddam-era Iraq. Those are the views of the man on track to become one of the US government's top lawyers: Harold Koh. President Obama has nominated Koh -- until last week the dean of Yale Law School -- to be the State Department's legal adviser. In that job, Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice. It's a job where you want a strong defender of America's sovereignty. But that's not Koh. He's a fan of \"transnational legal process,\" arguing that the distinctions between US and international law should vanish. What would this look like in a practical sense? Well, California voters have overruled their courts, which had imposed same-sex marriage on the state. Koh would like to see such matters go up the chain through federal courts -- which, in turn, should look to the rest of the world. If Canada, the European Human Rights Commission and the United Nations all say gay marriage should be legal -- well, then, it should be legal in California too, regardless of what the state's voters and elected representatives might say. He even believes judges should use this \"logic\" to strike down the death penalty, which is clearly permitted in the US Constitution. The primacy of international legal \"norms\" applies even to treaties we reject. For example, Koh believes that the UN Convention on the Rights of the Child -- a problematic document that we haven't ratified -- should dictate the age at which individual US states can execute criminals. Got that? On issues ranging from affirmative action to the interrogation of terrorists, what the rest of the world says, goes. Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" from NY post.com", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:43:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:45:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "Knele"
    }, 
    {
        "content": "I originally thought this was some kind of smear, but it is real. I don't know what to say. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "", 
        "reply": "I originally thought this was some kind of smear, but it is real. I don't know what to say. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:45:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does.", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "", 
        "reply": "Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:50:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I originally thought this was some kind of smear, but it is real. I don't know what to say. Another turd nomination.....", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: I originally thought this was some kind of smear, but it is real. I don't know what to say.", 
        "reply": " Another turd nomination.....", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:50:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program.", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does.", 
        "reply": " Bill, it's about diversity dude, get with the program.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:51:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.”", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "", 
        "reply": "The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.”", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 12:11:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.” If all else fails...deny everything right? This was on the news this morning. The video is here \"http://www.foxnews.com/video-search/m/22045148/shari_a_law.htm\" and the transcript is below the video...", 
        "intTime": 20090401, 
        "postID": 9, 
        "quote": "Originally posted by xerello: The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.”", 
        "reply": " If all else fails...deny everything right? This was on the news this morning. The video is here \"http://www.foxnews.com/video-search/m/22045148/shari_a_law.htm\" and the transcript is below the video...", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 12:42:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "intTime": 20090401, 
        "postID": 10, 
        "quote": "", 
        "reply": "the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 14:10:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps Sure...just combine that with everything we know about Obama: Geithner 'open' to China proposal Geithner, at the Council on Foreign Relations, said the U.S. is \"open\" to a headline-grabbing proposal by the governor of the China's central bank, which was widely reported as being a call for a new global currency to replace the dollar, but which Geithner described as more modest and \"evolutionary.\" \"I haven’t read the governor’s proposal. He’s a very thoughtful, very careful distinguished central banker. I generally find him sensible on every issue,\" Geithner said, saying that however his interpretation of the proposal was to increase the use of International Monetary Fund's special drawing rights -- shares in the body held by its members -- not creating a new currency in the literal sense. \"We’re actually quite open to that suggestion – you should see it as rather evolutionary rather building on the current architecture rather than moving us to global monetary union,\" he said. +++http://www.politico.com/blogs/bensmith/0309/Geithner_open_to_China_proposal.html Picture getting clearer?", 
        "intTime": 20090401, 
        "postID": 11, 
        "quote": "Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "reply": " Sure...just combine that with everything we know about Obama: Geithner 'open' to China proposal Geithner, at the Council on Foreign Relations, said the U.S. is \"open\" to a headline-grabbing proposal by the governor of the China's central bank, which was widely reported as being a call for a new global currency to replace the dollar, but which Geithner described as more modest and \"evolutionary.\" \"I haven’t read the governor’s proposal. He’s a very thoughtful, very careful distinguished central banker. I generally find him sensible on every issue,\" Geithner said, saying that however his interpretation of the proposal was to increase the use of International Monetary Fund's special drawing rights -- shares in the body held by its members -- not creating a new currency in the literal sense. \"We’re actually quite open to that suggestion – you should see it as rather evolutionary rather building on the current architecture rather than moving us to global monetary union,\" he said. +++http://www.politico.com/blogs/bensmith/0309/Geithner_open_to_China_proposal.html Picture getting clearer?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 14:14:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps Mind reader now, huh? And to think we thought you didn't have a mind.", 
        "intTime": 20090401, 
        "postID": 12, 
        "quote": "Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "reply": " Mind reader now, huh? And to think we thought you didn't have a mind.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 14:18:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "transport1"
    }, 
    {
        "content": "You cant jump into Obama's head to read what is going on in there...all you have to judge are his actions...", 
        "intTime": 20090401, 
        "postID": 13, 
        "quote": "", 
        "reply": "You cant jump into Obama's head to read what is going on in there...all you have to judge are his actions...", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 15:20:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "at what point are you guys going to admit that you were wearing tinfoil hats all along?", 
        "intTime": 20090402, 
        "postID": 14, 
        "quote": "", 
        "reply": "at what point are you guys going to admit that you were wearing tinfoil hats all along?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 02:24:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html", 
        "intTime": 20090402, 
        "postID": 15, 
        "quote": "", 
        "reply": "===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 03:51:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: ===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html when Americans die, will POTUS use the terror word??", 
        "intTime": 20090402, 
        "postID": 16, 
        "quote": "Originally posted by outlaws93: ===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html", 
        "reply": " when Americans die, will POTUS use the terror word??", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 04:53:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter!", 
        "intTime": 20090402, 
        "postID": 17, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program.", 
        "reply": " I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter!", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 07:57:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important.", 
        "intTime": 20090402, 
        "postID": 18, 
        "quote": "Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter!", 
        "reply": " Right, but it doesnt matter muslim accommodations are more important.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 08:06:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important. Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue.", 
        "intTime": 20090402, 
        "postID": 19, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important.", 
        "reply": " Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 08:21:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by Knele: This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion.", 
        "intTime": 20090402, 
        "postID": 20, 
        "quote": "Originally posted by Knele:", 
        "reply": " This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 08:35:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "jwr6"
    }, 
    {
        "content": "What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "intTime": 20090402, 
        "postID": 21, 
        "quote": "", 
        "reply": "What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:29:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? Maybe you should be tired of Muslims who use the same term? You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States.", 
        "intTime": 20090402, 
        "postID": 22, 
        "quote": "Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "reply": " Maybe you should be tired of Muslims who use the same term? You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:47:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Knele: This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion. +++http://www.cnn.com/2009/CRIME/02/16/buffalo.beheading/index.html NEW YORK (CNN) -- The founder of an upstate New York TV station aimed at countering Muslim stereotypes has been arrested on suspicion of killing his wife, who was beheaded, authorities said. Muzzammil Hassan has been charged with murder in the death of his wife, Aasiya Hassan. Muzzammil Hassan was charged with second-degree murder after police found the decapitated body of his wife, Aasiya Hassan, at the Bridges TV station in the Buffalo suburb of Orchard Park, said Andrew Benz, Orchard Park's police chief.", 
        "intTime": 20090402, 
        "postID": 23, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Knele: This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion.", 
        "reply": " +++http://www.cnn.com/2009/CRIME/02/16/buffalo.beheading/index.html NEW YORK (CNN) -- The founder of an upstate New York TV station aimed at countering Muslim stereotypes has been arrested on suspicion of killing his wife, who was beheaded, authorities said. Muzzammil Hassan has been charged with murder in the death of his wife, Aasiya Hassan. Muzzammil Hassan was charged with second-degree murder after police found the decapitated body of his wife, Aasiya Hassan, at the Bridges TV station in the Buffalo suburb of Orchard Park, said Andrew Benz, Orchard Park's police chief.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:48:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States. I don't care for the south either.", 
        "intTime": 20090402, 
        "postID": 24, 
        "quote": "You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States.", 
        "reply": " I don't care for the south either.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:56:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "What's the \"culture\" of the United States?", 
        "intTime": 20090402, 
        "postID": 25, 
        "quote": "", 
        "reply": "What's the \"culture\" of the United States?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:09:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site.", 
        "intTime": 20090402, 
        "postID": 26, 
        "quote": "Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "reply": " I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:09:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site. Maybe he is from that river in Africa? De nial. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 27, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site.", 
        "reply": " Maybe he is from that river in Africa? De nial. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:12:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important. Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue. Yeh, women cant speak for themselves they need michellbam to speak for them. Btw, my response before this was sarcasm.", 
        "intTime": 20090402, 
        "postID": 28, 
        "quote": "Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important. Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue.", 
        "reply": " Yeh, women cant speak for themselves they need michellbam to speak for them. Btw, my response before this was sarcasm.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:35:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary.", 
        "intTime": 20090402, 
        "postID": 29, 
        "quote": "Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer.", 
        "reply": " You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 11:52:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: quote: Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary. How does that change ANYTHING? When insane, out of control, muslims, as in the video posted, are protesting on the streets of New York, scraming that the muslim flag will fly over the whitehouse and demanding Sharia law...", 
        "intTime": 20090402, 
        "postID": 30, 
        "quote": "Originally posted by SgtSalaamv2: quote: Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary.", 
        "reply": " How does that change ANYTHING? When insane, out of control, muslims, as in the video posted, are protesting on the streets of New York, scraming that the muslim flag will fly over the whitehouse and demanding Sharia law...", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 11:56:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "+++http://islaminaction08.blogspot.com/2009/03/obama-top-legal-pick-supports-sharia.html Harol Koh, White House legal counsel pick: Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" No reason..dont let that silly bill of rights stop you!", 
        "intTime": 20090401, 
        "postID": 31, 
        "quote": "", 
        "reply": "+++http://islaminaction08.blogspot.com/2009/03/obama-top-legal-pick-supports-sharia.html Harol Koh, White House legal counsel pick: Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" No reason..dont let that silly bill of rights stop you!", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:41:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "JUDGES should interpret the Constitution according to other nations' legal \"norms.\" Sharia law could apply to disputes in US courts. The United States constitutes an \"axis of disobedience\" along with North Korea and Saddam-era Iraq. Those are the views of the man on track to become one of the US government's top lawyers: Harold Koh. President Obama has nominated Koh -- until last week the dean of Yale Law School -- to be the State Department's legal adviser. In that job, Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice. It's a job where you want a strong defender of America's sovereignty. But that's not Koh. He's a fan of \"transnational legal process,\" arguing that the distinctions between US and international law should vanish. What would this look like in a practical sense? Well, California voters have overruled their courts, which had imposed same-sex marriage on the state. Koh would like to see such matters go up the chain through federal courts -- which, in turn, should look to the rest of the world. If Canada, the European Human Rights Commission and the United Nations all say gay marriage should be legal -- well, then, it should be legal in California too, regardless of what the state's voters and elected representatives might say. He even believes judges should use this \"logic\" to strike down the death penalty, which is clearly permitted in the US Constitution. The primacy of international legal \"norms\" applies even to treaties we reject. For example, Koh believes that the UN Convention on the Rights of the Child -- a problematic document that we haven't ratified -- should dictate the age at which individual US states can execute criminals. Got that? On issues ranging from affirmative action to the interrogation of terrorists, what the rest of the world says, goes. Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" from NY post.com", 
        "intTime": 20090401, 
        "postID": 32, 
        "quote": "", 
        "reply": "JUDGES should interpret the Constitution according to other nations' legal \"norms.\" Sharia law could apply to disputes in US courts. The United States constitutes an \"axis of disobedience\" along with North Korea and Saddam-era Iraq. Those are the views of the man on track to become one of the US government's top lawyers: Harold Koh. President Obama has nominated Koh -- until last week the dean of Yale Law School -- to be the State Department's legal adviser. In that job, Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice. It's a job where you want a strong defender of America's sovereignty. But that's not Koh. He's a fan of \"transnational legal process,\" arguing that the distinctions between US and international law should vanish. What would this look like in a practical sense? Well, California voters have overruled their courts, which had imposed same-sex marriage on the state. Koh would like to see such matters go up the chain through federal courts -- which, in turn, should look to the rest of the world. If Canada, the European Human Rights Commission and the United Nations all say gay marriage should be legal -- well, then, it should be legal in California too, regardless of what the state's voters and elected representatives might say. He even believes judges should use this \"logic\" to strike down the death penalty, which is clearly permitted in the US Constitution. The primacy of international legal \"norms\" applies even to treaties we reject. For example, Koh believes that the UN Convention on the Rights of the Child -- a problematic document that we haven't ratified -- should dictate the age at which individual US states can execute criminals. Got that? On issues ranging from affirmative action to the interrogation of terrorists, what the rest of the world says, goes. Including, apparently, the world of radical imams. A New York lawyer, Steven Stein, says that, in addressing the Yale Club of Greenwich in 2007, Koh claimed that \"in an appropriate case, he didn't see any reason why sharia law would not be applied to govern a case in the United States.\" from NY post.com", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:43:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "", 
        "intTime": 20090401, 
        "postID": 33, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:45:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "Knele"
    }, 
    {
        "content": "I originally thought this was some kind of smear, but it is real. I don't know what to say. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 34, 
        "quote": "", 
        "reply": "I originally thought this was some kind of smear, but it is real. I don't know what to say. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:45:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does.", 
        "intTime": 20090401, 
        "postID": 35, 
        "quote": "", 
        "reply": "Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:50:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I originally thought this was some kind of smear, but it is real. I don't know what to say. Another turd nomination.....", 
        "intTime": 20090401, 
        "postID": 36, 
        "quote": "Originally posted by L0A1: I originally thought this was some kind of smear, but it is real. I don't know what to say.", 
        "reply": " Another turd nomination.....", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:50:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program.", 
        "intTime": 20090401, 
        "postID": 37, 
        "quote": "Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does.", 
        "reply": " Bill, it's about diversity dude, get with the program.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 07:51:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.”", 
        "intTime": 20090401, 
        "postID": 38, 
        "quote": "", 
        "reply": "The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.”", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 12:11:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.” If all else fails...deny everything right? This was on the news this morning. The video is here \"http://www.foxnews.com/video-search/m/22045148/shari_a_law.htm\" and the transcript is below the video...", 
        "intTime": 20090401, 
        "postID": 39, 
        "quote": "Originally posted by xerello: The fact that the only place where Harold Koh’s opinion about sharia law shows up on the internet is right wing blogs and tabloid press aside, there are other “mistakes” in this post. No matter the opinions of the person who is the State Department’s legal adviser, that person has no power to change the court system or the Constitution to incorporate any sharia laws that do not already agree with the Constitution (there are many.) Sharia law outlaws alcohol. We tried that and it did not work. “Koh would forge a wide range of international agreements on issues from trade to arms control, and help represent our country in such places as the United Nations and the International Court of Justice.” The State Department’s top lawyer does not “forge” international agreements, but is one of many advisors on them. The State Department’s legal adviser does not represent the United States at the United Nations, but provides legal advice to the Ambassador of the United Nations. The State Department’s legal adviser does not represent the United States in the International Court of Justice because the United States withdrew from that court’s compulsory jurisdiction in 1986. So this thread is just part of the many myths created by those who want President Obama to fail and want to provide uninformed rednecks something to complain about, such as: “Sharia law..coming your way!” “Terrorists are going to be released in the United States and be given a welfare check.” “President Obama has double the national debt in just the last 60 days.” “President Obama is going to take away our guns.” “We will be living in a socialist country by next year.” “We won the war in Iraq and President Obama won’t admit it.”", 
        "reply": " If all else fails...deny everything right? This was on the news this morning. The video is here \"http://www.foxnews.com/video-search/m/22045148/shari_a_law.htm\" and the transcript is below the video...", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 12:42:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "intTime": 20090401, 
        "postID": 40, 
        "quote": "", 
        "reply": "the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 14:10:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps Sure...just combine that with everything we know about Obama: Geithner 'open' to China proposal Geithner, at the Council on Foreign Relations, said the U.S. is \"open\" to a headline-grabbing proposal by the governor of the China's central bank, which was widely reported as being a call for a new global currency to replace the dollar, but which Geithner described as more modest and \"evolutionary.\" \"I haven’t read the governor’s proposal. He’s a very thoughtful, very careful distinguished central banker. I generally find him sensible on every issue,\" Geithner said, saying that however his interpretation of the proposal was to increase the use of International Monetary Fund's special drawing rights -- shares in the body held by its members -- not creating a new currency in the literal sense. \"We’re actually quite open to that suggestion – you should see it as rather evolutionary rather building on the current architecture rather than moving us to global monetary union,\" he said. +++http://www.politico.com/blogs/bensmith/0309/Geithner_open_to_China_proposal.html Picture getting clearer?", 
        "intTime": 20090401, 
        "postID": 41, 
        "quote": "Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "reply": " Sure...just combine that with everything we know about Obama: Geithner 'open' to China proposal Geithner, at the Council on Foreign Relations, said the U.S. is \"open\" to a headline-grabbing proposal by the governor of the China's central bank, which was widely reported as being a call for a new global currency to replace the dollar, but which Geithner described as more modest and \"evolutionary.\" \"I haven’t read the governor’s proposal. He’s a very thoughtful, very careful distinguished central banker. I generally find him sensible on every issue,\" Geithner said, saying that however his interpretation of the proposal was to increase the use of International Monetary Fund's special drawing rights -- shares in the body held by its members -- not creating a new currency in the literal sense. \"We’re actually quite open to that suggestion – you should see it as rather evolutionary rather building on the current architecture rather than moving us to global monetary union,\" he said. +++http://www.politico.com/blogs/bensmith/0309/Geithner_open_to_China_proposal.html Picture getting clearer?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 14:14:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps Mind reader now, huh? And to think we thought you didn't have a mind.", 
        "intTime": 20090401, 
        "postID": 42, 
        "quote": "Originally posted by liberal90: the \"appropriate case\" he was talking about (if he even said anything of the sort at all) is almost certainly in something like court-ordered mediation sessions, and only when all parties agree to have it applied hope this helps", 
        "reply": " Mind reader now, huh? And to think we thought you didn't have a mind.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 14:18:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "transport1"
    }, 
    {
        "content": "You cant jump into Obama's head to read what is going on in there...all you have to judge are his actions...", 
        "intTime": 20090401, 
        "postID": 43, 
        "quote": "", 
        "reply": "You cant jump into Obama's head to read what is going on in there...all you have to judge are his actions...", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-01 15:20:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "at what point are you guys going to admit that you were wearing tinfoil hats all along?", 
        "intTime": 20090402, 
        "postID": 44, 
        "quote": "", 
        "reply": "at what point are you guys going to admit that you were wearing tinfoil hats all along?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 02:24:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html", 
        "intTime": 20090402, 
        "postID": 45, 
        "quote": "", 
        "reply": "===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 03:51:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: ===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html when Americans die, will POTUS use the terror word??", 
        "intTime": 20090402, 
        "postID": 46, 
        "quote": "Originally posted by outlaws93: ===http://www.youtube.com/watch?v=fuEy0uiyvNw ====http://www.actforamerica.org/index.php/home/18-headline-item/518-shariah-compliant-finance-jihad-with-money ----http://www.petitiononline.com/qxyz1108/petition.html", 
        "reply": " when Americans die, will POTUS use the terror word??", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 04:53:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter!", 
        "intTime": 20090402, 
        "postID": 47, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program.", 
        "reply": " I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter!", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 07:57:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important.", 
        "intTime": 20090402, 
        "postID": 48, 
        "quote": "Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter!", 
        "reply": " Right, but it doesnt matter muslim accommodations are more important.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 08:06:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important. Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue.", 
        "intTime": 20090402, 
        "postID": 49, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important.", 
        "reply": " Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 08:21:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by Knele: This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion.", 
        "intTime": 20090402, 
        "postID": 50, 
        "quote": "Originally posted by Knele:", 
        "reply": " This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 08:35:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "jwr6"
    }, 
    {
        "content": "What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "intTime": 20090402, 
        "postID": 51, 
        "quote": "", 
        "reply": "What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:29:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? Maybe you should be tired of Muslims who use the same term? You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States.", 
        "intTime": 20090402, 
        "postID": 52, 
        "quote": "Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "reply": " Maybe you should be tired of Muslims who use the same term? You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:47:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Knele: This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion. +++http://www.cnn.com/2009/CRIME/02/16/buffalo.beheading/index.html NEW YORK (CNN) -- The founder of an upstate New York TV station aimed at countering Muslim stereotypes has been arrested on suspicion of killing his wife, who was beheaded, authorities said. Muzzammil Hassan has been charged with murder in the death of his wife, Aasiya Hassan. Muzzammil Hassan was charged with second-degree murder after police found the decapitated body of his wife, Aasiya Hassan, at the Bridges TV station in the Buffalo suburb of Orchard Park, said Andrew Benz, Orchard Park's police chief.", 
        "intTime": 20090402, 
        "postID": 53, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Knele: This has got to be an April Fool's joke. Although, when the State Department pushes a judge to throw out a case when some muslim in New York beheads his wife becuase she went to yoga class without her headscarf, I'll be sure to dig up this post and see if you've revised your opinion.", 
        "reply": " +++http://www.cnn.com/2009/CRIME/02/16/buffalo.beheading/index.html NEW YORK (CNN) -- The founder of an upstate New York TV station aimed at countering Muslim stereotypes has been arrested on suspicion of killing his wife, who was beheaded, authorities said. Muzzammil Hassan has been charged with murder in the death of his wife, Aasiya Hassan. Muzzammil Hassan was charged with second-degree murder after police found the decapitated body of his wife, Aasiya Hassan, at the Bridges TV station in the Buffalo suburb of Orchard Park, said Andrew Benz, Orchard Park's police chief.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:48:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States. I don't care for the south either.", 
        "intTime": 20090402, 
        "postID": 54, 
        "quote": "You know what I'm tired of? Clearly inferior cultures attempting to subvert the culture of the United States.", 
        "reply": " I don't care for the south either.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 09:56:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "What's the \"culture\" of the United States?", 
        "intTime": 20090402, 
        "postID": 55, 
        "quote": "", 
        "reply": "What's the \"culture\" of the United States?", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:09:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site.", 
        "intTime": 20090402, 
        "postID": 56, 
        "quote": "Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"?", 
        "reply": " I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:09:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site. Maybe he is from that river in Africa? De nial. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 57, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by SgtSalaamv2: What is Shariah Law? I so tired of non-Muslims hanging on to \"buzz\" words and terms that they do not fully understand but use them because they sound scary. I would love to see a copy of this \"shariah law\" that you guys keep whining about that Muslims supposedly all adhere to and want to implement, because as a Muslim for almost a decade, I have yet to see this legal document, maybe you guys can enlighten me, you have a link to a complete copy of the \"Shariah Law\"? I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. quote: Excerp from Wikipedia: Sharia Sharia (Arabic: '‎شريعة transliteration: Šarīʿah) is the body of Islamic religious law. The term means \"way\" or \"path to the water source\"; it is the legal framework within which the public and private aspects of life are regulated for those living in a legal system based on Islamic principles of jurisprudence and for Muslims living outside the domain. Sharia deals with many aspects of day-to-day life, including politics, economics, banking, business, contracts, family, sexuality, hygiene, and social issues. Before the 19th century, legal theory was considered the domain of the traditional legal schools of thought. Most Sunni Muslims follow Hanafi, Hanbali, Maliki or Shafii, while most Shia Muslims, the Twelvers, follow the Jaafari school of thought.[1] Islamic law is now the most widely used religious law, and one of the three most common legal systems of the world alongside common law and civil law.[2] During the Islamic Golden Age, classical Islamic law may have influenced the development of common law,[3] and also influenced the development of several civil law institutions.[4] quote: Excerp from the Islamic Dictionary: shari'a \"Way to the water.\" The \"way\" of Islam in accord with the Qur'an and Sunna, ijma' and qiyas. Sharia is the law of Islam. It is based on the teachings of the Qur'an and the Sunna, though there are many sources outside these two, such as Arab Bedouin law, commercial law from Mecca, and the law of some conquered nations such as Roman and Jewish law. The Sharia extends beyond what Westerners consider law. It covers the totality of religious, political, social, including private life and makes no distinction between sin and law. These excerps and more can be found at the sources and at \"http://www.answers.com/topic/sharia\" There are also a list of these laws at the above site.", 
        "reply": " Maybe he is from that river in Africa? De nial. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:12:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important. Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue. Yeh, women cant speak for themselves they need michellbam to speak for them. Btw, my response before this was sarcasm.", 
        "intTime": 20090402, 
        "postID": 58, 
        "quote": "Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by 19022583: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Yes, the USA should acquess to the will of Middle Eastern shieks, imams, and muhlas. After all they don't have a history of screwing up their society like the USA does. Bill, it's about diversity dude, get with the program. I doubt that America's homosexual population will warmly embrace the \"diversity\" that might come with islamic law, or....women, for that matter! Right, but it doesnt matter muslim accommodations are more important. Yeah, right. American women make up roughly 52% of the population and NONE want to regress. Perhaps Michelle Obama will opine on this issue.", 
        "reply": " Yeh, women cant speak for themselves they need michellbam to speak for them. Btw, my response before this was sarcasm.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 10:35:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary.", 
        "intTime": 20090402, 
        "postID": 59, 
        "quote": "Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer.", 
        "reply": " You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary.", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 11:52:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: quote: Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary. How does that change ANYTHING? When insane, out of control, muslims, as in the video posted, are protesting on the streets of New York, scraming that the muslim flag will fly over the whitehouse and demanding Sharia law...", 
        "intTime": 20090402, 
        "postID": 60, 
        "quote": "Originally posted by SgtSalaamv2: quote: Originally posted by AngelHeart: I'm suprised at you Sgt. Both for claiming ignorance and for your denial of the existence of these laws based on the Qur'an Sunna, ijma' and qiyas. A simple search with the keyword shari·‘a or sharia also shariah, would give you an answer. You are not remotely \"surprised\" what your doing is an attempt to ignore what I actually posted. It should be obvious to many at this point, that I'm fully aware of these terms. My point is against the scary non-Muslims who are not. Many continue to speak of Shariah in terms that are just plain ignorant willful or otherwise in order to scare the pants off of others. Shariah law is not a static document that 1.5 billion Muslims accept like a Muslim Constitution, but a concept based on interpretations, upon interpretations, with no clear uniformed acceptance one way or the other as no Muslim is required to adhere to one principle school of thought one way or the other. If certain non-Muslims would learn that fact, they would realize how stupid they sound when they scream the sky is falling because Muslims want to implement Shariah law, no such static document exists in which to implement. It's a subjective concept that exists solely in the minds of those who follow various portions of said concept. When a Muslim says they agree with Shariah law, what they are often stating is that they believe in principle that the laws they should obey should be in accordance to their individual or groups interpretation of their understanding of Islam in practice. News flash! All practicing Muslims actively follow Shariah law in various degrees as a practicing Muslim, everything from how they pray to what they should or shouldn't do from one moment to the next can be extrapolated to be part of the \"shariah law\" concept. My point: The concept is way too broad to be contained in the simplistic scary view of some non-Muslims that want to paint an obscure and obviously foreign concept to them as something threatening and scary.", 
        "reply": " How does that change ANYTHING? When insane, out of control, muslims, as in the video posted, are protesting on the streets of New York, scraming that the muslim flag will fly over the whitehouse and demanding Sharia law...", 
        "threadID": "409192893_4590015912001", 
        "time": "2009-04-02 11:56:00", 
        "title": "Sharia law..coming your way!", 
        "userID": "threerings"
    }
]