[
    {
        "content": "quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. I agree that Active duty U.S. Military Police should not be used as crowd control at civilian events. But - Were these Active duty Military Police? If they were from a Kentucky National Guard military police unit, which by law is under the control and authority of the Governor of Kentucky, and the Governor of Kentucky chose to use them as additional crowd control at the Kentucky Derby, I believe the Governor of Kentucky is legally allowed to do so. So the title of this could be \"Kentucky Governor uses Kentucky National Guard for crowd control at the Kentucky Derby\".", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events.", 
        "reply": " I agree that Active duty U.S. Military Police should not be used as crowd control at civilian events. But - Were these Active duty Military Police? If they were from a Kentucky National Guard military police unit, which by law is under the control and authority of the Governor of Kentucky, and the Governor of Kentucky chose to use them as additional crowd control at the Kentucky Derby, I believe the Governor of Kentucky is legally allowed to do so. So the title of this could be \"Kentucky Governor uses Kentucky National Guard for crowd control at the Kentucky Derby\".", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 12:28:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "That's odd! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "That's odd! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 12:34:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Sooo is this supposed to be a new Obama policy or has it been going on for some time now; black helicopters and all that. Perhaps you should have posted this in the conspiracy theory forums.", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "", 
        "reply": "Sooo is this supposed to be a new Obama policy or has it been going on for some time now; black helicopters and all that. Perhaps you should have posted this in the conspiracy theory forums.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 12:39:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "foxred03"
    }, 
    {
        "content": "Of course, the OTHER question is, where was this particular photo taken? Could be a racetrack, or ... or ... or ... ? My thought was like FightDirector's - I'd suspect they were KY ARNG, not the 101st riding to the rescue, so to speak. In which case, it's not OBAMA's policy (much as many would like to blame him for everything including that annoying drip from the kitchen faucet) as much as the KY Governor's. If you find out more information, please do post it, KL!", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "", 
        "reply": "Of course, the OTHER question is, where was this particular photo taken? Could be a racetrack, or ... or ... or ... ? My thought was like FightDirector's - I'd suspect they were KY ARNG, not the 101st riding to the rescue, so to speak. In which case, it's not OBAMA's policy (much as many would like to blame him for everything including that annoying drip from the kitchen faucet) as much as the KY Governor's. If you find out more information, please do post it, KL!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 13:34:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves This message has been edited. Last edited by: L0A1, Wed 06 May 2009 02:38 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "", 
        "reply": "Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves This message has been edited. Last edited by: L0A1, Wed 06 May 2009 02:38 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 14:04:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. I don't think this is the first time military police have been at the Derby. Hope everyone saw the Navy group ring the bell for Eight Belles. As for the race itself, I (along with millions of others) said \"What the heck just happened?\"", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events.", 
        "reply": " I don't think this is the first time military police have been at the Derby. Hope everyone saw the Navy group ring the bell for Eight Belles. As for the race itself, I (along with millions of others) said \"What the heck just happened?\"", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 14:14:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Boospar"
    }, 
    {
        "content": "The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "", 
        "reply": "The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 14:43:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "When I was stationed there, we would sell Mint Juleps at the Derby. Dude in the photo is probably pizzed because he bought one. \"The World's Finest\"", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "", 
        "reply": "When I was stationed there, we would sell Mint Juleps at the Derby. Dude in the photo is probably pizzed because he bought one. \"The World's Finest\"", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:10:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks? No, the Posse Comitatus Act prohibits use of \"the Army or Air Force as a posse comitatus or otherwise to enforce the laws.\" That is FEDERAL LAW, not a state prohibition. The NG can be used as a police force if the governor and supporting law allows it.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "Originally posted by FollowMeInfantry: The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks?", 
        "reply": " No, the Posse Comitatus Act prohibits use of \"the Army or Air Force as a posse comitatus or otherwise to enforce the laws.\" That is FEDERAL LAW, not a state prohibition. The NG can be used as a police force if the governor and supporting law allows it.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:21:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events.", 
        "reply": " BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:27:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there Ah Hotel street at night time. What fond memories your post brings back.", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "reply": " Ah Hotel street at night time. What fond memories your post brings back.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:32:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Duster6"
    }, 
    {
        "content": "Is that MP about to karate chop that spectator? Brutal!", 
        "intTime": 20090506, 
        "postID": 12, 
        "quote": "", 
        "reply": "Is that MP about to karate chop that spectator? Brutal!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 20:13:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "Governor Patton greets members of the Kentucky National Guard at the Kentucky Derby Kentucky Governor from 1995 to 2003", 
        "intTime": 20090506, 
        "postID": 13, 
        "quote": "", 
        "reply": "Governor Patton greets members of the Kentucky National Guard at the Kentucky Derby Kentucky Governor from 1995 to 2003", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 21:43:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "samh32"
    }, 
    {
        "content": "I don't know what the big deal is, The Kentucky National guard have been used at the Derby for years. In fact a guard member received the Kentucky Medal of Valor for his actions at the 102nd Derby in 1976 when a smoke granade was thrown onto the track during the race. -------------------------------------------- SGT GARY D. WALL 438th Military Police Company Kentucky Army National Guard Louisville, Kentucky 01 May 1976 Sergeant Gary D. Wall, 438th Military Police Company, Kentucky National Guard, distinguished himself by a conspicuous act of bravery above and beyond the call of duty while serving on State Active Duty during the running of the 102nd Kentucky Derby. While serving in the Governor's escort, Sergeant Wall saw an ignited smoke grenade thrown onto the track immediately after the Derby had commenced. The potential for disaster was immediate and incalculable. Without hesitation and with complete disregard for his personal safety, Sergeant Wall ran onto the track to retrieve the burning grenade. Though temporarily blinded by the smoke and unable to determine the location of the horses, he carried the grenade to the edge of the track where it was buried. Sergeant Wall's immediate reaction to the situation prevented the 102nd Kentucky Derby from becoming a total disaster and without doubt saved the lives of jockeys, horses, and spectators. His heroic action prevented a catastrophic conclusion to one of the most exciting sports events in the world. This singularly distinctive act is in the highest traditions of the Kentucky Army National Guard and reflects great credit upon himself and the Commonwealth of Kentucky. This message has been edited. Last edited by: mfdaniels_rph, Thu 07 May 2009 02:39 PM", 
        "intTime": 20090507, 
        "postID": 14, 
        "quote": "", 
        "reply": "I don't know what the big deal is, The Kentucky National guard have been used at the Derby for years. In fact a guard member received the Kentucky Medal of Valor for his actions at the 102nd Derby in 1976 when a smoke granade was thrown onto the track during the race. -------------------------------------------- SGT GARY D. WALL 438th Military Police Company Kentucky Army National Guard Louisville, Kentucky 01 May 1976 Sergeant Gary D. Wall, 438th Military Police Company, Kentucky National Guard, distinguished himself by a conspicuous act of bravery above and beyond the call of duty while serving on State Active Duty during the running of the 102nd Kentucky Derby. While serving in the Governor's escort, Sergeant Wall saw an ignited smoke grenade thrown onto the track immediately after the Derby had commenced. The potential for disaster was immediate and incalculable. Without hesitation and with complete disregard for his personal safety, Sergeant Wall ran onto the track to retrieve the burning grenade. Though temporarily blinded by the smoke and unable to determine the location of the horses, he carried the grenade to the edge of the track where it was buried. Sergeant Wall's immediate reaction to the situation prevented the 102nd Kentucky Derby from becoming a total disaster and without doubt saved the lives of jockeys, horses, and spectators. His heroic action prevented a catastrophic conclusion to one of the most exciting sports events in the world. This singularly distinctive act is in the highest traditions of the Kentucky Army National Guard and reflects great credit upon himself and the Commonwealth of Kentucky. This message has been edited. Last edited by: mfdaniels_rph, Thu 07 May 2009 02:39 PM", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 13:53:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "OK, I honestly say that that is THE first award I have seen presented for valor by smoke grenade, thereby saving countless horses some coughing. LOL! I'm sorry, but that right there is funny! \"Without regard for his own safety, he recklessly and fearlessly picked up the enemy smoke grenade, carrying it to the very edge of the battlefield, wherein track patrons, many injured financially from the race before, were saved from a possible restart...\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "", 
        "reply": "OK, I honestly say that that is THE first award I have seen presented for valor by smoke grenade, thereby saving countless horses some coughing. LOL! I'm sorry, but that right there is funny! \"Without regard for his own safety, he recklessly and fearlessly picked up the enemy smoke grenade, carrying it to the very edge of the battlefield, wherein track patrons, many injured financially from the race before, were saved from a possible restart...\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 14:48:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area.", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "", 
        "reply": "I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 15:36:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by mfdaniels_rph: I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area. I think you took my satire a little too seriously, my friend. I was in no way knocking the actions nor the compunction of the soldier that did those actions, merely laughing at the idea of this BDU-clad soldier running out into the middle of a racetrack, picking up a smoke grenade, and yelling, \"Ooooh, Ooooh, hot, hot!\" all the way back as a herd of horses came barreling towards him, LOL. It just struck me as funny, that's all. No offense intended. Here, have a beer. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090507, 
        "postID": 17, 
        "quote": "Originally posted by mfdaniels_rph: I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area.", 
        "reply": " I think you took my satire a little too seriously, my friend. I was in no way knocking the actions nor the compunction of the soldier that did those actions, merely laughing at the idea of this BDU-clad soldier running out into the middle of a racetrack, picking up a smoke grenade, and yelling, \"Ooooh, Ooooh, hot, hot!\" all the way back as a herd of horses came barreling towards him, LOL. It just struck me as funny, that's all. No offense intended. Here, have a beer. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 16:08:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "You are right , I over reacted . It was pretty funny. Here have two on me", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "", 
        "reply": "You are right , I over reacted . It was pretty funny. Here have two on me", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 17:39:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves I watched teh Kentucky Derby live, adn did see soldiers standing around in teh background in several shots. I didn't think much of it, as I am around military and uniforms quirte often. Good points brought up though. If it's AD Army, why are they there? KNG, is a different matter, even though, that still smacks a little of a police state type atmosphere.", 
        "intTime": 20090508, 
        "postID": 19, 
        "quote": "Originally posted by L0A1: Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves", 
        "reply": " I watched teh Kentucky Derby live, adn did see soldiers standing around in teh background in several shots. I didn't think much of it, as I am around military and uniforms quirte often. Good points brought up though. If it's AD Army, why are they there? KNG, is a different matter, even though, that still smacks a little of a police state type atmosphere.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 06:04:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there Well the difference there is you were there to take care of military people, not civilians.", 
        "intTime": 20090508, 
        "postID": 20, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "reply": " Well the difference there is you were there to take care of military people, not civilians.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 06:06:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "billdawg24"
    }, 
    {
        "content": "As I posted before. The Kentucky National Guard have helped out at the Kentucky Derby since the 1930's. That is almost 80 years. When you realize that you have 150,000 people , most of them have been drinking all day , you can see the need. Churchill Downs is located in a pretty much residential area of Louisville with many small streets. They help with the security and traffic control. You also have to remember the crowd consists of more than drunk college students in the infield but many rich and famous people from around the world including dignitaries. The Queen of England was there a fews ago. So with the need for more security since 9/11 it is even more esential for the Governor to mobilize the Kentucky National Guard for this event", 
        "intTime": 20090508, 
        "postID": 21, 
        "quote": "", 
        "reply": "As I posted before. The Kentucky National Guard have helped out at the Kentucky Derby since the 1930's. That is almost 80 years. When you realize that you have 150,000 people , most of them have been drinking all day , you can see the need. Churchill Downs is located in a pretty much residential area of Louisville with many small streets. They help with the security and traffic control. You also have to remember the crowd consists of more than drunk college students in the infield but many rich and famous people from around the world including dignitaries. The Queen of England was there a fews ago. So with the need for more security since 9/11 it is even more esential for the Governor to mobilize the Kentucky National Guard for this event", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 07:23:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "Funny how no one complained about US Troops in NYC after 9-11.", 
        "intTime": 20090508, 
        "postID": 22, 
        "quote": "", 
        "reply": "Funny how no one complained about US Troops in NYC after 9-11.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 09:01:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "shuman14"
    }, 
    {
        "content": "Troops and scenerio and mission are always under scruitiny as this thread readily shows. We are a nation of \"Rule of Law\" when it comes to actions taken by those in government, in uniform especially because they stand out... politicians seem to get away with everything under the sun and law at present time. Maybe all elected officials should wear an arm band?!", 
        "intTime": 20090508, 
        "postID": 23, 
        "quote": "", 
        "reply": "Troops and scenerio and mission are always under scruitiny as this thread readily shows. We are a nation of \"Rule of Law\" when it comes to actions taken by those in government, in uniform especially because they stand out... politicians seem to get away with everything under the sun and law at present time. Maybe all elected officials should wear an arm band?!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 10:04:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity.", 
        "intTime": 20090508, 
        "postID": 24, 
        "quote": "", 
        "reply": "When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 10:40:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity. Next thing, you'll be crying about Color Guards at sporting events!!", 
        "intTime": 20090510, 
        "postID": 25, 
        "quote": "Originally posted by nspreitler: When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity.", 
        "reply": " Next thing, you'll be crying about Color Guards at sporting events!!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-10 05:44:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. I agree that Active duty U.S. Military Police should not be used as crowd control at civilian events. But - Were these Active duty Military Police? If they were from a Kentucky National Guard military police unit, which by law is under the control and authority of the Governor of Kentucky, and the Governor of Kentucky chose to use them as additional crowd control at the Kentucky Derby, I believe the Governor of Kentucky is legally allowed to do so. So the title of this could be \"Kentucky Governor uses Kentucky National Guard for crowd control at the Kentucky Derby\".", 
        "intTime": 20090506, 
        "postID": 26, 
        "quote": "Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events.", 
        "reply": " I agree that Active duty U.S. Military Police should not be used as crowd control at civilian events. But - Were these Active duty Military Police? If they were from a Kentucky National Guard military police unit, which by law is under the control and authority of the Governor of Kentucky, and the Governor of Kentucky chose to use them as additional crowd control at the Kentucky Derby, I believe the Governor of Kentucky is legally allowed to do so. So the title of this could be \"Kentucky Governor uses Kentucky National Guard for crowd control at the Kentucky Derby\".", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 12:28:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "That's odd! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090506, 
        "postID": 27, 
        "quote": "", 
        "reply": "That's odd! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 12:34:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Sooo is this supposed to be a new Obama policy or has it been going on for some time now; black helicopters and all that. Perhaps you should have posted this in the conspiracy theory forums.", 
        "intTime": 20090506, 
        "postID": 28, 
        "quote": "", 
        "reply": "Sooo is this supposed to be a new Obama policy or has it been going on for some time now; black helicopters and all that. Perhaps you should have posted this in the conspiracy theory forums.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 12:39:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "foxred03"
    }, 
    {
        "content": "Of course, the OTHER question is, where was this particular photo taken? Could be a racetrack, or ... or ... or ... ? My thought was like FightDirector's - I'd suspect they were KY ARNG, not the 101st riding to the rescue, so to speak. In which case, it's not OBAMA's policy (much as many would like to blame him for everything including that annoying drip from the kitchen faucet) as much as the KY Governor's. If you find out more information, please do post it, KL!", 
        "intTime": 20090506, 
        "postID": 29, 
        "quote": "", 
        "reply": "Of course, the OTHER question is, where was this particular photo taken? Could be a racetrack, or ... or ... or ... ? My thought was like FightDirector's - I'd suspect they were KY ARNG, not the 101st riding to the rescue, so to speak. In which case, it's not OBAMA's policy (much as many would like to blame him for everything including that annoying drip from the kitchen faucet) as much as the KY Governor's. If you find out more information, please do post it, KL!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 13:34:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves This message has been edited. Last edited by: L0A1, Wed 06 May 2009 02:38 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 30, 
        "quote": "", 
        "reply": "Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves This message has been edited. Last edited by: L0A1, Wed 06 May 2009 02:38 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 14:04:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. I don't think this is the first time military police have been at the Derby. Hope everyone saw the Navy group ring the bell for Eight Belles. As for the race itself, I (along with millions of others) said \"What the heck just happened?\"", 
        "intTime": 20090506, 
        "postID": 31, 
        "quote": "Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events.", 
        "reply": " I don't think this is the first time military police have been at the Derby. Hope everyone saw the Navy group ring the bell for Eight Belles. As for the race itself, I (along with millions of others) said \"What the heck just happened?\"", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 14:14:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Boospar"
    }, 
    {
        "content": "The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090506, 
        "postID": 32, 
        "quote": "", 
        "reply": "The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 14:43:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "When I was stationed there, we would sell Mint Juleps at the Derby. Dude in the photo is probably pizzed because he bought one. \"The World's Finest\"", 
        "intTime": 20090506, 
        "postID": 33, 
        "quote": "", 
        "reply": "When I was stationed there, we would sell Mint Juleps at the Derby. Dude in the photo is probably pizzed because he bought one. \"The World's Finest\"", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:10:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks? No, the Posse Comitatus Act prohibits use of \"the Army or Air Force as a posse comitatus or otherwise to enforce the laws.\" That is FEDERAL LAW, not a state prohibition. The NG can be used as a police force if the governor and supporting law allows it.", 
        "intTime": 20090506, 
        "postID": 34, 
        "quote": "Originally posted by FollowMeInfantry: The Posse Comitatus Act forbids the Active Duty to interfere with civilian law enforcement. Those are NG, who may serve the needs of the state but cannot make arrests under Posse Comitatus. Do I have this right, folks?", 
        "reply": " No, the Posse Comitatus Act prohibits use of \"the Army or Air Force as a posse comitatus or otherwise to enforce the laws.\" That is FEDERAL LAW, not a state prohibition. The NG can be used as a police force if the governor and supporting law allows it.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:21:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "intTime": 20090506, 
        "postID": 35, 
        "quote": "Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events.", 
        "reply": " BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:27:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there Ah Hotel street at night time. What fond memories your post brings back.", 
        "intTime": 20090506, 
        "postID": 36, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "reply": " Ah Hotel street at night time. What fond memories your post brings back.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 17:32:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "Duster6"
    }, 
    {
        "content": "Is that MP about to karate chop that spectator? Brutal!", 
        "intTime": 20090506, 
        "postID": 37, 
        "quote": "", 
        "reply": "Is that MP about to karate chop that spectator? Brutal!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 20:13:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "Governor Patton greets members of the Kentucky National Guard at the Kentucky Derby Kentucky Governor from 1995 to 2003", 
        "intTime": 20090506, 
        "postID": 38, 
        "quote": "", 
        "reply": "Governor Patton greets members of the Kentucky National Guard at the Kentucky Derby Kentucky Governor from 1995 to 2003", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-06 21:43:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "samh32"
    }, 
    {
        "content": "I don't know what the big deal is, The Kentucky National guard have been used at the Derby for years. In fact a guard member received the Kentucky Medal of Valor for his actions at the 102nd Derby in 1976 when a smoke granade was thrown onto the track during the race. -------------------------------------------- SGT GARY D. WALL 438th Military Police Company Kentucky Army National Guard Louisville, Kentucky 01 May 1976 Sergeant Gary D. Wall, 438th Military Police Company, Kentucky National Guard, distinguished himself by a conspicuous act of bravery above and beyond the call of duty while serving on State Active Duty during the running of the 102nd Kentucky Derby. While serving in the Governor's escort, Sergeant Wall saw an ignited smoke grenade thrown onto the track immediately after the Derby had commenced. The potential for disaster was immediate and incalculable. Without hesitation and with complete disregard for his personal safety, Sergeant Wall ran onto the track to retrieve the burning grenade. Though temporarily blinded by the smoke and unable to determine the location of the horses, he carried the grenade to the edge of the track where it was buried. Sergeant Wall's immediate reaction to the situation prevented the 102nd Kentucky Derby from becoming a total disaster and without doubt saved the lives of jockeys, horses, and spectators. His heroic action prevented a catastrophic conclusion to one of the most exciting sports events in the world. This singularly distinctive act is in the highest traditions of the Kentucky Army National Guard and reflects great credit upon himself and the Commonwealth of Kentucky. This message has been edited. Last edited by: mfdaniels_rph, Thu 07 May 2009 02:39 PM", 
        "intTime": 20090507, 
        "postID": 39, 
        "quote": "", 
        "reply": "I don't know what the big deal is, The Kentucky National guard have been used at the Derby for years. In fact a guard member received the Kentucky Medal of Valor for his actions at the 102nd Derby in 1976 when a smoke granade was thrown onto the track during the race. -------------------------------------------- SGT GARY D. WALL 438th Military Police Company Kentucky Army National Guard Louisville, Kentucky 01 May 1976 Sergeant Gary D. Wall, 438th Military Police Company, Kentucky National Guard, distinguished himself by a conspicuous act of bravery above and beyond the call of duty while serving on State Active Duty during the running of the 102nd Kentucky Derby. While serving in the Governor's escort, Sergeant Wall saw an ignited smoke grenade thrown onto the track immediately after the Derby had commenced. The potential for disaster was immediate and incalculable. Without hesitation and with complete disregard for his personal safety, Sergeant Wall ran onto the track to retrieve the burning grenade. Though temporarily blinded by the smoke and unable to determine the location of the horses, he carried the grenade to the edge of the track where it was buried. Sergeant Wall's immediate reaction to the situation prevented the 102nd Kentucky Derby from becoming a total disaster and without doubt saved the lives of jockeys, horses, and spectators. His heroic action prevented a catastrophic conclusion to one of the most exciting sports events in the world. This singularly distinctive act is in the highest traditions of the Kentucky Army National Guard and reflects great credit upon himself and the Commonwealth of Kentucky. This message has been edited. Last edited by: mfdaniels_rph, Thu 07 May 2009 02:39 PM", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 13:53:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "OK, I honestly say that that is THE first award I have seen presented for valor by smoke grenade, thereby saving countless horses some coughing. LOL! I'm sorry, but that right there is funny! \"Without regard for his own safety, he recklessly and fearlessly picked up the enemy smoke grenade, carrying it to the very edge of the battlefield, wherein track patrons, many injured financially from the race before, were saved from a possible restart...\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090507, 
        "postID": 40, 
        "quote": "", 
        "reply": "OK, I honestly say that that is THE first award I have seen presented for valor by smoke grenade, thereby saving countless horses some coughing. LOL! I'm sorry, but that right there is funny! \"Without regard for his own safety, he recklessly and fearlessly picked up the enemy smoke grenade, carrying it to the very edge of the battlefield, wherein track patrons, many injured financially from the race before, were saved from a possible restart...\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 14:48:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area.", 
        "intTime": 20090507, 
        "postID": 41, 
        "quote": "", 
        "reply": "I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 15:36:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by mfdaniels_rph: I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area. I think you took my satire a little too seriously, my friend. I was in no way knocking the actions nor the compunction of the soldier that did those actions, merely laughing at the idea of this BDU-clad soldier running out into the middle of a racetrack, picking up a smoke grenade, and yelling, \"Ooooh, Ooooh, hot, hot!\" all the way back as a herd of horses came barreling towards him, LOL. It just struck me as funny, that's all. No offense intended. Here, have a beer. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090507, 
        "postID": 42, 
        "quote": "Originally posted by mfdaniels_rph: I guess it is no big deal to run out onto a track with about 15-20 half ton horse coming at you that can run a mile and a quarter in 2 minutes pick up a burning object and run back off. Not to mention if the horses panic the death and destruction that could have resulted. Don't expect any do-overs there. Also , would like to point out the KNG have been used at th Derby since the 1930's. Absolutly neccessary when you have 150,000 (many of who have been drinking) trying to leave a residential area.", 
        "reply": " I think you took my satire a little too seriously, my friend. I was in no way knocking the actions nor the compunction of the soldier that did those actions, merely laughing at the idea of this BDU-clad soldier running out into the middle of a racetrack, picking up a smoke grenade, and yelling, \"Ooooh, Ooooh, hot, hot!\" all the way back as a herd of horses came barreling towards him, LOL. It just struck me as funny, that's all. No offense intended. Here, have a beer. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 16:08:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "You are right , I over reacted . It was pretty funny. Here have two on me", 
        "intTime": 20090507, 
        "postID": 43, 
        "quote": "", 
        "reply": "You are right , I over reacted . It was pretty funny. Here have two on me", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-07 17:39:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves I watched teh Kentucky Derby live, adn did see soldiers standing around in teh background in several shots. I didn't think much of it, as I am around military and uniforms quirte often. Good points brought up though. If it's AD Army, why are they there? KNG, is a different matter, even though, that still smacks a little of a police state type atmosphere.", 
        "intTime": 20090508, 
        "postID": 44, 
        "quote": "Originally posted by L0A1: Are we sure this is the Kentucky Derby? I see tire tracks in the dirt going out pretty far onto the track. Thought horses had hooves", 
        "reply": " I watched teh Kentucky Derby live, adn did see soldiers standing around in teh background in several shots. I didn't think much of it, as I am around military and uniforms quirte often. Good points brought up though. If it's AD Army, why are they there? KNG, is a different matter, even though, that still smacks a little of a police state type atmosphere.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 06:04:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there Well the difference there is you were there to take care of military people, not civilians.", 
        "intTime": 20090508, 
        "postID": 45, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Maybe this should go with the thread \"Obama and Guns\" A Google News search does not produce a story or even a brief mention of the fact military police were on hand at the Kentucky Derby to keep the restless in line. However, an Associated Press photograph, posted on the Yahoo! News website, shows two MPs in combat fatigues with side arms restraining a man at the derby. The military has no business policing citizens except during extraordinarily exceptional times of national emergency by an executive order. This is very disturbing and completely un-American. Maybe even more disturbing is that no one seems to care how quietly and easily we have accepted the burgeoning police state. The presence of uniformed and armed military police at the Kentucky Derby is part of an ongoing campaign to acclimate the populace to the presence of soldiers at public events. BFD!!!....Hell I got stuck with Shore Patrol duty in Honolulu....Hotel street...drunk service members...nothing new there", 
        "reply": " Well the difference there is you were there to take care of military people, not civilians.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 06:06:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "billdawg24"
    }, 
    {
        "content": "As I posted before. The Kentucky National Guard have helped out at the Kentucky Derby since the 1930's. That is almost 80 years. When you realize that you have 150,000 people , most of them have been drinking all day , you can see the need. Churchill Downs is located in a pretty much residential area of Louisville with many small streets. They help with the security and traffic control. You also have to remember the crowd consists of more than drunk college students in the infield but many rich and famous people from around the world including dignitaries. The Queen of England was there a fews ago. So with the need for more security since 9/11 it is even more esential for the Governor to mobilize the Kentucky National Guard for this event", 
        "intTime": 20090508, 
        "postID": 46, 
        "quote": "", 
        "reply": "As I posted before. The Kentucky National Guard have helped out at the Kentucky Derby since the 1930's. That is almost 80 years. When you realize that you have 150,000 people , most of them have been drinking all day , you can see the need. Churchill Downs is located in a pretty much residential area of Louisville with many small streets. They help with the security and traffic control. You also have to remember the crowd consists of more than drunk college students in the infield but many rich and famous people from around the world including dignitaries. The Queen of England was there a fews ago. So with the need for more security since 9/11 it is even more esential for the Governor to mobilize the Kentucky National Guard for this event", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 07:23:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "Funny how no one complained about US Troops in NYC after 9-11.", 
        "intTime": 20090508, 
        "postID": 47, 
        "quote": "", 
        "reply": "Funny how no one complained about US Troops in NYC after 9-11.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 09:01:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "shuman14"
    }, 
    {
        "content": "Troops and scenerio and mission are always under scruitiny as this thread readily shows. We are a nation of \"Rule of Law\" when it comes to actions taken by those in government, in uniform especially because they stand out... politicians seem to get away with everything under the sun and law at present time. Maybe all elected officials should wear an arm band?!", 
        "intTime": 20090508, 
        "postID": 48, 
        "quote": "", 
        "reply": "Troops and scenerio and mission are always under scruitiny as this thread readily shows. We are a nation of \"Rule of Law\" when it comes to actions taken by those in government, in uniform especially because they stand out... politicians seem to get away with everything under the sun and law at present time. Maybe all elected officials should wear an arm band?!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 10:04:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity.", 
        "intTime": 20090508, 
        "postID": 49, 
        "quote": "", 
        "reply": "When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity.", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-08 10:40:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity. Next thing, you'll be crying about Color Guards at sporting events!!", 
        "intTime": 20090510, 
        "postID": 50, 
        "quote": "Originally posted by nspreitler: When I was stationed at Dover AFB, we would work the NASCAR races for traffic control, security, etc. The difference was we did it in civilian clothes and as temporary employees of Dover Downs. All the proceeds went to the squadron funds to pay for unit functions. Things like the Kentucky Derby are for profit events and I think it is inappropriate for the government (federal or state) to spend money on it. If the state was reimbursed for the Soldiers it would be alright, but it would probably be better to do it in a civilian capacity.", 
        "reply": " Next thing, you'll be crying about Color Guards at sporting events!!", 
        "threadID": "409192893_3570046222001", 
        "time": "2009-05-10 05:44:00", 
        "title": "Military Police at the Kentucky Derby", 
        "userID": "samh32"
    }
]