[
    {
        "content": "Was it outlawed like napalm was or what? That was some badazz stuff.", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "Was it outlawed like napalm was or what? That was some badazz stuff.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-25 21:57:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "We still use it for its INTENDED purposes which is too provide cover and concealment..... Why would you want to use this stuff against people??", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "", 
        "reply": "We still use it for its INTENDED purposes which is too provide cover and concealment..... Why would you want to use this stuff against people??", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-25 22:01:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: We still use it for its INTENDED purposes which is too provide cover and concealment..... Why would you want to use this stuff against people?? We used it in Fallujah. Brits used it too. It was used for cover and concealment but I think it was used for lethal intent too. Of course, I wasn't there, just going by what I heard. I know it was used by both sides in Nam for lethal intent. If it was my call, I wouldn't use it against people unless it was all I had left. Truly nasty.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "Originally posted by Irwin_R_Schyster: We still use it for its INTENDED purposes which is too provide cover and concealment..... Why would you want to use this stuff against people??", 
        "reply": " We used it in Fallujah. Brits used it too. It was used for cover and concealment but I think it was used for lethal intent too. Of course, I wasn't there, just going by what I heard. I know it was used by both sides in Nam for lethal intent. If it was my call, I wouldn't use it against people unless it was all I had left. Truly nasty.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-25 22:45:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: We still use it for its INTENDED purposes which is too provide cover and concealment..... Why would you want to use this stuff against people?? We used it in Fallujah. Brits used it too. It was used for cover and concealment but I think it was used for lethal intent too. Of course, I wasn't there, just going by what I heard. I know it was used by both sides in Nam for lethal intent. If it was my call, I wouldn't use it against people unless it was all I had left. Truly nasty. The Israelis were raining it down on Gaza recently as well. It really has no purpose against people except to melt them...", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Irwin_R_Schyster: We still use it for its INTENDED purposes which is too provide cover and concealment..... Why would you want to use this stuff against people?? We used it in Fallujah. Brits used it too. It was used for cover and concealment but I think it was used for lethal intent too. Of course, I wasn't there, just going by what I heard. I know it was used by both sides in Nam for lethal intent. If it was my call, I wouldn't use it against people unless it was all I had left. Truly nasty.", 
        "reply": " The Israelis were raining it down on Gaza recently as well. It really has no purpose against people except to melt them...", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-25 22:51:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I just googled it and found out it's actually illegal to use it as an anti personnel weapon. It's OK to use it for screening though. Also found these pics. Don't even go there if you don't want to see horrible death: >http://www.rainews24.rai.it/ran24/inchiesta/en/records.asp]http://www.rainews24.rai.it/ran24/inchiesta/en/records.asp I think it's connected to al Jazeera so it's not 100% certified that WE did this but it's an example of what WP does to people regardless of who did it. It should be banned.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "I just googled it and found out it's actually illegal to use it as an anti personnel weapon. It's OK to use it for screening though. Also found these pics. Don't even go there if you don't want to see horrible death: >http://www.rainews24.rai.it/ran24/inchiesta/en/records.asp]http://www.rainews24.rai.it/ran24/inchiesta/en/records.asp I think it's connected to al Jazeera so it's not 100% certified that WE did this but it's an example of what WP does to people regardless of who did it. It should be banned.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-25 23:56:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Is white phosphorus considered a chemical weapon?", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "", 
        "reply": "Is white phosphorus considered a chemical weapon?", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 00:27:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Is white phosphorus considered a chemical weapon? I'm not sure. I think it depends upon how it's used.", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "Originally posted by scooter_mech: Is white phosphorus considered a chemical weapon?", 
        "reply": " I'm not sure. I think it depends upon how it's used.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 01:48:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "\"www.guardian.co.uk/world/2009/jan/21/gaza-phosphorus-israel\" Check this out. Here is how to protect your self from a Willy-Pete attack.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "", 
        "reply": "\"www.guardian.co.uk/world/2009/jan/21/gaza-phosphorus-israel\" Check this out. Here is how to protect your self from a Willy-Pete attack.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 02:45:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Duster6"
    }, 
    {
        "content": "Scooter,,it was fired out of a 4.2\" Chemical mortor, so that should answer your question. I was wishing to lay some a that shiyt on enemy troops in the early 60z.", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "", 
        "reply": "Scooter,,it was fired out of a 4.2\" Chemical mortor, so that should answer your question. I was wishing to lay some a that shiyt on enemy troops in the early 60z.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 05:18:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "Willy-Pete (White Phosphorus)and napalm are two different weapons. WP can be fired from any artillery tube, napalm is dropped from aircraft. I remember when WP was banned but can't remember extactly when, 70s sometime, I think.", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "", 
        "reply": "Willy-Pete (White Phosphorus)and napalm are two different weapons. WP can be fired from any artillery tube, napalm is dropped from aircraft. I remember when WP was banned but can't remember extactly when, 70s sometime, I think.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 05:40:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: Is white phosphorus considered a chemical weapon? Simple answer - yes, because it is technically not an explosive round or a kinetic round, but a round filled with chemicals whose primary purpose is to create white smoke, as a screen or marker. If used for those two purposed, it has a legitimate purpose. If someone calls for a \"fire for effect\" with an HE and WP mix to blow up and burn out the enemy, some feel that should be a no-no. Same with dropping napalm, which is basically jelled gasoline. We carried 4 or 5 rounds of WP on our tanks for \"marking\" purposes, and were told not to use it against \"troops in open.\" I guess that's the way it goes in \"nice\" wars, if there is such a thing. I noticed the Israelis were using WP \"for screening purposes\" in their last fight recently - - Gaza WP Air Bursts - Kosher??? You got me - - Wandering and Wondering", 
        "intTime": 20090426, 
        "postID": 11, 
        "quote": "Originally posted by scooter_mech: Is white phosphorus considered a chemical weapon?", 
        "reply": " Simple answer - yes, because it is technically not an explosive round or a kinetic round, but a round filled with chemicals whose primary purpose is to create white smoke, as a screen or marker. If used for those two purposed, it has a legitimate purpose. If someone calls for a \"fire for effect\" with an HE and WP mix to blow up and burn out the enemy, some feel that should be a no-no. Same with dropping napalm, which is basically jelled gasoline. We carried 4 or 5 rounds of WP on our tanks for \"marking\" purposes, and were told not to use it against \"troops in open.\" I guess that's the way it goes in \"nice\" wars, if there is such a thing. I noticed the Israelis were using WP \"for screening purposes\" in their last fight recently - - Gaza WP Air Bursts - Kosher??? You got me - - Wandering and Wondering", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 13:54:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "willy pete, great stuff napalm great stuff there are and there is a direct replacement for napalm, developed in field and used by US ground troops in Iraq would i use either to stay alive,dam right have i used either, well lets say they did not issue willy pete grenades to hang on suspenders...for style............... and snake and nape popular item for dasc.. have had it less than 100 yards from my pos dam right", 
        "intTime": 20090426, 
        "postID": 12, 
        "quote": "", 
        "reply": "willy pete, great stuff napalm great stuff there are and there is a direct replacement for napalm, developed in field and used by US ground troops in Iraq would i use either to stay alive,dam right have i used either, well lets say they did not issue willy pete grenades to hang on suspenders...for style............... and snake and nape popular item for dasc.. have had it less than 100 yards from my pos dam right", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 14:11:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "One bad thing for sure... That schidt is difficult to extinguish once it starts! It is literally classified as a \"Class 'D'\" fire and there are only three extinguishing agents (Graphite, Copper, or Salt), besides using good layers of old-fashioned mud to cover it with. I knew someone who had to actually have his arm held UNDER WATER to have a chunk of 'willie' removed from his arm... Not a pretty sight!", 
        "intTime": 20090426, 
        "postID": 13, 
        "quote": "", 
        "reply": "One bad thing for sure... That schidt is difficult to extinguish once it starts! It is literally classified as a \"Class 'D'\" fire and there are only three extinguishing agents (Graphite, Copper, or Salt), besides using good layers of old-fashioned mud to cover it with. I knew someone who had to actually have his arm held UNDER WATER to have a chunk of 'willie' removed from his arm... Not a pretty sight!", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 15:52:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by scooter_mech: Is white phosphorus considered a chemical weapon? I'm not sure. I think it depends upon how it's used. It's strictly against the Laws Of Armed Combat to use it specifically against live targets and debatable whether it's legal to use it where you might \"reasonably expect live targets to be\". The ban is on two grounds IIRC: Firstly because it is a chemical weapon and secondly on the grounds that it's primary function is to cause \"grievous\" but not necessarily fatal wounds and is therefore inhumane (the same clause that bans certain types of expanding ammunition).", 
        "intTime": 20090426, 
        "postID": 14, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by scooter_mech: Is white phosphorus considered a chemical weapon? I'm not sure. I think it depends upon how it's used.", 
        "reply": " It's strictly against the Laws Of Armed Combat to use it specifically against live targets and debatable whether it's legal to use it where you might \"reasonably expect live targets to be\". The ban is on two grounds IIRC: Firstly because it is a chemical weapon and secondly on the grounds that it's primary function is to cause \"grievous\" but not necessarily fatal wounds and is therefore inhumane (the same clause that bans certain types of expanding ammunition).", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 15:56:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Why would you want to use this stuff against people?? Because it works! KFC anyone?", 
        "intTime": 20090426, 
        "postID": 15, 
        "quote": "Why would you want to use this stuff against people??", 
        "reply": " Because it works! KFC anyone?", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 19:12:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Warrior7d"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: It's strictly against the Laws Of Armed Combat to use it specifically against live targets and debatable whether it's legal to use it where you might \"reasonably expect live targets to be\". yeah, and we're not suposed to use ma-duce against troops either......... hasn't stopped anyone since the thing first came out. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090426, 
        "postID": 16, 
        "quote": "Originally posted by Bladensburg: It's strictly against the Laws Of Armed Combat to use it specifically against live targets and debatable whether it's legal to use it where you might \"reasonably expect live targets to be\".", 
        "reply": " yeah, and we're not suposed to use ma-duce against troops either......... hasn't stopped anyone since the thing first came out. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 20:41:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "WP is still used.", 
        "intTime": 20090426, 
        "postID": 17, 
        "quote": "", 
        "reply": "WP is still used.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-26 22:47:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Bladensburg: It's strictly against the Laws Of Armed Combat to use it specifically against live targets and debatable whether it's legal to use it where you might \"reasonably expect live targets to be\". yeah, and we're not suposed to use ma-duce against troops either......... hasn't stopped anyone since the thing first came out. I was under the impression that was a bit of a myth, certainly I've never seen the idea upheld seriously because it's clear that a .50BMG strike will almost certainly kill just about anyone instantly and therefore the \"grievous wound\" clause doesn't really come into play. As I recall it was weapons that would cause the sort of wound that is not necessarily instantly fatal but will probably kill on the battlefield in an intensely painful and unpleasant way - hence fire weapons and Dumdum bullets but not .50cal rounds.", 
        "intTime": 20090427, 
        "postID": 18, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Bladensburg: It's strictly against the Laws Of Armed Combat to use it specifically against live targets and debatable whether it's legal to use it where you might \"reasonably expect live targets to be\". yeah, and we're not suposed to use ma-duce against troops either......... hasn't stopped anyone since the thing first came out.", 
        "reply": " I was under the impression that was a bit of a myth, certainly I've never seen the idea upheld seriously because it's clear that a .50BMG strike will almost certainly kill just about anyone instantly and therefore the \"grievous wound\" clause doesn't really come into play. As I recall it was weapons that would cause the sort of wound that is not necessarily instantly fatal but will probably kill on the battlefield in an intensely painful and unpleasant way - hence fire weapons and Dumdum bullets but not .50cal rounds.", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-27 04:01:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "When in doubt, check the source: FM 27-10 The Law of Land Warfare quote: Section 33: Means of Injuring the Enemy Limited a. Treaty Provision. The right of belligerents to adopt means of injuring the enemy is not unlimited. (HR, art. 22.) b. The means employed are definitely restricted by international declarations and conventions and by the laws and usages of war. Section 34. Employment of Arms Causing Unnecessary Injury a. Treaty Provision. FM 27-10 Appendix A - 11 It is especially forbidden * * * to employ arms, projectiles, or material calculated to cause unnecessary suffering. (HR, art. 23, par. (e).) b. Interpretation. What weapons cause “unnecessary injury” can only be determined in light of the practice of States in refraining from the use of a given weapon because it is believed to have that effect. The prohibition certainly does not extend to the use of ex-plosives contained in artillery projectiles, mines, rockets, or hand grenades. Usage has, however, established the illegality of the use of lances with barbed heads, irregular-shaped bullets, and projectiles filled with glass, the use of any substance on bullets that would tend unnecessarily to inflame a wound inflicted by them, and the scoring of the surface or the filing off of the ends of the hard cases of bullets. Section 36. Weapons Employing Fire The use of weapons which employ fire, such as tracer ammunition, flame throwers, napalm and other incendiary agents, against targets requiring their use is not violative of international law. They should not, however, be employed in such a way as to cause unnecessary suffering to individuals. I believe the mentioning of 'tracer ammunition' above implies a belt loaded with nothing but tracers used as an incindiary as opposed to the normal use of tracers as a marker for where a weapon is firing. By this reference, .50Cal ball ammunition is not illegal. However, the willful use of a weapon loaded with .50 Cal API (Armor Piercing Incindiary) against personnel could be construed as illegal according to clause #36. Sullivan013", 
        "intTime": 20090428, 
        "postID": 19, 
        "quote": "Section 33: Means of Injuring the Enemy Limited a. Treaty Provision. The right of belligerents to adopt means of injuring the enemy is not unlimited. (HR, art. 22.) b. The means employed are definitely restricted by international declarations and conventions and by the laws and usages of war. Section 34. Employment of Arms Causing Unnecessary Injury a. Treaty Provision. FM 27-10 Appendix A - 11 It is especially forbidden * * * to employ arms, projectiles, or material calculated to cause unnecessary suffering. (HR, art. 23, par. (e).) b. Interpretation. What weapons cause “unnecessary injury” can only be determined in light of the practice of States in refraining from the use of a given weapon because it is believed to have that effect. The prohibition certainly does not extend to the use of ex-plosives contained in artillery projectiles, mines, rockets, or hand grenades. Usage has, however, established the illegality of the use of lances with barbed heads, irregular-shaped bullets, and projectiles filled with glass, the use of any substance on bullets that would tend unnecessarily to inflame a wound inflicted by them, and the scoring of the surface or the filing off of the ends of the hard cases of bullets. Section 36. Weapons Employing Fire The use of weapons which employ fire, such as tracer ammunition, flame throwers, napalm and other incendiary agents, against targets requiring their use is not violative of international law. They should not, however, be employed in such a way as to cause unnecessary suffering to individuals.", 
        "reply": "When in doubt, check the source: FM 27-10 The Law of Land Warfare  I believe the mentioning of 'tracer ammunition' above implies a belt loaded with nothing but tracers used as an incindiary as opposed to the normal use of tracers as a marker for where a weapon is firing. By this reference, .50Cal ball ammunition is not illegal. However, the willful use of a weapon loaded with .50 Cal API (Armor Piercing Incindiary) against personnel could be construed as illegal according to clause #36. Sullivan013", 
        "threadID": "409192893_4570097122001", 
        "time": "2009-04-28 05:23:00", 
        "title": "Why an when did we stop useing Willy-Pete?", 
        "userID": "sullivan013"
    }
]