[
    {
        "content": "quote: The number of employees working at the dealerships that are being notified is not yet known. The average dealership has about 52 employees, according to the National Automobile Dealers of America, meaning about 57,000 workers could lose their job as a result of Friday's action. All told, the planned dealership cuts at Chrysler and GM will eventually cost 140,000 jobs, NADA estimates. In a mere two days, Obama's economy saw 150,000 jobs lost, but we've got hope and change to pay the bills Why is he allowing the economy to swirl more vigorously down the toilet??", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "The number of employees working at the dealerships that are being notified is not yet known. The average dealership has about 52 employees, according to the National Automobile Dealers of America, meaning about 57,000 workers could lose their job as a result of Friday's action. All told, the planned dealership cuts at Chrysler and GM will eventually cost 140,000 jobs, NADA estimates.", 
        "reply": " In a mere two days, Obama's economy saw 150,000 jobs lost, but we've got hope and change to pay the bills Why is he allowing the economy to swirl more vigorously down the toilet??", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-15 11:33:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: The number of employees working at the dealerships that are being notified is not yet known. The average dealership has about 52 employees, according to the National Automobile Dealers of America, meaning about 57,000 workers could lose their job as a result of Friday's action. All told, the planned dealership cuts at Chrysler and GM will eventually cost 140,000 jobs, NADA estimates. In a mere two days, Obama's economy saw 150,000 jobs lost, but we've got hope and change to pay the bills Why is he allowing the economy to swirl more vigorously down the toilet?? Most likely to keep the \"Crissis\" going so he can use it to pass his agenda which calls for MORE SPENDING AND BORROWING!! I do hope I am wrong, but if what I suspect is true, he is a devious man. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: The number of employees working at the dealerships that are being notified is not yet known. The average dealership has about 52 employees, according to the National Automobile Dealers of America, meaning about 57,000 workers could lose their job as a result of Friday's action. All told, the planned dealership cuts at Chrysler and GM will eventually cost 140,000 jobs, NADA estimates. In a mere two days, Obama's economy saw 150,000 jobs lost, but we've got hope and change to pay the bills Why is he allowing the economy to swirl more vigorously down the toilet??", 
        "reply": " Most likely to keep the \"Crissis\" going so he can use it to pass his agenda which calls for MORE SPENDING AND BORROWING!! I do hope I am wrong, but if what I suspect is true, he is a devious man. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-15 11:37:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: The number of employees working at the dealerships that are being notified is not yet known. The average dealership has about 52 employees, according to the National Automobile Dealers of America, meaning about 57,000 workers could lose their job as a result of Friday's action. All told, the planned dealership cuts at Chrysler and GM will eventually cost 140,000 jobs, NADA estimates. In a mere two days, Obama's economy saw 150,000 jobs lost, but we've got hope and change to pay the bills Why is he allowing the economy to swirl more vigorously down the toilet?? There is only so much money. They are already swiming in debt up to their eye balls. I think its $1.8 trillion this year alone. He has already commited to saving the banks. To saving the insurance industry. To proping up whatever gets propped up by his stimulus bill earlier this year. There simply is no more money. He has to prioritize and the auto manufacturers which make a product that hurts rather than helps global warming isn't a high priority for what little dollars he has. Besides. Don't you guys know that Detroit has been a long time supporter of Republican candidates?", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: The number of employees working at the dealerships that are being notified is not yet known. The average dealership has about 52 employees, according to the National Automobile Dealers of America, meaning about 57,000 workers could lose their job as a result of Friday's action. All told, the planned dealership cuts at Chrysler and GM will eventually cost 140,000 jobs, NADA estimates. In a mere two days, Obama's economy saw 150,000 jobs lost, but we've got hope and change to pay the bills Why is he allowing the economy to swirl more vigorously down the toilet??", 
        "reply": " There is only so much money. They are already swiming in debt up to their eye balls. I think its $1.8 trillion this year alone. He has already commited to saving the banks. To saving the insurance industry. To proping up whatever gets propped up by his stimulus bill earlier this year. There simply is no more money. He has to prioritize and the auto manufacturers which make a product that hurts rather than helps global warming isn't a high priority for what little dollars he has. Besides. Don't you guys know that Detroit has been a long time supporter of Republican candidates?", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-15 13:56:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "floersh"
    }, 
    {
        "content": "The Harvard Boys Club strikes again.", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "", 
        "reply": "The Harvard Boys Club strikes again.", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-15 16:14:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "Duster6"
    }, 
    {
        "content": "I can’t wait to see what Obama can do to the economy in eight years like Bush had. Ah, the good old days before Jan 20, when everyone had a job, gas was cheap, record profits in the marke, no such thing as a bail out…", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "", 
        "reply": "I can’t wait to see what Obama can do to the economy in eight years like Bush had. Ah, the good old days before Jan 20, when everyone had a job, gas was cheap, record profits in the marke, no such thing as a bail out…", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-16 06:45:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "NavySubBubba"
    }, 
    {
        "content": "More \"Change you can believe in\"..... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "intTime": 20090516, 
        "postID": 6, 
        "quote": "", 
        "reply": "More \"Change you can believe in\"..... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-16 15:09:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "It's funny how the Obama detractors can call the President the \"Messiah\", while at the same time actually expecting him to fix the problems of the last few years in a few weeks. Actually wait, it's not funny at all. It's entirely expected. If we can microwave our dinner in 3 minutes why can't the President fix all our problems in 3 months?", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "", 
        "reply": "It's funny how the Obama detractors can call the President the \"Messiah\", while at the same time actually expecting him to fix the problems of the last few years in a few weeks. Actually wait, it's not funny at all. It's entirely expected. If we can microwave our dinner in 3 minutes why can't the President fix all our problems in 3 months?", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-17 00:11:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "Boots_"
    }, 
    {
        "content": "scream that unions are needing to cut their pay. scream when the government loans the auto industry money and tells them to restructure because they need to sink or swim on their own. scream when the government GIVES wall street billions because they need to sink or swim on their own. scream that CEO's deserve huge bonuses and claiming otherwise is socialism/class warfare. scream when businesses sink and blame it on the government. or just cut to the chase and admit you're not going to be happy until the \"uppity\" Democrat is out of the White House, and it doesn't matter what he does or doesn't do.", 
        "intTime": 20090517, 
        "postID": 8, 
        "quote": "", 
        "reply": "scream that unions are needing to cut their pay. scream when the government loans the auto industry money and tells them to restructure because they need to sink or swim on their own. scream when the government GIVES wall street billions because they need to sink or swim on their own. scream that CEO's deserve huge bonuses and claiming otherwise is socialism/class warfare. scream when businesses sink and blame it on the government. or just cut to the chase and admit you're not going to be happy until the \"uppity\" Democrat is out of the White House, and it doesn't matter what he does or doesn't do.", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-17 00:30:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Lots of teaching positions are getting cut in Washington State. Not sure why the Democratic Government is letting education get cut from the budgets. Teachers Union is pretty quiet. \"DEATH ON CALL\"", 
        "intTime": 20090517, 
        "postID": 9, 
        "quote": "", 
        "reply": "Lots of teaching positions are getting cut in Washington State. Not sure why the Democratic Government is letting education get cut from the budgets. Teachers Union is pretty quiet. \"DEATH ON CALL\"", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-17 07:48:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "Combatmix"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: or just cut to the chase and admit you're not going to be happy until the \"uppity\" Democrat is out of the White House, and it doesn't matter what he does or doesn't do. OK, I admit it. I'll be glad when he's gone and takes his little minions with him.", 
        "intTime": 20090517, 
        "postID": 10, 
        "quote": "Originally posted by karlhungusjr: or just cut to the chase and admit you're not going to be happy until the \"uppity\" Democrat is out of the White House, and it doesn't matter what he does or doesn't do.", 
        "reply": " OK, I admit it. I'll be glad when he's gone and takes his little minions with him.", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-17 16:31:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: OK, I admit it. I'll be glad when he's gone and takes his little minions with him. Smile +1 for honesty", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "OK, I admit it. I'll be glad when he's gone and takes his little minions with him. Smile", 
        "reply": " +1 for honesty", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-17 21:07:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "WHOSE ECONOMY?? When I last looked, this economy was brought to you by Jimmy Carter. Bill Clinton, Barney Frank, Chris Dodd, Fannie Mae and Freddie Mac. As much as I can not stand even the thought of Obama, lets be correct when we blame people and put the shoe where it belongs....up the appropriate a**!!!!", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "", 
        "reply": "WHOSE ECONOMY?? When I last looked, this economy was brought to you by Jimmy Carter. Bill Clinton, Barney Frank, Chris Dodd, Fannie Mae and Freddie Mac. As much as I can not stand even the thought of Obama, lets be correct when we blame people and put the shoe where it belongs....up the appropriate a**!!!!", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-17 21:51:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "tawodi"
    }, 
    {
        "content": "George Bush gets the accolade for being the guy who got us there.... he was the dude...", 
        "intTime": 20090517, 
        "postID": 13, 
        "quote": "", 
        "reply": "George Bush gets the accolade for being the guy who got us there.... he was the dude...", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-17 23:12:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: this economy was brought to you by Jimmy Carter. Bill Clinton, Barney Frank, Chris Dodd, Fannie Mae and Freddie Mac. weird how Carter is to blame but not the presidents who followed him for 12 years then all the sudden another president is to blame for eight years but not the president for the eight years after that.", 
        "intTime": 20090518, 
        "postID": 14, 
        "quote": "this economy was brought to you by Jimmy Carter. Bill Clinton, Barney Frank, Chris Dodd, Fannie Mae and Freddie Mac.", 
        "reply": " weird how Carter is to blame but not the presidents who followed him for 12 years then all the sudden another president is to blame for eight years but not the president for the eight years after that.", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-18 01:56:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by tawodi: WHOSE ECONOMY?? When I last looked, this economy was brought to you by Jimmy Carter. Bill Clinton, Barney Frank, Chris Dodd, Fannie Mae and Freddie Mac. As much as I can not stand even the thought of Obama, lets be correct when we blame people and put the shoe where it belongs....up the appropriate a**!!!! You forgot to mention Ronnie Reagan!! In order to cover newly spawned federal budget deficits, the United States borrowed heavily both domestically and abroad, raising the national debt from $700 billion to $3 trillion. Ronald Reagan described the new debt as the \"greatest disappointment\" of his presidency", 
        "intTime": 20090518, 
        "postID": 15, 
        "quote": "Originally posted by tawodi: WHOSE ECONOMY?? When I last looked, this economy was brought to you by Jimmy Carter. Bill Clinton, Barney Frank, Chris Dodd, Fannie Mae and Freddie Mac. As much as I can not stand even the thought of Obama, lets be correct when we blame people and put the shoe where it belongs....up the appropriate a**!!!!", 
        "reply": " You forgot to mention Ronnie Reagan!! In order to cover newly spawned federal budget deficits, the United States borrowed heavily both domestically and abroad, raising the national debt from $700 billion to $3 trillion. Ronald Reagan described the new debt as the \"greatest disappointment\" of his presidency", 
        "threadID": "409192893_4860083322001", 
        "time": "2009-05-18 02:56:00", 
        "title": "President Obama economy loose's another 140,000 jobs", 
        "userID": "samh32"
    }
]