[
    {
        "content": "Well, it appears that the banks packaged all of their credit card debts into securities just as they did with those pesky mortgages. Seeing as there are going to be a lot of CC defaults in the near future, this only adds to the hell we will see in regards to the economy. Let's not forget that mortgage NODs are now at levels much higher than they were during the first wave of foreclosures, meaning that their will be significantly more foreclosures in the second wave that will start late spring and extend into the summer. Let's also not forget that the Commercial Real Estate market is on the verge of taking a nosedive. Well, just add the Credit Cards into that credit crisis. This is not over by any means. In fact, it will get A LOT worse. Hope you have prepared for a complete collapse of our economy. I have. ---http://www.usatoday.com/money/industries/banking/2008-11-09-bank-credit-card-interest-rates_N.htm", 
        "intTime": 20090424, 
        "postID": 1, 
        "quote": "", 
        "reply": "Well, it appears that the banks packaged all of their credit card debts into securities just as they did with those pesky mortgages. Seeing as there are going to be a lot of CC defaults in the near future, this only adds to the hell we will see in regards to the economy. Let's not forget that mortgage NODs are now at levels much higher than they were during the first wave of foreclosures, meaning that their will be significantly more foreclosures in the second wave that will start late spring and extend into the summer. Let's also not forget that the Commercial Real Estate market is on the verge of taking a nosedive. Well, just add the Credit Cards into that credit crisis. This is not over by any means. In fact, it will get A LOT worse. Hope you have prepared for a complete collapse of our economy. I have. ---http://www.usatoday.com/money/industries/banking/2008-11-09-bank-credit-card-interest-rates_N.htm", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-24 15:22:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I know this don't work for everyone....but it's best if you pay your balance each month. Credit is going to get real tight. the economy, in spite of what they tell you, isn't at the bottom yet. Job layoffs continue and houses are still defaulting and the Banks? They aren't lending to folks that actually might need a loan. If you don't need one and have good credit....they'll lend you all you want.", 
        "intTime": 20090424, 
        "postID": 2, 
        "quote": "", 
        "reply": "I know this don't work for everyone....but it's best if you pay your balance each month. Credit is going to get real tight. the economy, in spite of what they tell you, isn't at the bottom yet. Job layoffs continue and houses are still defaulting and the Banks? They aren't lending to folks that actually might need a loan. If you don't need one and have good credit....they'll lend you all you want.", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-24 16:02:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "_cash_"
    }, 
    {
        "content": "Don't worry, Barry is calling all those mean credit card company CEO/CFOs into a meeting and give them a good talking to... that will cure the problem.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "Don't worry, Barry is calling all those mean credit card company CEO/CFOs into a meeting and give them a good talking to... that will cure the problem.", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-25 05:42:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "If your credit card company sends you notification that your rates are being raised, you have a few options: 1. Accept the rate increase. 2. Pay off the balance and close the account. 3. Decline the rate increase and close the account. It is not necessary for you pay it off in a lump sum, but it IS necessary that you continue to make your payments on time and allow no further charges to be made on that account, including any automatic payments you'd authorized. The issuer is bound by law to honor the original agreement they made with you, but any new charges or late payments can be used as a reason to go ahead and increase the interest rate anyhow.", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "", 
        "reply": "If your credit card company sends you notification that your rates are being raised, you have a few options: 1. Accept the rate increase. 2. Pay off the balance and close the account. 3. Decline the rate increase and close the account. It is not necessary for you pay it off in a lump sum, but it IS necessary that you continue to make your payments on time and allow no further charges to be made on that account, including any automatic payments you'd authorized. The issuer is bound by law to honor the original agreement they made with you, but any new charges or late payments can be used as a reason to go ahead and increase the interest rate anyhow.", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-25 06:00:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "stillkit"
    }, 
    {
        "content": "Screw 'em. I'm going back to the \"If you can't pay cash, you don't need it\" system in my life.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "Screw 'em. I'm going back to the \"If you can't pay cash, you don't need it\" system in my life.", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-25 08:01:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Very few things should be bought on credit by the average family: Home - on fixed rate loan...preferable through your own bank/credit union, so some of the % comes back to your own accounts. Auto - fixed rate loan - same approach as above.... Major home appliances (Fridge, washer, stove, heater) same approach as above.... Anything else? If ya don't have the cash save up...or you don't need it... Wandering and Wondering", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "", 
        "reply": "Very few things should be bought on credit by the average family: Home - on fixed rate loan...preferable through your own bank/credit union, so some of the % comes back to your own accounts. Auto - fixed rate loan - same approach as above.... Major home appliances (Fridge, washer, stove, heater) same approach as above.... Anything else? If ya don't have the cash save up...or you don't need it... Wandering and Wondering", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-25 10:18:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Very few things should be bought on credit by the average family: Home - on fixed rate loan...preferable through your own bank/credit union, so some of the % comes back to your own accounts. Auto - fixed rate loan - same approach as above.... Major home appliances (Fridge, washer, stove, heater) same approach as above.... Anything else? If ya don't have the cash save up...or you don't need it... Damn, we agree! The four horsemen just rode by. Problem is some establishments no longer accept cash. Like major hotels and motels. I paid cash for a meal at an upscale restaurant and the waiter acted like he didn't know what to do.", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "Originally posted by greywolfghost: Very few things should be bought on credit by the average family: Home - on fixed rate loan...preferable through your own bank/credit union, so some of the % comes back to your own accounts. Auto - fixed rate loan - same approach as above.... Major home appliances (Fridge, washer, stove, heater) same approach as above.... Anything else? If ya don't have the cash save up...or you don't need it...", 
        "reply": " Damn, we agree! The four horsemen just rode by. Problem is some establishments no longer accept cash. Like major hotels and motels. I paid cash for a meal at an upscale restaurant and the waiter acted like he didn't know what to do.", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-25 11:33:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "Thud357L"
    }, 
    {
        "content": "I bought one home on credit (30 year fixed, 20% down) and the other I paid cash for. I always pay cash for vehicles, because I see absolutely no reason to pay more for something that becomes so valueless so quickly. The only thing that I use credit cards for is vacations and rentals (for the perks and insurance). I never, ever carry a balance. I believe that the current crisis was the fault of people who just do not get this frame of mind. Thanks. Thanks a lot.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "", 
        "reply": "I bought one home on credit (30 year fixed, 20% down) and the other I paid cash for. I always pay cash for vehicles, because I see absolutely no reason to pay more for something that becomes so valueless so quickly. The only thing that I use credit cards for is vacations and rentals (for the perks and insurance). I never, ever carry a balance. I believe that the current crisis was the fault of people who just do not get this frame of mind. Thanks. Thanks a lot.", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-26 00:29:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Don't worry, Barry is calling all those mean credit card company CEO/CFOs into a meeting and give them a good talking to... that will cure the problem. The president is talking real reform. I'm cautiously optomistic. By BEN FELLER, Associated Press Writer Ben Feller, Associated Press Writer – Thu Apr 23, 7:06 pm ET WASHINGTON – President Barack Obama said Thursday he is determined to get a credit-card law that eliminates the tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\"", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "Originally posted by Mom2APAJ: Don't worry, Barry is calling all those mean credit card company CEO/CFOs into a meeting and give them a good talking to... that will cure the problem.", 
        "reply": " The president is talking real reform. I'm cautiously optomistic. By BEN FELLER, Associated Press Writer Ben Feller, Associated Press Writer – Thu Apr 23, 7:06 pm ET WASHINGTON – President Barack Obama said Thursday he is determined to get a credit-card law that eliminates the tricky fine print, sudden rate increases and late fees that give millions of consumers headaches. \"http://news.yahoo.com/s/ap/20090423/ap_on_go_pr_wh/us_obama_credit_cards\"", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-26 00:50:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by stillkit: If your credit card company sends you notification that your rates are being raised, you have a few options: 1. Accept the rate increase. 2. Pay off the balance and close the account. 3. Decline the rate increase and close the account. It is not necessary for you pay it off in a lump sum, but it IS necessary that you continue to make your payments on time and allow no further charges to be made on that account, including any automatic payments you'd authorized. The issuer is bound by law to honor the original agreement they made with you, but any new charges or late payments can be used as a reason to go ahead and increase the interest rate anyhow. you really only have those options, you and i dont agree a lot, but here we do.. if you pay if off and dont use it, maybe later you can force it down to a reasonable rate.. i hd a low rate MC, they did the rate increase to almost 18 percent, i just paid it off, but did not close the acct, sort of a wait and see, but do not plan on putting any more than a tank of gas on the card now and then and paying it off each time", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "Originally posted by stillkit: If your credit card company sends you notification that your rates are being raised, you have a few options: 1. Accept the rate increase. 2. Pay off the balance and close the account. 3. Decline the rate increase and close the account. It is not necessary for you pay it off in a lump sum, but it IS necessary that you continue to make your payments on time and allow no further charges to be made on that account, including any automatic payments you'd authorized. The issuer is bound by law to honor the original agreement they made with you, but any new charges or late payments can be used as a reason to go ahead and increase the interest rate anyhow.", 
        "reply": " you really only have those options, you and i dont agree a lot, but here we do.. if you pay if off and dont use it, maybe later you can force it down to a reasonable rate.. i hd a low rate MC, they did the rate increase to almost 18 percent, i just paid it off, but did not close the acct, sort of a wait and see, but do not plan on putting any more than a tank of gas on the card now and then and paying it off each time", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-26 14:19:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Screw 'em. I'm going back to the \"If you can't pay cash, you don't need it\" system in my life. Good policy. For people and governments. That said: I've been stating for a while: inflation and bloody high intrest rates are unavoidable. The increase in the rate of spending Obama has created makes it a forgone reality. As well as higher taxes. Unavoidable. And Obama isn't stupid. So if he wants to create high inflation, high intrest rates, and massive tax increases, what does that tell you about his intended policy?", 
        "intTime": 20090426, 
        "postID": 11, 
        "quote": "Originally posted by Thud357L: Screw 'em. I'm going back to the \"If you can't pay cash, you don't need it\" system in my life.", 
        "reply": " Good policy. For people and governments. That said: I've been stating for a while: inflation and bloody high intrest rates are unavoidable. The increase in the rate of spending Obama has created makes it a forgone reality. As well as higher taxes. Unavoidable. And Obama isn't stupid. So if he wants to create high inflation, high intrest rates, and massive tax increases, what does that tell you about his intended policy?", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-26 15:52:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "threerings"
    }, 
    {
        "content": "what does that tell you about his intended policy? It's time to practice grabbing my ankles???", 
        "intTime": 20090426, 
        "postID": 12, 
        "quote": "", 
        "reply": "what does that tell you about his intended policy? It's time to practice grabbing my ankles???", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-26 16:32:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: what does that tell you about his intended policy? It's time to practice grabbing my ankles??? Its far worse then that. remember, the one thing you can prove that Obama believes is that we, meaning the entire world, should be equal..and since he cant raise 3rd world nations to our level of civlization..i guess that means we have to be knocked down a peg or five.", 
        "intTime": 20090426, 
        "postID": 13, 
        "quote": "Originally posted by tawodi: what does that tell you about his intended policy? It's time to practice grabbing my ankles???", 
        "reply": " Its far worse then that. remember, the one thing you can prove that Obama believes is that we, meaning the entire world, should be equal..and since he cant raise 3rd world nations to our level of civlization..i guess that means we have to be knocked down a peg or five.", 
        "threadID": "409192893_3050086122001", 
        "time": "2009-04-26 17:55:00", 
        "title": "Why Credit Card rates are rising", 
        "userID": "threerings"
    }
]