[
    {
        "content": "+++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 15:33:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "threerings"
    }, 
    {
        "content": "A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\" \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 2, 
        "quote": "", 
        "reply": "A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\" \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 16:29:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\" Or better yet when shrub II and his toadies cheney/frist/delay saved terri schiavo by calling congress back into session...Now let me know if you want the coroners report on Terri Schiavo?.... The left is posting this little gem", 
        "intTime": 20090508, 
        "postID": 3, 
        "quote": "Originally posted by PinkBlossoms: A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\"", 
        "reply": " Or better yet when shrub II and his toadies cheney/frist/delay saved terri schiavo by calling congress back into session...Now let me know if you want the coroners report on Terri Schiavo?.... The left is posting this little gem", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 16:38:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. Ahhh yes. Going back to Reagan. When Reagan created the United States with lightning bolts from his eyes and fire from his arse. When Reagan himself wrote the constitution, freed the slaves, and defeated Hitler! The beginning of the universe itself...going back to Reagan.", 
        "intTime": 20090508, 
        "postID": 4, 
        "quote": "Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "reply": " Ahhh yes. Going back to Reagan. When Reagan created the United States with lightning bolts from his eyes and fire from his arse. When Reagan himself wrote the constitution, freed the slaves, and defeated Hitler! The beginning of the universe itself...going back to Reagan.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 17:15:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "Boots_"
    }, 
    {
        "content": "ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death. Michael Schiavo is yet another criminal who walks free. And since you dropped the Schiavo bomb, here's what I posted on it before: Michael Schiavo in Hell (a play in one paragraph) By Tom Smith MS: Where am I? Gosh it is so hot here! Man with No Eyebrows: But I think you will agree it is a very dry heat. MS: Dry! I'll say! I'm so thirsty! I don't think I've ever been so thirsty! MNE: Just you wait. MS: What? MNE: You said you were thirsty? MS: So thirsty . . . MNE: Would you like some nice, cool water? MS: Please! MNE: Let me just check outside. (Goes to door.) Why, how curious. There are hundreds of people out here trying to bring you water. Would you like a cup? MS: Oh yes! MNE: Cold water or warm? MS: Cold! I don't care! MNE: You know, I think we actually have a procedure to determine whether I can give you any water. I don't think I'm permitted to give you water just because you're thirsty! We have rules, you know. MS: Rules? MNE: Oh, yes. Rules and rules. MS: Well, who do I have to ask? MNE: Oh, judges. We have lots of judges here. You may recognize some of them. MS: I don't have time for that! MNE: Trust me. You do. MS: All I want is some water, for Christ's sake! MNE: (Wincing) Please don't swear. (Years later . . . ) MS: Water. Water. I'm so thristy . . . MNE: Oh, look! A package! It seems to be a crate of chilled Evian water sent by Terri and her parents. Do you remember them? MS: Water? Water! Water! MNE: I would let you have some, but that would violate the temporary restraining order issued before the 99th interlocutory appeal to the 666th Circuit. If there's one thing we don't permit around here, it's contempt of court. (Sipping.) Mmmmm. I don' t really prefer Evian. I think it tastes a little soapy or something. Still, it is nice and cold. MS: Water! Huhnnnnnhuuuhhh! MNE: What are you saying, Michael? You seem a little inarticulate. Well, I suppose I know what you really want. You really want to follow the law, right? I knew it. And believe me, just as soon as I am permitted to do so, I will give you a nice big gulp of water, if there's any left, that is! Alas, I must toddle. I must go to visit your attorney. He's right next door, you know! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 5, 
        "quote": "", 
        "reply": "ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death. Michael Schiavo is yet another criminal who walks free. And since you dropped the Schiavo bomb, here's what I posted on it before: Michael Schiavo in Hell (a play in one paragraph) By Tom Smith MS: Where am I? Gosh it is so hot here! Man with No Eyebrows: But I think you will agree it is a very dry heat. MS: Dry! I'll say! I'm so thirsty! I don't think I've ever been so thirsty! MNE: Just you wait. MS: What? MNE: You said you were thirsty? MS: So thirsty . . . MNE: Would you like some nice, cool water? MS: Please! MNE: Let me just check outside. (Goes to door.) Why, how curious. There are hundreds of people out here trying to bring you water. Would you like a cup? MS: Oh yes! MNE: Cold water or warm? MS: Cold! I don't care! MNE: You know, I think we actually have a procedure to determine whether I can give you any water. I don't think I'm permitted to give you water just because you're thirsty! We have rules, you know. MS: Rules? MNE: Oh, yes. Rules and rules. MS: Well, who do I have to ask? MNE: Oh, judges. We have lots of judges here. You may recognize some of them. MS: I don't have time for that! MNE: Trust me. You do. MS: All I want is some water, for Christ's sake! MNE: (Wincing) Please don't swear. (Years later . . . ) MS: Water. Water. I'm so thristy . . . MNE: Oh, look! A package! It seems to be a crate of chilled Evian water sent by Terri and her parents. Do you remember them? MS: Water? Water! Water! MNE: I would let you have some, but that would violate the temporary restraining order issued before the 99th interlocutory appeal to the 666th Circuit. If there's one thing we don't permit around here, it's contempt of court. (Sipping.) Mmmmm. I don' t really prefer Evian. I think it tastes a little soapy or something. Still, it is nice and cold. MS: Water! Huhnnnnnhuuuhhh! MNE: What are you saying, Michael? You seem a little inarticulate. Well, I suppose I know what you really want. You really want to follow the law, right? I knew it. And believe me, just as soon as I am permitted to do so, I will give you a nice big gulp of water, if there's any left, that is! Alas, I must toddle. I must go to visit your attorney. He's right next door, you know! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 17:39:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Criminals that walk free: Jackson, Schiavo, OJ ... (Slick MIA) lol \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 6, 
        "quote": "", 
        "reply": "Criminals that walk free: Jackson, Schiavo, OJ ... (Slick MIA) lol \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 17:59:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death. So now you're a physician? Oh, I know, you're a neurosurgeon...? What? Your not...oh. Well then where do you get your evidence that a crime was committed? Because the prevailing medical evidence suggested that she was brain dead and would never recover. I'm sure her parents would have been willing to assume all responsibility for her care....no? But then there's the issue of him not being divorced from a BRAIN DEAD WOMAN preventing him from goiing forward with his life. Of course only YOUR opinion of what he should have done is relevant.... You might have a point if she was actually ALIVE. But she wasn't and the executive branch of our government had no right or reason to interject itself into the personal lives of free citizens....something your hypocrisy prevents you from seeing and admitting about your precious. Of course now the new guy is doing it and it's wrong.....wtf? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 7, 
        "quote": "Originally posted by PinkBlossoms: ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death.", 
        "reply": " So now you're a physician? Oh, I know, you're a neurosurgeon...? What? Your not...oh. Well then where do you get your evidence that a crime was committed? Because the prevailing medical evidence suggested that she was brain dead and would never recover. I'm sure her parents would have been willing to assume all responsibility for her care....no? But then there's the issue of him not being divorced from a BRAIN DEAD WOMAN preventing him from goiing forward with his life. Of course only YOUR opinion of what he should have done is relevant.... You might have a point if she was actually ALIVE. But she wasn't and the executive branch of our government had no right or reason to interject itself into the personal lives of free citizens....something your hypocrisy prevents you from seeing and admitting about your precious. Of course now the new guy is doing it and it's wrong.....wtf? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 19:27:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "You're losing it, mmuhlder. Get ahold of yourself. You're the last person I'd discuss this subject with - and you know it. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 8, 
        "quote": "", 
        "reply": "You're losing it, mmuhlder. Get ahold of yourself. You're the last person I'd discuss this subject with - and you know it. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 19:33:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 9, 
        "quote": "", 
        "reply": "Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 19:53:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post.", 
        "intTime": 20090508, 
        "postID": 10, 
        "quote": "Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms?", 
        "reply": " I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:08:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 11, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post.", 
        "reply": " Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:14:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level.", 
        "reply": " Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:19:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 13, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "reply": " If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:28:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 14, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "reply": " Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:40:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real. Oh how cute. Someone is trying to insulate herself from the reality of what she really is and failing miserably. Keep on with that hypocrisy...your true self is evident. At least to others anyway. You couldn't make mincemeat out of mincemeat. Keeping it real.....as if. And according to your tagline you \"ain't worth a damn\".... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 15, 
        "quote": "Originally posted by PinkBlossoms: Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real.", 
        "reply": " Oh how cute. Someone is trying to insulate herself from the reality of what she really is and failing miserably. Keep on with that hypocrisy...your true self is evident. At least to others anyway. You couldn't make mincemeat out of mincemeat. Keeping it real.....as if. And according to your tagline you \"ain't worth a damn\".... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 21:04:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then... Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man.", 
        "intTime": 20090508, 
        "postID": 16, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then...", 
        "reply": " Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 21:48:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man. Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 17, 
        "quote": "Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man.", 
        "reply": " Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 21:59:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man. Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot! And just because you deny it doesn't make it untrue either. See how that works? lol. I know you weren't mad at me but you were pretty p i s s y with Pink. You are funny sometimes mm and you do make me laugh. Seriously now, you have a good night. I'm out for the night.", 
        "intTime": 20090508, 
        "postID": 18, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man. Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot!", 
        "reply": " And just because you deny it doesn't make it untrue either. See how that works? lol. I know you weren't mad at me but you were pretty p i s s y with Pink. You are funny sometimes mm and you do make me laugh. Seriously now, you have a good night. I'm out for the night.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 22:25:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 19, 
        "quote": "", 
        "reply": "Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 23:45:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090509, 
        "postID": 20, 
        "quote": "Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night", 
        "reply": " At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 12:27:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "WOW, mulder, all I can say isd listen here: \"\"http://www.youtube.com/watch?v=n6nW75fnX60", 
        "intTime": 20090509, 
        "postID": 21, 
        "quote": "", 
        "reply": "WOW, mulder, all I can say isd listen here: \"\"http://www.youtube.com/watch?v=n6nW75fnX60", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 12:56:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Wow peter, all I can say is, who is Mr. Jones and why would you refer to a girl by that name? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090509, 
        "postID": 22, 
        "quote": "", 
        "reply": "Wow peter, all I can say is, who is Mr. Jones and why would you refer to a girl by that name? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 13:29:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it.", 
        "intTime": 20090509, 
        "postID": 23, 
        "quote": "Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "reply": " \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 13:40:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "In baseball season mmulder is over the plate the pitch flys past him", 
        "intTime": 20090509, 
        "postID": 24, 
        "quote": "", 
        "reply": "In baseball season mmulder is over the plate the pitch flys past him", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 13:46:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom.", 
        "intTime": 20090509, 
        "postID": 25, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it.", 
        "reply": " Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 14:09:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom. I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps?", 
        "intTime": 20090509, 
        "postID": 26, 
        "quote": "Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom.", 
        "reply": " I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps?", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 14:40:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show! C'mon you two. Where's the love? I realize this is none of my business but I like both of you and you'll both probably tell me to F'off but I have to say, I do not recognize either of you when you are responding to one another. I know you don't want to hear this but as usual, I am going to tell you anyway. Pink, I have been hangin around here for more than five years and I know mmulder well enough. To be truthful, I have never seen him act this way. I have never seen you act this way either. You two seem to have some ugly hate goin on. I don't often agree with mmulder but I like him anyway He takes my crap with a grain of salt, as I do his. Stop talking to him that way and you might actually get to know him a bit. Don't forget that he served this country with honor and he deserves our respect. Mmulder, Pink is a great lady. Stop talking to her like she is a piece of doo doo. She isn't. You are both wrong about each other. If you two can't or won't start fresh then not talking to each other might be the answer. (This would be for all our sakes) my .02 cents Now I will go back to minding my own business.", 
        "intTime": 20090509, 
        "postID": 27, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show!", 
        "reply": " C'mon you two. Where's the love? I realize this is none of my business but I like both of you and you'll both probably tell me to F'off but I have to say, I do not recognize either of you when you are responding to one another. I know you don't want to hear this but as usual, I am going to tell you anyway. Pink, I have been hangin around here for more than five years and I know mmulder well enough. To be truthful, I have never seen him act this way. I have never seen you act this way either. You two seem to have some ugly hate goin on. I don't often agree with mmulder but I like him anyway He takes my crap with a grain of salt, as I do his. Stop talking to him that way and you might actually get to know him a bit. Don't forget that he served this country with honor and he deserves our respect. Mmulder, Pink is a great lady. Stop talking to her like she is a piece of doo doo. She isn't. You are both wrong about each other. If you two can't or won't start fresh then not talking to each other might be the answer. (This would be for all our sakes) my .02 cents Now I will go back to minding my own business.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 15:11:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift? Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "intTime": 20090509, 
        "postID": 28, 
        "quote": "", 
        "reply": "All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift? Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 16:02:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "Silent_Surface"
    }, 
    {
        "content": "quote: Originally posted by Silent_Surface: All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift? Clear as a bell. quote: Originally posted by Silent_Surface: Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? Since this doesn't apply to me I'll leave commenting on it to the other individual... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090509, 
        "postID": 29, 
        "quote": "Originally posted by Silent_Surface: All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift?", 
        "reply": " Clear as a bell. quote: Originally posted by Silent_Surface: Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? Since this doesn't apply to me I'll leave commenting on it to the other individual... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 23:57:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom. I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps? Its a central part of almost everything the left does..how many times has Obama told us we cant drive our big cars, and keep our houses at 72 and we need to wash our hands, and we're too fat..hell Deval \"King of the World\" Patrick has pushed for a soda and candy tax here..because he thinks it will reduce the number of fat bodies..he has pushed for and recieved a new law that will require all school children to be weighed in 3rd 5th and 8th grade, a body fat index developed and then the results will be sent to the parents, along with \"guidelines\" on how to not have a fat kid.", 
        "intTime": 20090510, 
        "postID": 30, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom. I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps?", 
        "reply": " Its a central part of almost everything the left does..how many times has Obama told us we cant drive our big cars, and keep our houses at 72 and we need to wash our hands, and we're too fat..hell Deval \"King of the World\" Patrick has pushed for a soda and candy tax here..because he thinks it will reduce the number of fat bodies..he has pushed for and recieved a new law that will require all school children to be weighed in 3rd 5th and 8th grade, a body fat index developed and then the results will be sent to the parents, along with \"guidelines\" on how to not have a fat kid.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-10 04:29:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "threerings"
    }, 
    {
        "content": "+++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "intTime": 20090508, 
        "postID": 31, 
        "quote": "", 
        "reply": "+++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 15:33:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "threerings"
    }, 
    {
        "content": "A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\" \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 32, 
        "quote": "", 
        "reply": "A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\" \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 16:29:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\" Or better yet when shrub II and his toadies cheney/frist/delay saved terri schiavo by calling congress back into session...Now let me know if you want the coroners report on Terri Schiavo?.... The left is posting this little gem", 
        "intTime": 20090508, 
        "postID": 33, 
        "quote": "Originally posted by PinkBlossoms: A clip from your link: New Rule: Now that we've answered his call to wash our hands, President Obama must continue to tell us how to live. Last week, when America was faced with the pan-global swine flu omega death plague, the President went on TV and told people to wash their hands, and experts tell us this made a big difference, which augurs well for next month's \"National Wipe Your Butt Day.\" Next week, in a fireside chat, he'll tell us not to put a fork in the toaster. It's sad that the leader of the free world had to call a live press conference to tell his nation of clueless nitwits that employees must wash hands before returning to work. If that's not the \"Forrest Gump-ification\" of America, I don't know what is. Feeling wet, America? Why not try new, \"Coming in from the Rain\"? You may think I'm blowing this out of proportion, but this plea from Obama - you know, the \"Audacity of Soap\" - was the first specific thing a President has asked the American people to actually do in decades. Unless you count \"go shopping.\" Hopefully it will open the door to other, slightly weightier suggestions from the President. So please, Mr. President, tell us to turn the lights off when we leave the room. Tell us not to buy crap we don't need and can't afford. Tell us to lay off the Ring Dings and Cheese Nips, and think twice before dating a stranger we meet on craigslist. For God's sake, tell people to read a newspaper. Not just to save the newspaper industry - though Lord knows I'd miss my Daily Jumble - but because having a public that actually knows something is our best defense against ever again electing a President who knows nothing. There's a name for people who do the right thing for their country, even if it involves sacrifice. And no, it's not \"socialists.\" It's \"patriots.\"", 
        "reply": " Or better yet when shrub II and his toadies cheney/frist/delay saved terri schiavo by calling congress back into session...Now let me know if you want the coroners report on Terri Schiavo?.... The left is posting this little gem", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 16:38:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. Ahhh yes. Going back to Reagan. When Reagan created the United States with lightning bolts from his eyes and fire from his arse. When Reagan himself wrote the constitution, freed the slaves, and defeated Hitler! The beginning of the universe itself...going back to Reagan.", 
        "intTime": 20090508, 
        "postID": 34, 
        "quote": "Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "reply": " Ahhh yes. Going back to Reagan. When Reagan created the United States with lightning bolts from his eyes and fire from his arse. When Reagan himself wrote the constitution, freed the slaves, and defeated Hitler! The beginning of the universe itself...going back to Reagan.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 17:15:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "Boots_"
    }, 
    {
        "content": "ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death. Michael Schiavo is yet another criminal who walks free. And since you dropped the Schiavo bomb, here's what I posted on it before: Michael Schiavo in Hell (a play in one paragraph) By Tom Smith MS: Where am I? Gosh it is so hot here! Man with No Eyebrows: But I think you will agree it is a very dry heat. MS: Dry! I'll say! I'm so thirsty! I don't think I've ever been so thirsty! MNE: Just you wait. MS: What? MNE: You said you were thirsty? MS: So thirsty . . . MNE: Would you like some nice, cool water? MS: Please! MNE: Let me just check outside. (Goes to door.) Why, how curious. There are hundreds of people out here trying to bring you water. Would you like a cup? MS: Oh yes! MNE: Cold water or warm? MS: Cold! I don't care! MNE: You know, I think we actually have a procedure to determine whether I can give you any water. I don't think I'm permitted to give you water just because you're thirsty! We have rules, you know. MS: Rules? MNE: Oh, yes. Rules and rules. MS: Well, who do I have to ask? MNE: Oh, judges. We have lots of judges here. You may recognize some of them. MS: I don't have time for that! MNE: Trust me. You do. MS: All I want is some water, for Christ's sake! MNE: (Wincing) Please don't swear. (Years later . . . ) MS: Water. Water. I'm so thristy . . . MNE: Oh, look! A package! It seems to be a crate of chilled Evian water sent by Terri and her parents. Do you remember them? MS: Water? Water! Water! MNE: I would let you have some, but that would violate the temporary restraining order issued before the 99th interlocutory appeal to the 666th Circuit. If there's one thing we don't permit around here, it's contempt of court. (Sipping.) Mmmmm. I don' t really prefer Evian. I think it tastes a little soapy or something. Still, it is nice and cold. MS: Water! Huhnnnnnhuuuhhh! MNE: What are you saying, Michael? You seem a little inarticulate. Well, I suppose I know what you really want. You really want to follow the law, right? I knew it. And believe me, just as soon as I am permitted to do so, I will give you a nice big gulp of water, if there's any left, that is! Alas, I must toddle. I must go to visit your attorney. He's right next door, you know! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 35, 
        "quote": "", 
        "reply": "ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death. Michael Schiavo is yet another criminal who walks free. And since you dropped the Schiavo bomb, here's what I posted on it before: Michael Schiavo in Hell (a play in one paragraph) By Tom Smith MS: Where am I? Gosh it is so hot here! Man with No Eyebrows: But I think you will agree it is a very dry heat. MS: Dry! I'll say! I'm so thirsty! I don't think I've ever been so thirsty! MNE: Just you wait. MS: What? MNE: You said you were thirsty? MS: So thirsty . . . MNE: Would you like some nice, cool water? MS: Please! MNE: Let me just check outside. (Goes to door.) Why, how curious. There are hundreds of people out here trying to bring you water. Would you like a cup? MS: Oh yes! MNE: Cold water or warm? MS: Cold! I don't care! MNE: You know, I think we actually have a procedure to determine whether I can give you any water. I don't think I'm permitted to give you water just because you're thirsty! We have rules, you know. MS: Rules? MNE: Oh, yes. Rules and rules. MS: Well, who do I have to ask? MNE: Oh, judges. We have lots of judges here. You may recognize some of them. MS: I don't have time for that! MNE: Trust me. You do. MS: All I want is some water, for Christ's sake! MNE: (Wincing) Please don't swear. (Years later . . . ) MS: Water. Water. I'm so thristy . . . MNE: Oh, look! A package! It seems to be a crate of chilled Evian water sent by Terri and her parents. Do you remember them? MS: Water? Water! Water! MNE: I would let you have some, but that would violate the temporary restraining order issued before the 99th interlocutory appeal to the 666th Circuit. If there's one thing we don't permit around here, it's contempt of court. (Sipping.) Mmmmm. I don' t really prefer Evian. I think it tastes a little soapy or something. Still, it is nice and cold. MS: Water! Huhnnnnnhuuuhhh! MNE: What are you saying, Michael? You seem a little inarticulate. Well, I suppose I know what you really want. You really want to follow the law, right? I knew it. And believe me, just as soon as I am permitted to do so, I will give you a nice big gulp of water, if there's any left, that is! Alas, I must toddle. I must go to visit your attorney. He's right next door, you know! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 17:39:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Criminals that walk free: Jackson, Schiavo, OJ ... (Slick MIA) lol \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 36, 
        "quote": "", 
        "reply": "Criminals that walk free: Jackson, Schiavo, OJ ... (Slick MIA) lol \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 17:59:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death. So now you're a physician? Oh, I know, you're a neurosurgeon...? What? Your not...oh. Well then where do you get your evidence that a crime was committed? Because the prevailing medical evidence suggested that she was brain dead and would never recover. I'm sure her parents would have been willing to assume all responsibility for her care....no? But then there's the issue of him not being divorced from a BRAIN DEAD WOMAN preventing him from goiing forward with his life. Of course only YOUR opinion of what he should have done is relevant.... You might have a point if she was actually ALIVE. But she wasn't and the executive branch of our government had no right or reason to interject itself into the personal lives of free citizens....something your hypocrisy prevents you from seeing and admitting about your precious. Of course now the new guy is doing it and it's wrong.....wtf? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 37, 
        "quote": "Originally posted by PinkBlossoms: ahhh, Scott - you went and mentioned Schiavo. Thank you for reminding me of another time I was so proud of GWB. I applaud President Bush and everyone else who defended and respect LIFE. Her family loved her - and her azzwipe wanted her dead. In the state of Florida, it's illegal to starve a dog to death.", 
        "reply": " So now you're a physician? Oh, I know, you're a neurosurgeon...? What? Your not...oh. Well then where do you get your evidence that a crime was committed? Because the prevailing medical evidence suggested that she was brain dead and would never recover. I'm sure her parents would have been willing to assume all responsibility for her care....no? But then there's the issue of him not being divorced from a BRAIN DEAD WOMAN preventing him from goiing forward with his life. Of course only YOUR opinion of what he should have done is relevant.... You might have a point if she was actually ALIVE. But she wasn't and the executive branch of our government had no right or reason to interject itself into the personal lives of free citizens....something your hypocrisy prevents you from seeing and admitting about your precious. Of course now the new guy is doing it and it's wrong.....wtf? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 19:27:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "You're losing it, mmuhlder. Get ahold of yourself. You're the last person I'd discuss this subject with - and you know it. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 38, 
        "quote": "", 
        "reply": "You're losing it, mmuhlder. Get ahold of yourself. You're the last person I'd discuss this subject with - and you know it. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 19:33:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 39, 
        "quote": "", 
        "reply": "Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 19:53:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post.", 
        "intTime": 20090508, 
        "postID": 40, 
        "quote": "Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms?", 
        "reply": " I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:08:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 41, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post.", 
        "reply": " Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:14:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "intTime": 20090508, 
        "postID": 42, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level.", 
        "reply": " Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:19:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 43, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "reply": " If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:28:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 44, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip.", 
        "reply": " Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 20:40:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real. Oh how cute. Someone is trying to insulate herself from the reality of what she really is and failing miserably. Keep on with that hypocrisy...your true self is evident. At least to others anyway. You couldn't make mincemeat out of mincemeat. Keeping it real.....as if. And according to your tagline you \"ain't worth a damn\".... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 45, 
        "quote": "Originally posted by PinkBlossoms: Others have tried to tell him this, but he's fighting it. And now he wants to bring his friend, Seawitch, into it. pffft. Behind all that smoke and huff and name-calling, he's sore at me because I made mincemeat out of him ... on another board. Fun fact. Keeping it real.", 
        "reply": " Oh how cute. Someone is trying to insulate herself from the reality of what she really is and failing miserably. Keep on with that hypocrisy...your true self is evident. At least to others anyway. You couldn't make mincemeat out of mincemeat. Keeping it real.....as if. And according to your tagline you \"ain't worth a damn\".... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 21:04:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then... Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man.", 
        "intTime": 20090508, 
        "postID": 46, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: quote: Originally posted by mmulder67: Try refuting the comment instead of using your tired and boring old perverted routine of insulting through screen name alterations....right SeaBlossoms? I know you don't want to hear it mm, but she is right on in her assesment of your last over emotional post. Look out!....here comes the swarm..... You're right, I don't want to hear it from you. Especially considering her constant over emotional posts about subjects she lacks any credible knowledge of. Opinions are one thing...hers go to a whole new level. Try detaching yourself for a minute and reading your own post. If the fog in that brain of yours would clear for just a few seconds, you will see who the emotional wreck really is. There was a lot of anger in your post and this one was no better. Seriously....get a grip. If I detach myself then I'll be in your world and that's a scary place to be. Just because you assume there to be some form of emotional wreck, and I assume you're speaking from experience, going on doesn't necessarly make it so. So very interesting that you can infer mental state through type font..... Continue on with your superiority complex. It's at least good for a laugh now and then...", 
        "reply": " Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 21:48:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man. Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 47, 
        "quote": "Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man.", 
        "reply": " Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 21:59:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man. Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot! And just because you deny it doesn't make it untrue either. See how that works? lol. I know you weren't mad at me but you were pretty p i s s y with Pink. You are funny sometimes mm and you do make me laugh. Seriously now, you have a good night. I'm out for the night.", 
        "intTime": 20090508, 
        "postID": 48, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by AngelHeart: Jeez mmulder, lighten up. You are such an angry rude guy. You are the one who seems to be losing it. Pity you don't seem to know it. Between you and conspiracy theory john, you are both gonna explode and then where will you be? Have a good night because your a drag man. Just because you keep saying something doesn't make it so. Why are you responding in such an angry fashion? See? I can say you're angry too. Because, insinuating mental state through pixels and fonts must be easy for everyone.... Bold and capital typeset is used to emphasize a point. Nothing more. If I was angry I'd say something that would get me a vacation. Believe me, nothing you can say is remotely causing me any form of distress or anger. But you're more then welcome to keep trying... I need a good laugh every now and then and tonight it's been a riot!", 
        "reply": " And just because you deny it doesn't make it untrue either. See how that works? lol. I know you weren't mad at me but you were pretty p i s s y with Pink. You are funny sometimes mm and you do make me laugh. Seriously now, you have a good night. I'm out for the night.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 22:25:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 49, 
        "quote": "", 
        "reply": "Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-08 23:45:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090509, 
        "postID": 50, 
        "quote": "Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night", 
        "reply": " At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 12:27:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "WOW, mulder, all I can say isd listen here: \"\"http://www.youtube.com/watch?v=n6nW75fnX60", 
        "intTime": 20090509, 
        "postID": 51, 
        "quote": "", 
        "reply": "WOW, mulder, all I can say isd listen here: \"\"http://www.youtube.com/watch?v=n6nW75fnX60", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 12:56:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Wow peter, all I can say is, who is Mr. Jones and why would you refer to a girl by that name? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090509, 
        "postID": 52, 
        "quote": "", 
        "reply": "Wow peter, all I can say is, who is Mr. Jones and why would you refer to a girl by that name? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 13:29:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it.", 
        "intTime": 20090509, 
        "postID": 53, 
        "quote": "Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake.", 
        "reply": " \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 13:40:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "In baseball season mmulder is over the plate the pitch flys past him", 
        "intTime": 20090509, 
        "postID": 54, 
        "quote": "", 
        "reply": "In baseball season mmulder is over the plate the pitch flys past him", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 13:46:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom.", 
        "intTime": 20090509, 
        "postID": 55, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it.", 
        "reply": " Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 14:09:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom. I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps?", 
        "intTime": 20090509, 
        "postID": 56, 
        "quote": "Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom.", 
        "reply": " I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps?", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 14:40:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show! C'mon you two. Where's the love? I realize this is none of my business but I like both of you and you'll both probably tell me to F'off but I have to say, I do not recognize either of you when you are responding to one another. I know you don't want to hear this but as usual, I am going to tell you anyway. Pink, I have been hangin around here for more than five years and I know mmulder well enough. To be truthful, I have never seen him act this way. I have never seen you act this way either. You two seem to have some ugly hate goin on. I don't often agree with mmulder but I like him anyway He takes my crap with a grain of salt, as I do his. Stop talking to him that way and you might actually get to know him a bit. Don't forget that he served this country with honor and he deserves our respect. Mmulder, Pink is a great lady. Stop talking to her like she is a piece of doo doo. She isn't. You are both wrong about each other. If you two can't or won't start fresh then not talking to each other might be the answer. (This would be for all our sakes) my .02 cents Now I will go back to minding my own business.", 
        "intTime": 20090509, 
        "postID": 57, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by PinkBlossoms: Angel, nice of you to shed another 'voice of reason' on this thread tonight. The stories I could tell you about this one ... he doesn't know who/where he is half the time. Sometimes I'm in the mood to play with him, and other times not. The problem is, he instantly bows up in a huff and what you saw tonight is in mild form - believe me when I tell you. He only escalates. And then I feel guilty - only a tad. However, I don't think he should bring his sore bottom over here from another board. Check it at the door. That's my view. g'night At least one of you has a voice of reason. You'd be funny if you weren't so pathetic.... Maybe you should quit checking your brain at the door when you come on board.... But of course I know that your sole purpose for posting inflammatory and baiting comments is to get your sick perverted pleasure from the perceived angst of those who you can't compete with. Do keep trying....we're enjoying the show!", 
        "reply": " C'mon you two. Where's the love? I realize this is none of my business but I like both of you and you'll both probably tell me to F'off but I have to say, I do not recognize either of you when you are responding to one another. I know you don't want to hear this but as usual, I am going to tell you anyway. Pink, I have been hangin around here for more than five years and I know mmulder well enough. To be truthful, I have never seen him act this way. I have never seen you act this way either. You two seem to have some ugly hate goin on. I don't often agree with mmulder but I like him anyway He takes my crap with a grain of salt, as I do his. Stop talking to him that way and you might actually get to know him a bit. Don't forget that he served this country with honor and he deserves our respect. Mmulder, Pink is a great lady. Stop talking to her like she is a piece of doo doo. She isn't. You are both wrong about each other. If you two can't or won't start fresh then not talking to each other might be the answer. (This would be for all our sakes) my .02 cents Now I will go back to minding my own business.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 15:11:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift? Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "intTime": 20090509, 
        "postID": 58, 
        "quote": "", 
        "reply": "All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift? Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 16:02:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "Silent_Surface"
    }, 
    {
        "content": "quote: Originally posted by Silent_Surface: All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift? Clear as a bell. quote: Originally posted by Silent_Surface: Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? Since this doesn't apply to me I'll leave commenting on it to the other individual... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090509, 
        "postID": 59, 
        "quote": "Originally posted by Silent_Surface: All I know is that if the two kids don't stop picking on each other, someone else will have to step in. Like I tell my kids, If an adult has to stop your bickering for you, the life you think you understand will drastically change for the worse. Get my drift?", 
        "reply": " Clear as a bell. quote: Originally posted by Silent_Surface: Oh, by the way, if you feel a need to bring another boards issues here, you may not be here much longer. That has been clearly put out before, and WAS NOT A JOKE. Clear? Since this doesn't apply to me I'll leave commenting on it to the other individual... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-09 23:57:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom. I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps? Its a central part of almost everything the left does..how many times has Obama told us we cant drive our big cars, and keep our houses at 72 and we need to wash our hands, and we're too fat..hell Deval \"King of the World\" Patrick has pushed for a soda and candy tax here..because he thinks it will reduce the number of fat bodies..he has pushed for and recieved a new law that will require all school children to be weighed in 3rd 5th and 8th grade, a body fat index developed and then the results will be sent to the parents, along with \"guidelines\" on how to not have a fat kid.", 
        "intTime": 20090510, 
        "postID": 60, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by threerings: quote: Originally posted by BPCR45_90: quote: Originally posted by threerings: +++http://www.nydailynews.com/opinions/2009/05/08/2009-05-08_americans_please_wash_hands_before_criticizing_obama.html Going back to Reagan, all of our leaders have predictably and reliably told us that government is always the problem, never you my precious, perfect American citizen. You are always perfect just the way you are, like a precious little snowflake. A beautiful, precious, 350-pound, pig-ignorant snowflake. \"Why didn't the left post this little gem?\" Riiiight! We had to rely on that notorious right-wing tool, Bill Maher for it. Sometimes... See Bill is left. And in this article he makes the case that Americans are stupid and need to be told to wash their fat hands and lose weight, and well...frankly the much smater than us political hacks should control us in every way... Bill exposes the truth about how the left feels. He states: American citizens are dumb and stupid and we know more than them and we need to tell them how to live their lives.. Which is why the left didn't post this little gem... because they either have their heads buried in sand and cant see the trees for the forest...or they agree with the agenda but know that if it is exposed they'll be lynched be the few remaining Americans that still beleive in freedom. I saw this last night. You and I obviously interpreted it differently. I thought he was poking fun at the politicians as much as the portion of the public that frankly are \"stupid and need to be told to wash their hands and lose weight...\" I think you're letting yourself get way too worked up about nothing. It was just a passing joke. Too much coffee this morning? My other point was that this was on a show that most people would consider pretty left wing(although Bill is pretty libertarian about most social and civil rights issues). So how do you figure there is some left-wing conspiracy to keep this under wraps?", 
        "reply": " Its a central part of almost everything the left does..how many times has Obama told us we cant drive our big cars, and keep our houses at 72 and we need to wash our hands, and we're too fat..hell Deval \"King of the World\" Patrick has pushed for a soda and candy tax here..because he thinks it will reduce the number of fat bodies..he has pushed for and recieved a new law that will require all school children to be weighed in 3rd 5th and 8th grade, a body fat index developed and then the results will be sent to the parents, along with \"guidelines\" on how to not have a fat kid.", 
        "threadID": "409192893_3270038222001", 
        "time": "2009-05-10 04:29:00", 
        "title": "Why didn't the left post this little gem?", 
        "userID": "threerings"
    }
]