[
    {
        "content": "Next step? No guns allowed for right-wing 'extremists' Bill empowers attorney general to forbid firearms for those 'suspected dangerous' May 09, 2009 By Drew Zahn © 2009 WorldNetDaily A new gun law being considered in Congress, if aligned with Department of Homeland Security memos labeling everyday Americans as potential \"threats,\" could potentially deny firearms to pro-lifers, gun-rights advocates, tax protesters, animal rights activists, and a host of others – any already on the expansive DHS watch list for potential \"extremism.\" Rep. Peter King, R-N.Y., has sponsored H.R. 2159, the Denying Firearms and Explosives to Dangerous Terrorists Act of 2009, which permits the attorney general to deny transfer of a firearm to any \"known or suspected dangerous terrorist.\" The bill requires only that the potential firearm transferee is \"appropriately suspected\" of preparing for a terrorist act and that the attorney general \"has a reasonable belief\" that the gun might be used in connection with terrorism. Gun rights advocates, however, object to the bill's language, arguing that it enables the federal government to suspend a person's Second Amendment rights without any trial or legal proof and only upon suspicion of being \"dangerous.\" Are you ready for a second Declaration of Independence? Sign the petition promoting true freedom once again! \"[Rep. King] would deny citizens their civil liberties based on no due process,\" objected Larry Pratt, executive director of Gun Owners of America. \"A 'known terrorist?' Look, if the guy has committed an act of terrorism, we shouldn't have to worry about him being able to buy a gun; he should be in jail!\" Pratt further warned WND of the potential overlap of H.R. 2159 and a recent DHS memo that warned against potential violence from \"right-wing extremists,\" such as those concerned about illegal immigration, increasing federal power, restrictions on firearms, abortion and the loss of U.S. sovereignty. \"By those standards, I'm one of [DHS Secretary] Janet Napolitano's terrorists,\" Pratt said. \"This bill would enable the attorney general to put all of the people who voted against Obama on no-gun lists, because according to the DHS, they're all potential terrorists. Actually, we could rename this bill the Janet Napolitano Frenzied Fantasy Implementation Act of 2009.\" Pratt's biggest concern, however, is the sidestepping of the Constitution and due process that the nebulous language of this bill could permit. \"Unbeknownst to us, some bureaucrat in the bowels of democracy can put your name on a list, and your Second Amendment rights are toast,\" Pratt told WND. \"This is such an anti-American bill, this is something King George III would have done.\" As WND reported, right-wing \"extremists\" aren't the only Americans on the DHS watch list. \"Legalize the Constitution\" bumper sticker Two weeks before the U.S. Department of Homeland Security penned its now notorious warning against \"right-wing extremists\" in the United States, it generated a memo defining dozens of additional groups as potential \"threats.\" That memo, the \"Domestic Extremism Lexicon\" expanded the list from typical \"right-wing\" causes to include left-wing extremism, animal rights activists, black separatists, anarchists, Cuban independence advocates, environmental extremists, the anti-war movement and more. It even insisted some of these groups were prone to violence. For example, the lexicon defined the \"tax resistance movement\" – also referred to in the report as the tax protest movement or the tax freedom movement – as \"groups or individuals who vehemently believe taxes violate their constitutional rights. Among their beliefs are that wages are not income, that paying income taxes is voluntary, and that the 16th Amendment to the U.S. Constitution, which allowed Congress to levy taxes on income, was not properly ratified.\" It further states that tax protesters \"have been known to advocate or engage in criminal activity and plot acts of violence and terrorism in an attempt to advance their extremist goals.\" The DHS memos were meant for distribution to law enforcement officials around the country, prompting some to worry the definitions might be used to classify Americans who simply disagree with government policies as being dangerous. As WND reported, the relative of a Louisiana driver claims her brother-in-law has already been unfairly targeted by police simply for having a supposedly subversive, \"Don't Tread on Me\" bumper sticker on his car. According to the relative, it happened this way: Her brother-in-law was driving home from work through Ball, La., which has a local reputation for enhancing its budget by ticketing speeders. He was pulled over by police officers who told him \"he had a subversive survivalist bumper sticker on his car.\" \"They proceeded to keep him there on the side of the road while they ran whatever they do to see if you have a record, keeping him standing by the side of the road for 30 minutes,\" she told WND. Finding no record and no reason to keep him, they warned him and eventually let him go, she said. WND has withheld the driver's name and the relative's name at their request. H.R. 2159 has six co-sponsors, from both parties, and has been referred to the House Committee on the Judiciary. WND contacted Rep. King's office for comment on the bill, but received no response.", 
        "intTime": 20090509, 
        "postID": 1, 
        "quote": "", 
        "reply": "Next step? No guns allowed for right-wing 'extremists' Bill empowers attorney general to forbid firearms for those 'suspected dangerous' May 09, 2009 By Drew Zahn © 2009 WorldNetDaily A new gun law being considered in Congress, if aligned with Department of Homeland Security memos labeling everyday Americans as potential \"threats,\" could potentially deny firearms to pro-lifers, gun-rights advocates, tax protesters, animal rights activists, and a host of others – any already on the expansive DHS watch list for potential \"extremism.\" Rep. Peter King, R-N.Y., has sponsored H.R. 2159, the Denying Firearms and Explosives to Dangerous Terrorists Act of 2009, which permits the attorney general to deny transfer of a firearm to any \"known or suspected dangerous terrorist.\" The bill requires only that the potential firearm transferee is \"appropriately suspected\" of preparing for a terrorist act and that the attorney general \"has a reasonable belief\" that the gun might be used in connection with terrorism. Gun rights advocates, however, object to the bill's language, arguing that it enables the federal government to suspend a person's Second Amendment rights without any trial or legal proof and only upon suspicion of being \"dangerous.\" Are you ready for a second Declaration of Independence? Sign the petition promoting true freedom once again! \"[Rep. King] would deny citizens their civil liberties based on no due process,\" objected Larry Pratt, executive director of Gun Owners of America. \"A 'known terrorist?' Look, if the guy has committed an act of terrorism, we shouldn't have to worry about him being able to buy a gun; he should be in jail!\" Pratt further warned WND of the potential overlap of H.R. 2159 and a recent DHS memo that warned against potential violence from \"right-wing extremists,\" such as those concerned about illegal immigration, increasing federal power, restrictions on firearms, abortion and the loss of U.S. sovereignty. \"By those standards, I'm one of [DHS Secretary] Janet Napolitano's terrorists,\" Pratt said. \"This bill would enable the attorney general to put all of the people who voted against Obama on no-gun lists, because according to the DHS, they're all potential terrorists. Actually, we could rename this bill the Janet Napolitano Frenzied Fantasy Implementation Act of 2009.\" Pratt's biggest concern, however, is the sidestepping of the Constitution and due process that the nebulous language of this bill could permit. \"Unbeknownst to us, some bureaucrat in the bowels of democracy can put your name on a list, and your Second Amendment rights are toast,\" Pratt told WND. \"This is such an anti-American bill, this is something King George III would have done.\" As WND reported, right-wing \"extremists\" aren't the only Americans on the DHS watch list. \"Legalize the Constitution\" bumper sticker Two weeks before the U.S. Department of Homeland Security penned its now notorious warning against \"right-wing extremists\" in the United States, it generated a memo defining dozens of additional groups as potential \"threats.\" That memo, the \"Domestic Extremism Lexicon\" expanded the list from typical \"right-wing\" causes to include left-wing extremism, animal rights activists, black separatists, anarchists, Cuban independence advocates, environmental extremists, the anti-war movement and more. It even insisted some of these groups were prone to violence. For example, the lexicon defined the \"tax resistance movement\" – also referred to in the report as the tax protest movement or the tax freedom movement – as \"groups or individuals who vehemently believe taxes violate their constitutional rights. Among their beliefs are that wages are not income, that paying income taxes is voluntary, and that the 16th Amendment to the U.S. Constitution, which allowed Congress to levy taxes on income, was not properly ratified.\" It further states that tax protesters \"have been known to advocate or engage in criminal activity and plot acts of violence and terrorism in an attempt to advance their extremist goals.\" The DHS memos were meant for distribution to law enforcement officials around the country, prompting some to worry the definitions might be used to classify Americans who simply disagree with government policies as being dangerous. As WND reported, the relative of a Louisiana driver claims her brother-in-law has already been unfairly targeted by police simply for having a supposedly subversive, \"Don't Tread on Me\" bumper sticker on his car. According to the relative, it happened this way: Her brother-in-law was driving home from work through Ball, La., which has a local reputation for enhancing its budget by ticketing speeders. He was pulled over by police officers who told him \"he had a subversive survivalist bumper sticker on his car.\" \"They proceeded to keep him there on the side of the road while they ran whatever they do to see if you have a record, keeping him standing by the side of the road for 30 minutes,\" she told WND. Finding no record and no reason to keep him, they warned him and eventually let him go, she said. WND has withheld the driver's name and the relative's name at their request. H.R. 2159 has six co-sponsors, from both parties, and has been referred to the House Committee on the Judiciary. WND contacted Rep. King's office for comment on the bill, but received no response.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 05:04:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "20777261"
    }, 
    {
        "content": "Some of us mentioned that this type of mission creep was inevitable with the expanded powers of the executive branch. Some of us also warned that the original cheerleaders would not like the results when a new administration appled that power to their pet peeves. So, be careful what you ask for.", 
        "intTime": 20090509, 
        "postID": 2, 
        "quote": "", 
        "reply": "Some of us mentioned that this type of mission creep was inevitable with the expanded powers of the executive branch. Some of us also warned that the original cheerleaders would not like the results when a new administration appled that power to their pet peeves. So, be careful what you ask for.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 06:42:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: Some of us mentioned that this type of mission creep was inevitable with the expanded powers of the executive branch. Some of us also warned that the original cheerleaders would not like the results when a new administration appled that power to their pet peeves. So, be careful what you ask for. I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. Of course, considering the WND tendency to publish fictions and outright lies, the chances are this article is bogus anyway.", 
        "intTime": 20090509, 
        "postID": 3, 
        "quote": "Originally posted by thorin001: Some of us mentioned that this type of mission creep was inevitable with the expanded powers of the executive branch. Some of us also warned that the original cheerleaders would not like the results when a new administration appled that power to their pet peeves. So, be careful what you ask for.", 
        "reply": " I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. Of course, considering the WND tendency to publish fictions and outright lies, the chances are this article is bogus anyway.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 07:22:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by thorin001: Some of us mentioned that this type of mission creep was inevitable with the expanded powers of the executive branch. Some of us also warned that the original cheerleaders would not like the results when a new administration appled that power to their pet peeves. So, be careful what you ask for. I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. Of course, considering the WND tendency to publish fictions and outright lies, the chances are this article is bogus anyway. Try reading H.R. 2159 and a recent DHS memo then come back with an honest statement. Those on the Right and Those Democrats that believe in our constituional rights have NEVER indicated that liberals or any other political group not be allowed to own firearms. So your statement is fals in everyway. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 4, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by thorin001: Some of us mentioned that this type of mission creep was inevitable with the expanded powers of the executive branch. Some of us also warned that the original cheerleaders would not like the results when a new administration appled that power to their pet peeves. So, be careful what you ask for. I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. Of course, considering the WND tendency to publish fictions and outright lies, the chances are this article is bogus anyway.", 
        "reply": " Try reading H.R. 2159 and a recent DHS memo then come back with an honest statement. Those on the Right and Those Democrats that believe in our constituional rights have NEVER indicated that liberals or any other political group not be allowed to own firearms. So your statement is fals in everyway. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 07:39:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Janet Napolitano labeled our returning military as possible threats and said they should be added to the watch list. Anyone catch that? It was in a town hall meeting that Representative Mary Fallon addressed the Obama admininstration's back pedaling of Napolitano's statement. She's a liberal nutcase that NEVER should have been appointed head of Homeland Security.", 
        "intTime": 20090509, 
        "postID": 5, 
        "quote": "", 
        "reply": "Janet Napolitano labeled our returning military as possible threats and said they should be added to the watch list. Anyone catch that? It was in a town hall meeting that Representative Mary Fallon addressed the Obama admininstration's back pedaling of Napolitano's statement. She's a liberal nutcase that NEVER should have been appointed head of Homeland Security.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 09:01:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Janet Napolitano labeled our returning military as possible threats and said they should be added to the watch list. Anyone catch that? It was in a town hall meeting that Representative Mary Fallon addressed the Obama admininstration's back pedaling of Napolitano's statement. She's a liberal nutcase that NEVER should have been appointed head of Homeland Security. I don't think she meant all returning military were potential terrorists. If you can show me where she said just that I'll agree with you that she's in the wrong job. There were a number of left-wing groups on that watch list too. The chicken littles on the right conveniently ignore that.", 
        "intTime": 20090509, 
        "postID": 6, 
        "quote": "Originally posted by Mom2APAJ: Janet Napolitano labeled our returning military as possible threats and said they should be added to the watch list. Anyone catch that? It was in a town hall meeting that Representative Mary Fallon addressed the Obama admininstration's back pedaling of Napolitano's statement. She's a liberal nutcase that NEVER should have been appointed head of Homeland Security.", 
        "reply": " I don't think she meant all returning military were potential terrorists. If you can show me where she said just that I'll agree with you that she's in the wrong job. There were a number of left-wing groups on that watch list too. The chicken littles on the right conveniently ignore that.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 13:04:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "It's worth noting that this bill was introduced by a Republican and 3 of the 6 cosponsors are Republicans. I doubt this bill will make it out of committee though. A significant number of Democrats in the House and Senate have vowed not to support any anti-gun legislation. I skimmed over the bill. It's way too subjective, and one particularly disturbing provision jumped out at me. If you are denied an FFL, have an FFL revoked, or have a firearm transfer denied under the provisions of this bill you can appeal, however...\"any information on which the Attorney General relied for this determination may be withheld from the petitioner if the Attorney General determines that disclosure of the information would likely compromise national security...\" How convenient for the AG! How can you hope to appeal a decision if you don't even know on what basis he made that decision? This sounds like something the Bush administration's Justice Department lawyers would have written.", 
        "intTime": 20090509, 
        "postID": 7, 
        "quote": "", 
        "reply": "It's worth noting that this bill was introduced by a Republican and 3 of the 6 cosponsors are Republicans. I doubt this bill will make it out of committee though. A significant number of Democrats in the House and Senate have vowed not to support any anti-gun legislation. I skimmed over the bill. It's way too subjective, and one particularly disturbing provision jumped out at me. If you are denied an FFL, have an FFL revoked, or have a firearm transfer denied under the provisions of this bill you can appeal, however...\"any information on which the Attorney General relied for this determination may be withheld from the petitioner if the Attorney General determines that disclosure of the information would likely compromise national security...\" How convenient for the AG! How can you hope to appeal a decision if you don't even know on what basis he made that decision? This sounds like something the Bush administration's Justice Department lawyers would have written.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 13:32:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "L0A1: quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. Of course, considering the WND tendency to publish fictions and outright lies, the chances are this article is bogus anyway. Maybe folks need to listen to the newscast of the Frenchmen...it's pretty good.. \"http://www.dailypaul.com/node/92438\" Here's a link off the above to the bill, you may want to read it yourself. http://www.govtrack.us/congress/bill.xpd?bill=h111-2159 Here are a list of the co-sponsors quote: Mr. KING of New York (for himself, Mr. RANGEL, Mr. CASTLE, Mrs. MCCARTHY of New York, Mr. KIRK, Mr. MORAN of Virginia, and Mr. SMITH of New Jersey) introduced the following bill; which was referred to the Committee on the Judiciary I e-mailed my congressman asking that he vote against this silly bill.. This message has been edited. Last edited by: 3678131, Sat 09 May 2009 09:29 PM", 
        "intTime": 20090509, 
        "postID": 8, 
        "quote": "I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. Of course, considering the WND tendency to publish fictions and outright lies, the chances are this article is bogus anyway.", 
        "reply": "L0A1:  Maybe folks need to listen to the newscast of the Frenchmen...it's pretty good.. \"http://www.dailypaul.com/node/92438\" Here's a link off the above to the bill, you may want to read it yourself. http://www.govtrack.us/congress/bill.xpd?bill=h111-2159 Here are a list of the co-sponsors quote: Mr. KING of New York (for himself, Mr. RANGEL, Mr. CASTLE, Mrs. MCCARTHY of New York, Mr. KIRK, Mr. MORAN of Virginia, and Mr. SMITH of New Jersey) introduced the following bill; which was referred to the Committee on the Judiciary I e-mailed my congressman asking that he vote against this silly bill.. This message has been edited. Last edited by: 3678131, Sat 09 May 2009 09:29 PM", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 20:43:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: A new gun law being considered in Congress, if aligned with Department of Homeland Security memos labeling everyday Americans as potential \"threats,\" could potentially deny firearms to pro-lifers, gun-rights advocates, tax protesters, animal rights activists, and a host of others – any already on the expansive DHS watch list for potential \"extremism.\" Once again, something I have been saying for a couple years now..in different words. Folks, WAKE THE HECK UP. Do you not understand that you can NOT threaten someone else's rights and liberties in any way shape or form without it eventually having a direct impact and effecting YOURS and this nations as a whole. Are some of you really that intellectual that you have no common since left? This is geared toward the conservative side, maybe that's the true meaning; Conservative Plenty Smarts..a since of common 1 in head, no. Anyway, back to topic. As I said...we will all be pointing at our neighbors and calling the Feds on them, the Feds will be watchful for any person that does not comply or appear to conform as a CitizenBot W has created a MONSTER with the DHS and there is no stopping it now, but the conservative right has fed the terrorist monster to the point it has grown and is living in us all. FEMA Camps for national emergencies...you 'betch-cha' baby....", 
        "intTime": 20090509, 
        "postID": 9, 
        "quote": "A new gun law being considered in Congress, if aligned with Department of Homeland Security memos labeling everyday Americans as potential \"threats,\" could potentially deny firearms to pro-lifers, gun-rights advocates, tax protesters, animal rights activists, and a host of others – any already on the expansive DHS watch list for potential \"extremism.\"", 
        "reply": " Once again, something I have been saying for a couple years now..in different words. Folks, WAKE THE HECK UP. Do you not understand that you can NOT threaten someone else's rights and liberties in any way shape or form without it eventually having a direct impact and effecting YOURS and this nations as a whole. Are some of you really that intellectual that you have no common since left? This is geared toward the conservative side, maybe that's the true meaning; Conservative Plenty Smarts..a since of common 1 in head, no. Anyway, back to topic. As I said...we will all be pointing at our neighbors and calling the Feds on them, the Feds will be watchful for any person that does not comply or appear to conform as a CitizenBot W has created a MONSTER with the DHS and there is no stopping it now, but the conservative right has fed the terrorist monster to the point it has grown and is living in us all. FEMA Camps for national emergencies...you 'betch-cha' baby....", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 21:25:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Great,...Then everyone wil start useing cars, trucks, cigarett lighters and IEDs` ...Way to go !!", 
        "intTime": 20090509, 
        "postID": 10, 
        "quote": "", 
        "reply": "Great,...Then everyone wil start useing cars, trucks, cigarett lighters and IEDs` ...Way to go !!", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-09 22:07:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "H.R.2159 Title: To increase public safety by permitting the Attorney General to deny the transfer of a firearm or the issuance of firearms or explosives licenses to a known or suspected dangerous terrorist. Sponsor: Rep King, Peter T. [NY-3] (introduced 4/29/2009) Cosponsors (6) Latest Major Action: 4/29/2009 Referred to House committee. Status: Referred to the House Committee on the Judiciary. ALL ACTIONS: 4/29/2009: Referred to the House Committee on the Judiciary. You don't suppose they'll be willing to respond to questions from one denied rights to buy or sell a firearm about why he is disqualified do you?", 
        "intTime": 20090516, 
        "postID": 11, 
        "quote": "", 
        "reply": "H.R.2159 Title: To increase public safety by permitting the Attorney General to deny the transfer of a firearm or the issuance of firearms or explosives licenses to a known or suspected dangerous terrorist. Sponsor: Rep King, Peter T. [NY-3] (introduced 4/29/2009) Cosponsors (6) Latest Major Action: 4/29/2009 Referred to House committee. Status: Referred to the House Committee on the Judiciary. ALL ACTIONS: 4/29/2009: Referred to the House Committee on the Judiciary. You don't suppose they'll be willing to respond to questions from one denied rights to buy or sell a firearm about why he is disqualified do you?", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-16 20:39:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "billford1"
    }, 
    {
        "content": "quote: Janet Napolitano labeled our returning military as possible threats and said they should be added to the watch list. Anyone catch that? 1. the memo referring to vets was created in 2007, and was only released to the public this year. 2. It did NOT say vets were a possible threat. It said vets would be a target for recruitment by certain groups.", 
        "intTime": 20090516, 
        "postID": 12, 
        "quote": "Janet Napolitano labeled our returning military as possible threats and said they should be added to the watch list. Anyone catch that?", 
        "reply": " 1. the memo referring to vets was created in 2007, and was only released to the public this year. 2. It did NOT say vets were a possible threat. It said vets would be a target for recruitment by certain groups.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-16 22:42:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Hmmmm. Lessee if I understand this correctly. Under this bill, some government functionary could designate you as a terrorist, terrorist supporter or extremist and that would be grounds for the government taking legal action of some kind against you. If you questioned why such a designation was made, they don't have to tell you. Where have I heard that before? Oh yes! The Patriot Act! Remember that one? Remember how many here thought it was a great idea and that it would never be abused or applied to innocent people? Now that the same process might be used to shoe the other foot, it's a little different, isn't it?", 
        "intTime": 20090517, 
        "postID": 13, 
        "quote": "", 
        "reply": "Hmmmm. Lessee if I understand this correctly. Under this bill, some government functionary could designate you as a terrorist, terrorist supporter or extremist and that would be grounds for the government taking legal action of some kind against you. If you questioned why such a designation was made, they don't have to tell you. Where have I heard that before? Oh yes! The Patriot Act! Remember that one? Remember how many here thought it was a great idea and that it would never be abused or applied to innocent people? Now that the same process might be used to shoe the other foot, it's a little different, isn't it?", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 04:39:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "stillkit"
    }, 
    {
        "content": "The \"Just say NO to drugs\" is really working in this country quite well isn't it? So won't taking our guns away. Good luck with that.", 
        "intTime": 20090517, 
        "postID": 14, 
        "quote": "", 
        "reply": "The \"Just say NO to drugs\" is really working in this country quite well isn't it? So won't taking our guns away. Good luck with that.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 04:52:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: The \"Just say NO to drugs\" is really working in this country quite well isn't it? So won't taking our guns away. Good luck with that. My thought is this - if someone wanted to do away with a perceived risk of private firearms ownership, then the best way would be to make ammunition unobtainable - either by cost or by regulation of quantity allowed and/or supply available). The 2nd Amendment clearly says that the right to own and bear firearms shall not be infringed - but it says ZILCH about ammunition. What good is a gun without bullets?", 
        "intTime": 20090517, 
        "postID": 15, 
        "quote": "Originally posted by Duster6: The \"Just say NO to drugs\" is really working in this country quite well isn't it? So won't taking our guns away. Good luck with that.", 
        "reply": " My thought is this - if someone wanted to do away with a perceived risk of private firearms ownership, then the best way would be to make ammunition unobtainable - either by cost or by regulation of quantity allowed and/or supply available). The 2nd Amendment clearly says that the right to own and bear firearms shall not be infringed - but it says ZILCH about ammunition. What good is a gun without bullets?", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 04:59:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Obama Pushes Anti-Gun Treaty -http://www.youtube.com/watch?v=D9X2VbhSH9o", 
        "intTime": 20090517, 
        "postID": 16, 
        "quote": "", 
        "reply": "Obama Pushes Anti-Gun Treaty -http://www.youtube.com/watch?v=D9X2VbhSH9o", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 06:32:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Hmmmm. Lessee if I understand this correctly. Under this bill, some government functionary could designate you as a terrorist, terrorist supporter or extremist and that would be grounds for the government taking legal action of some kind against you. If you questioned why such a designation was made, they don't have to tell you. Where have I heard that before? Oh yes! The Patriot Act! Remember that one? Remember how many here thought it was a great idea and that it would never be abused or applied to innocent people? Now that the same process might be used to shoe the other foot, it's a little different, isn't it? What's the old expression, \"It all depends on whose ox is getting gored\"? Many of the posters here are too young to remember that, during the \"Tricky Dick\" Nixon Administration, Nixon actually commissioned members of his Administration to evaluate setting up concentration camps to imprision anti-Viet-Nam War protestors. Work leaked out and they dropped the idea. Of course, some of today's posters might think that FEMA camps for people on the Left would be a great idea whereas FEMA camps for people on the Right is unConstitutional!", 
        "intTime": 20090517, 
        "postID": 17, 
        "quote": "Originally posted by stillkit: Hmmmm. Lessee if I understand this correctly. Under this bill, some government functionary could designate you as a terrorist, terrorist supporter or extremist and that would be grounds for the government taking legal action of some kind against you. If you questioned why such a designation was made, they don't have to tell you. Where have I heard that before? Oh yes! The Patriot Act! Remember that one? Remember how many here thought it was a great idea and that it would never be abused or applied to innocent people? Now that the same process might be used to shoe the other foot, it's a little different, isn't it?", 
        "reply": " What's the old expression, \"It all depends on whose ox is getting gored\"? Many of the posters here are too young to remember that, during the \"Tricky Dick\" Nixon Administration, Nixon actually commissioned members of his Administration to evaluate setting up concentration camps to imprision anti-Viet-Nam War protestors. Work leaked out and they dropped the idea. Of course, some of today's posters might think that FEMA camps for people on the Left would be a great idea whereas FEMA camps for people on the Right is unConstitutional!", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 08:10:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Next step? No guns allowed for right-wing 'extremists' Bill empowers attorney general to forbid firearms for those 'suspected dangerous' The 'assuredly dangerous' ones are those bureaucrats and polytishuns who would stupidly, foolishly attempt to deny good Americans a God-given and Constitutionally affirmed right on the basis of the polytickle insecurity and control-freak mentality of a bunch of self-proclaimed illuminati totalitarians. What is more, if the firearms and ammunition are made and maintained entirely within the borders of a state, then by the 10th Amendment only that state's laws pertain to the manufacture and ownership of the firearms: no true interstate commerce. Attempts at federal enforcement might even be met with arrest of those participating in the unconstitutional federal intrusion to illegally and unduly restrict that over which they have no jurisdiction.", 
        "intTime": 20090517, 
        "postID": 18, 
        "quote": "Next step? No guns allowed for right-wing 'extremists' Bill empowers attorney general to forbid firearms for those 'suspected dangerous'", 
        "reply": " The 'assuredly dangerous' ones are those bureaucrats and polytishuns who would stupidly, foolishly attempt to deny good Americans a God-given and Constitutionally affirmed right on the basis of the polytickle insecurity and control-freak mentality of a bunch of self-proclaimed illuminati totalitarians. What is more, if the firearms and ammunition are made and maintained entirely within the borders of a state, then by the 10th Amendment only that state's laws pertain to the manufacture and ownership of the firearms: no true interstate commerce. Attempts at federal enforcement might even be met with arrest of those participating in the unconstitutional federal intrusion to illegally and unduly restrict that over which they have no jurisdiction.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 12:35:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion. Not all Democrats are fools and knaves; some understand the essential nature of the Second Amendment. This message has been edited. Last edited by: RRR52, Sun 17 May 2009 01:05 PM", 
        "intTime": 20090517, 
        "postID": 19, 
        "quote": "I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly.", 
        "reply": " It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion. Not all Democrats are fools and knaves; some understand the essential nature of the Second Amendment. This message has been edited. Last edited by: RRR52, Sun 17 May 2009 01:05 PM", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 12:42:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion. Or, more simply put, \"my rights are more important then your rights.\" And when you institute policies to take away someone else's rights, pretty soon that comes around and bites you in the azz. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090517, 
        "postID": 20, 
        "quote": "Originally posted by RRR52: quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion.", 
        "reply": " Or, more simply put, \"my rights are more important then your rights.\" And when you institute policies to take away someone else's rights, pretty soon that comes around and bites you in the azz. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 13:08:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by RRR52: quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion. Or, more simply put, \"my rights are more important then your rights.\" [IF YOU PRESUME TO REFER TO MY SENTIMENTS, THEN YOU ARE UNABLE TO READ EFFECTIVELY.] And when you institute policies to take away someone else's rights, pretty soon that comes around and bites you in the azz.[NO JOKE. TELL THE OBAMANITES.] Even the Constitutional rights of jackasses are endorsed by conservatives; a Constitutional right denied to bona fide American citizens becomes a denial of Constitutional rights of any type for any American. If any bona fide American citizens wish to keep and bear arms, good for them. Go for it. If they don't want to, then don't. Anybody just better keep their mits off mine and my exercise of God-given and Constitutionally affirmed rights. And the fact that I tend to strongly, responsibly, knowingly support moral and political positions that have been respected and endorsed by the majority of Americans throughout our history does not now give some two-bit bureaucrats and leftist opinion-mongers any innate right to presume to adjudge me or the many tens of millions like me unfit to exercise our rights, over which they shall have no jurisdiction or say.", 
        "intTime": 20090517, 
        "postID": 21, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by RRR52: quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion. Or, more simply put, \"my rights are more important then your rights.\" [IF YOU PRESUME TO REFER TO MY SENTIMENTS, THEN YOU ARE UNABLE TO READ EFFECTIVELY.] And when you institute policies to take away someone else's rights, pretty soon that comes around and bites you in the azz.[NO JOKE. TELL THE OBAMANITES.]", 
        "reply": " Even the Constitutional rights of jackasses are endorsed by conservatives; a Constitutional right denied to bona fide American citizens becomes a denial of Constitutional rights of any type for any American. If any bona fide American citizens wish to keep and bear arms, good for them. Go for it. If they don't want to, then don't. Anybody just better keep their mits off mine and my exercise of God-given and Constitutionally affirmed rights. And the fact that I tend to strongly, responsibly, knowingly support moral and political positions that have been respected and endorsed by the majority of Americans throughout our history does not now give some two-bit bureaucrats and leftist opinion-mongers any innate right to presume to adjudge me or the many tens of millions like me unfit to exercise our rights, over which they shall have no jurisdiction or say.", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 13:24:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by mmulder67: quote: Originally posted by RRR52: quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion. Or, more simply put, \"my rights are more important then your rights.\" [IF YOU PRESUME TO REFER TO MY SENTIMENTS, THEN YOU ARE UNABLE TO READ EFFECTIVELY.] And when you institute policies to take away someone else's rights, pretty soon that comes around and bites you in the azz.[NO JOKE. TELL THE OBAMANITES.] Even the Constitutional rights of jackasses are endorsed by conservatives; a Constitutional right denied to bona fide American citizens becomes a denial of Constitutional rights of any type for any American. If any bona fide American citizens wish to keep and bear arms, good for them. Go for it. If they don't want to, then don't. Anybody just better keep their mits off mine and my exercise of God-given and Constitutionally affirmed rights. And the fact that I tend to strongly, responsibly, knowingly support moral and political positions that have been respected and endorsed by the majority of Americans throughout our history does not now give some two-bit bureaucrats and leftist opinion-mongers any innate right to presume to adjudge me or the many tens of millions like me unfit to exercise our rights, over which they shall have no jurisdiction or say. I'm pretty sure it was a Republican that instituted the Patriot Act. For you to automatically assume that someone is unable to read based on their ability to see the irony and/or hypocrisy of your opinions is proof in and of itself of same. The blame game never incorporates all the players when you are too one sided to see the playing field. And there are plenty of two-bit bureaucrats and rightist opinion mongers who think they have a right to presume to adjudge others as unfit to exercise their rights. I have, do and will continue to, keep and bear arms until they either jail me or kill me. But I won't go down without a fight. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090517, 
        "postID": 22, 
        "quote": "Originally posted by RRR52: quote: Originally posted by mmulder67: quote: Originally posted by RRR52: quote: I suspect if the WND published a story that all those Americans who belong to the Democratic Party were not going to be allowed to legally own firearms, the poster would have applauded loudly. It seems that the leftists mindlessly lapse into foolishly and wrongly attributing their own control-freak spitefulness to conservatives who know what the Constitution says, i.e., what the Founders intended, which is what conservatives stand strong to conserve and support--for any good American. . . yes, even a jackass party minion. Or, more simply put, \"my rights are more important then your rights.\" [IF YOU PRESUME TO REFER TO MY SENTIMENTS, THEN YOU ARE UNABLE TO READ EFFECTIVELY.] And when you institute policies to take away someone else's rights, pretty soon that comes around and bites you in the azz.[NO JOKE. TELL THE OBAMANITES.] Even the Constitutional rights of jackasses are endorsed by conservatives; a Constitutional right denied to bona fide American citizens becomes a denial of Constitutional rights of any type for any American. If any bona fide American citizens wish to keep and bear arms, good for them. Go for it. If they don't want to, then don't. Anybody just better keep their mits off mine and my exercise of God-given and Constitutionally affirmed rights. And the fact that I tend to strongly, responsibly, knowingly support moral and political positions that have been respected and endorsed by the majority of Americans throughout our history does not now give some two-bit bureaucrats and leftist opinion-mongers any innate right to presume to adjudge me or the many tens of millions like me unfit to exercise our rights, over which they shall have no jurisdiction or say.", 
        "reply": " I'm pretty sure it was a Republican that instituted the Patriot Act. For you to automatically assume that someone is unable to read based on their ability to see the irony and/or hypocrisy of your opinions is proof in and of itself of same. The blame game never incorporates all the players when you are too one sided to see the playing field. And there are plenty of two-bit bureaucrats and rightist opinion mongers who think they have a right to presume to adjudge others as unfit to exercise their rights. I have, do and will continue to, keep and bear arms until they either jail me or kill me. But I won't go down without a fight. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 13:34:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "mmulder67"
    }, 
    {
        "content": "I like your Menken quote...but it could be taken in a very wrong way...", 
        "intTime": 20090517, 
        "postID": 23, 
        "quote": "", 
        "reply": "I like your Menken quote...but it could be taken in a very wrong way...", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 15:04:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "\"Uncertain as we must ever be of the particular point in our circumference where an enemy may choose to invade us, the only force which can be ready at every point and competent to oppose them, is the body of neighboring citizens as formed into a militia. On these, collected from the parts most convenient, in numbers proportioned to the invading foe, it is best to rely, not only to meet the first attack, but if it threatens to be permanent, to maintain the defence until regulars may be engaged to relieve them.\" --Thomas Jefferson: 1st Annual Message, 1801. ME 3:334 \"None but an armed nation can dispense with a standing army. To keep ours armed and disciplined is therefore at all times important.\" --Thomas Jefferson, 1803. \"Laws that forbid the carrying of arms . . . disarm only those who are neither inclined nor determined to commit crimes . . . Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than to prevent homicides, for an unarmed man may be attacked with greater confidence than an armed man.\" --Thomas Jefferson, quoting Cesare Beccaria in On Crimes and Punishment (1764). \"No freeman shall be debarred the use of arms (within his own lands or tenements).\" --Thomas Jefferson: Draft Virginia Constitution with (his note added), 1776. Papers, 1:353", 
        "intTime": 20090517, 
        "postID": 24, 
        "quote": "", 
        "reply": "\"Uncertain as we must ever be of the particular point in our circumference where an enemy may choose to invade us, the only force which can be ready at every point and competent to oppose them, is the body of neighboring citizens as formed into a militia. On these, collected from the parts most convenient, in numbers proportioned to the invading foe, it is best to rely, not only to meet the first attack, but if it threatens to be permanent, to maintain the defence until regulars may be engaged to relieve them.\" --Thomas Jefferson: 1st Annual Message, 1801. ME 3:334 \"None but an armed nation can dispense with a standing army. To keep ours armed and disciplined is therefore at all times important.\" --Thomas Jefferson, 1803. \"Laws that forbid the carrying of arms . . . disarm only those who are neither inclined nor determined to commit crimes . . . Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than to prevent homicides, for an unarmed man may be attacked with greater confidence than an armed man.\" --Thomas Jefferson, quoting Cesare Beccaria in On Crimes and Punishment (1764). \"No freeman shall be debarred the use of arms (within his own lands or tenements).\" --Thomas Jefferson: Draft Virginia Constitution with (his note added), 1776. Papers, 1:353", 
        "threadID": "409192893_8200098222001", 
        "time": "2009-05-17 16:13:00", 
        "title": "Next Step? No Guns Allowed for Right-Wing Extremists!", 
        "userID": "strobelvets"
    }
]