[
    {
        "content": "U.S. sues Union Pacific over cross-border drug smuggling Marijuana or cocaine was found in rail cars at least 38 times between 2001 and 2006, authorities claim. The rail company says it has little control over operations by its corporate partner in Mexico. By Richard Marosi March 19, 2009 Reporting from San Diego — The U.S. Department of Justice filed lawsuits against Union Pacific Railroad Co. on Wednesday seeking $37 million in damages for allegedly failing to prevent its rail cars from being used to smuggle drugs into the country. U.S. customs inspectors on at least 38 occasions between 2001 and 2006 discovered marijuana or cocaine in Union Pacific rail cars at border crossings at Brownsville, Texas, and Calexico, Calif., according to the two complaints filed Wednesday. Federal authorities say the Omaha-based company violated laws requiring transportation operators to submit accurate descriptions of their cargo to customs inspectors. The lawsuit was filed after Union Pacific refused to pay several penalties, saying it has limited ability to control train operations by its corporate partner in Mexico. \"We're being punished for drug smuggling from Mexico that we have no ability to prevent,\" said Donna Kush, a spokeswoman for Union Pacific, North America's largest railroad company. The federal government said its inspectors found more than two tons of marijuana and more than 100 kilograms of cocaine on company rail cars, many of which were listed as empty on manifests, the complaint alleges. Seizures included 61 kilograms of marijuana found in the spine of a rail car, 29 kilograms of marijuana discovered in a hidden compartment of a flat-bed car and 117 kilograms of cocaine in a false wall of a rail car at the border crossing in Brownsville. \"Securing the nation's rail system against the threat of cross-border smuggling requires the compliance and cooperation of the rail industry, Jayson P. Ahern, acting commissioner of U.S. Customs and Border Protection, said in a statement. The Department of Homeland Security has told the company that it should hire an outside security company or work with its business partner, Ferrocarril Mexicano, of which it is a part owner. The spokeswoman for Union Pacific, which has its own police force in the U.S., said that setting up a security team in Mexico would be unrealistic and potentially dangerous. \"We wouldn't be allowed to carry arms or use K-9 teams. . . . We'd be unarmed in the face of vicious drug gangs,\" Kush said. '[URL=http://www.latimes.com/news/nationworld/nation/la-na-mexico-drugs-railroad19-2009mar19,0,6619169.story]' From the Los Angeles Times ============================================================ If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? This message has been edited. Last edited by: stillkit, Fri 20 March 2009 09:23 AM \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 1, 
        "quote": "", 
        "reply": "U.S. sues Union Pacific over cross-border drug smuggling Marijuana or cocaine was found in rail cars at least 38 times between 2001 and 2006, authorities claim. The rail company says it has little control over operations by its corporate partner in Mexico. By Richard Marosi March 19, 2009 Reporting from San Diego — The U.S. Department of Justice filed lawsuits against Union Pacific Railroad Co. on Wednesday seeking $37 million in damages for allegedly failing to prevent its rail cars from being used to smuggle drugs into the country. U.S. customs inspectors on at least 38 occasions between 2001 and 2006 discovered marijuana or cocaine in Union Pacific rail cars at border crossings at Brownsville, Texas, and Calexico, Calif., according to the two complaints filed Wednesday. Federal authorities say the Omaha-based company violated laws requiring transportation operators to submit accurate descriptions of their cargo to customs inspectors. The lawsuit was filed after Union Pacific refused to pay several penalties, saying it has limited ability to control train operations by its corporate partner in Mexico. \"We're being punished for drug smuggling from Mexico that we have no ability to prevent,\" said Donna Kush, a spokeswoman for Union Pacific, North America's largest railroad company. The federal government said its inspectors found more than two tons of marijuana and more than 100 kilograms of cocaine on company rail cars, many of which were listed as empty on manifests, the complaint alleges. Seizures included 61 kilograms of marijuana found in the spine of a rail car, 29 kilograms of marijuana discovered in a hidden compartment of a flat-bed car and 117 kilograms of cocaine in a false wall of a rail car at the border crossing in Brownsville. \"Securing the nation's rail system against the threat of cross-border smuggling requires the compliance and cooperation of the rail industry, Jayson P. Ahern, acting commissioner of U.S. Customs and Border Protection, said in a statement. The Department of Homeland Security has told the company that it should hire an outside security company or work with its business partner, Ferrocarril Mexicano, of which it is a part owner. The spokeswoman for Union Pacific, which has its own police force in the U.S., said that setting up a security team in Mexico would be unrealistic and potentially dangerous. \"We wouldn't be allowed to carry arms or use K-9 teams. . . . We'd be unarmed in the face of vicious drug gangs,\" Kush said. '[URL=http://www.latimes.com/news/nationworld/nation/la-na-mexico-drugs-railroad19-2009mar19,0,6619169.story]' From the Los Angeles Times ============================================================ If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? This message has been edited. Last edited by: stillkit, Fri 20 March 2009 09:23 AM \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 19:59:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault.", 
        "intTime": 20090319, 
        "postID": 2, 
        "quote": "Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in???", 
        "reply": " You probably don't want to know, but I don't see how it's UP's fault.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:09:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? It is their cars. You probably don't want to know, but I don't see how it's UP's fault. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 3, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? It is their cars. You probably don't want to know, but I don't see how it's UP's fault.", 
        "reply": " \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:10:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. It is their cars. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 4, 
        "quote": "Originally posted by EngrOpsNCO: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault.", 
        "reply": " It is their cars. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:11:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "intTime": 20090319, 
        "postID": 5, 
        "quote": "Originally posted by EngrOpsNCO: It is their cars.", 
        "reply": " I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:14:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "The lawsuit is about the company refusing to pay penalties, not about criminal activity. The company claims they \"cannot\" control what their company in Mexico does, maybe they should disband their mexican company and start over.", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "", 
        "reply": "The lawsuit is about the company refusing to pay penalties, not about criminal activity. The company claims they \"cannot\" control what their company in Mexico does, maybe they should disband their mexican company and start over.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:28:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Yep, you are correct. Criminal = Reasonable doubt Civilian = more then likely (or words close to that.) Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "reply": " Yep, you are correct. Criminal = Reasonable doubt Civilian = more then likely (or words close to that.) Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:44:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "L0A1"
    }, 
    {
        "content": "Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "", 
        "reply": "Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:58:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault.", 
        "reply": " Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:58:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Is it even a criminal matter?", 
        "intTime": 20090320, 
        "postID": 10, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "reply": " Is it even a criminal matter?", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:00:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence. Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay?", 
        "intTime": 20090320, 
        "postID": 11, 
        "quote": "Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "reply": " Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay?", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:02:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Is it even a criminal matter? I don't see how it could be. Would a farmer on the TX/MX border be responsible for all the smuggling and illegal aliens coming in across his land? Not unless he was allowing it with knowledge. Simple solution, if the government has a problem with it, they should provide enough K-9's to search the trains. Just my opinion. Don", 
        "intTime": 20090320, 
        "postID": 12, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Is it even a criminal matter?", 
        "reply": " I don't see how it could be. Would a farmer on the TX/MX border be responsible for all the smuggling and illegal aliens coming in across his land? Not unless he was allowing it with knowledge. Simple solution, if the government has a problem with it, they should provide enough K-9's to search the trains. Just my opinion. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:08:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay? Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses", 
        "intTime": 20090320, 
        "postID": 13, 
        "quote": "Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay?", 
        "reply": " Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:13:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay? Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses Okay... you have me stumped as to what you are trying to say. The Federal Government is well within its rights to ensure that the UP secures their own equipment. And to charge the UP civilly for the expense of Customs and Border patrol man hours when they find contraband. There is ample precident for this in the maritime Shipping industry. This really is a non-issue and the UP is simply trying to buy as much time as it can before having to add this expense to their books.", 
        "intTime": 20090320, 
        "postID": 14, 
        "quote": "Originally posted by soscorpio: quote: Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay? Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses", 
        "reply": " Okay... you have me stumped as to what you are trying to say. The Federal Government is well within its rights to ensure that the UP secures their own equipment. And to charge the UP civilly for the expense of Customs and Border patrol man hours when they find contraband. There is ample precident for this in the maritime Shipping industry. This really is a non-issue and the UP is simply trying to buy as much time as it can before having to add this expense to their books.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:18:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter.", 
        "intTime": 20090320, 
        "postID": 15, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "reply": " According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:34:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter. Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse.", 
        "intTime": 20090320, 
        "postID": 16, 
        "quote": "Originally posted by stillkit: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter.", 
        "reply": " Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:59:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don", 
        "intTime": 20090320, 
        "postID": 17, 
        "quote": "Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime.", 
        "reply": " Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:04:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.", 
        "intTime": 20090320, 
        "postID": 18, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don", 
        "reply": " Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:12:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Just another benefit of NAFTA.", 
        "intTime": 20090320, 
        "postID": 19, 
        "quote": "", 
        "reply": "Just another benefit of NAFTA.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:17:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse. It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse.", 
        "reply": " It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:24:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Don Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.[/QUOTE] Well that clarifies that issue. I wonder if I can find a caboose cheap for a home? Live the life of James West and Artemus Gordon in the TV series, \"Wild, Wild, West\" Don", 
        "intTime": 20090320, 
        "postID": 21, 
        "quote": "Originally posted by ArtMarsh: Don", 
        "reply": " Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.[/QUOTE] Well that clarifies that issue. I wonder if I can find a caboose cheap for a home? Live the life of James West and Artemus Gordon in the TV series, \"Wild, Wild, West\" Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:27:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Solid ground? Doubtful. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090320, 
        "postID": 22, 
        "quote": "Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "reply": " I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Solid ground? Doubtful. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:41:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. [/QUOTE] Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don", 
        "intTime": 20090320, 
        "postID": 23, 
        "quote": "Originally posted by mmulder67:", 
        "reply": " I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. [/QUOTE] Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:45:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well. The U.S. knows that Mexico is smuggling drugs across the border on foot, in cars, in semi trailers, etc.. When are we going to start fining the Border Patrol for allowing it to happen? Customs seizes \"containers\" that are used in transporting contraband. Can you elaborate on that a little more? Was there a bill of lading that showed one cargo that wasn't present while contraband was? Who shipped the container? Where was the container going? And lastly....UP typically doesn't own the containers so how does that affect them? I sure hope your line of reasoning doesn't take it's full course cause as soon as it does your neighbors stolen car used in a crime? Well to bad for your neighbor he's getting fined. Hope no one steals your car...... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090320, 
        "postID": 24, 
        "quote": "Originally posted by ArtMarsh: Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.", 
        "reply": " The U.S. knows that Mexico is smuggling drugs across the border on foot, in cars, in semi trailers, etc.. When are we going to start fining the Border Patrol for allowing it to happen? Customs seizes \"containers\" that are used in transporting contraband. Can you elaborate on that a little more? Was there a bill of lading that showed one cargo that wasn't present while contraband was? Who shipped the container? Where was the container going? And lastly....UP typically doesn't own the containers so how does that affect them? I sure hope your line of reasoning doesn't take it's full course cause as soon as it does your neighbors stolen car used in a crime? Well to bad for your neighbor he's getting fined. Hope no one steals your car...... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:50:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by mmulder67: I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don Wonder how they could do that with railcars? Not very many smaller railcars out there... Helps to avoid the inspectors at the ports. Wonder who employs those (federal) inspectors at the ports? Why doesn't UP get the same consideration? Oh I know! Cash cow......isn't our government wonderful? Rhetorical question full of sarcasm..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090320, 
        "postID": 25, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by mmulder67: I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don", 
        "reply": " Wonder how they could do that with railcars? Not very many smaller railcars out there... Helps to avoid the inspectors at the ports. Wonder who employs those (federal) inspectors at the ports? Why doesn't UP get the same consideration? Oh I know! Cash cow......isn't our government wonderful? Rhetorical question full of sarcasm..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:54:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Wonder how they could do that with railcars? Not very many smaller railcars out there... Heck, that would be easy. Railways through a desert or countryside, SUV pulls up and the offload commences. Don", 
        "intTime": 20090320, 
        "postID": 26, 
        "quote": "Originally posted by mmulder67: Wonder how they could do that with railcars? Not very many smaller railcars out there...", 
        "reply": " Heck, that would be easy. Railways through a desert or countryside, SUV pulls up and the offload commences. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 11:03:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence. Can you explain how our founders did anything to control border access? Were there checkpoints and a fence between the new US and Canada. Did we have a riverboat fleet to secure our side of the Mississippi? Was there anything keeping every immigrant from Europe from coming over? What does having border security have to do with morals? Are we morally superiorover the rest of the planet? I am all for border security, but I don't see how your \"founders\" argument is relavent.", 
        "intTime": 20090320, 
        "postID": 27, 
        "quote": "Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "reply": " Can you explain how our founders did anything to control border access? Were there checkpoints and a fence between the new US and Canada. Did we have a riverboat fleet to secure our side of the Mississippi? Was there anything keeping every immigrant from Europe from coming over? What does having border security have to do with morals? Are we morally superiorover the rest of the planet? I am all for border security, but I don't see how your \"founders\" argument is relavent.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:43:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse. It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries. LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.", 
        "intTime": 20090320, 
        "postID": 28, 
        "quote": "Originally posted by stillkit: quote: Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse. It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "reply": " LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:43:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. I have... it is done all the time. Docking at Ocean berths are done by appointment only. Ie... scheduled. Occasionaly one gets ahead of the game... most of time by cancelling a prior port call. At the next port it will usually have to sit offshore while the berth empties. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. The same way it is done in Mexico... they are put aboard before the doors are sealed. As a joke, one of the Longshoremen placed a management pickup truck in an empty container and that container was loaded in Seattle. They found the truck in Hong Kong over a month later when they went to reuse the container. It wound up being returned to Seattle the same way. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Read closer as to who owns the Mexican transportation company. Also, how come the Maritime industry can comply following 9/11 and the Railroad industry cannot? Solid ground? Doubtful. It is solid... with precident", 
        "intTime": 20090320, 
        "postID": 29, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. I have... it is done all the time. Docking at Ocean berths are done by appointment only. Ie... scheduled. Occasionaly one gets ahead of the game... most of time by cancelling a prior port call. At the next port it will usually have to sit offshore while the berth empties. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. The same way it is done in Mexico... they are put aboard before the doors are sealed. As a joke, one of the Longshoremen placed a management pickup truck in an empty container and that container was loaded in Seattle. They found the truck in Hong Kong over a month later when they went to reuse the container. It wound up being returned to Seattle the same way. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Read closer as to who owns the Mexican transportation company. Also, how come the Maritime industry can comply following 9/11 and the Railroad industry cannot? Solid ground? Doubtful. It is solid... with precident", 
        "reply": "", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:51:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries. LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.[/QUOTE] What kind of manifest would you have for each, individual empty container? I can understand an over-all manifest identifying X number of empties or a manifest for a ship load of empty containers, but we're not talking about container cars in the UP's case. According to the article, we're talking about empty box cars and empty flat cars. Yes, the railroad must provide the Border Patrol and INS documentation relating to how many cars, loaded or empty, they're bringing across the border, but empty cars do not require an individual manifest for what's on board because nothing is. So, the train crosses the border at Calexico/Mexicali and immediately enters the Custom's inspection yard. The train manifest lists 40 loaded cars and 10 empties. Bills of Lading are provided to identify what's in the loaded ones, but nothing more is required for the empties. The inspectors begin searching the train, opening doors to verify the cargo in those loaded cars. They bring out the dogs or run the cars through a scanner of some sort and do a walk around. They find dope HIDDEN in an empty boxcar, concealed behind a false front or secreted into the frame of the car. Then, they write the UP a ticket for not declaring and documenting the dope they didn't even know was there? That's outrageously unfair, wouldn't you say? I've pulled empty trailers across both borders, going both ways, and was subjected to an inspection every time. Nothing wrong with that. But, nobody ever threatened to fine me for not having a manifest which identified any dope hidden in the the trailer and, if they had, I'd have come unglued.", 
        "intTime": 20090320, 
        "postID": 30, 
        "quote": "Originally posted by ArtMarsh: It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "reply": " LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.[/QUOTE] What kind of manifest would you have for each, individual empty container? I can understand an over-all manifest identifying X number of empties or a manifest for a ship load of empty containers, but we're not talking about container cars in the UP's case. According to the article, we're talking about empty box cars and empty flat cars. Yes, the railroad must provide the Border Patrol and INS documentation relating to how many cars, loaded or empty, they're bringing across the border, but empty cars do not require an individual manifest for what's on board because nothing is. So, the train crosses the border at Calexico/Mexicali and immediately enters the Custom's inspection yard. The train manifest lists 40 loaded cars and 10 empties. Bills of Lading are provided to identify what's in the loaded ones, but nothing more is required for the empties. The inspectors begin searching the train, opening doors to verify the cargo in those loaded cars. They bring out the dogs or run the cars through a scanner of some sort and do a walk around. They find dope HIDDEN in an empty boxcar, concealed behind a false front or secreted into the frame of the car. Then, they write the UP a ticket for not declaring and documenting the dope they didn't even know was there? That's outrageously unfair, wouldn't you say? I've pulled empty trailers across both borders, going both ways, and was subjected to an inspection every time. Nothing wrong with that. But, nobody ever threatened to fine me for not having a manifest which identified any dope hidden in the the trailer and, if they had, I'd have come unglued.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:58:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "U.S. sues Union Pacific over cross-border drug smuggling Marijuana or cocaine was found in rail cars at least 38 times between 2001 and 2006, authorities claim. The rail company says it has little control over operations by its corporate partner in Mexico. By Richard Marosi March 19, 2009 Reporting from San Diego — The U.S. Department of Justice filed lawsuits against Union Pacific Railroad Co. on Wednesday seeking $37 million in damages for allegedly failing to prevent its rail cars from being used to smuggle drugs into the country. U.S. customs inspectors on at least 38 occasions between 2001 and 2006 discovered marijuana or cocaine in Union Pacific rail cars at border crossings at Brownsville, Texas, and Calexico, Calif., according to the two complaints filed Wednesday. Federal authorities say the Omaha-based company violated laws requiring transportation operators to submit accurate descriptions of their cargo to customs inspectors. The lawsuit was filed after Union Pacific refused to pay several penalties, saying it has limited ability to control train operations by its corporate partner in Mexico. \"We're being punished for drug smuggling from Mexico that we have no ability to prevent,\" said Donna Kush, a spokeswoman for Union Pacific, North America's largest railroad company. The federal government said its inspectors found more than two tons of marijuana and more than 100 kilograms of cocaine on company rail cars, many of which were listed as empty on manifests, the complaint alleges. Seizures included 61 kilograms of marijuana found in the spine of a rail car, 29 kilograms of marijuana discovered in a hidden compartment of a flat-bed car and 117 kilograms of cocaine in a false wall of a rail car at the border crossing in Brownsville. \"Securing the nation's rail system against the threat of cross-border smuggling requires the compliance and cooperation of the rail industry, Jayson P. Ahern, acting commissioner of U.S. Customs and Border Protection, said in a statement. The Department of Homeland Security has told the company that it should hire an outside security company or work with its business partner, Ferrocarril Mexicano, of which it is a part owner. The spokeswoman for Union Pacific, which has its own police force in the U.S., said that setting up a security team in Mexico would be unrealistic and potentially dangerous. \"We wouldn't be allowed to carry arms or use K-9 teams. . . . We'd be unarmed in the face of vicious drug gangs,\" Kush said. '[URL=http://www.latimes.com/news/nationworld/nation/la-na-mexico-drugs-railroad19-2009mar19,0,6619169.story]' From the Los Angeles Times ============================================================ If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? This message has been edited. Last edited by: stillkit, Fri 20 March 2009 09:23 AM \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 31, 
        "quote": "", 
        "reply": "U.S. sues Union Pacific over cross-border drug smuggling Marijuana or cocaine was found in rail cars at least 38 times between 2001 and 2006, authorities claim. The rail company says it has little control over operations by its corporate partner in Mexico. By Richard Marosi March 19, 2009 Reporting from San Diego — The U.S. Department of Justice filed lawsuits against Union Pacific Railroad Co. on Wednesday seeking $37 million in damages for allegedly failing to prevent its rail cars from being used to smuggle drugs into the country. U.S. customs inspectors on at least 38 occasions between 2001 and 2006 discovered marijuana or cocaine in Union Pacific rail cars at border crossings at Brownsville, Texas, and Calexico, Calif., according to the two complaints filed Wednesday. Federal authorities say the Omaha-based company violated laws requiring transportation operators to submit accurate descriptions of their cargo to customs inspectors. The lawsuit was filed after Union Pacific refused to pay several penalties, saying it has limited ability to control train operations by its corporate partner in Mexico. \"We're being punished for drug smuggling from Mexico that we have no ability to prevent,\" said Donna Kush, a spokeswoman for Union Pacific, North America's largest railroad company. The federal government said its inspectors found more than two tons of marijuana and more than 100 kilograms of cocaine on company rail cars, many of which were listed as empty on manifests, the complaint alleges. Seizures included 61 kilograms of marijuana found in the spine of a rail car, 29 kilograms of marijuana discovered in a hidden compartment of a flat-bed car and 117 kilograms of cocaine in a false wall of a rail car at the border crossing in Brownsville. \"Securing the nation's rail system against the threat of cross-border smuggling requires the compliance and cooperation of the rail industry, Jayson P. Ahern, acting commissioner of U.S. Customs and Border Protection, said in a statement. The Department of Homeland Security has told the company that it should hire an outside security company or work with its business partner, Ferrocarril Mexicano, of which it is a part owner. The spokeswoman for Union Pacific, which has its own police force in the U.S., said that setting up a security team in Mexico would be unrealistic and potentially dangerous. \"We wouldn't be allowed to carry arms or use K-9 teams. . . . We'd be unarmed in the face of vicious drug gangs,\" Kush said. '[URL=http://www.latimes.com/news/nationworld/nation/la-na-mexico-drugs-railroad19-2009mar19,0,6619169.story]' From the Los Angeles Times ============================================================ If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? This message has been edited. Last edited by: stillkit, Fri 20 March 2009 09:23 AM \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 19:59:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault.", 
        "intTime": 20090319, 
        "postID": 32, 
        "quote": "Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in???", 
        "reply": " You probably don't want to know, but I don't see how it's UP's fault.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:09:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? It is their cars. You probably don't want to know, but I don't see how it's UP's fault. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 33, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? It is their cars. You probably don't want to know, but I don't see how it's UP's fault.", 
        "reply": " \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:10:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. It is their cars. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 34, 
        "quote": "Originally posted by EngrOpsNCO: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault.", 
        "reply": " It is their cars. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:11:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "intTime": 20090319, 
        "postID": 35, 
        "quote": "Originally posted by EngrOpsNCO: It is their cars.", 
        "reply": " I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-19 20:14:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "The lawsuit is about the company refusing to pay penalties, not about criminal activity. The company claims they \"cannot\" control what their company in Mexico does, maybe they should disband their mexican company and start over.", 
        "intTime": 20090320, 
        "postID": 36, 
        "quote": "", 
        "reply": "The lawsuit is about the company refusing to pay penalties, not about criminal activity. The company claims they \"cannot\" control what their company in Mexico does, maybe they should disband their mexican company and start over.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:28:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Yep, you are correct. Criminal = Reasonable doubt Civilian = more then likely (or words close to that.) Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090320, 
        "postID": 37, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "reply": " Yep, you are correct. Criminal = Reasonable doubt Civilian = more then likely (or words close to that.) Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:44:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "L0A1"
    }, 
    {
        "content": "Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "intTime": 20090320, 
        "postID": 38, 
        "quote": "", 
        "reply": "Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:58:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "intTime": 20090320, 
        "postID": 39, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault.", 
        "reply": " Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 08:58:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Is it even a criminal matter?", 
        "intTime": 20090320, 
        "postID": 40, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case.", 
        "reply": " Is it even a criminal matter?", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:00:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence. Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay?", 
        "intTime": 20090320, 
        "postID": 41, 
        "quote": "Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "reply": " Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay?", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:02:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Is it even a criminal matter? I don't see how it could be. Would a farmer on the TX/MX border be responsible for all the smuggling and illegal aliens coming in across his land? Not unless he was allowing it with knowledge. Simple solution, if the government has a problem with it, they should provide enough K-9's to search the trains. Just my opinion. Don", 
        "intTime": 20090320, 
        "postID": 42, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: It is their cars. I suppose it's a \"buck stops here\" sort of thing, but nobody in their right mind would expect them to know about what's secretly been hidden in their cars. And, what's up with the lawsuit? If they're responsible, why not file criminal charges? Let me give you tip why not: They couldn't get a conviction in a month of Sunday's, that's why. The burden of proof is much more strict in a criminal case. Is it even a criminal matter?", 
        "reply": " I don't see how it could be. Would a farmer on the TX/MX border be responsible for all the smuggling and illegal aliens coming in across his land? Not unless he was allowing it with knowledge. Simple solution, if the government has a problem with it, they should provide enough K-9's to search the trains. Just my opinion. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:08:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay? Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses", 
        "intTime": 20090320, 
        "postID": 43, 
        "quote": "Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay?", 
        "reply": " Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:13:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay? Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses Okay... you have me stumped as to what you are trying to say. The Federal Government is well within its rights to ensure that the UP secures their own equipment. And to charge the UP civilly for the expense of Customs and Border patrol man hours when they find contraband. There is ample precident for this in the maritime Shipping industry. This really is a non-issue and the UP is simply trying to buy as much time as it can before having to add this expense to their books.", 
        "intTime": 20090320, 
        "postID": 44, 
        "quote": "Originally posted by soscorpio: quote: Not really certain what the rant is about... but it was George Bush's administration that placed these rules and requirements following 9/11. There is nothing wrong with those rules Okay? Okay? No, America is being invaded. We need to hold congress responsible regardless of who was sitting in the POTUS chair. Besides Bush was a liberal. The good Republicans are so outnumbered that they have no voice and their side is not represented in the media. The media always uses two sides in a discussion but they really aren't saying much different from each other. And the destruction goes on and on and on, right under the noses of the complacent and uneducated masses", 
        "reply": " Okay... you have me stumped as to what you are trying to say. The Federal Government is well within its rights to ensure that the UP secures their own equipment. And to charge the UP civilly for the expense of Customs and Border patrol man hours when they find contraband. There is ample precident for this in the maritime Shipping industry. This really is a non-issue and the UP is simply trying to buy as much time as it can before having to add this expense to their books.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:18:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter.", 
        "intTime": 20090320, 
        "postID": 45, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: If they can bring in that much drugs what else (dirty bombs, etc) could be making its way in??? You probably don't want to know, but I don't see how it's UP's fault. Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "reply": " According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:34:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter. Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse.", 
        "intTime": 20090320, 
        "postID": 46, 
        "quote": "Originally posted by stillkit: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. According to the article, it appears more likely that the government has been assessing \"penalities\" (see: fining) UP for not having manifests for the drugs found in, or on, its empty cars. Any transporter, by whatever method of conveyance, is required to have a manifest or bill of lading for what's in their vehicles. If that vehicle is empty, none is required. Even then, unless that vehicle is live-loaded, ie: with someone from the company standing right there supervising, they have no way of knowing whether or not that manifest accurately describes what's in the vehicle unless they break the seal (as serious no-no, especially in international shipments) and look for themselves. Once those seals are broken, whatever is in there, and the commodities condition, become the responsibility of the carrier instead of the shipper. Trains are rarely live-loaded. The lawsuit apparently stems from UP's refusal to pay those fines and I don't blame them. If I, as a truck driver, had picked up an empty trailer from a yard somewhere and drugs were found hidden on that trailer, I wouldn't pay a fine for not having a bill of lading on the drugs either. Frankly, this all smacks of political payback for something much more so than a law enforcement matter.", 
        "reply": " Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 09:59:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don", 
        "intTime": 20090320, 
        "postID": 47, 
        "quote": "Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime.", 
        "reply": " Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:04:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.", 
        "intTime": 20090320, 
        "postID": 48, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by ArtMarsh: The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. Art, it use to be that way but things changed over the past 10 yrs. With Customs, we use to seize boats (that was my job, not ships) if they were used in smuggling. In the late 90's, a ruling came down that we had to show the owner had knowledge of the criminal act. That's why we started seeing all the smuggler using some boat owned by a school teacher or something who just happened to \"loan\" them the boat for the night. Ya right. We also use to seize anything the smuggler owned that was way above what his documented income could afford. Ex: say he was supposedly a taxi driver yet owned a $500,000 home, yacht, etc, we would generally seize all that based on smuggling proceeds. Again, that all changed and we had to prove what income was earned based on the shipment we seized unless we could go back and collect evidence to show proceeds from past smuggling ventures were the source of income for the house, yacht, etc. Don", 
        "reply": " Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:12:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Just another benefit of NAFTA.", 
        "intTime": 20090320, 
        "postID": 49, 
        "quote": "", 
        "reply": "Just another benefit of NAFTA.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:17:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse. It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "intTime": 20090320, 
        "postID": 50, 
        "quote": "Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse.", 
        "reply": " It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:24:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Don Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.[/QUOTE] Well that clarifies that issue. I wonder if I can find a caboose cheap for a home? Live the life of James West and Artemus Gordon in the TV series, \"Wild, Wild, West\" Don", 
        "intTime": 20090320, 
        "postID": 51, 
        "quote": "Originally posted by ArtMarsh: Don", 
        "reply": " Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.[/QUOTE] Well that clarifies that issue. I wonder if I can find a caboose cheap for a home? Live the life of James West and Artemus Gordon in the TV series, \"Wild, Wild, West\" Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:27:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Solid ground? Doubtful. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090320, 
        "postID": 52, 
        "quote": "Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here.", 
        "reply": " I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Solid ground? Doubtful. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:41:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. [/QUOTE] Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don", 
        "intTime": 20090320, 
        "postID": 53, 
        "quote": "Originally posted by mmulder67:", 
        "reply": " I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. [/QUOTE] Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:45:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well. The U.S. knows that Mexico is smuggling drugs across the border on foot, in cars, in semi trailers, etc.. When are we going to start fining the Border Patrol for allowing it to happen? Customs seizes \"containers\" that are used in transporting contraband. Can you elaborate on that a little more? Was there a bill of lading that showed one cargo that wasn't present while contraband was? Who shipped the container? Where was the container going? And lastly....UP typically doesn't own the containers so how does that affect them? I sure hope your line of reasoning doesn't take it's full course cause as soon as it does your neighbors stolen car used in a crime? Well to bad for your neighbor he's getting fined. Hope no one steals your car...... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090320, 
        "postID": 54, 
        "quote": "Originally posted by ArtMarsh: Don, The UP knows their equipment is being used for smuggling... that satisfies the law. I have watched Customs sieze and sell containers and content used in transporting contraband. Every once in awhile you will see the auctions come up as well.", 
        "reply": " The U.S. knows that Mexico is smuggling drugs across the border on foot, in cars, in semi trailers, etc.. When are we going to start fining the Border Patrol for allowing it to happen? Customs seizes \"containers\" that are used in transporting contraband. Can you elaborate on that a little more? Was there a bill of lading that showed one cargo that wasn't present while contraband was? Who shipped the container? Where was the container going? And lastly....UP typically doesn't own the containers so how does that affect them? I sure hope your line of reasoning doesn't take it's full course cause as soon as it does your neighbors stolen car used in a crime? Well to bad for your neighbor he's getting fined. Hope no one steals your car...... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:50:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by mmulder67: I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don Wonder how they could do that with railcars? Not very many smaller railcars out there... Helps to avoid the inspectors at the ports. Wonder who employs those (federal) inspectors at the ports? Why doesn't UP get the same consideration? Oh I know! Cash cow......isn't our government wonderful? Rhetorical question full of sarcasm..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090320, 
        "postID": 55, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by mmulder67: I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. Ya, it's the other way around...freighter from Colombia, Venezuala, Panama comes up close to the US coast and offloads to smaller boats. Don", 
        "reply": " Wonder how they could do that with railcars? Not very many smaller railcars out there... Helps to avoid the inspectors at the ports. Wonder who employs those (federal) inspectors at the ports? Why doesn't UP get the same consideration? Oh I know! Cash cow......isn't our government wonderful? Rhetorical question full of sarcasm..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 10:54:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Wonder how they could do that with railcars? Not very many smaller railcars out there... Heck, that would be easy. Railways through a desert or countryside, SUV pulls up and the offload commences. Don", 
        "intTime": 20090320, 
        "postID": 56, 
        "quote": "Originally posted by mmulder67: Wonder how they could do that with railcars? Not very many smaller railcars out there...", 
        "reply": " Heck, that would be easy. Railways through a desert or countryside, SUV pulls up and the offload commences. Don", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 11:03:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence. Can you explain how our founders did anything to control border access? Were there checkpoints and a fence between the new US and Canada. Did we have a riverboat fleet to secure our side of the Mississippi? Was there anything keeping every immigrant from Europe from coming over? What does having border security have to do with morals? Are we morally superiorover the rest of the planet? I am all for border security, but I don't see how your \"founders\" argument is relavent.", 
        "intTime": 20090320, 
        "postID": 57, 
        "quote": "Originally posted by soscorpio: Our founders knew a strong, tight border was vital to maintain the morals that are educated to our citizens, but the liberals managed to lable those actions as 'repressive\" and \"isolationist\". And so the good republicans at the time compromised. Whenever we compromise our principles, one party gains ground and the other loses. That is some compromise! Our republic required intelligent citizens to survive. The elite owned media made sure to propagandize us so as to lead us into destruction. Liberty takes vigalence.", 
        "reply": " Can you explain how our founders did anything to control border access? Were there checkpoints and a fence between the new US and Canada. Did we have a riverboat fleet to secure our side of the Mississippi? Was there anything keeping every immigrant from Europe from coming over? What does having border security have to do with morals? Are we morally superiorover the rest of the planet? I am all for border security, but I don't see how your \"founders\" argument is relavent.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:43:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse. It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries. LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.", 
        "intTime": 20090320, 
        "postID": 58, 
        "quote": "Originally posted by stillkit: quote: Kit, All the government can do at this point is charge penalties… it is a civil matter. To be criminal, there would have to be evidence that the UP was an active participant to the criminal act. We both know that they are not. And you are incorrect… there must be 100% accountability for all equipment being moved in a manifest. Regardless if it moves by rail or ship. That was my business Kit. From 1995 until 2004 and from 2006 until 2008. Dealing with International Maritime shipments as well as rail transshipping on the BNSF, UP, Southern, NS… and a couple of other Texas rails. It is not political payback nor is it big brother. The federal Government uses this as a tool to stop smuggling. The other Option for the Federal Government Kit is Asset forfeiture. That law does not care WHO owns the equipment…. Just the fact it was used in the commission of a crime. That would hurt the UP far worse. It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "reply": " LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:43:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. I have... it is done all the time. Docking at Ocean berths are done by appointment only. Ie... scheduled. Occasionaly one gets ahead of the game... most of time by cancelling a prior port call. At the next port it will usually have to sit offshore while the berth empties. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. The same way it is done in Mexico... they are put aboard before the doors are sealed. As a joke, one of the Longshoremen placed a management pickup truck in an empty container and that container was loaded in Seattle. They found the truck in Hong Kong over a month later when they went to reuse the container. It wound up being returned to Seattle the same way. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Read closer as to who owns the Mexican transportation company. Also, how come the Maritime industry can comply following 9/11 and the Railroad industry cannot? Solid ground? Doubtful. It is solid... with precident", 
        "intTime": 20090320, 
        "postID": 59, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by ArtMarsh: Kit... what is the difference between this and Ocean shippers that bring smuggled items into the US? Since 2001 the Federal Government has required those shippers to do the same thing they are asking the UP to do. And those shippers are able to handle it often times from the same or worse drug gang regions. While it may not be UPs fault for the drugs getting into their rail shipments... it certainly can become their responsibility to ensure that it does not happen. The Fed is on solid ground here. I have yet too see a ship stop anywhere in the middle of the ocean to let another ship pass....no \"sidings\" in the ocean. I have... it is done all the time. Docking at Ocean berths are done by appointment only. Ie... scheduled. Occasionaly one gets ahead of the game... most of time by cancelling a prior port call. At the next port it will usually have to sit offshore while the berth empties. Be kind of neat to see drug smugglers put drugs in empty containers on a ship in mid transport. The same way it is done in Mexico... they are put aboard before the doors are sealed. As a joke, one of the Longshoremen placed a management pickup truck in an empty container and that container was loaded in Seattle. They found the truck in Hong Kong over a month later when they went to reuse the container. It wound up being returned to Seattle the same way. And how can it not be their fault for the drugs getting into their cars yet it's their responsibility to ensure that it does not happen, yet it's happening in a foreign country where UP has no authority? That statement contradicts itself. Read closer as to who owns the Mexican transportation company. Also, how come the Maritime industry can comply following 9/11 and the Railroad industry cannot? Solid ground? Doubtful. It is solid... with precident", 
        "reply": "", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:51:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries. LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.[/QUOTE] What kind of manifest would you have for each, individual empty container? I can understand an over-all manifest identifying X number of empties or a manifest for a ship load of empty containers, but we're not talking about container cars in the UP's case. According to the article, we're talking about empty box cars and empty flat cars. Yes, the railroad must provide the Border Patrol and INS documentation relating to how many cars, loaded or empty, they're bringing across the border, but empty cars do not require an individual manifest for what's on board because nothing is. So, the train crosses the border at Calexico/Mexicali and immediately enters the Custom's inspection yard. The train manifest lists 40 loaded cars and 10 empties. Bills of Lading are provided to identify what's in the loaded ones, but nothing more is required for the empties. The inspectors begin searching the train, opening doors to verify the cargo in those loaded cars. They bring out the dogs or run the cars through a scanner of some sort and do a walk around. They find dope HIDDEN in an empty boxcar, concealed behind a false front or secreted into the frame of the car. Then, they write the UP a ticket for not declaring and documenting the dope they didn't even know was there? That's outrageously unfair, wouldn't you say? I've pulled empty trailers across both borders, going both ways, and was subjected to an inspection every time. Nothing wrong with that. But, nobody ever threatened to fine me for not having a manifest which identified any dope hidden in the the trailer and, if they had, I'd have come unglued.", 
        "intTime": 20090320, 
        "postID": 60, 
        "quote": "Originally posted by ArtMarsh: It used to be my business too, on a lower level. I drove a truck for many years, often in international commerce to Canada and Mexico. I was never required to have any kind of manifest for an empty trailer by any of the 3 countries.", 
        "reply": " LOL! Ever ship 300 empty containers at the same time? How about 100 empty railcars? I have on occasion seen 2200 empty containers loaded onto a ship bound for the Far East. That quantity gets manifested... each and every time.[/QUOTE] What kind of manifest would you have for each, individual empty container? I can understand an over-all manifest identifying X number of empties or a manifest for a ship load of empty containers, but we're not talking about container cars in the UP's case. According to the article, we're talking about empty box cars and empty flat cars. Yes, the railroad must provide the Border Patrol and INS documentation relating to how many cars, loaded or empty, they're bringing across the border, but empty cars do not require an individual manifest for what's on board because nothing is. So, the train crosses the border at Calexico/Mexicali and immediately enters the Custom's inspection yard. The train manifest lists 40 loaded cars and 10 empties. Bills of Lading are provided to identify what's in the loaded ones, but nothing more is required for the empties. The inspectors begin searching the train, opening doors to verify the cargo in those loaded cars. They bring out the dogs or run the cars through a scanner of some sort and do a walk around. They find dope HIDDEN in an empty boxcar, concealed behind a false front or secreted into the frame of the car. Then, they write the UP a ticket for not declaring and documenting the dope they didn't even know was there? That's outrageously unfair, wouldn't you say? I've pulled empty trailers across both borders, going both ways, and was subjected to an inspection every time. Nothing wrong with that. But, nobody ever threatened to fine me for not having a manifest which identified any dope hidden in the the trailer and, if they had, I'd have come unglued.", 
        "threadID": "409192893_8400083812001", 
        "time": "2009-03-20 12:58:00", 
        "title": "There are trainloads of contraband flowing across the border (literally)", 
        "userID": "stillkit"
    }
]