[
    {
        "content": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "intTime": 20090514, 
        "postID": 1, 
        "quote": "\"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training.", 
        "reply": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html  There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:11:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "intTime": 20090514, 
        "postID": 2, 
        "quote": "", 
        "reply": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL. I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "intTime": 20090514, 
        "postID": 3, 
        "quote": "Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "reply": " I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:10:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "intTime": 20090514, 
        "postID": 4, 
        "quote": "", 
        "reply": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:14:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "intTime": 20090514, 
        "postID": 5, 
        "quote": "", 
        "reply": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:22:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OldDoc"
    }, 
    {
        "content": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "intTime": 20090514, 
        "postID": 6, 
        "quote": "", 
        "reply": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:50:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. +1", 
        "intTime": 20090514, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " +1", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:03:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "intTime": 20090514, 
        "postID": 8, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Esample1"
    }, 
    {
        "content": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "intTime": 20090515, 
        "postID": 9, 
        "quote": "", 
        "reply": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 00:58:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "intTime": 20090515, 
        "postID": 10, 
        "quote": "", 
        "reply": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 11, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:24:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. He is against it too. You have probably misunderstood him.", 
        "intTime": 20090515, 
        "postID": 12, 
        "quote": "Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility.", 
        "reply": " He is against it too. You have probably misunderstood him.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives. First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "intTime": 20090515, 
        "postID": 13, 
        "quote": "Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "reply": " First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:46:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: We are doing the same thing to our own troops. Not really.", 
        "intTime": 20090515, 
        "postID": 14, 
        "quote": "We are doing the same thing to our own troops.", 
        "reply": " Not really.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:54:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "intTime": 20090515, 
        "postID": 15, 
        "quote": "Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really.", 
        "reply": " I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 15:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident. And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "intTime": 20090515, 
        "postID": 16, 
        "quote": "Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "reply": " And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:06:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "intTime": 20090515, 
        "postID": 17, 
        "quote": "Originally posted by ELLIOTT1980: that qualifies you to make the above statement...", 
        "reply": " It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:23:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "intTime": 20090515, 
        "postID": 18, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:41:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "intTime": 20090515, 
        "postID": 19, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 22:21:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 20, 
        "quote": "", 
        "reply": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 02:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 21, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 03:00:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090516, 
        "postID": 22, 
        "quote": "", 
        "reply": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 04:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "intTime": 20090516, 
        "postID": 23, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner...", 
        "reply": " MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 05:49:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "stillkit"
    }, 
    {
        "content": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 24, 
        "quote": "", 
        "reply": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:52:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Jus' sayin'... \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 25, 
        "quote": "", 
        "reply": "Jus' sayin'... \"The World's Finest\"", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "intTime": 20090516, 
        "postID": 26, 
        "quote": "Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago.", 
        "reply": " The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:08:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "NavySubBubba"
    }, 
    {
        "content": "quote: Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized. Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 27, 
        "quote": "Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "reply": " Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:29:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 28, 
        "quote": "", 
        "reply": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 08:56:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 29, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 09:19:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "intTime": 20090516, 
        "postID": 30, 
        "quote": "", 
        "reply": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 10:20:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "intTime": 20090514, 
        "postID": 31, 
        "quote": "\"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training.", 
        "reply": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html  There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:11:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "intTime": 20090514, 
        "postID": 32, 
        "quote": "", 
        "reply": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL. I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "intTime": 20090514, 
        "postID": 33, 
        "quote": "Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "reply": " I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:10:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "intTime": 20090514, 
        "postID": 34, 
        "quote": "", 
        "reply": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:14:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "intTime": 20090514, 
        "postID": 35, 
        "quote": "", 
        "reply": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:22:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OldDoc"
    }, 
    {
        "content": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "intTime": 20090514, 
        "postID": 36, 
        "quote": "", 
        "reply": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:50:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. +1", 
        "intTime": 20090514, 
        "postID": 37, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " +1", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:03:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "intTime": 20090514, 
        "postID": 38, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Esample1"
    }, 
    {
        "content": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "intTime": 20090515, 
        "postID": 39, 
        "quote": "", 
        "reply": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 00:58:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "intTime": 20090515, 
        "postID": 40, 
        "quote": "", 
        "reply": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 41, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:24:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. He is against it too. You have probably misunderstood him.", 
        "intTime": 20090515, 
        "postID": 42, 
        "quote": "Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility.", 
        "reply": " He is against it too. You have probably misunderstood him.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives. First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "intTime": 20090515, 
        "postID": 43, 
        "quote": "Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "reply": " First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:46:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: We are doing the same thing to our own troops. Not really.", 
        "intTime": 20090515, 
        "postID": 44, 
        "quote": "We are doing the same thing to our own troops.", 
        "reply": " Not really.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:54:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "intTime": 20090515, 
        "postID": 45, 
        "quote": "Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really.", 
        "reply": " I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 15:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident. And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "intTime": 20090515, 
        "postID": 46, 
        "quote": "Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "reply": " And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:06:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "intTime": 20090515, 
        "postID": 47, 
        "quote": "Originally posted by ELLIOTT1980: that qualifies you to make the above statement...", 
        "reply": " It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:23:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "intTime": 20090515, 
        "postID": 48, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:41:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "intTime": 20090515, 
        "postID": 49, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 22:21:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 50, 
        "quote": "", 
        "reply": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 02:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 51, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 03:00:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090516, 
        "postID": 52, 
        "quote": "", 
        "reply": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 04:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "intTime": 20090516, 
        "postID": 53, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner...", 
        "reply": " MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 05:49:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "stillkit"
    }, 
    {
        "content": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 54, 
        "quote": "", 
        "reply": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:52:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Jus' sayin'... \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 55, 
        "quote": "", 
        "reply": "Jus' sayin'... \"The World's Finest\"", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "intTime": 20090516, 
        "postID": 56, 
        "quote": "Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago.", 
        "reply": " The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:08:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "NavySubBubba"
    }, 
    {
        "content": "quote: Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized. Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 57, 
        "quote": "Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "reply": " Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:29:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 58, 
        "quote": "", 
        "reply": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 08:56:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 59, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 09:19:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "intTime": 20090516, 
        "postID": 60, 
        "quote": "", 
        "reply": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 10:20:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "intTime": 20090514, 
        "postID": 61, 
        "quote": "\"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training.", 
        "reply": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html  There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:11:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "intTime": 20090514, 
        "postID": 62, 
        "quote": "", 
        "reply": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL. I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "intTime": 20090514, 
        "postID": 63, 
        "quote": "Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "reply": " I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:10:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "intTime": 20090514, 
        "postID": 64, 
        "quote": "", 
        "reply": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:14:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "intTime": 20090514, 
        "postID": 65, 
        "quote": "", 
        "reply": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:22:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OldDoc"
    }, 
    {
        "content": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "intTime": 20090514, 
        "postID": 66, 
        "quote": "", 
        "reply": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:50:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. +1", 
        "intTime": 20090514, 
        "postID": 67, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " +1", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:03:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "intTime": 20090514, 
        "postID": 68, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Esample1"
    }, 
    {
        "content": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "intTime": 20090515, 
        "postID": 69, 
        "quote": "", 
        "reply": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 00:58:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "intTime": 20090515, 
        "postID": 70, 
        "quote": "", 
        "reply": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 71, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:24:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. He is against it too. You have probably misunderstood him.", 
        "intTime": 20090515, 
        "postID": 72, 
        "quote": "Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility.", 
        "reply": " He is against it too. You have probably misunderstood him.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives. First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "intTime": 20090515, 
        "postID": 73, 
        "quote": "Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "reply": " First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:46:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: We are doing the same thing to our own troops. Not really.", 
        "intTime": 20090515, 
        "postID": 74, 
        "quote": "We are doing the same thing to our own troops.", 
        "reply": " Not really.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:54:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "intTime": 20090515, 
        "postID": 75, 
        "quote": "Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really.", 
        "reply": " I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 15:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident. And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "intTime": 20090515, 
        "postID": 76, 
        "quote": "Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "reply": " And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:06:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "intTime": 20090515, 
        "postID": 77, 
        "quote": "Originally posted by ELLIOTT1980: that qualifies you to make the above statement...", 
        "reply": " It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:23:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "intTime": 20090515, 
        "postID": 78, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:41:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "intTime": 20090515, 
        "postID": 79, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 22:21:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 80, 
        "quote": "", 
        "reply": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 02:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 81, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 03:00:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090516, 
        "postID": 82, 
        "quote": "", 
        "reply": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 04:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "intTime": 20090516, 
        "postID": 83, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner...", 
        "reply": " MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 05:49:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "stillkit"
    }, 
    {
        "content": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 84, 
        "quote": "", 
        "reply": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:52:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Jus' sayin'... \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 85, 
        "quote": "", 
        "reply": "Jus' sayin'... \"The World's Finest\"", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "intTime": 20090516, 
        "postID": 86, 
        "quote": "Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago.", 
        "reply": " The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:08:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "NavySubBubba"
    }, 
    {
        "content": "quote: Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized. Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 87, 
        "quote": "Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "reply": " Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:29:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 88, 
        "quote": "", 
        "reply": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 08:56:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 89, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 09:19:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "intTime": 20090516, 
        "postID": 90, 
        "quote": "", 
        "reply": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 10:20:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "intTime": 20090514, 
        "postID": 91, 
        "quote": "\"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training.", 
        "reply": "Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html  There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:11:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "intTime": 20090514, 
        "postID": 92, 
        "quote": "", 
        "reply": "Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 19:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL. I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "intTime": 20090514, 
        "postID": 93, 
        "quote": "Originally posted by xnavycg: Not trying to nit pick, but Ventura was a UDT not a SEAL. He has said this in the past, but the media still refers to him as a SEAL.", 
        "reply": " I never knew that about him. Never really paid much attention to him before this. Did you watch the video? I am curious about it because I can't watch it with my slow connection. I have to wait till I get to work tomorrow.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:10:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "intTime": 20090514, 
        "postID": 94, 
        "quote": "", 
        "reply": "And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:14:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "intTime": 20090514, 
        "postID": 95, 
        "quote": "", 
        "reply": "Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:22:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OldDoc"
    }, 
    {
        "content": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "intTime": 20090514, 
        "postID": 96, 
        "quote": "", 
        "reply": "It is too funny. He is saying exactly what the experts have said all along. There is no value to torture. You can however make someone say what you want them to say. Sounds like something the Bush administration could use. Kinda like Chalabi's lies.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 20:50:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. +1", 
        "intTime": 20090514, 
        "postID": 97, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " +1", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:03:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "intTime": 20090514, 
        "postID": 98, 
        "quote": "Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding.", 
        "reply": " Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-14 21:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Esample1"
    }, 
    {
        "content": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "intTime": 20090515, 
        "postID": 99, 
        "quote": "", 
        "reply": "Old school + New school = BUDs (UDT/SEAL) Both wear the same solid Gold Badge !!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 00:58:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "intTime": 20090515, 
        "postID": 100, 
        "quote": "", 
        "reply": "Last year Ventura was on the Opie & Anthony Show. He was going on about 9/11 conspiracy stuff, was coming off as a loon. Comedian Jim Norton took him to task on various points, made Ventura look like a chump. I'm sure it's on U-tube or one of those sites, worth a search. I appreciate that he served & was governor, ect., but nowadays he's way out in left field.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:17:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 101, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:24:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility. He is against it too. You have probably misunderstood him.", 
        "intTime": 20090515, 
        "postID": 102, 
        "quote": "Originally posted by L0A1: quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? Interesting and hypocritical. Anyojne that pays attention know I am against waterboarding, that said Jessie supposedly is as well, yet makes this statement? He is a hypocrite with no credibility.", 
        "reply": " He is against it too. You have probably misunderstood him.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 10:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives. First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "intTime": 20090515, 
        "postID": 103, 
        "quote": "Originally posted by esample1: quote: Originally posted by GunnyRet03: And the fact that he said he was waterboarded proved the point that it is ok to do it to terrorists. Now we have nitwits here who say but but but being in the military is voluntary and if you're waterboarded as part of your trng its your fault or decision. Guess what..... Being a terrorist is voluntary, and in doing so a terrorist signed up for waterboarding. Well that makes sense. Since we waterboard our troops to prepare them for torture while in captivity, that means it's ok to do it to our captives.", 
        "reply": " First of all in aint torture and secondly yes, it is ok. We are doing the same thing to our own troops.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:46:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: We are doing the same thing to our own troops. Not really.", 
        "intTime": 20090515, 
        "postID": 104, 
        "quote": "We are doing the same thing to our own troops.", 
        "reply": " Not really.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 14:54:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "intTime": 20090515, 
        "postID": 105, 
        "quote": "Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really.", 
        "reply": " I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... It's none of your busness what his MOS was or what he did. Now stay on the topic or move on. That goes for all of you on this thread. Mainedawg Moderator. This message has been edited. Last edited by: mainedawg, Wed 20 May 2009 12:54 PM", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 15:39:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident. And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "intTime": 20090515, 
        "postID": 106, 
        "quote": "Originally posted by OldDoc: Ventura has morphed into a windbag who talks only to hear himself, he has no credibility with most people who hear him. As xnavy said, he is UDT, shouldn't wear the trident.", 
        "reply": " And merrills Maurauders evolved into the green berets,and special forces, so what. UDT was all they had at the time and they evolved into the seals. He is entitled.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:06:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "intTime": 20090515, 
        "postID": 107, 
        "quote": "Originally posted by ELLIOTT1980: that qualifies you to make the above statement...", 
        "reply": " It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:23:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "intTime": 20090515, 
        "postID": 108, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Thats exactly what good self defense training is all about.To defend against an unexpected attack and reverse it into a disabling offensive manuver rendering the attacker immobilized or worse.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 16:41:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same. Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "intTime": 20090515, 
        "postID": 109, 
        "quote": "Originally posted by SenClaghorn: quote: Originally posted by ELLIOTT1980: that qualifies you to make the above statement... It is none of your business what my MOS was. What is important to know is the two are different, just like self defense training is different then a savage attack from from an unknown assailant. It is not the same.", 
        "reply": " Believe (say) whatever you want... That's the greatness of our nation, to have sheeple flocks nestled safely, without fear, with shepherd's dogs (OUR Warriors) ever vigilant. GOD Bless Our Warriors", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-15 22:21:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 110, 
        "quote": "", 
        "reply": "\"http://www.navyseals.com/jesse-ventura\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 02:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 111, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I think the Governor is spot on with his remarks!...applause for him........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 03:00:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090516, 
        "postID": 112, 
        "quote": "", 
        "reply": "For what it is worth \"NavySEALS.com\" has the following posted on \"Notable SEALs:\" Jesse Ventura joined the Navy after high school and served for six years — four on active duty, two in the Reserves — and is a Vietnam veteran. While on active duty, he was a member of Underwater Demolition (SEAL) Team 12. He returned to Minnesota in 1973. Ventura's role as the Governor of Minnesota is the latest aspect of a lifetime spent serving the public in such various ways. He was the mayor of Brooklyn Park, a Navy SEAL, professional wrestler, actor and broadcaster. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 04:28:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner... MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "intTime": 20090516, 
        "postID": 113, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by SenClaghorn: quote: We are doing the same thing to our own troops. Not really. I'm not questioning your service sir, however, I would like to know your MOS, additional specialties, that qualifies you to make the above statement... I've been thru a \"hard cell\" situation, it taught me alot about myself, and what is in store for a prisoner...", 
        "reply": " MOD HAT ON Actually, questioning his service is exactly what you're doing and it's not allowed. You may ask how he's qualified to make such a statement, but you may not couch it terms of questioning his service.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 05:49:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "stillkit"
    }, 
    {
        "content": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 114, 
        "quote": "", 
        "reply": "I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:52:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Jus' sayin'... \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 115, 
        "quote": "", 
        "reply": "Jus' sayin'... \"The World's Finest\"", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 06:55:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "intTime": 20090516, 
        "postID": 116, 
        "quote": "Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago.", 
        "reply": " The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:08:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "NavySubBubba"
    }, 
    {
        "content": "quote: Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized. Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 117, 
        "quote": "Originally posted by NavySubBubba: quote: Originally posted by ProgMod: I have seen Jessie Ventura wearing the gold trident badge and the gold Navy/MC qualified parachutists wings on several occasions. He normally wears them on a blue blazer. Knowing how serious the Seals take anyone who may be posing as one of their own, or wrongly wearing badges they didn't qualify for, celebrity status or not-the Governor would have taken heat for that a long time ago. The Navy “retired” the UDT badge in the 70’s and grandfathered everyone to the SEAL’s Trident. Regardless which way you went, UDT or SEAL, everyone completed BUD’s. So, The Body wearing the Trident is authorized.", 
        "reply": " Roger that NavySub, I knew that. All I was saying, was that Jessie would have caught hell if he hadn't qualified BUD'S=SEALS/UDT, and was getting away with wearing something unauthorized. I remember well the old UDT badges did not incorporate the \"eagle.\" Enlisted personnel also wore a silver version of both SEAL/UDT badges. Now, the SEAL badge is in gold for both officer/enlisted. Now, I've got a question for you. For those in SEAL training, must they qualify first in winning their Navy/MC gold jump wings, before they complete their SEAL training to win the trident? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 07:29:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 118, 
        "quote": "", 
        "reply": "I have to agree with GunnyRet03. First of all, waterboarding is not \"torture,\" regardless of the liberal spin doctors utilizing their free speech to declare it as such. Regardless, even if it was, if we can do it to our own, we can do it to those who oppose us as enemies. The standards need to be consistent. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 08:56:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it? I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 119, 
        "quote": "Originally posted by AngelHeart: Re: http://military-entertainment.military.com/2009/05/navy...nfess-to-murder.html quote: \"You give me a waterboard, Dick Cheney and one hour, and I'll have him confess to the Sharon Tate murders.\" So says Navy SEAL, professional wrestling entertainer, star of \"Predator\" and former Minnesota Governor Jesse Ventura in an interview with Larry King. Ventura claims that waterboarding is torture, based on the waterboarding he endured during SEAL training. There are links to the video of the interveiw. I was curious to know what ya all think about it?", 
        "reply": " I'll pass on the videos, Angel - he's a shock value attention ***** - like the other \"Jesse.\" ugggh, I can do without. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 09:19:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "intTime": 20090516, 
        "postID": 120, 
        "quote": "", 
        "reply": "Cheney was very unhappy he shot his friend...who did die later?!", 
        "threadID": "409192893_2000043322001", 
        "time": "2009-05-16 10:20:00", 
        "title": "Navy SEAL(Jesse Ventura) Would Like Dick Cheney to Confess to Murder", 
        "userID": "dragonflyer04"
    }
]