[
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Has anyone seen Rove?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:44:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "reply": " Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party", 
        "reply": " May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:52:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! He must have a Mini Me.", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend!", 
        "reply": " He must have a Mini Me.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "intTime": 20090304, 
        "postID": 5, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:01:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs.", 
        "reply": " It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "intTime": 20090304, 
        "postID": 7, 
        "quote": "EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO?", 
        "reply": " I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "intTime": 20090304, 
        "postID": 8, 
        "quote": "FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda.", 
        "reply": " Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "intTime": 20090304, 
        "postID": 9, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:18:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "intTime": 20090304, 
        "postID": 10, 
        "quote": "Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "reply": " I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:20:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power? Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "intTime": 20090304, 
        "postID": 11, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "reply": " Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:22:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "intTime": 20090304, 
        "postID": 12, 
        "quote": "", 
        "reply": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:34:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "", 
        "reply": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "intTime": 20090304, 
        "postID": 14, 
        "quote": "", 
        "reply": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:45:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "intTime": 20090304, 
        "postID": 15, 
        "quote": "FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:58:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090304, 
        "postID": 16, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:32:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "intTime": 20090304, 
        "postID": 17, 
        "quote": "Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "reply": " The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "intTime": 20090304, 
        "postID": 18, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "reply": " What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:51:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like. Discredit him? No that is not their strategy. Try again.", 
        "intTime": 20090304, 
        "postID": 19, 
        "quote": "Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "reply": " Discredit him? No that is not their strategy. Try again.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:55:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "intTime": 20090304, 
        "postID": 20, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:05:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Oh and here is another one that is not afraid of limbo: quote: A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "intTime": 20090304, 
        "postID": 21, 
        "quote": "A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "reply": "Oh and here is another one that is not afraid of limbo: ", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "intTime": 20090304, 
        "postID": 22, 
        "quote": "In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "reply": " Where was that said?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:09:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said? Go look at the other threads on this topic. Booh!", 
        "intTime": 20090304, 
        "postID": 23, 
        "quote": "Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "reply": " Go look at the other threads on this topic. Booh!", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:12:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "intTime": 20090304, 
        "postID": 24, 
        "quote": "", 
        "reply": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:43:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "intTime": 20090304, 
        "postID": 25, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:47:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Well pretty much all the predictions about obama have so far been on track.", 
        "intTime": 20090304, 
        "postID": 26, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Well pretty much all the predictions about obama have so far been on track.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Who said he can't disagree with the president?", 
        "intTime": 20090304, 
        "postID": 27, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Who said he can't disagree with the president?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:19:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host. COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "intTime": 20090304, 
        "postID": 28, 
        "quote": "Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "reply": " COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:36:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "intTime": 20090304, 
        "postID": 29, 
        "quote": "", 
        "reply": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:37:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold. Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "intTime": 20090304, 
        "postID": 30, 
        "quote": "Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "reply": " Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:39:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "intTime": 20090304, 
        "postID": 31, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Has anyone seen Rove?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:44:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090304, 
        "postID": 32, 
        "quote": "Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "reply": " Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "intTime": 20090304, 
        "postID": 33, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party", 
        "reply": " May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:52:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! He must have a Mini Me.", 
        "intTime": 20090304, 
        "postID": 34, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend!", 
        "reply": " He must have a Mini Me.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "intTime": 20090304, 
        "postID": 35, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:01:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "intTime": 20090304, 
        "postID": 36, 
        "quote": "Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs.", 
        "reply": " It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "intTime": 20090304, 
        "postID": 37, 
        "quote": "EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO?", 
        "reply": " I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "intTime": 20090304, 
        "postID": 38, 
        "quote": "FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda.", 
        "reply": " Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "intTime": 20090304, 
        "postID": 39, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:18:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "intTime": 20090304, 
        "postID": 40, 
        "quote": "Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "reply": " I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:20:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power? Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "intTime": 20090304, 
        "postID": 41, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "reply": " Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:22:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "intTime": 20090304, 
        "postID": 42, 
        "quote": "", 
        "reply": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:34:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "intTime": 20090304, 
        "postID": 43, 
        "quote": "", 
        "reply": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "intTime": 20090304, 
        "postID": 44, 
        "quote": "", 
        "reply": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:45:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "intTime": 20090304, 
        "postID": 45, 
        "quote": "FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:58:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090304, 
        "postID": 46, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:32:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "intTime": 20090304, 
        "postID": 47, 
        "quote": "Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "reply": " The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "intTime": 20090304, 
        "postID": 48, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "reply": " What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:51:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like. Discredit him? No that is not their strategy. Try again.", 
        "intTime": 20090304, 
        "postID": 49, 
        "quote": "Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "reply": " Discredit him? No that is not their strategy. Try again.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:55:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "intTime": 20090304, 
        "postID": 50, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:05:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Oh and here is another one that is not afraid of limbo: quote: A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "intTime": 20090304, 
        "postID": 51, 
        "quote": "A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "reply": "Oh and here is another one that is not afraid of limbo: ", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "intTime": 20090304, 
        "postID": 52, 
        "quote": "In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "reply": " Where was that said?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:09:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said? Go look at the other threads on this topic. Booh!", 
        "intTime": 20090304, 
        "postID": 53, 
        "quote": "Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "reply": " Go look at the other threads on this topic. Booh!", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:12:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "intTime": 20090304, 
        "postID": 54, 
        "quote": "", 
        "reply": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:43:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "intTime": 20090304, 
        "postID": 55, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:47:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Well pretty much all the predictions about obama have so far been on track.", 
        "intTime": 20090304, 
        "postID": 56, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Well pretty much all the predictions about obama have so far been on track.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Who said he can't disagree with the president?", 
        "intTime": 20090304, 
        "postID": 57, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Who said he can't disagree with the president?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:19:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host. COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "intTime": 20090304, 
        "postID": 58, 
        "quote": "Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "reply": " COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:36:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "intTime": 20090304, 
        "postID": 59, 
        "quote": "", 
        "reply": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:37:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold. Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "intTime": 20090304, 
        "postID": 60, 
        "quote": "Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "reply": " Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:39:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "intTime": 20090304, 
        "postID": 61, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Has anyone seen Rove?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:44:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090304, 
        "postID": 62, 
        "quote": "Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "reply": " Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "intTime": 20090304, 
        "postID": 63, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party", 
        "reply": " May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:52:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! He must have a Mini Me.", 
        "intTime": 20090304, 
        "postID": 64, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend!", 
        "reply": " He must have a Mini Me.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "intTime": 20090304, 
        "postID": 65, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:01:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "intTime": 20090304, 
        "postID": 66, 
        "quote": "Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs.", 
        "reply": " It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "intTime": 20090304, 
        "postID": 67, 
        "quote": "EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO?", 
        "reply": " I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "intTime": 20090304, 
        "postID": 68, 
        "quote": "FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda.", 
        "reply": " Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "intTime": 20090304, 
        "postID": 69, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:18:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "intTime": 20090304, 
        "postID": 70, 
        "quote": "Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "reply": " I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:20:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power? Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "intTime": 20090304, 
        "postID": 71, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "reply": " Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:22:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "intTime": 20090304, 
        "postID": 72, 
        "quote": "", 
        "reply": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:34:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "intTime": 20090304, 
        "postID": 73, 
        "quote": "", 
        "reply": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "intTime": 20090304, 
        "postID": 74, 
        "quote": "", 
        "reply": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:45:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "intTime": 20090304, 
        "postID": 75, 
        "quote": "FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:58:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090304, 
        "postID": 76, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:32:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "intTime": 20090304, 
        "postID": 77, 
        "quote": "Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "reply": " The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "intTime": 20090304, 
        "postID": 78, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "reply": " What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:51:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like. Discredit him? No that is not their strategy. Try again.", 
        "intTime": 20090304, 
        "postID": 79, 
        "quote": "Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "reply": " Discredit him? No that is not their strategy. Try again.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:55:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "intTime": 20090304, 
        "postID": 80, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:05:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Oh and here is another one that is not afraid of limbo: quote: A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "intTime": 20090304, 
        "postID": 81, 
        "quote": "A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "reply": "Oh and here is another one that is not afraid of limbo: ", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "intTime": 20090304, 
        "postID": 82, 
        "quote": "In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "reply": " Where was that said?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:09:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said? Go look at the other threads on this topic. Booh!", 
        "intTime": 20090304, 
        "postID": 83, 
        "quote": "Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "reply": " Go look at the other threads on this topic. Booh!", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:12:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "intTime": 20090304, 
        "postID": 84, 
        "quote": "", 
        "reply": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:43:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "intTime": 20090304, 
        "postID": 85, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:47:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Well pretty much all the predictions about obama have so far been on track.", 
        "intTime": 20090304, 
        "postID": 86, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Well pretty much all the predictions about obama have so far been on track.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Who said he can't disagree with the president?", 
        "intTime": 20090304, 
        "postID": 87, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Who said he can't disagree with the president?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:19:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host. COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "intTime": 20090304, 
        "postID": 88, 
        "quote": "Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "reply": " COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:36:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "intTime": 20090304, 
        "postID": 89, 
        "quote": "", 
        "reply": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:37:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold. Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "intTime": 20090304, 
        "postID": 90, 
        "quote": "Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "reply": " Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:39:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "intTime": 20090304, 
        "postID": 91, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Has anyone seen Rove?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:44:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090304, 
        "postID": 92, 
        "quote": "Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove?", 
        "reply": " Yep! He was on a CNN Sunday morning talk show this weekend! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "intTime": 20090304, 
        "postID": 93, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party", 
        "reply": " May work or could be a disaster. Time will tell. It will be the economy that determins the 2010 and 2012 election results.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:52:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend! He must have a Mini Me.", 
        "intTime": 20090304, 
        "postID": 94, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by FrJohn1123: quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Has anyone seen Rove? Yep! He was on a CNN Sunday morning talk show this weekend!", 
        "reply": " He must have a Mini Me.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 05:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House. Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "intTime": 20090304, 
        "postID": 95, 
        "quote": "Top Democrats believe they have struck political gold by depicting Rush Limbaugh as the new face of the Republican Party, a full-scale effort first hatched by some of the most familiar names in politics and now being guided in part from inside the White House.", 
        "reply": " Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. This country is in an economic tailspin, and the Dems and White House place bashing Rush a priority. Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? You Dems are extremely disapointing when it comes to what is in the best interest of this nation.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:01:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "intTime": 20090304, 
        "postID": 96, 
        "quote": "Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs.", 
        "reply": " It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO? I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "intTime": 20090304, 
        "postID": 97, 
        "quote": "EspritDeCorps: Could it be that, attacking people that disagree with their lame idology is ALL THEY KNOW HOW TO DO?", 
        "reply": " I said it before the election. Obama was just going to be more of the same (McSame). Now I can say \"I told you so.\"", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "intTime": 20090304, 
        "postID": 98, 
        "quote": "FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda.", 
        "reply": " Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "intTime": 20090304, 
        "postID": 99, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:18:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "intTime": 20090304, 
        "postID": 100, 
        "quote": "Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda.", 
        "reply": " I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:20:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power? Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "intTime": 20090304, 
        "postID": 101, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by FrJohn1123: quote: Attacking Rush is SO MUCH MORE IMPORTANT, than doing their jobs. It is important when you have people like Rush obstructing the presidents agenda. The people voted Obama in and he has every right and obligation to push his agenda. I had no idea that Rush has more power than the Democrat Congress. Or is that you just FEAR he might have more power?", 
        "reply": " Who has said he has more power than Congress? Nonsense. Still he is a leader and here is the latest from the RNC: quote: Republican Party Chairman Michael Steele now says the sparring between himself and conservative radio commentator Rush Limbaugh was a \"sideshow distraction.\" Steele told NBC's \"Today\" that there are disagreements among conservative leaders, but said: \"My job is to try to balance that. I wasn't that effective at it this week.\" In an interview on CNN on Saturday, Steele called Limbaugh's talk show \"incendiary\" and \"ugly.\" Steele apologized on Monday, calling Limbaugh a \"national conservative leader.\" Steele says, \"There's a lot of popcorn going around for folks who are watching this and enjoying it.\" But the party chairman says he's going to concentrate on moving the GOP forward. Popcorn anyone?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:22:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "intTime": 20090304, 
        "postID": 102, 
        "quote": "", 
        "reply": "LOL You Dems are scared to death of Rush. It's FEAR that drives your rant, not common sense. The Dems have a \"real\" challange in front of them, and what do they do? Spend their time attacking a radio talk show host? If this country is ever attacked by a REAL threat, while the Dems are in power, the Dems will fold like a house of cards. You idiots actually FEAR Rush.....this IS A \"GOLD Rush\"....ROFLMAO...", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 06:34:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "intTime": 20090304, 
        "postID": 103, 
        "quote": "", 
        "reply": "Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:11:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "intTime": 20090304, 
        "postID": 104, 
        "quote": "", 
        "reply": "Read the article again. The Dems aren't scared of Rush, he is driving moderate voters right into their hands. The GOP does seem to cower before him though.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:45:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "intTime": 20090304, 
        "postID": 105, 
        "quote": "FrJohn1123: The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Show how Rush is keeping people from spending. Show how Rush is increasing the rate of unemployment. Show how Rush is preventing banks that received bailout money from lending. Rush is not obstructing the economy. Lack of money, confidence, and hope is keeping the economy down. Rush is in tune with the members of his audence that are hurting and plays to them. If any group could be considered obstructing the economy it would be the lib/socialists that syphon off stimulus money for their pet project and to pay back their political supporters.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 08:58:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090304, 
        "postID": 106, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " WTF does Rush think he is? That's Obama's job! Obama is the leader of We The People. Obama has talked down the economy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:32:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "intTime": 20090304, 
        "postID": 107, 
        "quote": "Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing.", 
        "reply": " The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:48:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "intTime": 20090304, 
        "postID": 108, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing.", 
        "reply": " What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:51:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like. Discredit him? No that is not their strategy. Try again.", 
        "intTime": 20090304, 
        "postID": 109, 
        "quote": "Originally posted by transport1: quote: Originally posted by FrJohn1123: quote: Originally posted by transport1: Do these idiots really think that Rush is going to run for president in the 2012 election, is that why they are so afraid of him. People like frjohn really get me to laughing - they don't realize what a paper tiger they are chasing. The only one I see running scared is Steele who is the head of the RNC. I think the whole thing is pretty amusing. What was Bugs Bunny's favorite line? I think it was \"What a Maroon.\" If the Dems weren't scared of him, it wouldn't be Obama, Immanuel, and other top azzhats that were operating \"Operation Gold Rush\" to try to discredit him. Proving, once again, what a loser looks like.", 
        "reply": " Discredit him? No that is not their strategy. Try again.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 09:55:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "intTime": 20090304, 
        "postID": 110, 
        "quote": "Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience.", 
        "reply": " LMAO Rush obstructing Obama Good gawd what an ate up statement! Poor little Obama is being obstructed by some fat fk on the radio. Just 11% of Republicans Say Limbaugh Is Their Party’s Leader 'http://www.rasmussenreports.com/public_content/politics/general_politics/just_11_of_republicans_say_limbaugh_is_their_party_s_leader' Despite efforts by the Obama political team and its surrogates to link Rush Limbaugh to the Republican Party, just 11% of GOP voters say the conservative radio commentator is the party’s leader. Eighty-one percent (81%) of Republican voters disagree and 8% are undecided in a new Rasmussen Reports national telephone survey. Democrats, however, are closely divided-- 44% say Limbaugh is the Republican leader and 41% don’t believe it. Among voters not affiliated with either of the major national parties, 27% say Limbaugh is the Republicans’ leader, while 58% say he is not and 15% are undecided. Rasmussen Reports is testing public reaction to a series of quotes made by newsmakers recently. For this topic, respondents were asked if they agreed or disagreed with the statement, “Rush Limbaugh is the leader of the Republican Party. He says jump, and they say how high.” That statement came from Brad Woodhouse, president of the liberal advocacy group Americans United for Change. His group is co-sponsoring national television ads with the American Federation of State, County and Municipal Employees that link Limbaugh to the GOP. Woodhouse was not identified in the survey. Overall, only 29% of the nation’s voters agree with Woodhouse’s statement. Fifty-nine percent (59%) disagree, and 13% are not sure. Results from other newsmaker quotes will be released in the coming days. (Want a free daily e-mail update? Sign up now. If it's in the news, it's in our polls.) Rasmussen Reports updates also available on Twitter. While Limbaugh is arguably the most high-profile conservative commentator in the country, even 76% of self-designated conservatives do not see him as the Republican leader. Fifty-two percent (52%) of moderates share that view, but the plurality of liberals (45%) do see Limbaugh as calling the shots for the GOP. White House Chief of Staff Rahm Emanuel on CBS’ “Face The Nation” on Sunday dubbed Limbaugh \"the voice and the intellectual force and energy behind the Republican Party.\" The next day, White House press secretary Robert Gibbs described the popular radio commentator as \"a national spokesperson for conservative views and many in the Republican Party.\" Even President Obama himself got in the act when in January he urged Republican leaders in a private meeting to quit listening to Limbaugh. In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:05:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Oh and here is another one that is not afraid of limbo: quote: A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "intTime": 20090304, 
        "postID": 111, 
        "quote": "A spokesman for Florida Rep. Alan Grayson, Todd Jurkowski, confirms a Grayson quote floating around on some blogs: I’m sorry Limbaugh called for harsh sentences for drug addicts while he was a drug addict. I’m also sorry that he’s bent on seeing America fail. And I’m sorry that Limbaugh is one sorry excuse for a human being. Grayson, who had previously called Limbaugh a \"has-been hypocrite loser,\" seems to have done himself one better.", 
        "reply": "Oh and here is another one that is not afraid of limbo: ", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:06:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "intTime": 20090304, 
        "postID": 112, 
        "quote": "In earlier posts these people were saying the WH has no hand in this and now they're gloating in it.", 
        "reply": " Where was that said?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:09:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said? Go look at the other threads on this topic. Booh!", 
        "intTime": 20090304, 
        "postID": 113, 
        "quote": "Originally posted by FrJohn1123: quote: In earlier posts these people were saying the WH has no hand in this and now they're gloating in it. Where was that said?", 
        "reply": " Go look at the other threads on this topic. Booh!", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:12:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "intTime": 20090304, 
        "postID": 114, 
        "quote": "", 
        "reply": "I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:43:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "intTime": 20090304, 
        "postID": 115, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that.", 
        "reply": " Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:47:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Well pretty much all the predictions about obama have so far been on track.", 
        "intTime": 20090304, 
        "postID": 116, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Well pretty much all the predictions about obama have so far been on track.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 10:56:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn? Who said he can't disagree with the president?", 
        "intTime": 20090304, 
        "postID": 117, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by FrJohn1123: quote: Originally posted by bill_kananen: quote: FrJohn1123: It is important when you have people like Rush obstructing the presidents agenda. Another lib/socialist phony fact. Rush has no authority or office from which he can obstruct the President's agenda. If the President's agenda is not popular with the American citizens in Rush's audience the cause is President's lack or leadership and experience. The market is made up of people, Rush is a leader of people, he is talking down the economy, so he is obstructing. Sorry you don't understand that. Yeah!! How dare a citizen disagree with the President!! We need to repeal that pesky First Amendment thing so that King Prez Barry can do whatever the hell he wants to, completely unopposed! That's what our Republic was founded on, right, FrJohn?", 
        "reply": " Who said he can't disagree with the president?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:19:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host. COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "intTime": 20090304, 
        "postID": 118, 
        "quote": "Originally posted by 67NOV: I'm glad to see that the economy is running smoothly, the VA has no more problems, our troops are home from Iraq & A-stan, Israel & Hammas are buddies, our infrastructure is vastly improved, the border is secured & the illegal alien problem has been taken care of, global warming is a thing of the past, ect., ect. That means Dems have nothing else to do & are free to deal with a radio show host.", 
        "reply": " COMMENT: I suppose in the same manner that White House senior staffers in the Bush administration had to attack the integrity of an intelligence officer because her husband would not abide with the false claims of trying to acquire yellowcake from Niger for a non-existent Iraqi nuclear program, all in the midst of an invasion into Iraq and a concurrent combat campaign in Afghanistan. Save your indignation for bipartisan blame.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:36:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "intTime": 20090304, 
        "postID": 119, 
        "quote": "", 
        "reply": "And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:37:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold. Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "intTime": 20090304, 
        "postID": 120, 
        "quote": "Originally posted by peter3_1: And Rush gets MILLIONS in free advertizing and MILLIONS of new listeners. \"Strikes gold\"?, more like FeS2, Fool's Gold.", 
        "reply": " Yes isn't capitalism great? Wonder if it will help the republican party?", 
        "threadID": "409192893_9110078612001", 
        "time": "2009-03-04 12:39:00", 
        "title": "Gold Rush: Dems launch Operation Rushbo", 
        "userID": "FrJohn1123"
    }
]