[
    {
        "content": "Within the next several weeks the US will drop its Triple-A credit rating…! Obama and his socialist cronies have repeatedly been WARNED. The UK was warned – NOW they got it – TOO LATE! This will be the beginning of new depression era. Obama is already borrowing 150-BILLION dollars per month to pay the loans back ALREADY – ALREADY… EVERY MONTH… 150-BILLION DOLLARS and that is only trying to pay the interest payments! So while everyone is focused on what Nancy did not know what she knew – and others just want to hang Cheney & Bush – YOUR GOVERNMENT – CONGRESS passed the LARGEST SPENDING BILL in the HISTORY of the WORLD! And DID IT without even READING IT! The 1.2 Trillion dollars estimated has now been “readjusted” to 1.84-tillion dollars – I guess someone made an error… Which reminds me – has anyone found that 9-Trillion dollars the misplaced…? No, thought so… So, typical of socialism ideology – TAX MAN – YEA – YEA – HERE COMES THE TAX MAN… Snack tax, fat people tax, soda tax, smokers tax, HUGE fuel tax, HUGE HUGE energy tax, driving - *mileage tax, luxury tax, health benefit tax, ultra high property tax, Treasury Dept in Charge of Internet Gambling – gambling tax, and let’s not forget the ole DEATH tax… And just think – that doesn’t even include the higher income taxes – ssc taxes – and all that just because they signed a bill they did not even read… Dumb & Dumber welcome to socialism… The mileage tax is especially interesting – it is THE PREMO of SOCIALIST schemes – the discussion is to required vehicles to have GPS devices to the FED can TAX YOUR MILEAGE. Hey, those commies Russians never had anything like these socialists thieves have dreamed up… Oh, and it is designed to charge you MORE during peak hours – I guess that’s their way of giving us a discount…? They have been warned by economists from Harvard, Yale, Oxford, Princeton, and countless others including from Europe. They are move WAY TOO MUCH TOO FAST… 52-leading economists signed a letter telling the president to back off (my words) or we will collapse. The actual deficit projected in real-world economics is OVER 56-TRILLION DOLLARS. WORSE – that NOTE is DUE in 5-years! In 5-Years we cannot even PAY the interest payments – it would consume more than 50% of the ENTIRE amount the US earns! This dwarfs Medicare & Social Security COMBINED! California is bankrupt an owes out 10-15 Billion dollars – compare that to 56-TRILLION. These economists have warned Obama we will enter into the hyper-inflation zone of the Peso-Dollar and there is NO fast track out. Once we turn that faucet on – there is no turning it off. Oh yeah – so, no new taxes for anyone earning LESS than 250k. What did Obama think that no one earning under 250k per yr – ate snacks, drank sodas, drove vehicles, or anything – or was he thinking of the future when we could NO LONGER AFFORD TO DO THOSE THINGS after he TAXED US TO DEATH! I hope they more flavors than potato soup…", 
        "intTime": 20090522, 
        "postID": 1, 
        "quote": "", 
        "reply": "Within the next several weeks the US will drop its Triple-A credit rating…! Obama and his socialist cronies have repeatedly been WARNED. The UK was warned – NOW they got it – TOO LATE! This will be the beginning of new depression era. Obama is already borrowing 150-BILLION dollars per month to pay the loans back ALREADY – ALREADY… EVERY MONTH… 150-BILLION DOLLARS and that is only trying to pay the interest payments! So while everyone is focused on what Nancy did not know what she knew – and others just want to hang Cheney & Bush – YOUR GOVERNMENT – CONGRESS passed the LARGEST SPENDING BILL in the HISTORY of the WORLD! And DID IT without even READING IT! The 1.2 Trillion dollars estimated has now been “readjusted” to 1.84-tillion dollars – I guess someone made an error… Which reminds me – has anyone found that 9-Trillion dollars the misplaced…? No, thought so… So, typical of socialism ideology – TAX MAN – YEA – YEA – HERE COMES THE TAX MAN… Snack tax, fat people tax, soda tax, smokers tax, HUGE fuel tax, HUGE HUGE energy tax, driving - *mileage tax, luxury tax, health benefit tax, ultra high property tax, Treasury Dept in Charge of Internet Gambling – gambling tax, and let’s not forget the ole DEATH tax… And just think – that doesn’t even include the higher income taxes – ssc taxes – and all that just because they signed a bill they did not even read… Dumb & Dumber welcome to socialism… The mileage tax is especially interesting – it is THE PREMO of SOCIALIST schemes – the discussion is to required vehicles to have GPS devices to the FED can TAX YOUR MILEAGE. Hey, those commies Russians never had anything like these socialists thieves have dreamed up… Oh, and it is designed to charge you MORE during peak hours – I guess that’s their way of giving us a discount…? They have been warned by economists from Harvard, Yale, Oxford, Princeton, and countless others including from Europe. They are move WAY TOO MUCH TOO FAST… 52-leading economists signed a letter telling the president to back off (my words) or we will collapse. The actual deficit projected in real-world economics is OVER 56-TRILLION DOLLARS. WORSE – that NOTE is DUE in 5-years! In 5-Years we cannot even PAY the interest payments – it would consume more than 50% of the ENTIRE amount the US earns! This dwarfs Medicare & Social Security COMBINED! California is bankrupt an owes out 10-15 Billion dollars – compare that to 56-TRILLION. These economists have warned Obama we will enter into the hyper-inflation zone of the Peso-Dollar and there is NO fast track out. Once we turn that faucet on – there is no turning it off. Oh yeah – so, no new taxes for anyone earning LESS than 250k. What did Obama think that no one earning under 250k per yr – ate snacks, drank sodas, drove vehicles, or anything – or was he thinking of the future when we could NO LONGER AFFORD TO DO THOSE THINGS after he TAXED US TO DEATH! I hope they more flavors than potato soup…", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-22 10:37:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "I don't know if this will take us to a depression, but the lemmings of obamanation economics harp foolishly about their Spendulus. 6% of that gross burden on future Americans has been obligated, and the economy slowly but surely straightens out without much of any Spendulus obligated. It was really just a ploy to funnel wasted taxpayer dollars to cronies and ne'er-do-wells (don't let a good crisis go to waste). What some have said, and I still think is true, is that inflation will almost certainly rear its ugly head in the mid-term, say, 2-6 years ahead and last a while, until we have another recession to wring out the inflationary pressures. Inflation is a terrible, guvmint created tax on citizens, and it harms the poor and middle class worst of all. (Spend excessively and irresponsibly now, and the extra, cheap dollars chase goods, causing them to increase in number of dollars required to purchase them; effect the same as being taxed excessively, if you cannot promptly adjust your income to match the increase in number of dollars required for purchases.) Anybody who cannot adjust his or her income quickly to match the inflation gets screwed. Savings are degraded. Economic dislocations ensue. But be mindful that helping Americans is NOT the Neighborhood Organizer in Chief's objective. His handlers and he desire turmoil and troubles for Americans; that impacts Americans since so many have sold their souls to collectivism, handouts, and nanny-statism. Turmoil enables obamanites to consolidate their power and control over people.", 
        "intTime": 20090523, 
        "postID": 2, 
        "quote": "", 
        "reply": "I don't know if this will take us to a depression, but the lemmings of obamanation economics harp foolishly about their Spendulus. 6% of that gross burden on future Americans has been obligated, and the economy slowly but surely straightens out without much of any Spendulus obligated. It was really just a ploy to funnel wasted taxpayer dollars to cronies and ne'er-do-wells (don't let a good crisis go to waste). What some have said, and I still think is true, is that inflation will almost certainly rear its ugly head in the mid-term, say, 2-6 years ahead and last a while, until we have another recession to wring out the inflationary pressures. Inflation is a terrible, guvmint created tax on citizens, and it harms the poor and middle class worst of all. (Spend excessively and irresponsibly now, and the extra, cheap dollars chase goods, causing them to increase in number of dollars required to purchase them; effect the same as being taxed excessively, if you cannot promptly adjust your income to match the increase in number of dollars required for purchases.) Anybody who cannot adjust his or her income quickly to match the inflation gets screwed. Savings are degraded. Economic dislocations ensue. But be mindful that helping Americans is NOT the Neighborhood Organizer in Chief's objective. His handlers and he desire turmoil and troubles for Americans; that impacts Americans since so many have sold their souls to collectivism, handouts, and nanny-statism. Turmoil enables obamanites to consolidate their power and control over people.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-23 11:47:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: I don't know if this will take us to a depression, but the lemmings of obamanation economics harp foolishly about their Spendulus. 6% of that gross burden on future Americans has been obligated, and the economy slowly but surely straightens out without much of any Spendulus obligated. It was really just a ploy to funnel wasted taxpayer dollars to cronies and ne'er-do-wells (don't let a good crisis go to waste). What some have said, and I still think is true, is that inflation will almost certainly rear its ugly head in the mid-term, say, 2-6 years ahead and last a while, until we have another recession to wring out the inflationary pressures. Inflation is a terrible, guvmint created tax on citizens, and it harms the poor and middle class worst of all. (Spend excessively and irresponsibly now, and the extra, cheap dollars chase goods, causing them to increase in number of dollars required to purchase them; effect the same as being taxed excessively, if you cannot promptly adjust your income to match the increase in number of dollars required for purchases.) Anybody who cannot adjust his or her income quickly to match the inflation gets screwed. Savings are degraded. Economic dislocations ensue. But be mindful that helping Americans is NOT the Neighborhood Organizer in Chief's objective. His handlers and he desire turmoil and troubles for Americans; that impacts Americans since so many have sold their souls to collectivism, handouts, and nanny-statism. Turmoil enables obamanites to consolidate their power and control over people. I agree … I believe they have grossly miscalculated this time-around with that of the 80s and even 90s. I don’t know of any Bill Gates types hanging the brim ready to pop out with a new industry. Had it not been for the technology cycle we would have been hurting. Whenever I hear about how well Clinton did with the deficit – I just cringe. Not because it was Clinton but because “he” really didn’t do it. It just so happened that EVERYBODY was making money – huge sums of money. We have NOTHING that I know of like that. The absurdity is we have yet to financially recover from all of the major catastrophes Bush had to deal with. Clinton had to deal with hurricane Andrew – bombing of the World Trade Center basement – Cole… Bush had 9/11, Katrina, three wars, and 4-more category 4-5 hurricanes. I think folks forgot about New Orleans was practically TOTALLY out of commission for over a year. That alone displaced over 400-thousand jobs. All of those situations cost us an enormous amount of money. I believe we are about to lose our triple A rating. Even if Obama can pressure them to make it only temporary – that is going blow the bottom out. Businesses have yet to feel the tax increases he’s imposed and reduced the write-offs. I also don’t believe businesses are going to trust this gov. They will begin pulling out as has already started happening. It is impossible for decent business to operate in this country under Obama’s full blown plans. They were expecting unemployment to drop several points by now. This is summer – everything should up and running but it isn’t. I also wouldn’t doubt that those who were working for Chrysler & GM who were laid off and/or while it was shut down – I doubt any of those numbers are incorporated into the numbers we’re hearing. China & Chavez are trying to push for a new global currency. Sadly, there isn’t a damn democrat in congress or the administration who has ever actually OWNED a real business. All they know is textbook bs and that is a recipe for bankruptcy. I don’t see this taking too long. The 6-million people unemployed now will have their benefits cutoff right around Christmas. Thus far everything I’ve been reading on the 2010-2011 budgets for businesses – it is NOT good. They’ve already written off this year and 2010. Obama better pay attention because that means NO JOBS will be coming until these companies can catch their breath and get their cash-flow leveled out. The problem is – that’s exactly when his taxes start kicking in AND Bush’s expire – plus the additional write-offs disappear – charitable donations – and even residential mortgage interest is no longer tax deductable. The new snack tax, soda tax will go into affect then the TWO REAL BIGGIES – Fuel tax 1.50 per gallon above what the fed is taking already – the next whopper is the freaking energy tax. They keep saying it double most people’s electric bills. Well, if doubles the residential electric bill – what do you think that will do to commercial rates – 2.5 times… Then remember what he’s pushing in Detroit – ELECTRIC CARS! Image that – rape the country for taxes on energy and fuel and FORCE US TO BUY THOSE vehicles. What they conveniently don’t tell us is that Europe can get away with electric cars and whatnot because countries like France get 70% of the energy from nuclear plants. We are in for seriously BAD times…", 
        "intTime": 20090523, 
        "postID": 3, 
        "quote": "Originally posted by RRR52: I don't know if this will take us to a depression, but the lemmings of obamanation economics harp foolishly about their Spendulus. 6% of that gross burden on future Americans has been obligated, and the economy slowly but surely straightens out without much of any Spendulus obligated. It was really just a ploy to funnel wasted taxpayer dollars to cronies and ne'er-do-wells (don't let a good crisis go to waste). What some have said, and I still think is true, is that inflation will almost certainly rear its ugly head in the mid-term, say, 2-6 years ahead and last a while, until we have another recession to wring out the inflationary pressures. Inflation is a terrible, guvmint created tax on citizens, and it harms the poor and middle class worst of all. (Spend excessively and irresponsibly now, and the extra, cheap dollars chase goods, causing them to increase in number of dollars required to purchase them; effect the same as being taxed excessively, if you cannot promptly adjust your income to match the increase in number of dollars required for purchases.) Anybody who cannot adjust his or her income quickly to match the inflation gets screwed. Savings are degraded. Economic dislocations ensue. But be mindful that helping Americans is NOT the Neighborhood Organizer in Chief's objective. His handlers and he desire turmoil and troubles for Americans; that impacts Americans since so many have sold their souls to collectivism, handouts, and nanny-statism. Turmoil enables obamanites to consolidate their power and control over people.", 
        "reply": " I agree … I believe they have grossly miscalculated this time-around with that of the 80s and even 90s. I don’t know of any Bill Gates types hanging the brim ready to pop out with a new industry. Had it not been for the technology cycle we would have been hurting. Whenever I hear about how well Clinton did with the deficit – I just cringe. Not because it was Clinton but because “he” really didn’t do it. It just so happened that EVERYBODY was making money – huge sums of money. We have NOTHING that I know of like that. The absurdity is we have yet to financially recover from all of the major catastrophes Bush had to deal with. Clinton had to deal with hurricane Andrew – bombing of the World Trade Center basement – Cole… Bush had 9/11, Katrina, three wars, and 4-more category 4-5 hurricanes. I think folks forgot about New Orleans was practically TOTALLY out of commission for over a year. That alone displaced over 400-thousand jobs. All of those situations cost us an enormous amount of money. I believe we are about to lose our triple A rating. Even if Obama can pressure them to make it only temporary – that is going blow the bottom out. Businesses have yet to feel the tax increases he’s imposed and reduced the write-offs. I also don’t believe businesses are going to trust this gov. They will begin pulling out as has already started happening. It is impossible for decent business to operate in this country under Obama’s full blown plans. They were expecting unemployment to drop several points by now. This is summer – everything should up and running but it isn’t. I also wouldn’t doubt that those who were working for Chrysler & GM who were laid off and/or while it was shut down – I doubt any of those numbers are incorporated into the numbers we’re hearing. China & Chavez are trying to push for a new global currency. Sadly, there isn’t a damn democrat in congress or the administration who has ever actually OWNED a real business. All they know is textbook bs and that is a recipe for bankruptcy. I don’t see this taking too long. The 6-million people unemployed now will have their benefits cutoff right around Christmas. Thus far everything I’ve been reading on the 2010-2011 budgets for businesses – it is NOT good. They’ve already written off this year and 2010. Obama better pay attention because that means NO JOBS will be coming until these companies can catch their breath and get their cash-flow leveled out. The problem is – that’s exactly when his taxes start kicking in AND Bush’s expire – plus the additional write-offs disappear – charitable donations – and even residential mortgage interest is no longer tax deductable. The new snack tax, soda tax will go into affect then the TWO REAL BIGGIES – Fuel tax 1.50 per gallon above what the fed is taking already – the next whopper is the freaking energy tax. They keep saying it double most people’s electric bills. Well, if doubles the residential electric bill – what do you think that will do to commercial rates – 2.5 times… Then remember what he’s pushing in Detroit – ELECTRIC CARS! Image that – rape the country for taxes on energy and fuel and FORCE US TO BUY THOSE vehicles. What they conveniently don’t tell us is that Europe can get away with electric cars and whatnot because countries like France get 70% of the energy from nuclear plants. We are in for seriously BAD times…", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-23 18:01:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "As an after thought France sends most of its nuclear waste here to the US.", 
        "intTime": 20090523, 
        "postID": 4, 
        "quote": "", 
        "reply": "As an after thought France sends most of its nuclear waste here to the US.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-23 23:19:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is no where to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in.", 
        "intTime": 20090524, 
        "postID": 5, 
        "quote": "", 
        "reply": "Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is no where to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 07:29:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is nowhere to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in. Hey, I hope YOU are right... but I don't think so... The UK thought they were safe too! Watch what happens in the next few weeks. They have warned Obama – if he presses his socialist health care – THEY WILL BUST OUR CREDIT RATING. We are borrowing 150-Billion dollars per month because we can’t PAY our debts now… As for the richest nation - appearances can be deceiving – the mortgaging situation was SERIOUS warning – a shot across the bow per se - Detroit was merely a minor glitch exposing our “weakness.” If China was a bit more independent they would have called our notes in and the US would be BANKRUPT. There would not be a damn thing we could do about it. Bankrupt! I don’t want to sound redundant but we are borrowing 150-billion dollars to PAY our debts… Do you realize what that actually means…? It is akin to using your credit card to pay your mortgage because you were laid off. That’s what Obama is doing and that is NOT your typical MORTGAGE PAYMENT. It is impossible to pay. That means he must call down to the basement and roll the presses. That means INFLATION. Some of the TOP economists in the WORLD – Harvard, Princeton, Yale, several in Europe, ALL have said DO NOT GO INTO MORE DEBT and this was BEFORE his 1.3 trillion dollar gambling spree. He is rolling the dice that if the FED injects the funds it will stimulate the economy. NO – WRONG THINKING – the economy does NOT simply jump back into the groove because the FED spends money – that money MUST be given to those who CREATE JOBS and EARN their money. The FED does NOT “earn” its money – it TAKES it from THOSE who earn it. If those who earn it do NOT have it, the FED dries up. THAT is what is happening. That is why unemployment continues to rise. Obama was counting on unemployment to drop back to 5.5 to 6 by now. We are approaching summer – this country traditionally starts ROLLING in the bucks by now – the SURGE starts showing – but instead unemployment is over 10% and rising FAST… That means none of those people are now paying anything – NO TAXES and are DRAWING money from the system. I hope I am wrong – but I don’t think so… We are in for some DEEP – DEEP hard times… He screwed up and screwed BIG and there is no turning it around now.", 
        "intTime": 20090524, 
        "postID": 6, 
        "quote": "Originally posted by DMarkUhler: Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is nowhere to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in.", 
        "reply": " Hey, I hope YOU are right... but I don't think so... The UK thought they were safe too! Watch what happens in the next few weeks. They have warned Obama – if he presses his socialist health care – THEY WILL BUST OUR CREDIT RATING. We are borrowing 150-Billion dollars per month because we can’t PAY our debts now… As for the richest nation - appearances can be deceiving – the mortgaging situation was SERIOUS warning – a shot across the bow per se - Detroit was merely a minor glitch exposing our “weakness.” If China was a bit more independent they would have called our notes in and the US would be BANKRUPT. There would not be a damn thing we could do about it. Bankrupt! I don’t want to sound redundant but we are borrowing 150-billion dollars to PAY our debts… Do you realize what that actually means…? It is akin to using your credit card to pay your mortgage because you were laid off. That’s what Obama is doing and that is NOT your typical MORTGAGE PAYMENT. It is impossible to pay. That means he must call down to the basement and roll the presses. That means INFLATION. Some of the TOP economists in the WORLD – Harvard, Princeton, Yale, several in Europe, ALL have said DO NOT GO INTO MORE DEBT and this was BEFORE his 1.3 trillion dollar gambling spree. He is rolling the dice that if the FED injects the funds it will stimulate the economy. NO – WRONG THINKING – the economy does NOT simply jump back into the groove because the FED spends money – that money MUST be given to those who CREATE JOBS and EARN their money. The FED does NOT “earn” its money – it TAKES it from THOSE who earn it. If those who earn it do NOT have it, the FED dries up. THAT is what is happening. That is why unemployment continues to rise. Obama was counting on unemployment to drop back to 5.5 to 6 by now. We are approaching summer – this country traditionally starts ROLLING in the bucks by now – the SURGE starts showing – but instead unemployment is over 10% and rising FAST… That means none of those people are now paying anything – NO TAXES and are DRAWING money from the system. I hope I am wrong – but I don’t think so… We are in for some DEEP – DEEP hard times… He screwed up and screwed BIG and there is no turning it around now.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 09:26:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: As an after thought France sends most of its nuclear waste here to the US. man, ya know, I don't doubt that one bit... then our people complain we build new nuclear plants because they create too much waste... Man, when I was a kid, my mother would slap the hell out of me if I acted that damn dumb... Maybe we need to send our mom's to DC and slap some common sense into the boneheads...", 
        "intTime": 20090524, 
        "postID": 7, 
        "quote": "Originally posted by dragonflyer04: As an after thought France sends most of its nuclear waste here to the US.", 
        "reply": " man, ya know, I don't doubt that one bit... then our people complain we build new nuclear plants because they create too much waste... Man, when I was a kid, my mother would slap the hell out of me if I acted that damn dumb... Maybe we need to send our mom's to DC and slap some common sense into the boneheads...", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 09:36:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Just as a matter of interest, can you please show me the link that says that US will loose its AAA rating? Sounds a bit scary, to tell you the truth.", 
        "intTime": 20090524, 
        "postID": 8, 
        "quote": "", 
        "reply": "Just as a matter of interest, can you please show me the link that says that US will loose its AAA rating? Sounds a bit scary, to tell you the truth.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 10:35:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "The USA Triple A rating is more or less 'old news'. It was on the DrudgeReport. But here is something else to ponder \"http://www.lucianne.com/thread/?artnum=471985\" {British Banks Revolt Against Obama Tax Plan} \"The decision, which would make it hard for Americans in London to open bank accounts and trade shares, is being discussed by executives at Britain's banks and brokers who say it could become too expensive to service American clients. The proposals, which were unveiled as part of the president's first budget, are designed to clamp-down on American tax evaders abroad.\" Our own government won't \"revolt\" against Obama's outrageous tax plans, so somebody had to. Good for the Brits. Maybe their refusals to deal with us will open a few blinded Congressional eyes.", 
        "intTime": 20090524, 
        "postID": 9, 
        "quote": "", 
        "reply": "The USA Triple A rating is more or less 'old news'. It was on the DrudgeReport. But here is something else to ponder \"http://www.lucianne.com/thread/?artnum=471985\" {British Banks Revolt Against Obama Tax Plan} \"The decision, which would make it hard for Americans in London to open bank accounts and trade shares, is being discussed by executives at Britain's banks and brokers who say it could become too expensive to service American clients. The proposals, which were unveiled as part of the president's first budget, are designed to clamp-down on American tax evaders abroad.\" Our own government won't \"revolt\" against Obama's outrageous tax plans, so somebody had to. Good for the Brits. Maybe their refusals to deal with us will open a few blinded Congressional eyes.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 10:56:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is no where to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in. Greenspan made money easy to borrow; too easy. It contributed substantially to the problems of excessive we have now. That is not the policy of someone overly concerned about inflation. It was seldom a \"tight money\" policy. In 2001, there were about 500 billion dollars in circulation. Recently, BEFORE the SPENDULUS and the other big jump in budget deficit (bogus rationale: Bush caused so much trouble by spending, so let's spend even more to remedy the situation--frickin' fools), there were 1.7 trillion dollars in circulation. More than a three-fold increase in 7-8 years. Did the economy grow that much? No. Where are the dollars? What will happen to prices of goods when the big increase in dollars chases the same general level of produced goods? There is no doom and gloom. There is rational analysis of economic behavior. Inflation in the mid-term to long-term is likely. Of course, the extra dollars,to the degree they are here in the US, could be taxed away from those who EARN them. But that destroys the economy, too. Ultimately, excessive intrusion into the economy by the government--sudenly changing this, quickly favoring that for political purposes well beyond economic justification--creates turmoil, even greater difficulty to forecast where the best application of economic resources should be. Inefficiencies result, and this contributes to even worse economic problems. And it is far more than one man discussing the credit rating. The Chinese, one of the largest if not the largest lender, have openly communicated their caution in buying much more debt. This is not political extremism or unfounded concern. Let's hope it does not happen. But the die has been cast and it may be too late to significantly change the credit rating during the next few years. And, as always, despite the foolish rationalizations such as we heard from Hillary and Obama, the immense burdens of Social Insecurity and Medicare are coming our way in the long-term with far greater impact than we have heretofore seen. Inflation helps the government meet the debt requirements already incurred for benefits by paying the required number of dollars with cheaper dollars. There are substantial forces at work that tend to result in or would benefit greatly by inflated dollars. It is wise to look at places to keep one's money, even for those of us without large sums, that are less affected by inflation.", 
        "intTime": 20090524, 
        "postID": 10, 
        "quote": "Originally posted by DMarkUhler: Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is no where to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in.", 
        "reply": " Greenspan made money easy to borrow; too easy. It contributed substantially to the problems of excessive we have now. That is not the policy of someone overly concerned about inflation. It was seldom a \"tight money\" policy. In 2001, there were about 500 billion dollars in circulation. Recently, BEFORE the SPENDULUS and the other big jump in budget deficit (bogus rationale: Bush caused so much trouble by spending, so let's spend even more to remedy the situation--frickin' fools), there were 1.7 trillion dollars in circulation. More than a three-fold increase in 7-8 years. Did the economy grow that much? No. Where are the dollars? What will happen to prices of goods when the big increase in dollars chases the same general level of produced goods? There is no doom and gloom. There is rational analysis of economic behavior. Inflation in the mid-term to long-term is likely. Of course, the extra dollars,to the degree they are here in the US, could be taxed away from those who EARN them. But that destroys the economy, too. Ultimately, excessive intrusion into the economy by the government--sudenly changing this, quickly favoring that for political purposes well beyond economic justification--creates turmoil, even greater difficulty to forecast where the best application of economic resources should be. Inefficiencies result, and this contributes to even worse economic problems. And it is far more than one man discussing the credit rating. The Chinese, one of the largest if not the largest lender, have openly communicated their caution in buying much more debt. This is not political extremism or unfounded concern. Let's hope it does not happen. But the die has been cast and it may be too late to significantly change the credit rating during the next few years. And, as always, despite the foolish rationalizations such as we heard from Hillary and Obama, the immense burdens of Social Insecurity and Medicare are coming our way in the long-term with far greater impact than we have heretofore seen. Inflation helps the government meet the debt requirements already incurred for benefits by paying the required number of dollars with cheaper dollars. There are substantial forces at work that tend to result in or would benefit greatly by inflated dollars. It is wise to look at places to keep one's money, even for those of us without large sums, that are less affected by inflation.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 15:58:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Just as a matter of interest, can you please show me the link that says that US will loose its AAA rating? Sounds a bit scary, to tell you the truth. Honestly, I'd say Google it - that way you'll get to read quite-a-few articles on it. I've reading about our triple A rating being at risk for quite a while. At the time those guys were written-off as alarmists. Now they aren't being written off anymore. Google 56-Trillion dollar debt once... That article is excellent. The guy is NOT bashing Obama - he is a professor from Harvard (I think) and he lays it out in \"real\" dollars & cents. I've ready 5-6 very good articles coming from different points of view - BUT they ALL have one thing in common - ALL repeatedly warn that once we go down this road - there is NO U-TURNS. What they mean is - no matter WHAT the fed does - NO MATTER WHAT - inflation begin unraveling the entire thing. Something like 52 or 72 economists signed a letter warning Prez Obama we will impload. I believe the 56-Trillion dollar article has all of the guys charts & graphs showing why. Honestly, it was 10-pay grades over my head but I do know the common unavoidable problem we run into is hyper-inflation. Some of these articles are talking about the Peso-Dollar. They aren’t blowing smoke – they are concerned. I keep coming across other information that is radically different – for the reasoning behind this economy. I ran across it a lot during the campaign. However, it is downright eerie. It will be surfacing quite-a-bit shortly. I started another thread on it just to throw it out there for folks ponder. Most will dismiss it – but they won’t in future. Google up Obama – Cloward/Piven Strategy of Economic Recovery. If you Google it, don’t just go to the first page and dismiss it… Keep flipping until you come across some decent articles on it. One way I usually check out a “topic” to see if it’s bs or not – is search for the oldest documents – then the most current. Typically, if they are bs – then topic never existed prior to a specific date that’s relative to the current verbiage. If it has age to it – especially if it’s quite a few years and it’s essentially the same subject with different terminology… It’s worth bird-dogging that puppy down further. Usually, you’ll ether find the source and if they radical either-way I’ll usually leave it alone – if not, it’s worth scrounging around more. This puppy has legs – and it isn’t going away… PS - the only reasons I say Google this stuff, is so you can find it and read from other sources. If you have trouble let me know I can give you sources. I just find that it's best sometimes to point folks in a direction so you can read several different views on it. The UK lost their rating. They are not happy and are especially upset that the US didn't lose their credit rating yet... Personally, I believe we'll get busted in the next few weeks. I think they'll have to do it but I bet Obama has bought some time somehow - so they can shift some assets around. That way - they'll lower our credit rating - Obama will tell the world he made some adjustments - and they'll bring it back up. That allows everyone to save face. Sadly, if Obama is following the Cloward-Piven strategy - he'll let the UK and the US tumble into the abbys...", 
        "intTime": 20090524, 
        "postID": 11, 
        "quote": "Originally posted by PanzerMeister: Just as a matter of interest, can you please show me the link that says that US will loose its AAA rating? Sounds a bit scary, to tell you the truth.", 
        "reply": " Honestly, I'd say Google it - that way you'll get to read quite-a-few articles on it. I've reading about our triple A rating being at risk for quite a while. At the time those guys were written-off as alarmists. Now they aren't being written off anymore. Google 56-Trillion dollar debt once... That article is excellent. The guy is NOT bashing Obama - he is a professor from Harvard (I think) and he lays it out in \"real\" dollars & cents. I've ready 5-6 very good articles coming from different points of view - BUT they ALL have one thing in common - ALL repeatedly warn that once we go down this road - there is NO U-TURNS. What they mean is - no matter WHAT the fed does - NO MATTER WHAT - inflation begin unraveling the entire thing. Something like 52 or 72 economists signed a letter warning Prez Obama we will impload. I believe the 56-Trillion dollar article has all of the guys charts & graphs showing why. Honestly, it was 10-pay grades over my head but I do know the common unavoidable problem we run into is hyper-inflation. Some of these articles are talking about the Peso-Dollar. They aren’t blowing smoke – they are concerned. I keep coming across other information that is radically different – for the reasoning behind this economy. I ran across it a lot during the campaign. However, it is downright eerie. It will be surfacing quite-a-bit shortly. I started another thread on it just to throw it out there for folks ponder. Most will dismiss it – but they won’t in future. Google up Obama – Cloward/Piven Strategy of Economic Recovery. If you Google it, don’t just go to the first page and dismiss it… Keep flipping until you come across some decent articles on it. One way I usually check out a “topic” to see if it’s bs or not – is search for the oldest documents – then the most current. Typically, if they are bs – then topic never existed prior to a specific date that’s relative to the current verbiage. If it has age to it – especially if it’s quite a few years and it’s essentially the same subject with different terminology… It’s worth bird-dogging that puppy down further. Usually, you’ll ether find the source and if they radical either-way I’ll usually leave it alone – if not, it’s worth scrounging around more. This puppy has legs – and it isn’t going away… PS - the only reasons I say Google this stuff, is so you can find it and read from other sources. If you have trouble let me know I can give you sources. I just find that it's best sometimes to point folks in a direction so you can read several different views on it. The UK lost their rating. They are not happy and are especially upset that the US didn't lose their credit rating yet... Personally, I believe we'll get busted in the next few weeks. I think they'll have to do it but I bet Obama has bought some time somehow - so they can shift some assets around. That way - they'll lower our credit rating - Obama will tell the world he made some adjustments - and they'll bring it back up. That allows everyone to save face. Sadly, if Obama is following the Cloward-Piven strategy - he'll let the UK and the US tumble into the abbys...", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 18:38:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Credit ratings are not like yours and mine. It would be hard to conceive any nation taking the place as the safest investment in the world. We have never defaulted on our debt, unlike most nations in the world. I assure you that if we default, the rest of the world will be in the terminal.", 
        "intTime": 20090524, 
        "postID": 12, 
        "quote": "", 
        "reply": "Credit ratings are not like yours and mine. It would be hard to conceive any nation taking the place as the safest investment in the world. We have never defaulted on our debt, unlike most nations in the world. I assure you that if we default, the rest of the world will be in the terminal.", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 18:48:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by DMarkUhler: Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is no where to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in. Greenspan made money easy to borrow; too easy. It contributed substantially to the problems of excessive we have now. That is not the policy of someone overly concerned about inflation. It was seldom a \"tight money\" policy. In 2001, there were about 500 billion dollars in circulation. Recently, BEFORE the SPENDULUS and the other big jump in budget deficit (bogus rationale: Bush caused so much trouble by spending, so let's spend even more to remedy the situation--frickin' fools), there were 1.7 trillion dollars in circulation. More than a three-fold increase in 7-8 years. Did the economy grow that much? No. Where are the dollars? What will happen to prices of goods when the big increase in dollars chases the same general level of produced goods? There is no doom and gloom. There is rational analysis of economic behavior. Inflation in the mid-term to long-term is likely. Of course, the extra dollars,to the degree they are here in the US, could be taxed away from those who EARN them. But that destroys the economy, too. Ultimately, excessive intrusion into the economy by the government--sudenly changing this, quickly favoring that for political purposes well beyond economic justification--creates turmoil, even greater difficulty to forecast where the best application of economic resources should be. Inefficiencies result, and this contributes to even worse economic problems. And it is far more than one man discussing the credit rating. The Chinese, one of the largest if not the largest lender, have openly communicated their caution in buying much more debt. This is not political extremism or unfounded concern. Let's hope it does not happen. But the die has been cast and it may be too late to significantly change the credit rating during the next few years. And, as always, despite the foolish rationalizations such as we heard from Hillary and Obama, the immense burdens of Social Insecurity and Medicare are coming our way in the long-term with far greater impact than we have heretofore seen. Inflation helps the government meet the debt requirements already incurred for benefits by paying the required number of dollars with cheaper dollars. There are substantial forces at work that tend to result in or would benefit greatly by inflated dollars. It is wise to look at places to keep one's money, even for those of us without large sums, that are less affected by inflation. Just a point on something... The SSC and Medi-care issues are concerns because we can't afford them. 70% of those funds are borrowed - which they are NOT supposed to be - but they are... The concern is sustainability... The money Obama borrowed DWARFS those problems COMBINED. Those were HUGE problems however there was 15-20 yrs before it would start slamming us real hard. Google 56-trillion debt once - What we ARE being told is the real numbers. However, the money that Obama just borrowed DWARFS midicare - SSC - Medicade - ALL Combined and here's the part that these economists are concerned about.. Right NOW - Obama is borrowing 150-billion dollars PER MONTH to pay the interest. Here is what so pathetically FOOLISH of these idiots in DC - THE money they just borrowed - which they could NOT afford to pay back BEFORE they borrowed the OTHER TRILLION - THOSE DEBTS MATURE IN 5 freaking YEARS. That's what is so crazy - it isn't uncommon for these debts to roll around for 70-years - but we negotiated a 5 YEAR NOTE. Now consider what the market will look like in 5 yrs. Yep, No matter WHAT we THINK we will DO - CHINA is going to RAISE that interest rate. Do the math on that little puppy one time. China is going to BUST us wide open. AND what's worse - the idiot is still pushing to spend more on the health care. He can't pay the debts now - and he's pushing more debt...? it's crazy!", 
        "intTime": 20090524, 
        "postID": 13, 
        "quote": "Originally posted by RRR52: quote: Originally posted by DMarkUhler: Just a couple points: One; One guy makes a claim (about our credit rating going down) does not make it so. We are a very rich nation, probably the richest in the history of the world, so hold the doom and gloom. Two; inflation is no where to be seen. The last fed Chairman obsessed about that and greatly contributed to the mess we are currently in. Greenspan made money easy to borrow; too easy. It contributed substantially to the problems of excessive we have now. That is not the policy of someone overly concerned about inflation. It was seldom a \"tight money\" policy. In 2001, there were about 500 billion dollars in circulation. Recently, BEFORE the SPENDULUS and the other big jump in budget deficit (bogus rationale: Bush caused so much trouble by spending, so let's spend even more to remedy the situation--frickin' fools), there were 1.7 trillion dollars in circulation. More than a three-fold increase in 7-8 years. Did the economy grow that much? No. Where are the dollars? What will happen to prices of goods when the big increase in dollars chases the same general level of produced goods? There is no doom and gloom. There is rational analysis of economic behavior. Inflation in the mid-term to long-term is likely. Of course, the extra dollars,to the degree they are here in the US, could be taxed away from those who EARN them. But that destroys the economy, too. Ultimately, excessive intrusion into the economy by the government--sudenly changing this, quickly favoring that for political purposes well beyond economic justification--creates turmoil, even greater difficulty to forecast where the best application of economic resources should be. Inefficiencies result, and this contributes to even worse economic problems. And it is far more than one man discussing the credit rating. The Chinese, one of the largest if not the largest lender, have openly communicated their caution in buying much more debt. This is not political extremism or unfounded concern. Let's hope it does not happen. But the die has been cast and it may be too late to significantly change the credit rating during the next few years. And, as always, despite the foolish rationalizations such as we heard from Hillary and Obama, the immense burdens of Social Insecurity and Medicare are coming our way in the long-term with far greater impact than we have heretofore seen. Inflation helps the government meet the debt requirements already incurred for benefits by paying the required number of dollars with cheaper dollars. There are substantial forces at work that tend to result in or would benefit greatly by inflated dollars. It is wise to look at places to keep one's money, even for those of us without large sums, that are less affected by inflation.", 
        "reply": " Just a point on something... The SSC and Medi-care issues are concerns because we can't afford them. 70% of those funds are borrowed - which they are NOT supposed to be - but they are... The concern is sustainability... The money Obama borrowed DWARFS those problems COMBINED. Those were HUGE problems however there was 15-20 yrs before it would start slamming us real hard. Google 56-trillion debt once - What we ARE being told is the real numbers. However, the money that Obama just borrowed DWARFS midicare - SSC - Medicade - ALL Combined and here's the part that these economists are concerned about.. Right NOW - Obama is borrowing 150-billion dollars PER MONTH to pay the interest. Here is what so pathetically FOOLISH of these idiots in DC - THE money they just borrowed - which they could NOT afford to pay back BEFORE they borrowed the OTHER TRILLION - THOSE DEBTS MATURE IN 5 freaking YEARS. That's what is so crazy - it isn't uncommon for these debts to roll around for 70-years - but we negotiated a 5 YEAR NOTE. Now consider what the market will look like in 5 yrs. Yep, No matter WHAT we THINK we will DO - CHINA is going to RAISE that interest rate. Do the math on that little puppy one time. China is going to BUST us wide open. AND what's worse - the idiot is still pushing to spend more on the health care. He can't pay the debts now - and he's pushing more debt...? it's crazy!", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 18:55:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: Credit ratings are not like yours and mine. It would be hard to conceive any nation taking the place as the safest investment in the world. We have never defaulted on our debt, unlike most nations in the world. I assure you that if we default, the rest of the world will be in the terminal. I hear what you're saying... However \"that\" is part of the problem - everyone keeps saying the US has \"never\" faulted on a loan. Well, that's partly because we had the work force to produce the revenue - AND - we had the industries to pay the work force. Right NOW - we have NETHER and what little we do have is pulling out - shutting down - going under...but here's a small snip from on economist... Google the guys name - these are smart people without and ax to grind. THEY ARE SERIOUSLY CONCERNED... \"...If rates rise, it will have harmful effects on not only us but also our foreign creditors. According to noted investment advisor Peter Schiff, in a recent interview, he said we (USA) are financing an increasing amount of our debt with short term bonds instead of locking in long term rates. If rates spike our interest payments will spike. To put this in the worst possible light, 22% of our tax revenue goes to debt interest - if rates on the debt doubled (because the short term bonds will mature soon and new ones will be sold to pay back the old - basically government “refinancing”), assuming we didn’t add or subtract any debt, our interest payments would be 44% of tax revenue!!!!! In Bush's worst time the deficit consumed 8% and it was making everyone extremely nervous... Last I heard Obama was pegging 13% and climbing. We haven't even begun to tap the inflation buttons yet. Those will start triggering right around Christmas and after that - things will start getting worse. Unemployment is tapping 10% - It will hit 15-18 before the year is out. The jobs Obama is creating are NOT the jobs being lost and what little they do create will not even begin to raise the revenue he will need to pay the debt. He is running everything bassawkards... The debt payments will be higher and climbing every month because he is borrowing more to pay each payment - THEN at the same time less & less people are working so the revenues are steadily dropping. His reaction is to RAISE taxes but that will NOT help. In 5yrs the DEBT payment alone will consume 50% of ALL the money the fed brings in - 50% of ALL - they were screaming at 8% - Obama is already tapping 13% - and we cannot pay it now. What is he going to do other than crank up the printing presses..?", 
        "intTime": 20090524, 
        "postID": 14, 
        "quote": "Originally posted by DMarkUhler: Credit ratings are not like yours and mine. It would be hard to conceive any nation taking the place as the safest investment in the world. We have never defaulted on our debt, unlike most nations in the world. I assure you that if we default, the rest of the world will be in the terminal.", 
        "reply": " I hear what you're saying... However \"that\" is part of the problem - everyone keeps saying the US has \"never\" faulted on a loan. Well, that's partly because we had the work force to produce the revenue - AND - we had the industries to pay the work force. Right NOW - we have NETHER and what little we do have is pulling out - shutting down - going under...but here's a small snip from on economist... Google the guys name - these are smart people without and ax to grind. THEY ARE SERIOUSLY CONCERNED... \"...If rates rise, it will have harmful effects on not only us but also our foreign creditors. According to noted investment advisor Peter Schiff, in a recent interview, he said we (USA) are financing an increasing amount of our debt with short term bonds instead of locking in long term rates. If rates spike our interest payments will spike. To put this in the worst possible light, 22% of our tax revenue goes to debt interest - if rates on the debt doubled (because the short term bonds will mature soon and new ones will be sold to pay back the old - basically government “refinancing”), assuming we didn’t add or subtract any debt, our interest payments would be 44% of tax revenue!!!!! In Bush's worst time the deficit consumed 8% and it was making everyone extremely nervous... Last I heard Obama was pegging 13% and climbing. We haven't even begun to tap the inflation buttons yet. Those will start triggering right around Christmas and after that - things will start getting worse. Unemployment is tapping 10% - It will hit 15-18 before the year is out. The jobs Obama is creating are NOT the jobs being lost and what little they do create will not even begin to raise the revenue he will need to pay the debt. He is running everything bassawkards... The debt payments will be higher and climbing every month because he is borrowing more to pay each payment - THEN at the same time less & less people are working so the revenues are steadily dropping. His reaction is to RAISE taxes but that will NOT help. In 5yrs the DEBT payment alone will consume 50% of ALL the money the fed brings in - 50% of ALL - they were screaming at 8% - Obama is already tapping 13% - and we cannot pay it now. What is he going to do other than crank up the printing presses..?", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-24 19:17:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "We risk hyper inflation. \"\"http://www.answers.com/topic/hyperinflation", 
        "intTime": 20090525, 
        "postID": 15, 
        "quote": "", 
        "reply": "We risk hyper inflation. \"\"http://www.answers.com/topic/hyperinflation", 
        "threadID": "409192893_8640099322001", 
        "time": "2009-05-25 19:16:00", 
        "title": "OBAMA & SOCIALIST PROGRESSIVES – BLIND ADDICTION INFLATION – INFLATION - INFLATION", 
        "userID": "peter3_1"
    }
]