[
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by john2x: I guess Bush aint off the hook just yet. Bugliosi is like a pit Bull And isnt giving up. He sent out 8,000 letters to DAs across the nation. He only needs one to file the charges to a grand jury before he can proceed. 8,000 to one is pretty good odds he just might succeed and then watch the domino effect. \"www.peaceteam.net/bugliosi_letter.html\" A lot of pit bulls wind up being put down ... Yep after they rip someone a new AH. Not necessarily .... our shleters kill many just because they're pit bulls.", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by john2x: I guess Bush aint off the hook just yet. Bugliosi is like a pit Bull And isnt giving up. He sent out 8,000 letters to DAs across the nation. He only needs one to file the charges to a grand jury before he can proceed. 8,000 to one is pretty good odds he just might succeed and then watch the domino effect. \"www.peaceteam.net/bugliosi_letter.html\" A lot of pit bulls wind up being put down ... Yep after they rip someone a new AH.", 
        "reply": " Not necessarily .... our shleters kill many just because they're pit bulls.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:19:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? How so? As it stands now GWB has been convicted of no crimes and the war has not been determined an illegal war. And I doubt GWB ever will be .... but try to humor these folks.", 
        "intTime": 20090302, 
        "postID": 22, 
        "quote": "Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? How so? As it stands now GWB has been convicted of no crimes and the war has not been determined an illegal war.", 
        "reply": " And I doubt GWB ever will be .... but try to humor these folks.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:21:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? That will no longer be an issue once they prove in a court of law whether the information presented on which they based thier vote was true or false. So \"Plugs\" isn't responsible for checking to see if information he is given is accurate?", 
        "intTime": 20090302, 
        "postID": 23, 
        "quote": "Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? That will no longer be an issue once they prove in a court of law whether the information presented on which they based thier vote was true or false.", 
        "reply": " So \"Plugs\" isn't responsible for checking to see if information he is given is accurate?", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:23:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "Boospar"
    }, 
    {
        "content": "Bugliosi is behind the power curve. People who can actually do something, like the Senate and House Judicial Committees, have been discussing the way forward on getting the facts out. I'm not sure if this is broadcast on television news (I kind of doubt that it is), but something is going to happen pretty soon.", 
        "intTime": 20090302, 
        "postID": 24, 
        "quote": "", 
        "reply": "Bugliosi is behind the power curve. People who can actually do something, like the Senate and House Judicial Committees, have been discussing the way forward on getting the facts out. I'm not sure if this is broadcast on television news (I kind of doubt that it is), but something is going to happen pretty soon.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:30:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me?", 
        "intTime": 20090302, 
        "postID": 25, 
        "quote": "Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998....", 
        "reply": " You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me?", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:32:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me? Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence.", 
        "intTime": 20090302, 
        "postID": 26, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me?", 
        "reply": " Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:58:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "Bugliosi is a petty little grandstander. His 15 minutes are up but he can't avoid the limelight. Leslie Van Houten committed her crimes when she was 18 years old and under the influence of Charles Manson. She's a model prisoner who helps other prisoners and has earned two college degrees in prison. She is consistently denied parole in large part due to Bugliosi while the actual hands-on killer was Tex Watson, was allowed to live seperately in a trailer, marry, and father four children.", 
        "intTime": 20090302, 
        "postID": 27, 
        "quote": "", 
        "reply": "Bugliosi is a petty little grandstander. His 15 minutes are up but he can't avoid the limelight. Leslie Van Houten committed her crimes when she was 18 years old and under the influence of Charles Manson. She's a model prisoner who helps other prisoners and has earned two college degrees in prison. She is consistently denied parole in large part due to Bugliosi while the actual hands-on killer was Tex Watson, was allowed to live seperately in a trailer, marry, and father four children.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 09:16:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me? Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence. I served under every President from Reagan to GW Bush. And the average active duty GI didn't care one way or the other who the Commander in Chief was. In fact, in my experience, most GIs do not only not declare themselves members of a political party, but they didn't care about politics one way or another. So, among the circle of GIs you associated yourself with, who were probably like-minded people (as most of our friends are), there may have been a certain sentiment one way or the other, but don't make the mistake of assuming that all GIs, or even a majority of GIs, are on a given side of a political fence. I submit to you that they are not. The average 17- or 18-year old doesn't join the military out of any particular patriotic or political attitude, and while the patriotic piece often changes as they spend more time in, the political does not. \"Star Wars\", or the Strategic Defense Initiative (SDI) - went nowhere. Spent a lot of money, though. The B-1: Well, it took an awful long time before it was ever used. For the most part, it's been a hangar queen, much like it's other supersonic predecessor, the B-58 Hustler. That's been pretty expensive, too. Carter cancelled the project because it wasn't cost effective, and we could develop ALCMs (Air Launched Cruise Missiles) that could do the job for a lot less money. In fact, the Air Force retired over 30 of them to offset the costs of maintaing the entire fleet, the brought back seven, and started using canned birds from the remainder. Good project? And we didn't bankrupt the Soviets; they did it to themselves with their disaster of a central planning apparatus and Afghanistan, among other things.", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "Originally posted by M1Lase_n_Blaze: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me? Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence.", 
        "reply": " I served under every President from Reagan to GW Bush. And the average active duty GI didn't care one way or the other who the Commander in Chief was. In fact, in my experience, most GIs do not only not declare themselves members of a political party, but they didn't care about politics one way or another. So, among the circle of GIs you associated yourself with, who were probably like-minded people (as most of our friends are), there may have been a certain sentiment one way or the other, but don't make the mistake of assuming that all GIs, or even a majority of GIs, are on a given side of a political fence. I submit to you that they are not. The average 17- or 18-year old doesn't join the military out of any particular patriotic or political attitude, and while the patriotic piece often changes as they spend more time in, the political does not. \"Star Wars\", or the Strategic Defense Initiative (SDI) - went nowhere. Spent a lot of money, though. The B-1: Well, it took an awful long time before it was ever used. For the most part, it's been a hangar queen, much like it's other supersonic predecessor, the B-58 Hustler. That's been pretty expensive, too. Carter cancelled the project because it wasn't cost effective, and we could develop ALCMs (Air Launched Cruise Missiles) that could do the job for a lot less money. In fact, the Air Force retired over 30 of them to offset the costs of maintaing the entire fleet, the brought back seven, and started using canned birds from the remainder. Good project? And we didn't bankrupt the Soviets; they did it to themselves with their disaster of a central planning apparatus and Afghanistan, among other things.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 09:37:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Reagan Turned the Military’s Morale By David DeBatto President Ronald W Reagan was the 40th President of the United States and our Commander-in-Chief during the bulk of the 1980s, taking over at a time when the nation, the U.S. military included, did not feel particularly good about itself. We had just endured 440-some odd days of the Iranian hostage crisis during which the country was humbled for over a year by some radical students and a recently returned-from-exile cleric. The mood of the people was foul. We were frustrated, and especially within the military, we were angry. There was a feeling of helplessness that was new to Americans. President Jimmy Carter had seemed paralyzed by the crisis. The more he negotiated with the Iranians, the worse the situation seemed to get. When he finally did make a move, it was an ill-fated rescue mission led by some of the original Delta Force teams that met with disaster in the desert outside of Tehran. That was arguably the low point of the entire decade for America. I can still remember, as a private 1st class on my way to a tour in Germany, the shock, anger and finally sadness upon hearing of the mission’s fate. It didn’t get any worse than that. Then, on Jan. 20, 1981, Reagan was inaugurated and the whole world changed, at least for those of us in uniform, and I suspect, for a great many other Americans as well. Literally as president-elect Reagan was sitting near the podium waiting to be sworn in, aides whispered to him that the hostages had been released. He made that announcement from the podium and the nation’s mood went from dark to light almost immediately. Now, what did that all mean to the grunt? Well, for one thing, it meant that we could start to feel proud of ourselves, our uniform, our military, and yes, our president again. Not that we didn’t respect Jimmy Carter, but he had presided over a presidency that had seen our nation’s and our military’s image and self-esteem, sink to a new low. Think Abu Ghraib and you have some idea of how it was, only worse. That did an about-face with the inauguration of Ronald Reagan. It was a breath of fresh, cordite-filled air. Sure, President Carter had been a naval officer and Reagan only a movie star soldier, but Reagan got it. He understood the men and women in uniform and we knew it. He told us it was a new day for the United States and he did something about it. When he took office, the Army (my frame of reference) was a disaster. It still consisted of malcontent holdovers from Vietnam, both enlisted and officer, and bottom-of-the-barrel newbies who could not make it in the civilian world. The whole volunteer Army thing was brand new and it showed. The uniforms, equipment, barracks, weapons, chow and every other component of Army life were, to put it mildly, lacking. To add insult to injury, we were also getting vastly underpaid for all of our misery. As one might imagine, morale was in the mud. President Reagan hit the ground running. He rammed through a series of pay raises that did not exactly bring the military into parity with the civilian sector, but was a dramatic increase from the Vietnam-era salary levels they had been at. That was a huge shot in the arm all by itself. He also initiated a major rehabilitation of military housing, especially at OCONUS posts, that greatly improved life for soldiers and their families. During the 1980s, the Army saw some major new weapons platforms fielded, such as the M1 Abrams main battle tank and the Apache attack helicopter. The BDU, now, common throughout the U.S military, was introduced during his watch to replace the bland, boring olive-drab fatigues and baseball cap that had been worn since the 1950s. The warrior image had been reborn. Increased funding for field training exercises and professional non-commissioned officer development was made available. NCOES was formalized and directly linked to promotions. The NCO corps was professionalized as never before. High standards were set and expected. The bar had been raised. A fast and deliberate pace had been set and that pace continued during his entire two terms in office. President Reagan also did the military proud by staring down our old adversary, the Soviet Union, and telling them in no uncertain terms that the USA was back and we would be kickin’ ass and takin’ names! That got everyone’s attention and provided us grunts with plenty of motivation to get the job done. It sure felt good to have a commander-in-chief who spoke our language for a change. Did President Reagan run up the national debt? Sure. Was there an end run regarding the Iran-Contra affair? Maybe. Was the decision to cut and run after Beirut a mistake? Probably. But for my money and that of most soldiers, sailors, airmen and Marines I know, it was an honor and privilege to have served under President Ronald Reagan. Drive on sir!", 
        "intTime": 20090302, 
        "postID": 29, 
        "quote": "", 
        "reply": "Reagan Turned the Military’s Morale By David DeBatto President Ronald W Reagan was the 40th President of the United States and our Commander-in-Chief during the bulk of the 1980s, taking over at a time when the nation, the U.S. military included, did not feel particularly good about itself. We had just endured 440-some odd days of the Iranian hostage crisis during which the country was humbled for over a year by some radical students and a recently returned-from-exile cleric. The mood of the people was foul. We were frustrated, and especially within the military, we were angry. There was a feeling of helplessness that was new to Americans. President Jimmy Carter had seemed paralyzed by the crisis. The more he negotiated with the Iranians, the worse the situation seemed to get. When he finally did make a move, it was an ill-fated rescue mission led by some of the original Delta Force teams that met with disaster in the desert outside of Tehran. That was arguably the low point of the entire decade for America. I can still remember, as a private 1st class on my way to a tour in Germany, the shock, anger and finally sadness upon hearing of the mission’s fate. It didn’t get any worse than that. Then, on Jan. 20, 1981, Reagan was inaugurated and the whole world changed, at least for those of us in uniform, and I suspect, for a great many other Americans as well. Literally as president-elect Reagan was sitting near the podium waiting to be sworn in, aides whispered to him that the hostages had been released. He made that announcement from the podium and the nation’s mood went from dark to light almost immediately. Now, what did that all mean to the grunt? Well, for one thing, it meant that we could start to feel proud of ourselves, our uniform, our military, and yes, our president again. Not that we didn’t respect Jimmy Carter, but he had presided over a presidency that had seen our nation’s and our military’s image and self-esteem, sink to a new low. Think Abu Ghraib and you have some idea of how it was, only worse. That did an about-face with the inauguration of Ronald Reagan. It was a breath of fresh, cordite-filled air. Sure, President Carter had been a naval officer and Reagan only a movie star soldier, but Reagan got it. He understood the men and women in uniform and we knew it. He told us it was a new day for the United States and he did something about it. When he took office, the Army (my frame of reference) was a disaster. It still consisted of malcontent holdovers from Vietnam, both enlisted and officer, and bottom-of-the-barrel newbies who could not make it in the civilian world. The whole volunteer Army thing was brand new and it showed. The uniforms, equipment, barracks, weapons, chow and every other component of Army life were, to put it mildly, lacking. To add insult to injury, we were also getting vastly underpaid for all of our misery. As one might imagine, morale was in the mud. President Reagan hit the ground running. He rammed through a series of pay raises that did not exactly bring the military into parity with the civilian sector, but was a dramatic increase from the Vietnam-era salary levels they had been at. That was a huge shot in the arm all by itself. He also initiated a major rehabilitation of military housing, especially at OCONUS posts, that greatly improved life for soldiers and their families. During the 1980s, the Army saw some major new weapons platforms fielded, such as the M1 Abrams main battle tank and the Apache attack helicopter. The BDU, now, common throughout the U.S military, was introduced during his watch to replace the bland, boring olive-drab fatigues and baseball cap that had been worn since the 1950s. The warrior image had been reborn. Increased funding for field training exercises and professional non-commissioned officer development was made available. NCOES was formalized and directly linked to promotions. The NCO corps was professionalized as never before. High standards were set and expected. The bar had been raised. A fast and deliberate pace had been set and that pace continued during his entire two terms in office. President Reagan also did the military proud by staring down our old adversary, the Soviet Union, and telling them in no uncertain terms that the USA was back and we would be kickin’ ass and takin’ names! That got everyone’s attention and provided us grunts with plenty of motivation to get the job done. It sure felt good to have a commander-in-chief who spoke our language for a change. Did President Reagan run up the national debt? Sure. Was there an end run regarding the Iran-Contra affair? Maybe. Was the decision to cut and run after Beirut a mistake? Probably. But for my money and that of most soldiers, sailors, airmen and Marines I know, it was an honor and privilege to have served under President Ronald Reagan. Drive on sir!", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 10:57:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "One man's opinion on Reagan. Why did you post this?", 
        "intTime": 20090302, 
        "postID": 30, 
        "quote": "", 
        "reply": "One man's opinion on Reagan. Why did you post this?", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 11:05:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by john2x: I guess Bush aint off the hook just yet. Bugliosi is like a pit Bull And isnt giving up. He sent out 8,000 letters to DAs across the nation. He only needs one to file the charges to a grand jury before he can proceed. 8,000 to one is pretty good odds he just might succeed and then watch the domino effect. \"www.peaceteam.net/bugliosi_letter.html\" A lot of pit bulls wind up being put down ... Yep after they rip someone a new AH. Not necessarily .... our shleters kill many just because they're pit bulls.", 
        "intTime": 20090302, 
        "postID": 51, 
        "quote": "Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by john2x: I guess Bush aint off the hook just yet. Bugliosi is like a pit Bull And isnt giving up. He sent out 8,000 letters to DAs across the nation. He only needs one to file the charges to a grand jury before he can proceed. 8,000 to one is pretty good odds he just might succeed and then watch the domino effect. \"www.peaceteam.net/bugliosi_letter.html\" A lot of pit bulls wind up being put down ... Yep after they rip someone a new AH.", 
        "reply": " Not necessarily .... our shleters kill many just because they're pit bulls.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:19:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? How so? As it stands now GWB has been convicted of no crimes and the war has not been determined an illegal war. And I doubt GWB ever will be .... but try to humor these folks.", 
        "intTime": 20090302, 
        "postID": 52, 
        "quote": "Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? How so? As it stands now GWB has been convicted of no crimes and the war has not been determined an illegal war.", 
        "reply": " And I doubt GWB ever will be .... but try to humor these folks.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:21:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? That will no longer be an issue once they prove in a court of law whether the information presented on which they based thier vote was true or false. So \"Plugs\" isn't responsible for checking to see if information he is given is accurate?", 
        "intTime": 20090302, 
        "postID": 53, 
        "quote": "Originally posted by john2x: quote: Originally posted by Boospar: quote: Originally posted by outlaws93: ah yea always wanting to blame others other then those responsible...well if you want to bring bush down for deceiving the American public might as well get everyone involved....including all in the house and senate who voted for it... I recommend the first prosecution after Dubya be Joseph Biden, as he voted for the war. Can we next prosecute BO, as he knew this yet selected Senator Biden to be VP? That will no longer be an issue once they prove in a court of law whether the information presented on which they based thier vote was true or false.", 
        "reply": " So \"Plugs\" isn't responsible for checking to see if information he is given is accurate?", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:23:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "Boospar"
    }, 
    {
        "content": "Bugliosi is behind the power curve. People who can actually do something, like the Senate and House Judicial Committees, have been discussing the way forward on getting the facts out. I'm not sure if this is broadcast on television news (I kind of doubt that it is), but something is going to happen pretty soon.", 
        "intTime": 20090302, 
        "postID": 54, 
        "quote": "", 
        "reply": "Bugliosi is behind the power curve. People who can actually do something, like the Senate and House Judicial Committees, have been discussing the way forward on getting the facts out. I'm not sure if this is broadcast on television news (I kind of doubt that it is), but something is going to happen pretty soon.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:30:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me?", 
        "intTime": 20090302, 
        "postID": 55, 
        "quote": "Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998....", 
        "reply": " You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me?", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:32:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me? Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence.", 
        "intTime": 20090302, 
        "postID": 56, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me?", 
        "reply": " Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 08:58:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "Bugliosi is a petty little grandstander. His 15 minutes are up but he can't avoid the limelight. Leslie Van Houten committed her crimes when she was 18 years old and under the influence of Charles Manson. She's a model prisoner who helps other prisoners and has earned two college degrees in prison. She is consistently denied parole in large part due to Bugliosi while the actual hands-on killer was Tex Watson, was allowed to live seperately in a trailer, marry, and father four children.", 
        "intTime": 20090302, 
        "postID": 57, 
        "quote": "", 
        "reply": "Bugliosi is a petty little grandstander. His 15 minutes are up but he can't avoid the limelight. Leslie Van Houten committed her crimes when she was 18 years old and under the influence of Charles Manson. She's a model prisoner who helps other prisoners and has earned two college degrees in prison. She is consistently denied parole in large part due to Bugliosi while the actual hands-on killer was Tex Watson, was allowed to live seperately in a trailer, marry, and father four children.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 09:16:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me? Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence. I served under every President from Reagan to GW Bush. And the average active duty GI didn't care one way or the other who the Commander in Chief was. In fact, in my experience, most GIs do not only not declare themselves members of a political party, but they didn't care about politics one way or another. So, among the circle of GIs you associated yourself with, who were probably like-minded people (as most of our friends are), there may have been a certain sentiment one way or the other, but don't make the mistake of assuming that all GIs, or even a majority of GIs, are on a given side of a political fence. I submit to you that they are not. The average 17- or 18-year old doesn't join the military out of any particular patriotic or political attitude, and while the patriotic piece often changes as they spend more time in, the political does not. \"Star Wars\", or the Strategic Defense Initiative (SDI) - went nowhere. Spent a lot of money, though. The B-1: Well, it took an awful long time before it was ever used. For the most part, it's been a hangar queen, much like it's other supersonic predecessor, the B-58 Hustler. That's been pretty expensive, too. Carter cancelled the project because it wasn't cost effective, and we could develop ALCMs (Air Launched Cruise Missiles) that could do the job for a lot less money. In fact, the Air Force retired over 30 of them to offset the costs of maintaing the entire fleet, the brought back seven, and started using canned birds from the remainder. Good project? And we didn't bankrupt the Soviets; they did it to themselves with their disaster of a central planning apparatus and Afghanistan, among other things.", 
        "intTime": 20090302, 
        "postID": 58, 
        "quote": "Originally posted by M1Lase_n_Blaze: quote: Originally posted by mcgreer: quote: Originally posted by outlaws93: well i hope they plan on doing the same to bil clinton... after all bush was just following clintons executive order 1447 from 1998.... You know, with all this talk about how evil the Democrat Presidents have been (going all the way back to Roosevelt in the '30s), why haven't the Republican Presidents ever been able to fix all this stuff that the Dems allegedly broke? I don't understand - can someone explain it to me? Two things. For the last month all we've heard from Obama and Pelosi is how the Republican administration is at fault for their predicament and their shortcomings in dealing with it past, present and even incredibly future. If you want a list of items \"fixed\" I suggest you take a cursory look at the Carter and Reagan administrations as a starting point you can recall in your life time. Ask any soldier who served between 1976 and 1988 if there was difference in overall attitude. You were in the Air Force. Star Wars, the B-1 brought back... We went from placation and nailbiting over SALT treaties and mutually assured destruction to taking charge of our situation and arms racing the Soviets Union out of existence.", 
        "reply": " I served under every President from Reagan to GW Bush. And the average active duty GI didn't care one way or the other who the Commander in Chief was. In fact, in my experience, most GIs do not only not declare themselves members of a political party, but they didn't care about politics one way or another. So, among the circle of GIs you associated yourself with, who were probably like-minded people (as most of our friends are), there may have been a certain sentiment one way or the other, but don't make the mistake of assuming that all GIs, or even a majority of GIs, are on a given side of a political fence. I submit to you that they are not. The average 17- or 18-year old doesn't join the military out of any particular patriotic or political attitude, and while the patriotic piece often changes as they spend more time in, the political does not. \"Star Wars\", or the Strategic Defense Initiative (SDI) - went nowhere. Spent a lot of money, though. The B-1: Well, it took an awful long time before it was ever used. For the most part, it's been a hangar queen, much like it's other supersonic predecessor, the B-58 Hustler. That's been pretty expensive, too. Carter cancelled the project because it wasn't cost effective, and we could develop ALCMs (Air Launched Cruise Missiles) that could do the job for a lot less money. In fact, the Air Force retired over 30 of them to offset the costs of maintaing the entire fleet, the brought back seven, and started using canned birds from the remainder. Good project? And we didn't bankrupt the Soviets; they did it to themselves with their disaster of a central planning apparatus and Afghanistan, among other things.", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 09:37:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Reagan Turned the Military’s Morale By David DeBatto President Ronald W Reagan was the 40th President of the United States and our Commander-in-Chief during the bulk of the 1980s, taking over at a time when the nation, the U.S. military included, did not feel particularly good about itself. We had just endured 440-some odd days of the Iranian hostage crisis during which the country was humbled for over a year by some radical students and a recently returned-from-exile cleric. The mood of the people was foul. We were frustrated, and especially within the military, we were angry. There was a feeling of helplessness that was new to Americans. President Jimmy Carter had seemed paralyzed by the crisis. The more he negotiated with the Iranians, the worse the situation seemed to get. When he finally did make a move, it was an ill-fated rescue mission led by some of the original Delta Force teams that met with disaster in the desert outside of Tehran. That was arguably the low point of the entire decade for America. I can still remember, as a private 1st class on my way to a tour in Germany, the shock, anger and finally sadness upon hearing of the mission’s fate. It didn’t get any worse than that. Then, on Jan. 20, 1981, Reagan was inaugurated and the whole world changed, at least for those of us in uniform, and I suspect, for a great many other Americans as well. Literally as president-elect Reagan was sitting near the podium waiting to be sworn in, aides whispered to him that the hostages had been released. He made that announcement from the podium and the nation’s mood went from dark to light almost immediately. Now, what did that all mean to the grunt? Well, for one thing, it meant that we could start to feel proud of ourselves, our uniform, our military, and yes, our president again. Not that we didn’t respect Jimmy Carter, but he had presided over a presidency that had seen our nation’s and our military’s image and self-esteem, sink to a new low. Think Abu Ghraib and you have some idea of how it was, only worse. That did an about-face with the inauguration of Ronald Reagan. It was a breath of fresh, cordite-filled air. Sure, President Carter had been a naval officer and Reagan only a movie star soldier, but Reagan got it. He understood the men and women in uniform and we knew it. He told us it was a new day for the United States and he did something about it. When he took office, the Army (my frame of reference) was a disaster. It still consisted of malcontent holdovers from Vietnam, both enlisted and officer, and bottom-of-the-barrel newbies who could not make it in the civilian world. The whole volunteer Army thing was brand new and it showed. The uniforms, equipment, barracks, weapons, chow and every other component of Army life were, to put it mildly, lacking. To add insult to injury, we were also getting vastly underpaid for all of our misery. As one might imagine, morale was in the mud. President Reagan hit the ground running. He rammed through a series of pay raises that did not exactly bring the military into parity with the civilian sector, but was a dramatic increase from the Vietnam-era salary levels they had been at. That was a huge shot in the arm all by itself. He also initiated a major rehabilitation of military housing, especially at OCONUS posts, that greatly improved life for soldiers and their families. During the 1980s, the Army saw some major new weapons platforms fielded, such as the M1 Abrams main battle tank and the Apache attack helicopter. The BDU, now, common throughout the U.S military, was introduced during his watch to replace the bland, boring olive-drab fatigues and baseball cap that had been worn since the 1950s. The warrior image had been reborn. Increased funding for field training exercises and professional non-commissioned officer development was made available. NCOES was formalized and directly linked to promotions. The NCO corps was professionalized as never before. High standards were set and expected. The bar had been raised. A fast and deliberate pace had been set and that pace continued during his entire two terms in office. President Reagan also did the military proud by staring down our old adversary, the Soviet Union, and telling them in no uncertain terms that the USA was back and we would be kickin’ ass and takin’ names! That got everyone’s attention and provided us grunts with plenty of motivation to get the job done. It sure felt good to have a commander-in-chief who spoke our language for a change. Did President Reagan run up the national debt? Sure. Was there an end run regarding the Iran-Contra affair? Maybe. Was the decision to cut and run after Beirut a mistake? Probably. But for my money and that of most soldiers, sailors, airmen and Marines I know, it was an honor and privilege to have served under President Ronald Reagan. Drive on sir!", 
        "intTime": 20090302, 
        "postID": 59, 
        "quote": "", 
        "reply": "Reagan Turned the Military’s Morale By David DeBatto President Ronald W Reagan was the 40th President of the United States and our Commander-in-Chief during the bulk of the 1980s, taking over at a time when the nation, the U.S. military included, did not feel particularly good about itself. We had just endured 440-some odd days of the Iranian hostage crisis during which the country was humbled for over a year by some radical students and a recently returned-from-exile cleric. The mood of the people was foul. We were frustrated, and especially within the military, we were angry. There was a feeling of helplessness that was new to Americans. President Jimmy Carter had seemed paralyzed by the crisis. The more he negotiated with the Iranians, the worse the situation seemed to get. When he finally did make a move, it was an ill-fated rescue mission led by some of the original Delta Force teams that met with disaster in the desert outside of Tehran. That was arguably the low point of the entire decade for America. I can still remember, as a private 1st class on my way to a tour in Germany, the shock, anger and finally sadness upon hearing of the mission’s fate. It didn’t get any worse than that. Then, on Jan. 20, 1981, Reagan was inaugurated and the whole world changed, at least for those of us in uniform, and I suspect, for a great many other Americans as well. Literally as president-elect Reagan was sitting near the podium waiting to be sworn in, aides whispered to him that the hostages had been released. He made that announcement from the podium and the nation’s mood went from dark to light almost immediately. Now, what did that all mean to the grunt? Well, for one thing, it meant that we could start to feel proud of ourselves, our uniform, our military, and yes, our president again. Not that we didn’t respect Jimmy Carter, but he had presided over a presidency that had seen our nation’s and our military’s image and self-esteem, sink to a new low. Think Abu Ghraib and you have some idea of how it was, only worse. That did an about-face with the inauguration of Ronald Reagan. It was a breath of fresh, cordite-filled air. Sure, President Carter had been a naval officer and Reagan only a movie star soldier, but Reagan got it. He understood the men and women in uniform and we knew it. He told us it was a new day for the United States and he did something about it. When he took office, the Army (my frame of reference) was a disaster. It still consisted of malcontent holdovers from Vietnam, both enlisted and officer, and bottom-of-the-barrel newbies who could not make it in the civilian world. The whole volunteer Army thing was brand new and it showed. The uniforms, equipment, barracks, weapons, chow and every other component of Army life were, to put it mildly, lacking. To add insult to injury, we were also getting vastly underpaid for all of our misery. As one might imagine, morale was in the mud. President Reagan hit the ground running. He rammed through a series of pay raises that did not exactly bring the military into parity with the civilian sector, but was a dramatic increase from the Vietnam-era salary levels they had been at. That was a huge shot in the arm all by itself. He also initiated a major rehabilitation of military housing, especially at OCONUS posts, that greatly improved life for soldiers and their families. During the 1980s, the Army saw some major new weapons platforms fielded, such as the M1 Abrams main battle tank and the Apache attack helicopter. The BDU, now, common throughout the U.S military, was introduced during his watch to replace the bland, boring olive-drab fatigues and baseball cap that had been worn since the 1950s. The warrior image had been reborn. Increased funding for field training exercises and professional non-commissioned officer development was made available. NCOES was formalized and directly linked to promotions. The NCO corps was professionalized as never before. High standards were set and expected. The bar had been raised. A fast and deliberate pace had been set and that pace continued during his entire two terms in office. President Reagan also did the military proud by staring down our old adversary, the Soviet Union, and telling them in no uncertain terms that the USA was back and we would be kickin’ ass and takin’ names! That got everyone’s attention and provided us grunts with plenty of motivation to get the job done. It sure felt good to have a commander-in-chief who spoke our language for a change. Did President Reagan run up the national debt? Sure. Was there an end run regarding the Iran-Contra affair? Maybe. Was the decision to cut and run after Beirut a mistake? Probably. But for my money and that of most soldiers, sailors, airmen and Marines I know, it was an honor and privilege to have served under President Ronald Reagan. Drive on sir!", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 10:57:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "One man's opinion on Reagan. Why did you post this?", 
        "intTime": 20090302, 
        "postID": 60, 
        "quote": "", 
        "reply": "One man's opinion on Reagan. Why did you post this?", 
        "threadID": "409192893_1320033612001", 
        "time": "2009-03-02 11:05:00", 
        "title": "Bugliosi sends out 8,000 letters to DAs", 
        "userID": "mcgreer"
    }
]