[
    {
        "content": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:32:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:38:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "dhd123"
    }, 
    {
        "content": "My vote keep it secret", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "My vote keep it secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:57:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 08:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Secret", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "", 
        "reply": "Secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 18:41:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "secret x infinity", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "", 
        "reply": "secret x infinity", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:06:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "ACR26"
    }, 
    {
        "content": "Secret. This is, after all, America.", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "", 
        "reply": "Secret. This is, after all, America.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:36:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 20:55:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "OldDoc"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:49:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "busnrete8"
    }, 
    {
        "content": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "", 
        "reply": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:56:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "reply": " are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 15:14:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Hmmm...now that you mention it, I suppose I am.", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Hmmm...now that you mention it, I suppose I am.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 20:35:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Secret. As all ballots should be.", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "", 
        "reply": "Secret. As all ballots should be.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 22:15:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "intTime": 20090313, 
        "postID": 15, 
        "quote": "", 
        "reply": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:22:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "intTime": 20090313, 
        "postID": 16, 
        "quote": "", 
        "reply": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:24:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "intTime": 20090313, 
        "postID": 17, 
        "quote": "", 
        "reply": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "intTime": 20090313, 
        "postID": 18, 
        "quote": "Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "reply": " Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:43:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "intTime": 20090313, 
        "postID": 19, 
        "quote": "Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 08:12:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair. And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "intTime": 20090313, 
        "postID": 20, 
        "quote": "Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "reply": " And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:03:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 21, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:33:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "intTime": 20090313, 
        "postID": 22, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:17:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "intTime": 20090313, 
        "postID": 23, 
        "quote": "", 
        "reply": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:30:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 24, 
        "quote": "", 
        "reply": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations. If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "intTime": 20090313, 
        "postID": 25, 
        "quote": "Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "reply": " If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:10:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "intTime": 20090314, 
        "postID": 26, 
        "quote": "", 
        "reply": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "19022583"
    }, 
    {
        "content": "Keep it secret...Do not want my profession to go Union.", 
        "intTime": 20090314, 
        "postID": 27, 
        "quote": "", 
        "reply": "Keep it secret...Do not want my profession to go Union.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:11:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Captialism works for those who are getting theirs. And the majority of us aren't and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "intTime": 20090314, 
        "postID": 28, 
        "quote": "Captialism works for those who are getting theirs. And the majority of us aren't", 
        "reply": " and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "intTime": 20090314, 
        "postID": 29, 
        "quote": "", 
        "reply": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:21:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "intTime": 20090314, 
        "postID": 30, 
        "quote": "Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security.....", 
        "reply": " So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:40:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "", 
        "reply": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:32:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "", 
        "reply": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:38:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "dhd123"
    }, 
    {
        "content": "My vote keep it secret", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "", 
        "reply": "My vote keep it secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:57:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090311, 
        "postID": 34, 
        "quote": "Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 08:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Secret", 
        "intTime": 20090311, 
        "postID": 35, 
        "quote": "", 
        "reply": "Secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 18:41:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "secret x infinity", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "", 
        "reply": "secret x infinity", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:06:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "ACR26"
    }, 
    {
        "content": "Secret. This is, after all, America.", 
        "intTime": 20090311, 
        "postID": 37, 
        "quote": "", 
        "reply": "Secret. This is, after all, America.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:36:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090311, 
        "postID": 38, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 20:55:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "OldDoc"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090312, 
        "postID": 39, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:49:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "busnrete8"
    }, 
    {
        "content": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "intTime": 20090312, 
        "postID": 40, 
        "quote": "", 
        "reply": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:56:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "intTime": 20090312, 
        "postID": 41, 
        "quote": "Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "reply": " are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "intTime": 20090312, 
        "postID": 42, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 15:14:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Hmmm...now that you mention it, I suppose I am.", 
        "intTime": 20090312, 
        "postID": 43, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Hmmm...now that you mention it, I suppose I am.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 20:35:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Secret. As all ballots should be.", 
        "intTime": 20090312, 
        "postID": 44, 
        "quote": "", 
        "reply": "Secret. As all ballots should be.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 22:15:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "intTime": 20090313, 
        "postID": 45, 
        "quote": "", 
        "reply": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:22:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "intTime": 20090313, 
        "postID": 46, 
        "quote": "", 
        "reply": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:24:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "intTime": 20090313, 
        "postID": 47, 
        "quote": "", 
        "reply": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "intTime": 20090313, 
        "postID": 48, 
        "quote": "Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "reply": " Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:43:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "intTime": 20090313, 
        "postID": 49, 
        "quote": "Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 08:12:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair. And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "intTime": 20090313, 
        "postID": 50, 
        "quote": "Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "reply": " And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:03:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 51, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:33:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "intTime": 20090313, 
        "postID": 52, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:17:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "intTime": 20090313, 
        "postID": 53, 
        "quote": "", 
        "reply": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:30:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 54, 
        "quote": "", 
        "reply": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations. If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "intTime": 20090313, 
        "postID": 55, 
        "quote": "Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "reply": " If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:10:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "intTime": 20090314, 
        "postID": 56, 
        "quote": "", 
        "reply": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "19022583"
    }, 
    {
        "content": "Keep it secret...Do not want my profession to go Union.", 
        "intTime": 20090314, 
        "postID": 57, 
        "quote": "", 
        "reply": "Keep it secret...Do not want my profession to go Union.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:11:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Captialism works for those who are getting theirs. And the majority of us aren't and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "intTime": 20090314, 
        "postID": 58, 
        "quote": "Captialism works for those who are getting theirs. And the majority of us aren't", 
        "reply": " and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "intTime": 20090314, 
        "postID": 59, 
        "quote": "", 
        "reply": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:21:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "intTime": 20090314, 
        "postID": 60, 
        "quote": "Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security.....", 
        "reply": " So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:40:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "intTime": 20090311, 
        "postID": 61, 
        "quote": "", 
        "reply": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:32:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "intTime": 20090311, 
        "postID": 62, 
        "quote": "", 
        "reply": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:38:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "dhd123"
    }, 
    {
        "content": "My vote keep it secret", 
        "intTime": 20090311, 
        "postID": 63, 
        "quote": "", 
        "reply": "My vote keep it secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:57:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090311, 
        "postID": 64, 
        "quote": "Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 08:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Secret", 
        "intTime": 20090311, 
        "postID": 65, 
        "quote": "", 
        "reply": "Secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 18:41:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "secret x infinity", 
        "intTime": 20090311, 
        "postID": 66, 
        "quote": "", 
        "reply": "secret x infinity", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:06:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "ACR26"
    }, 
    {
        "content": "Secret. This is, after all, America.", 
        "intTime": 20090311, 
        "postID": 67, 
        "quote": "", 
        "reply": "Secret. This is, after all, America.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:36:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090311, 
        "postID": 68, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 20:55:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "OldDoc"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090312, 
        "postID": 69, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:49:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "busnrete8"
    }, 
    {
        "content": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "intTime": 20090312, 
        "postID": 70, 
        "quote": "", 
        "reply": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:56:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "intTime": 20090312, 
        "postID": 71, 
        "quote": "Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "reply": " are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "intTime": 20090312, 
        "postID": 72, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 15:14:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Hmmm...now that you mention it, I suppose I am.", 
        "intTime": 20090312, 
        "postID": 73, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Hmmm...now that you mention it, I suppose I am.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 20:35:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Secret. As all ballots should be.", 
        "intTime": 20090312, 
        "postID": 74, 
        "quote": "", 
        "reply": "Secret. As all ballots should be.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 22:15:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "intTime": 20090313, 
        "postID": 75, 
        "quote": "", 
        "reply": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:22:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "intTime": 20090313, 
        "postID": 76, 
        "quote": "", 
        "reply": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:24:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "intTime": 20090313, 
        "postID": 77, 
        "quote": "", 
        "reply": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "intTime": 20090313, 
        "postID": 78, 
        "quote": "Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "reply": " Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:43:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "intTime": 20090313, 
        "postID": 79, 
        "quote": "Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 08:12:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair. And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "intTime": 20090313, 
        "postID": 80, 
        "quote": "Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "reply": " And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:03:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 81, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:33:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "intTime": 20090313, 
        "postID": 82, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:17:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "intTime": 20090313, 
        "postID": 83, 
        "quote": "", 
        "reply": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:30:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 84, 
        "quote": "", 
        "reply": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations. If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "intTime": 20090313, 
        "postID": 85, 
        "quote": "Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "reply": " If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:10:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "intTime": 20090314, 
        "postID": 86, 
        "quote": "", 
        "reply": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "19022583"
    }, 
    {
        "content": "Keep it secret...Do not want my profession to go Union.", 
        "intTime": 20090314, 
        "postID": 87, 
        "quote": "", 
        "reply": "Keep it secret...Do not want my profession to go Union.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:11:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Captialism works for those who are getting theirs. And the majority of us aren't and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "intTime": 20090314, 
        "postID": 88, 
        "quote": "Captialism works for those who are getting theirs. And the majority of us aren't", 
        "reply": " and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "intTime": 20090314, 
        "postID": 89, 
        "quote": "", 
        "reply": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:21:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "intTime": 20090314, 
        "postID": 90, 
        "quote": "Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security.....", 
        "reply": " So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:40:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "intTime": 20090311, 
        "postID": 91, 
        "quote": "", 
        "reply": "i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:32:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "intTime": 20090311, 
        "postID": 92, 
        "quote": "", 
        "reply": "The whole purpose of secret ballots is to keep reprisals against individual workers from happening. No one needs to know how each person casts their ballot, just like in elections, each vote is that persons business and no one elses.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:38:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "dhd123"
    }, 
    {
        "content": "My vote keep it secret", 
        "intTime": 20090311, 
        "postID": 93, 
        "quote": "", 
        "reply": "My vote keep it secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 03:57:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090311, 
        "postID": 94, 
        "quote": "Originally posted by Ira1945: ......{snip]...... would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " Sure! Why not! He's a Union man (SAG)! Secret! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 08:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Secret", 
        "intTime": 20090311, 
        "postID": 95, 
        "quote": "", 
        "reply": "Secret", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 18:41:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "secret x infinity", 
        "intTime": 20090311, 
        "postID": 96, 
        "quote": "", 
        "reply": "secret x infinity", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:06:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "ACR26"
    }, 
    {
        "content": "Secret. This is, after all, America.", 
        "intTime": 20090311, 
        "postID": 97, 
        "quote": "", 
        "reply": "Secret. This is, after all, America.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 19:36:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090311, 
        "postID": 98, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-11 20:55:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "OldDoc"
    }, 
    {
        "content": "Secret.", 
        "intTime": 20090312, 
        "postID": 99, 
        "quote": "", 
        "reply": "Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:49:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "busnrete8"
    }, 
    {
        "content": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "intTime": 20090312, 
        "postID": 100, 
        "quote": "", 
        "reply": "The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 09:56:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "intTime": 20090312, 
        "postID": 101, 
        "quote": "Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption.", 
        "reply": " are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "intTime": 20090312, 
        "postID": 102, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Just as honest as when they're filing taxes! Secret. Top Secret.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 15:14:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level?? Hmmm...now that you mention it, I suppose I am.", 
        "intTime": 20090312, 
        "postID": 103, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Philhelm: The real question is, who in their right mind would not want it to be secret? The only people who would want it to be open are those who wish to legitimize corruption. are you saying that the senators and congressmen all gentle ladies and men, would suport corruption at the union level??", 
        "reply": " Hmmm...now that you mention it, I suppose I am.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 20:35:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Secret. As all ballots should be.", 
        "intTime": 20090312, 
        "postID": 104, 
        "quote": "", 
        "reply": "Secret. As all ballots should be.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-12 22:15:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "intTime": 20090313, 
        "postID": 105, 
        "quote": "", 
        "reply": "Wow, a unanimous vote for secrecy, and in Point-Counterpoint, no less. Hmmm...for *some* reason, *somebody* doesn't want it to be secret. Now, if only I can wrap my head around the reason behind this...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:22:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "intTime": 20090313, 
        "postID": 106, 
        "quote": "", 
        "reply": "Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:24:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "intTime": 20090313, 
        "postID": 107, 
        "quote": "", 
        "reply": "form a Union, secret ballot, yay or nay. I can't tell you what my vote is on this....it's a secret. Don", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:34:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "intTime": 20090313, 
        "postID": 108, 
        "quote": "Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\".", 
        "reply": " Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 07:43:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "intTime": 20090313, 
        "postID": 109, 
        "quote": "Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open??", 
        "reply": " The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 08:12:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair. And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "intTime": 20090313, 
        "postID": 110, 
        "quote": "Originally posted by Philhelm: quote: Originally posted by navy8086: Unions are organised crime syndicates, with union stewarts nothing more than thier \"button men\". Well, I wouldn't go that far. Unions did serve a purpose at one time, and were probably necessary. However, as with every move for balance in history, the pendulem swings a bit farther than what is actually fair.", 
        "reply": " And almost all the power is in the hands of CEO's and other managers NOW. You know the ones that have been running companies into the ground so that they can get SHORT term gains (or what looks like gains anyway) to justify large MANGEMENT bonus while hurting the company long term. Example - Management has a layoff because the compnay is having problem and then gives themselves a bonus.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:03:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 111, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " At the company I USED to work for, every time the union came around looking to get representation the CEO OF THE COMPANY would personally come to the plant and stop all production and have a \"meeting\" with the employees to tell us how adversely the union would affect our employment. All the while management is getting bonuses and million dollar salaries. When they bought a factory in Canada then opened a factory in Mexico I saw the writing on the wall. The profit margin was the only relevant issue. Screw the workers who busted their asses for years to make that company into the respected industry leader that it is/used to be. There are less then 500 workers now from about 1100 just 5 years ago and they keep laying off 10 here, 20 there. A union would have given the former (and current) employees more compensation for the work they did. Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 10:33:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining. How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "intTime": 20090313, 
        "postID": 112, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Ira1945: i say keep it secret, heck the congress uses secret ballots to form caucus's, all US elections are secret. I grew up in Chicago and i know many Union \"stewards\", \"delegates\" so forth and so on, funny none of them work, would you want a Joe Pesci standing next to you when you fill out a \"card\" in the open?? The reason Businesses such as WalMart want a secret ballot \"organized by the government\" is that it introduces a long enough delay that they have been able to intimidate workers into voting against the union. The groups funded by businesses that are running ads opposing the change CLAIM that it will might allow Unions to intimidate workers (they mention the Mafia) to join while ignoring the FACT that the current system HAS allowed businesses to intimidate workers into voting against joining.", 
        "reply": " How does that justify the denial of a fundamental American ideal? It sure sounds like a case of killing the patient to cure the illness.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:17:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "adminnco1"
    }, 
    {
        "content": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "intTime": 20090313, 
        "postID": 113, 
        "quote": "", 
        "reply": "AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 11:30:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "navy8086"
    }, 
    {
        "content": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090313, 
        "postID": 114, 
        "quote": "", 
        "reply": "The good faith efforts are becoming too one sided. If the company management tells the bargaining unit that they can't \"afford\" to give a raise to the employee's but turn around and give the top executives a pay increae, bonuses, stock options, etc. then how is that in the best interests of the company? Not just the executives but all the employee's of the company? Getting compensated for doing a good job is the basis for the employment for the majority of workers yet executives are not bound by those tenets and the employee's and the public see that hypocrisy. Then we wonder how they get away with it. DO a bad job and get fired? Only if you aren't an executive. Being told that companies have to pay for the talent and quality of those \"top\" executives then watching the company crash and burn is too much Bullschizz for some of us to tolerate. Captialism works for those who are getting theirs. And the majority of us aren't. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations. If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "intTime": 20090313, 
        "postID": 115, 
        "quote": "Originally posted by navy8086: AS for claims of job security, a news story ran acouple of years ago. (Sorry it was a print story, so I don't have a link) It was right in the middle of a strikie involving several nuring home at the time (I think it was 20). In the preceeding 5 years, 2000 nursing home beds were lost in the state of CT. Of those 80% were in unionized homes. Along with the bed losses, of course, were job losses. THe nursing homes ust could keep up with wage demands and were forced to close down operations.", 
        "reply": " If this is the same issue I remember many of the homes reopened under new names without unions and several also then had \"issues\" with state rules and laws about the \"standard of care\" they provided. \"http://www.nursing-home-abuse-resource.com/news/connecticut.html\" \"http://www.nursing-home-abuse-resource.com/nursing_home_abuse/abcnews_article.html\" quote: Nursing Home Abuse Nursing Home Abuse - From ABCNEWS.COM A study done by the minority staff of the Special Investigations Division of the House Government Reform Committee, finds that 30 percent of nursing homes in the United States — 5,283 facilities — were cited for almost 9,000 instances of nursing home abuse over a recent two-year period, from January 1999 to January 2001. \"http://www.nursing-home-abuse-resource.com/news/bad-homes.html\" quote: Too Many Bad Nursing Homes August 11 , 2006 A new report to be published in next month’s issue of Consumer Reports finds that too many bad nursing homes and too few good ones plague elderly care in the United States. The report, titled Nursing Home Quality Monitor, is based on data from about 16,000 nursing homes across the country. Researchers analyzed the homes based on three measures of quality, including accuracy of reporting, adequate staffing, and mobility of residents. What the researchers found Based on their results, the researchers determined the best nursing homes and the worst in each state. They concluded that, in general, non-profit homes were better than for-profit ones and independent homes better than chains. “Less than 2 percent of for-profit homes were likely to provide good care while more than 7 percent of not-for-profit homes were,” said Trudy Lieberman, director of Consumers Union’s Center for Consumer Health Choices. She added, “At the other end of the spectrum, less than 1.5 percent of not-for-profits were likely to provide poor care while 3.5 percent of for-profits were.”", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-13 12:10:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "rayld2"
    }, 
    {
        "content": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "intTime": 20090314, 
        "postID": 116, 
        "quote": "", 
        "reply": "Nah, lets ask the \"friendly\" union steward HOW we should vote. HE'll understand when we disagree with him, won't he?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:02:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "19022583"
    }, 
    {
        "content": "Keep it secret...Do not want my profession to go Union.", 
        "intTime": 20090314, 
        "postID": 117, 
        "quote": "", 
        "reply": "Keep it secret...Do not want my profession to go Union.", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 10:11:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Captialism works for those who are getting theirs. And the majority of us aren't and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "intTime": 20090314, 
        "postID": 118, 
        "quote": "Captialism works for those who are getting theirs. And the majority of us aren't", 
        "reply": " and whose fault is that>> no one promised a rose garden, you have the same opportunity as everyone else, it is what you do with it that counts. if you are failing, then whose fault is it?", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:13:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "intTime": 20090314, 
        "postID": 119, 
        "quote": "", 
        "reply": "I think some folks should get smart and start their UNION for NON-UNION members... Odd isn't it... Obama wants the gov to control the health-care, banking, investment, labor, manufacturing, media, guns, schools, and housing, and energy... but he aint a socialist...? Go figure, Chavez must be a true American hero than... ah...? I think reading the Constitution should be mandatory for ALL Presidents - maybe TWICE PER DAY!! Kind-a strange how the media is so quiet about taxes... I bet that 250 \"middle-class\" tax hike gets dropped to about 60-70k per now... and let's not forget about the 1.50 per gal fuel tax coming soon to all our neighborhoods - change - change you can believe in...? YEP, cuz that's about all that will left in our pockets when they are done... AMERIKA the land of the Unionized Free - Liberty & Justice are reserved for members only - oh yeah, and those who were enemy combatants - they get a free ticket too - I guess... gee I hope the appreciate it...", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:21:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security..... So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "intTime": 20090314, 
        "postID": 120, 
        "quote": "Originally posted by mmulder67: Who doesn't want unions? Not the employees who can only gain more compensation and more job security.....", 
        "reply": " So, why can’t they start their own business and hire union people…. When I worked at Martin Marietta I used to drive past Sparrows Point – Bethlehem Steel and the big ole shipping yards… They used to employ 75-thousand people… as did Martin Marietta also employed 50-thousand people… My neighbor worked for Sparrows Point – he received ONE week of vacation for every year worked. He was getting 26-wks vacation – and I’m not kidding… he was also making about 26-bucks per hr – and this was 1980… Guess what happened to him…? The last time I drove past Sparrows point they had about 2-thousand people working… At Martin’s they were down to about 3500 people… Both were CLOSED SHOPS… I tried to argue that I didn’t want to join the union… tough – if I wanted to work I had to pay my two-hrs per wk to the union… Unions are as useful as a Tumor…. sooner or later – it WILL BECOME malignant… Watch what happens when these Socialist agenda start unfolding… The after-shocks of these socialist agendas will be100-times worse than anything this country has seen… if our politicians are dirty scum, what do you think hides behind the doors of these unions? I’ll give-ya a hint – it aint pro-America…", 
        "threadID": "409192893_4530015712001", 
        "time": "2009-03-14 11:40:00", 
        "title": "form a Union, secret ballot, yay or nay", 
        "userID": "GlassOnion"
    }
]