[
    {
        "content": "quote: Originally posted by scottrj50: well the Clinton/Obama machine had no problem chewing up the GOP Another whipping Failure of the GOP to aadhere to conservative values ensured they were tubed. They turned way too far from the ideals of the Contract with America.", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "Originally posted by scottrj50: well the Clinton/Obama machine had no problem chewing up the GOP Another whipping", 
        "reply": " Failure of the GOP to aadhere to conservative values ensured they were tubed. They turned way too far from the ideals of the Contract with America.", 
        "threadID": "409192893_4800066512001", 
        "time": "2009-03-20 17:08:00", 
        "title": "The Clinton machine is after Obama", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Bill Clinton needs to shut up, but that won't happen. While his wife is carrying the President's water in Asia, and his cronies are firmly entrenched inside the new administration (the cost of Hillary's support), the former President is politely criticizing the new President already. And, his pals in the media give him instant access. Notice who the interviewer is. This won't stop and Obama can't do anything about it. In fact, it will get worse as time goes by. The Clinton's will position themselves in 2012 to offer the \"real\" change Obama promised, but failed to deliver on. Of course, until then, they'll work as hard as they can to short-circuit everything the President tries to do while appearing to be good soldiers. In league with their like-minded Republican buddies, they'll try to torpedo the new President and, so far, they're doing a pretty good job of saying one thing and doing another. How Clintonesque is that? Former President Bill Clinton gives President Barack Obama an \"A\" grade for his first month in office, but tells ABC News that Obama needs to put on a more positive face when speaking to the American people about the economy and must keep pressure on Republicans who try to obstruct his plans.... Regarding Obama's bleak warnings that \"the economy could get worse before it gets better,\" and that the economic stimulus program is only the beginning of the end of the economic crisis, Clinton said, \"I like the fact that he didn't come in and give us a bunch of happy talk. I'm glad he shot straight with us.\" But he added, \"I just want the American people to know that he's confident that we are gonna get out of this and he feels good about the long run.\" Clinton thinks Obama should talk to the public in greater depth about the economy. \"I like trying to educate the American people about the dimensions and scope of this economic crisis,\" Clinton said. \"I just would like him to end by saying that he is hopeful and completely convinced we're gonna come through this.\".... \"http://abcnews.go.com/GMA/President44/story?id=6916695&page=1\" So any constructive criticism, anything other than fawning obesience is a plot. Nine out of ten proto-totalitarians agree, constructive criticism is still criticism.", 
        "intTime": 20090320, 
        "postID": 21, 
        "quote": "Originally posted by stillkit: Bill Clinton needs to shut up, but that won't happen. While his wife is carrying the President's water in Asia, and his cronies are firmly entrenched inside the new administration (the cost of Hillary's support), the former President is politely criticizing the new President already. And, his pals in the media give him instant access. Notice who the interviewer is. This won't stop and Obama can't do anything about it. In fact, it will get worse as time goes by. The Clinton's will position themselves in 2012 to offer the \"real\" change Obama promised, but failed to deliver on. Of course, until then, they'll work as hard as they can to short-circuit everything the President tries to do while appearing to be good soldiers. In league with their like-minded Republican buddies, they'll try to torpedo the new President and, so far, they're doing a pretty good job of saying one thing and doing another. How Clintonesque is that? Former President Bill Clinton gives President Barack Obama an \"A\" grade for his first month in office, but tells ABC News that Obama needs to put on a more positive face when speaking to the American people about the economy and must keep pressure on Republicans who try to obstruct his plans.... Regarding Obama's bleak warnings that \"the economy could get worse before it gets better,\" and that the economic stimulus program is only the beginning of the end of the economic crisis, Clinton said, \"I like the fact that he didn't come in and give us a bunch of happy talk. I'm glad he shot straight with us.\" But he added, \"I just want the American people to know that he's confident that we are gonna get out of this and he feels good about the long run.\" Clinton thinks Obama should talk to the public in greater depth about the economy. \"I like trying to educate the American people about the dimensions and scope of this economic crisis,\" Clinton said. \"I just would like him to end by saying that he is hopeful and completely convinced we're gonna come through this.\".... \"http://abcnews.go.com/GMA/President44/story?id=6916695&page=1\"", 
        "reply": " So any constructive criticism, anything other than fawning obesience is a plot. Nine out of ten proto-totalitarians agree, constructive criticism is still criticism.", 
        "threadID": "409192893_4800066512001", 
        "time": "2009-03-20 17:48:00", 
        "title": "The Clinton machine is after Obama", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: My favorite quote from the entire article - How Clintonesque ... quote: \"I personally believe, based on my experience over the years with the economy, that if we moved aggressively on this home problem a year and a half ago, even a year ago, as much as 90 percent of the current crisis could have been avoided.\" That from the man who left office with the country entering recession and with the tech bubble bursting ... how prescient is hindsight and how self-serving the memory? ...that assured the incoming administration Saddam was indeed a threat and was developing WMDs. This was also the guy who claimed global warming legislation could do something to halt tornadoes in the Midwest. Making the claim to victims of a recent spate of tornadoes.", 
        "intTime": 20090320, 
        "postID": 22, 
        "quote": "Originally posted by I_M_Qwerty: My favorite quote from the entire article - How Clintonesque ... quote: \"I personally believe, based on my experience over the years with the economy, that if we moved aggressively on this home problem a year and a half ago, even a year ago, as much as 90 percent of the current crisis could have been avoided.\" That from the man who left office with the country entering recession and with the tech bubble bursting ... how prescient is hindsight and how self-serving the memory?", 
        "reply": " ...that assured the incoming administration Saddam was indeed a threat and was developing WMDs. This was also the guy who claimed global warming legislation could do something to halt tornadoes in the Midwest. Making the claim to victims of a recent spate of tornadoes.", 
        "threadID": "409192893_4800066512001", 
        "time": "2009-03-20 17:55:00", 
        "title": "The Clinton machine is after Obama", 
        "userID": "M1Lase_n_Blaze"
    }
]