[
    {
        "content": "So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "", 
        "reply": "So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 17:39:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 17:54:00", 
        "title": "Reconciling Rendition", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "", 
        "reply": "Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:23:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction? That's a good question but we have to remind ourselves that within the past several months we ARE living in a different world. Prepare yourself. My whole heart goes out to those in uniform who are there with sincere intentions to be part of ensuring our freedom. But .... they lack the backing of the new administration. I'm so sad and sorry about that. More than anything else, my heart goes out to them. They are young men and women who don't deserve this. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "Originally posted by psychoABN: So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "reply": " That's a good question but we have to remind ourselves that within the past several months we ARE living in a different world. Prepare yourself. My whole heart goes out to those in uniform who are there with sincere intentions to be part of ensuring our freedom. But .... they lack the backing of the new administration. I'm so sad and sorry about that. More than anything else, my heart goes out to them. They are young men and women who don't deserve this. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:32:00", 
        "title": "Reconciling Rendition", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "reply": " I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "reply": " Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:51:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "From the LA Times: Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 The CIA's secret prisons are being shuttered. Harsh interrogation techniques are off-limits. And Guantanamo Bay will eventually go back to being a wind-swept naval base on the southeastern corner of Cuba. But even while dismantling these programs, President Obama left intact an equally controversial counter-terrorism tool. Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. Current and former U.S. intelligence officials said that the rendition program might be poised to play an expanded role going forward because it was the main remaining mechanism -- aside from Predator missile strikes -- for taking suspected terrorists off the street. The rendition program became a source of embarrassment for the CIA, and a target of international scorn, as details emerged in recent years of botched captures, mistaken identities and allegations that prisoners were turned over to countries where they were tortured. The European Parliament condemned renditions as \"an illegal instrument used by the United States.\" Prisoners swept up in the program have sued the CIA as well as a Boeing Co. subsidiary accused of working with the agency on dozens of rendition flights. But the Obama administration appears to have determined that the rendition program was one component of the Bush administration's war on terrorism that it could not afford to discard. The decision underscores the fact that the battle with Al Qaeda and other terrorist groups is far from over and that even if the United States is shutting down the prisons, it is not done taking prisoners. \"Obviously you need to preserve some tools, you still have to go after the bad guys,\" said an Obama administration official, speaking on condition of anonymity when discussing the legal reasoning. \"The legal advisors working on this looked at rendition. It is controversial in some circles and kicked up a big storm in Europe. But if done within certain parameters, it is an acceptable practice.\" One provision in one of Obama's orders appears to preserve the CIA's ability to detain and interrogate terrorism suspects as long as they are not held long-term. The little-noticed provision states that the instructions to close the CIA's secret prison sites \"do not refer to facilities used only to hold people on a short-term, transitory basis.\" Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 Despite concern about rendition, Obama's prohibition against the use of most other counter-terrorism tools could prompt intelligence officers to resort more frequently to the \"transitory\" technique. The decision to preserve the program did not draw major protests, even among human rights groups. Leaders of such organizations said that reflected a sense that the United States and other nations needed certain tools to combat terrorism. \"Under limited circumstances, there is a legitimate place\" for renditions, said Tom Malinowski, the Washington advocacy director for Human Rights Watch. \"What I heard loud and clear from the president's order was that they want to design a system that doesn't result in people being sent to foreign dungeons to be tortured. But that designing that system is going to take some time.\" Malinowski said that he had urged the Obama administration to require that prisoners be transferred to other countries only when they would be guaranteed a public hearing in an official court. \"Producing a prisoner before a real court is a key safeguard against torture, abuse and disappearance,\" Malinowski said. CIA veterans involved in the rendition program said that it was an important capability, but used mainly for terrorism suspects not valuable enough for the agency to keep, and that the program was of limited use in gathering intelligence. \"The reason we did interrogations [ourselves] is because renditions for the most part weren't very productive,\" said a former senior CIA official who spoke on condition of anonymity because of the sensitive nature of the subject. The most valuable intelligence on Al Qaeda came from prisoners who were in CIA custody and questioned by agency experts, the official said. Once prisoners were turned over to other countries, such as Egypt and Jordan, the agency had limited ability to influence how much intelligence was shared, how prisoners were treated and whether they were later released. \"In some ways, [rendition] is the worst option,\" the former official said. \"If they are in U.S. hands, you have a lot of checks and balances, medics and lawyers. Once you turn them over to another service, you lose control.\" In his executive order on lawful interrogations, Obama created a task force to reexamine renditions to make sure that they \"do not result in the transfer of individuals to other nations to face torture,\" or otherwise circumvent human rights laws and treaties.", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "", 
        "reply": "From the LA Times: Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 The CIA's secret prisons are being shuttered. Harsh interrogation techniques are off-limits. And Guantanamo Bay will eventually go back to being a wind-swept naval base on the southeastern corner of Cuba. But even while dismantling these programs, President Obama left intact an equally controversial counter-terrorism tool. Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. Current and former U.S. intelligence officials said that the rendition program might be poised to play an expanded role going forward because it was the main remaining mechanism -- aside from Predator missile strikes -- for taking suspected terrorists off the street. The rendition program became a source of embarrassment for the CIA, and a target of international scorn, as details emerged in recent years of botched captures, mistaken identities and allegations that prisoners were turned over to countries where they were tortured. The European Parliament condemned renditions as \"an illegal instrument used by the United States.\" Prisoners swept up in the program have sued the CIA as well as a Boeing Co. subsidiary accused of working with the agency on dozens of rendition flights. But the Obama administration appears to have determined that the rendition program was one component of the Bush administration's war on terrorism that it could not afford to discard. The decision underscores the fact that the battle with Al Qaeda and other terrorist groups is far from over and that even if the United States is shutting down the prisons, it is not done taking prisoners. \"Obviously you need to preserve some tools, you still have to go after the bad guys,\" said an Obama administration official, speaking on condition of anonymity when discussing the legal reasoning. \"The legal advisors working on this looked at rendition. It is controversial in some circles and kicked up a big storm in Europe. But if done within certain parameters, it is an acceptable practice.\" One provision in one of Obama's orders appears to preserve the CIA's ability to detain and interrogate terrorism suspects as long as they are not held long-term. The little-noticed provision states that the instructions to close the CIA's secret prison sites \"do not refer to facilities used only to hold people on a short-term, transitory basis.\" Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 Despite concern about rendition, Obama's prohibition against the use of most other counter-terrorism tools could prompt intelligence officers to resort more frequently to the \"transitory\" technique. The decision to preserve the program did not draw major protests, even among human rights groups. Leaders of such organizations said that reflected a sense that the United States and other nations needed certain tools to combat terrorism. \"Under limited circumstances, there is a legitimate place\" for renditions, said Tom Malinowski, the Washington advocacy director for Human Rights Watch. \"What I heard loud and clear from the president's order was that they want to design a system that doesn't result in people being sent to foreign dungeons to be tortured. But that designing that system is going to take some time.\" Malinowski said that he had urged the Obama administration to require that prisoners be transferred to other countries only when they would be guaranteed a public hearing in an official court. \"Producing a prisoner before a real court is a key safeguard against torture, abuse and disappearance,\" Malinowski said. CIA veterans involved in the rendition program said that it was an important capability, but used mainly for terrorism suspects not valuable enough for the agency to keep, and that the program was of limited use in gathering intelligence. \"The reason we did interrogations [ourselves] is because renditions for the most part weren't very productive,\" said a former senior CIA official who spoke on condition of anonymity because of the sensitive nature of the subject. The most valuable intelligence on Al Qaeda came from prisoners who were in CIA custody and questioned by agency experts, the official said. Once prisoners were turned over to other countries, such as Egypt and Jordan, the agency had limited ability to influence how much intelligence was shared, how prisoners were treated and whether they were later released. \"In some ways, [rendition] is the worst option,\" the former official said. \"If they are in U.S. hands, you have a lot of checks and balances, medics and lawyers. Once you turn them over to another service, you lose control.\" In his executive order on lawful interrogations, Obama created a task force to reexamine renditions to make sure that they \"do not result in the transfer of individuals to other nations to face torture,\" or otherwise circumvent human rights laws and treaties.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:57:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof? You might want to look up the word \"proof\".", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "reply": " You might want to look up the word \"proof\".", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:05:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "According to the article above, the most intelligence was collected when the detainees remained in CIA control. Perhaps using the EITs, perhaps not. But, now that the interrogation memos were released, the enemy knows that nothing much will happen to them, so that option is ruined. We still have rendition though, which isn't as effective as far as gathering intelligence, and will probably result in the detainees actually being tortured with no medics present to tend to their medical needs, no lawyers present to tell the interrogators to back off if they start to cross the line, none of that. Seems a$$ backwards to me. So much for the \"smart power\" tht was touted during the election, doesn't seem too smart to me.", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "", 
        "reply": "According to the article above, the most intelligence was collected when the detainees remained in CIA control. Perhaps using the EITs, perhaps not. But, now that the interrogation memos were released, the enemy knows that nothing much will happen to them, so that option is ruined. We still have rendition though, which isn't as effective as far as gathering intelligence, and will probably result in the detainees actually being tortured with no medics present to tend to their medical needs, no lawyers present to tell the interrogators to back off if they start to cross the line, none of that. Seems a$$ backwards to me. So much for the \"smart power\" tht was touted during the election, doesn't seem too smart to me.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:08:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Remove the hot link... It snuck in. Who me? Where? I'll take it out...", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "Originally posted by klassylady25: Remove the hot link... It snuck in.", 
        "reply": " Who me? Where? I'll take it out...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:09:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "[/QUOTE]You might want to look up the word \"proof\".[/QUOTE] Proof-evidence sufficient to establish a thing as true, or to produce belief in its truth. Well, the article I posted from the LA Times pretty much provides proof. Unless you can produce an article from a valid, reputable source that states that the Obama administration hasn't continued the policy of rendition. So, how do you reconcile the use of rendition, even the possible expansion as stated in the article (because our intelligence capabilities were diminished by the release of the \"torture\" memos), by the current administration?", 
        "intTime": 20090520, 
        "postID": 11, 
        "quote": "", 
        "reply": "[/QUOTE]You might want to look up the word \"proof\".[/QUOTE] Proof-evidence sufficient to establish a thing as true, or to produce belief in its truth. Well, the article I posted from the LA Times pretty much provides proof. Unless you can produce an article from a valid, reputable source that states that the Obama administration hasn't continued the policy of rendition. So, how do you reconcile the use of rendition, even the possible expansion as stated in the article (because our intelligence capabilities were diminished by the release of the \"torture\" memos), by the current administration?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:17:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "intTime": 20090520, 
        "postID": 12, 
        "quote": "pretty much provides proof.", 
        "reply": " Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:34:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "reply": " The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:39:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "reply": "Okay, okay....let me give you a hand here...  So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects... Very well said!", 
        "intTime": 20090520, 
        "postID": 15, 
        "quote": "Originally posted by strobelvets: Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "reply": " Very well said!", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:44:00", 
        "title": "Reconciling Rendition", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited.", 
        "intTime": 20090520, 
        "postID": 16, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "reply": " There was a lot more than regs sited.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:46:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited. Doesn't matter. If it's done in secret, the only ones that know are the ones that ordered it, in this case, President Obama, down a straight chain of command to the ones that execute the mission. Regs don't matter in black ops. That's why they call them \"black ops\".", 
        "intTime": 20090520, 
        "postID": 17, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited.", 
        "reply": " Doesn't matter. If it's done in secret, the only ones that know are the ones that ordered it, in this case, President Obama, down a straight chain of command to the ones that execute the mission. Regs don't matter in black ops. That's why they call them \"black ops\".", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:20:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Here, read this again: quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "intTime": 20090520, 
        "postID": 18, 
        "quote": "Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "reply": "Here, read this again: ", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:21:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome! Breaking your message down to 5th grade reading level still won't get the LIBs to accept the truth, \"their minds are made up...\" This one is a \"Hung Jumper\" . . ., cut the line, let'em go . . .", 
        "intTime": 20090520, 
        "postID": 19, 
        "quote": "Originally posted by psychoABN: Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "reply": " Breaking your message down to 5th grade reading level still won't get the LIBs to accept the truth, \"their minds are made up...\" This one is a \"Hung Jumper\" . . ., cut the line, let'em go . . .", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:30:00", 
        "title": "Reconciling Rendition", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "intTime": 20090520, 
        "postID": 20, 
        "quote": "", 
        "reply": "I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:36:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "intTime": 20090520, 
        "postID": 21, 
        "quote": "Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "reply": " There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "intTime": 20090520, 
        "postID": 22, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "reply": " That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:56:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "intTime": 20090520, 
        "postID": 23, 
        "quote": "", 
        "reply": "It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:25:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The bleeding hearts will never take National Security away from the GOP, its just not in their nature to be tuff, too many sissys on their side with utopian views of the world..", 
        "intTime": 20090520, 
        "postID": 24, 
        "quote": "", 
        "reply": "The bleeding hearts will never take National Security away from the GOP, its just not in their nature to be tuff, too many sissys on their side with utopian views of the world..", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:28:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet.... IRS, you know you are pizzing off the devout LIBs, you know that... you are trying to humanize PO, all the while his faithful followers see him in a much higher sense of \"the all knowing\" and an answer to their feeble existence... The ONE cannot possibly error, or think as the devil BUSH had thought . . .", 
        "intTime": 20090520, 
        "postID": 25, 
        "quote": "Originally posted by Irwin_R_Schyster: It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "reply": " IRS, you know you are pizzing off the devout LIBs, you know that... you are trying to humanize PO, all the while his faithful followers see him in a much higher sense of \"the all knowing\" and an answer to their feeble existence... The ONE cannot possibly error, or think as the devil BUSH had thought . . .", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:33:00", 
        "title": "Reconciling Rendition", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "The Rendition program is necessary to winning the type of war America is fighting today because the enemy does not fight as a regular army. The planners who radicalize Muslims to become suicide bombers do not go onto a battlefield. The operational/logistic people do not expose themselves to the violent acts that al Qaeda carries out. But these people need to be captured or killed to win the war against them. There are legal ways to carry out the rendition program, President Obama has ordered his people to find a way to carry out this program legally. President Bush and his crew were not always concerned about legalities and ended up getting CIA agents indicted by foreign governments and kidnapping innocent people by mistake with their version of the extraordinary rendition program. President Obama can authorize a rendition program that is NOT the same as the Bush era rendition program, but is legal. Examples of legal rendition – Mir Aimal Kasi killed CIA employees in 1993 while they were at a stop light on their way to CIA headquarters. At 4 a.m. on the morning of June 15, 1997, an armed team of FBI agents, working with the Pakistani ISI, raided Kasi's hotel room. His fingerprints were taken on the scene, confirming his identity. There is some dispute over where Kasi was taken next—US authorities claim it was a holding facility run by Pakistani authorities, while Pakistani sources claim it was the US embassy in Islamabad — before being flown to the US on June 17 in a C-141 transport. During the flight, Kasi made a full oral and written confession to the FBI without being tortured. Kasi's extrajudicial rendition was controversial in Pakistan—no formal request for his extradition was made, and no extradition proceedings were initiated. US authorities would later assert the rendition was legal under an extradition treaty signed with the UK, before Partition when India was under colonial rule. Kasi argued against his rendition in court but his assertions were found to have no basis in law. The Court wrote: …the treaty between the United States and Pakistan contains no provision that bars forcible abductions, nor does it otherwise 'purport to specify the only way in which one country may gain custody of a national of the other country for the purposes of prosecution.' Id. at 664 (emphasis added). Nor does the treaty provide that, once a request for extradition is made, the procedures outlined in the treaty become the sole means of transferring custody of a suspected criminal from one country to the other. Finally, because Kasi was not returned to the United States via extradition proceedings initiated under the Extradition Treaty between the United States and Pakistan, Kasi's reliance upon United States v. Rauscher does not avail him Kasi was executed by lethal injection on November 14, 2002. On February 7, 1995, Pakistani intelligence and U.S. Bureau of Diplomatic Security Special Agents Bill Miller and Jeff Riner captured Ramzi Ahmed Yousefin Islamabad, Pakistan. Yousef was flown back to the United States where he was convicted of the 1993 bombing of the North Tower of the World Trade Center. This dangerous terrorist, who is the nephew of 9/11 master mind, Khalid Shaikh Mohammed is serving a life sentence in an American prison. On March 1, 2003, the Pakistani Inter-Services Intelligence reported that they had captured Khalid Shaikh Mohammed in a raid in Rawalpindi, Pakistan in a joint raid with the CIA's Special Activities Division paramilitary operatives. Following the report of the capture, some Pakistani officials say he was immediately transferred to U.S. custody without extradition proceedings, while others said he remained in Pakistani custody. Where the rendition became illegal - he was not transported to the United States or to a declared detention center but was sent to a secret prison – which is a violation of international law. Secret prisons were outlawed by the international community after WWII because the Nazis used to make people disappear without their families or local authorities being informed of the person's situation.", 
        "intTime": 20090520, 
        "postID": 26, 
        "quote": "", 
        "reply": "The Rendition program is necessary to winning the type of war America is fighting today because the enemy does not fight as a regular army. The planners who radicalize Muslims to become suicide bombers do not go onto a battlefield. The operational/logistic people do not expose themselves to the violent acts that al Qaeda carries out. But these people need to be captured or killed to win the war against them. There are legal ways to carry out the rendition program, President Obama has ordered his people to find a way to carry out this program legally. President Bush and his crew were not always concerned about legalities and ended up getting CIA agents indicted by foreign governments and kidnapping innocent people by mistake with their version of the extraordinary rendition program. President Obama can authorize a rendition program that is NOT the same as the Bush era rendition program, but is legal. Examples of legal rendition – Mir Aimal Kasi killed CIA employees in 1993 while they were at a stop light on their way to CIA headquarters. At 4 a.m. on the morning of June 15, 1997, an armed team of FBI agents, working with the Pakistani ISI, raided Kasi's hotel room. His fingerprints were taken on the scene, confirming his identity. There is some dispute over where Kasi was taken next—US authorities claim it was a holding facility run by Pakistani authorities, while Pakistani sources claim it was the US embassy in Islamabad — before being flown to the US on June 17 in a C-141 transport. During the flight, Kasi made a full oral and written confession to the FBI without being tortured. Kasi's extrajudicial rendition was controversial in Pakistan—no formal request for his extradition was made, and no extradition proceedings were initiated. US authorities would later assert the rendition was legal under an extradition treaty signed with the UK, before Partition when India was under colonial rule. Kasi argued against his rendition in court but his assertions were found to have no basis in law. The Court wrote: …the treaty between the United States and Pakistan contains no provision that bars forcible abductions, nor does it otherwise 'purport to specify the only way in which one country may gain custody of a national of the other country for the purposes of prosecution.' Id. at 664 (emphasis added). Nor does the treaty provide that, once a request for extradition is made, the procedures outlined in the treaty become the sole means of transferring custody of a suspected criminal from one country to the other. Finally, because Kasi was not returned to the United States via extradition proceedings initiated under the Extradition Treaty between the United States and Pakistan, Kasi's reliance upon United States v. Rauscher does not avail him Kasi was executed by lethal injection on November 14, 2002. On February 7, 1995, Pakistani intelligence and U.S. Bureau of Diplomatic Security Special Agents Bill Miller and Jeff Riner captured Ramzi Ahmed Yousefin Islamabad, Pakistan. Yousef was flown back to the United States where he was convicted of the 1993 bombing of the North Tower of the World Trade Center. This dangerous terrorist, who is the nephew of 9/11 master mind, Khalid Shaikh Mohammed is serving a life sentence in an American prison. On March 1, 2003, the Pakistani Inter-Services Intelligence reported that they had captured Khalid Shaikh Mohammed in a raid in Rawalpindi, Pakistan in a joint raid with the CIA's Special Activities Division paramilitary operatives. Following the report of the capture, some Pakistani officials say he was immediately transferred to U.S. custody without extradition proceedings, while others said he remained in Pakistani custody. Where the rendition became illegal - he was not transported to the United States or to a declared detention center but was sent to a secret prison – which is a violation of international law. Secret prisons were outlawed by the international community after WWII because the Nazis used to make people disappear without their families or local authorities being informed of the person's situation.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:42:00", 
        "title": "Reconciling Rendition", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "intTime": 20090520, 
        "postID": 27, 
        "quote": "The ONE cannot possibly error, or think as the devil BUSH had thought . .", 
        "reply": " One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:44:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it... How many detainees have been renditioned under Obama's watch?", 
        "intTime": 20090520, 
        "postID": 28, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "reply": " How many detainees have been renditioned under Obama's watch?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:59:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform. Sorry but President Obama has just trashed the GOP in that particular area. Do your research.", 
        "intTime": 20090520, 
        "postID": 29, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "reply": " Sorry but President Obama has just trashed the GOP in that particular area. Do your research.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 23:01:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "intTime": 20090520, 
        "postID": 30, 
        "quote": "", 
        "reply": "So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 17:39:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "intTime": 20090520, 
        "postID": 31, 
        "quote": "", 
        "reply": "Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 17:54:00", 
        "title": "Reconciling Rendition", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "intTime": 20090520, 
        "postID": 32, 
        "quote": "", 
        "reply": "Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:23:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction? That's a good question but we have to remind ourselves that within the past several months we ARE living in a different world. Prepare yourself. My whole heart goes out to those in uniform who are there with sincere intentions to be part of ensuring our freedom. But .... they lack the backing of the new administration. I'm so sad and sorry about that. More than anything else, my heart goes out to them. They are young men and women who don't deserve this. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090520, 
        "postID": 33, 
        "quote": "Originally posted by psychoABN: So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "reply": " That's a good question but we have to remind ourselves that within the past several months we ARE living in a different world. Prepare yourself. My whole heart goes out to those in uniform who are there with sincere intentions to be part of ensuring our freedom. But .... they lack the backing of the new administration. I'm so sad and sorry about that. More than anything else, my heart goes out to them. They are young men and women who don't deserve this. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:32:00", 
        "title": "Reconciling Rendition", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "intTime": 20090520, 
        "postID": 34, 
        "quote": "Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "reply": " I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "intTime": 20090520, 
        "postID": 35, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "reply": " Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:51:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "From the LA Times: Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 The CIA's secret prisons are being shuttered. Harsh interrogation techniques are off-limits. And Guantanamo Bay will eventually go back to being a wind-swept naval base on the southeastern corner of Cuba. But even while dismantling these programs, President Obama left intact an equally controversial counter-terrorism tool. Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. Current and former U.S. intelligence officials said that the rendition program might be poised to play an expanded role going forward because it was the main remaining mechanism -- aside from Predator missile strikes -- for taking suspected terrorists off the street. The rendition program became a source of embarrassment for the CIA, and a target of international scorn, as details emerged in recent years of botched captures, mistaken identities and allegations that prisoners were turned over to countries where they were tortured. The European Parliament condemned renditions as \"an illegal instrument used by the United States.\" Prisoners swept up in the program have sued the CIA as well as a Boeing Co. subsidiary accused of working with the agency on dozens of rendition flights. But the Obama administration appears to have determined that the rendition program was one component of the Bush administration's war on terrorism that it could not afford to discard. The decision underscores the fact that the battle with Al Qaeda and other terrorist groups is far from over and that even if the United States is shutting down the prisons, it is not done taking prisoners. \"Obviously you need to preserve some tools, you still have to go after the bad guys,\" said an Obama administration official, speaking on condition of anonymity when discussing the legal reasoning. \"The legal advisors working on this looked at rendition. It is controversial in some circles and kicked up a big storm in Europe. But if done within certain parameters, it is an acceptable practice.\" One provision in one of Obama's orders appears to preserve the CIA's ability to detain and interrogate terrorism suspects as long as they are not held long-term. The little-noticed provision states that the instructions to close the CIA's secret prison sites \"do not refer to facilities used only to hold people on a short-term, transitory basis.\" Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 Despite concern about rendition, Obama's prohibition against the use of most other counter-terrorism tools could prompt intelligence officers to resort more frequently to the \"transitory\" technique. The decision to preserve the program did not draw major protests, even among human rights groups. Leaders of such organizations said that reflected a sense that the United States and other nations needed certain tools to combat terrorism. \"Under limited circumstances, there is a legitimate place\" for renditions, said Tom Malinowski, the Washington advocacy director for Human Rights Watch. \"What I heard loud and clear from the president's order was that they want to design a system that doesn't result in people being sent to foreign dungeons to be tortured. But that designing that system is going to take some time.\" Malinowski said that he had urged the Obama administration to require that prisoners be transferred to other countries only when they would be guaranteed a public hearing in an official court. \"Producing a prisoner before a real court is a key safeguard against torture, abuse and disappearance,\" Malinowski said. CIA veterans involved in the rendition program said that it was an important capability, but used mainly for terrorism suspects not valuable enough for the agency to keep, and that the program was of limited use in gathering intelligence. \"The reason we did interrogations [ourselves] is because renditions for the most part weren't very productive,\" said a former senior CIA official who spoke on condition of anonymity because of the sensitive nature of the subject. The most valuable intelligence on Al Qaeda came from prisoners who were in CIA custody and questioned by agency experts, the official said. Once prisoners were turned over to other countries, such as Egypt and Jordan, the agency had limited ability to influence how much intelligence was shared, how prisoners were treated and whether they were later released. \"In some ways, [rendition] is the worst option,\" the former official said. \"If they are in U.S. hands, you have a lot of checks and balances, medics and lawyers. Once you turn them over to another service, you lose control.\" In his executive order on lawful interrogations, Obama created a task force to reexamine renditions to make sure that they \"do not result in the transfer of individuals to other nations to face torture,\" or otherwise circumvent human rights laws and treaties.", 
        "intTime": 20090520, 
        "postID": 36, 
        "quote": "", 
        "reply": "From the LA Times: Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 The CIA's secret prisons are being shuttered. Harsh interrogation techniques are off-limits. And Guantanamo Bay will eventually go back to being a wind-swept naval base on the southeastern corner of Cuba. But even while dismantling these programs, President Obama left intact an equally controversial counter-terrorism tool. Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. Current and former U.S. intelligence officials said that the rendition program might be poised to play an expanded role going forward because it was the main remaining mechanism -- aside from Predator missile strikes -- for taking suspected terrorists off the street. The rendition program became a source of embarrassment for the CIA, and a target of international scorn, as details emerged in recent years of botched captures, mistaken identities and allegations that prisoners were turned over to countries where they were tortured. The European Parliament condemned renditions as \"an illegal instrument used by the United States.\" Prisoners swept up in the program have sued the CIA as well as a Boeing Co. subsidiary accused of working with the agency on dozens of rendition flights. But the Obama administration appears to have determined that the rendition program was one component of the Bush administration's war on terrorism that it could not afford to discard. The decision underscores the fact that the battle with Al Qaeda and other terrorist groups is far from over and that even if the United States is shutting down the prisons, it is not done taking prisoners. \"Obviously you need to preserve some tools, you still have to go after the bad guys,\" said an Obama administration official, speaking on condition of anonymity when discussing the legal reasoning. \"The legal advisors working on this looked at rendition. It is controversial in some circles and kicked up a big storm in Europe. But if done within certain parameters, it is an acceptable practice.\" One provision in one of Obama's orders appears to preserve the CIA's ability to detain and interrogate terrorism suspects as long as they are not held long-term. The little-noticed provision states that the instructions to close the CIA's secret prison sites \"do not refer to facilities used only to hold people on a short-term, transitory basis.\" Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 Despite concern about rendition, Obama's prohibition against the use of most other counter-terrorism tools could prompt intelligence officers to resort more frequently to the \"transitory\" technique. The decision to preserve the program did not draw major protests, even among human rights groups. Leaders of such organizations said that reflected a sense that the United States and other nations needed certain tools to combat terrorism. \"Under limited circumstances, there is a legitimate place\" for renditions, said Tom Malinowski, the Washington advocacy director for Human Rights Watch. \"What I heard loud and clear from the president's order was that they want to design a system that doesn't result in people being sent to foreign dungeons to be tortured. But that designing that system is going to take some time.\" Malinowski said that he had urged the Obama administration to require that prisoners be transferred to other countries only when they would be guaranteed a public hearing in an official court. \"Producing a prisoner before a real court is a key safeguard against torture, abuse and disappearance,\" Malinowski said. CIA veterans involved in the rendition program said that it was an important capability, but used mainly for terrorism suspects not valuable enough for the agency to keep, and that the program was of limited use in gathering intelligence. \"The reason we did interrogations [ourselves] is because renditions for the most part weren't very productive,\" said a former senior CIA official who spoke on condition of anonymity because of the sensitive nature of the subject. The most valuable intelligence on Al Qaeda came from prisoners who were in CIA custody and questioned by agency experts, the official said. Once prisoners were turned over to other countries, such as Egypt and Jordan, the agency had limited ability to influence how much intelligence was shared, how prisoners were treated and whether they were later released. \"In some ways, [rendition] is the worst option,\" the former official said. \"If they are in U.S. hands, you have a lot of checks and balances, medics and lawyers. Once you turn them over to another service, you lose control.\" In his executive order on lawful interrogations, Obama created a task force to reexamine renditions to make sure that they \"do not result in the transfer of individuals to other nations to face torture,\" or otherwise circumvent human rights laws and treaties.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:57:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof? You might want to look up the word \"proof\".", 
        "intTime": 20090520, 
        "postID": 37, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "reply": " You might want to look up the word \"proof\".", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:05:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "According to the article above, the most intelligence was collected when the detainees remained in CIA control. Perhaps using the EITs, perhaps not. But, now that the interrogation memos were released, the enemy knows that nothing much will happen to them, so that option is ruined. We still have rendition though, which isn't as effective as far as gathering intelligence, and will probably result in the detainees actually being tortured with no medics present to tend to their medical needs, no lawyers present to tell the interrogators to back off if they start to cross the line, none of that. Seems a$$ backwards to me. So much for the \"smart power\" tht was touted during the election, doesn't seem too smart to me.", 
        "intTime": 20090520, 
        "postID": 38, 
        "quote": "", 
        "reply": "According to the article above, the most intelligence was collected when the detainees remained in CIA control. Perhaps using the EITs, perhaps not. But, now that the interrogation memos were released, the enemy knows that nothing much will happen to them, so that option is ruined. We still have rendition though, which isn't as effective as far as gathering intelligence, and will probably result in the detainees actually being tortured with no medics present to tend to their medical needs, no lawyers present to tell the interrogators to back off if they start to cross the line, none of that. Seems a$$ backwards to me. So much for the \"smart power\" tht was touted during the election, doesn't seem too smart to me.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:08:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Remove the hot link... It snuck in. Who me? Where? I'll take it out...", 
        "intTime": 20090520, 
        "postID": 39, 
        "quote": "Originally posted by klassylady25: Remove the hot link... It snuck in.", 
        "reply": " Who me? Where? I'll take it out...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:09:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "[/QUOTE]You might want to look up the word \"proof\".[/QUOTE] Proof-evidence sufficient to establish a thing as true, or to produce belief in its truth. Well, the article I posted from the LA Times pretty much provides proof. Unless you can produce an article from a valid, reputable source that states that the Obama administration hasn't continued the policy of rendition. So, how do you reconcile the use of rendition, even the possible expansion as stated in the article (because our intelligence capabilities were diminished by the release of the \"torture\" memos), by the current administration?", 
        "intTime": 20090520, 
        "postID": 40, 
        "quote": "", 
        "reply": "[/QUOTE]You might want to look up the word \"proof\".[/QUOTE] Proof-evidence sufficient to establish a thing as true, or to produce belief in its truth. Well, the article I posted from the LA Times pretty much provides proof. Unless you can produce an article from a valid, reputable source that states that the Obama administration hasn't continued the policy of rendition. So, how do you reconcile the use of rendition, even the possible expansion as stated in the article (because our intelligence capabilities were diminished by the release of the \"torture\" memos), by the current administration?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:17:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "intTime": 20090520, 
        "postID": 41, 
        "quote": "pretty much provides proof.", 
        "reply": " Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:34:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "intTime": 20090520, 
        "postID": 42, 
        "quote": "Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "reply": " The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:39:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "intTime": 20090520, 
        "postID": 43, 
        "quote": "Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "reply": "Okay, okay....let me give you a hand here...  So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects... Very well said!", 
        "intTime": 20090520, 
        "postID": 44, 
        "quote": "Originally posted by strobelvets: Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "reply": " Very well said!", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:44:00", 
        "title": "Reconciling Rendition", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited.", 
        "intTime": 20090520, 
        "postID": 45, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "reply": " There was a lot more than regs sited.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:46:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited. Doesn't matter. If it's done in secret, the only ones that know are the ones that ordered it, in this case, President Obama, down a straight chain of command to the ones that execute the mission. Regs don't matter in black ops. That's why they call them \"black ops\".", 
        "intTime": 20090520, 
        "postID": 46, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited.", 
        "reply": " Doesn't matter. If it's done in secret, the only ones that know are the ones that ordered it, in this case, President Obama, down a straight chain of command to the ones that execute the mission. Regs don't matter in black ops. That's why they call them \"black ops\".", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:20:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Here, read this again: quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "intTime": 20090520, 
        "postID": 47, 
        "quote": "Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "reply": "Here, read this again: ", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:21:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome! Breaking your message down to 5th grade reading level still won't get the LIBs to accept the truth, \"their minds are made up...\" This one is a \"Hung Jumper\" . . ., cut the line, let'em go . . .", 
        "intTime": 20090520, 
        "postID": 48, 
        "quote": "Originally posted by psychoABN: Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "reply": " Breaking your message down to 5th grade reading level still won't get the LIBs to accept the truth, \"their minds are made up...\" This one is a \"Hung Jumper\" . . ., cut the line, let'em go . . .", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:30:00", 
        "title": "Reconciling Rendition", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "intTime": 20090520, 
        "postID": 49, 
        "quote": "", 
        "reply": "I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:36:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "intTime": 20090520, 
        "postID": 50, 
        "quote": "Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "reply": " There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "intTime": 20090520, 
        "postID": 51, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "reply": " That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:56:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "intTime": 20090520, 
        "postID": 52, 
        "quote": "", 
        "reply": "It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:25:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The bleeding hearts will never take National Security away from the GOP, its just not in their nature to be tuff, too many sissys on their side with utopian views of the world..", 
        "intTime": 20090520, 
        "postID": 53, 
        "quote": "", 
        "reply": "The bleeding hearts will never take National Security away from the GOP, its just not in their nature to be tuff, too many sissys on their side with utopian views of the world..", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:28:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet.... IRS, you know you are pizzing off the devout LIBs, you know that... you are trying to humanize PO, all the while his faithful followers see him in a much higher sense of \"the all knowing\" and an answer to their feeble existence... The ONE cannot possibly error, or think as the devil BUSH had thought . . .", 
        "intTime": 20090520, 
        "postID": 54, 
        "quote": "Originally posted by Irwin_R_Schyster: It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "reply": " IRS, you know you are pizzing off the devout LIBs, you know that... you are trying to humanize PO, all the while his faithful followers see him in a much higher sense of \"the all knowing\" and an answer to their feeble existence... The ONE cannot possibly error, or think as the devil BUSH had thought . . .", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:33:00", 
        "title": "Reconciling Rendition", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "The Rendition program is necessary to winning the type of war America is fighting today because the enemy does not fight as a regular army. The planners who radicalize Muslims to become suicide bombers do not go onto a battlefield. The operational/logistic people do not expose themselves to the violent acts that al Qaeda carries out. But these people need to be captured or killed to win the war against them. There are legal ways to carry out the rendition program, President Obama has ordered his people to find a way to carry out this program legally. President Bush and his crew were not always concerned about legalities and ended up getting CIA agents indicted by foreign governments and kidnapping innocent people by mistake with their version of the extraordinary rendition program. President Obama can authorize a rendition program that is NOT the same as the Bush era rendition program, but is legal. Examples of legal rendition – Mir Aimal Kasi killed CIA employees in 1993 while they were at a stop light on their way to CIA headquarters. At 4 a.m. on the morning of June 15, 1997, an armed team of FBI agents, working with the Pakistani ISI, raided Kasi's hotel room. His fingerprints were taken on the scene, confirming his identity. There is some dispute over where Kasi was taken next—US authorities claim it was a holding facility run by Pakistani authorities, while Pakistani sources claim it was the US embassy in Islamabad — before being flown to the US on June 17 in a C-141 transport. During the flight, Kasi made a full oral and written confession to the FBI without being tortured. Kasi's extrajudicial rendition was controversial in Pakistan—no formal request for his extradition was made, and no extradition proceedings were initiated. US authorities would later assert the rendition was legal under an extradition treaty signed with the UK, before Partition when India was under colonial rule. Kasi argued against his rendition in court but his assertions were found to have no basis in law. The Court wrote: …the treaty between the United States and Pakistan contains no provision that bars forcible abductions, nor does it otherwise 'purport to specify the only way in which one country may gain custody of a national of the other country for the purposes of prosecution.' Id. at 664 (emphasis added). Nor does the treaty provide that, once a request for extradition is made, the procedures outlined in the treaty become the sole means of transferring custody of a suspected criminal from one country to the other. Finally, because Kasi was not returned to the United States via extradition proceedings initiated under the Extradition Treaty between the United States and Pakistan, Kasi's reliance upon United States v. Rauscher does not avail him Kasi was executed by lethal injection on November 14, 2002. On February 7, 1995, Pakistani intelligence and U.S. Bureau of Diplomatic Security Special Agents Bill Miller and Jeff Riner captured Ramzi Ahmed Yousefin Islamabad, Pakistan. Yousef was flown back to the United States where he was convicted of the 1993 bombing of the North Tower of the World Trade Center. This dangerous terrorist, who is the nephew of 9/11 master mind, Khalid Shaikh Mohammed is serving a life sentence in an American prison. On March 1, 2003, the Pakistani Inter-Services Intelligence reported that they had captured Khalid Shaikh Mohammed in a raid in Rawalpindi, Pakistan in a joint raid with the CIA's Special Activities Division paramilitary operatives. Following the report of the capture, some Pakistani officials say he was immediately transferred to U.S. custody without extradition proceedings, while others said he remained in Pakistani custody. Where the rendition became illegal - he was not transported to the United States or to a declared detention center but was sent to a secret prison – which is a violation of international law. Secret prisons were outlawed by the international community after WWII because the Nazis used to make people disappear without their families or local authorities being informed of the person's situation.", 
        "intTime": 20090520, 
        "postID": 55, 
        "quote": "", 
        "reply": "The Rendition program is necessary to winning the type of war America is fighting today because the enemy does not fight as a regular army. The planners who radicalize Muslims to become suicide bombers do not go onto a battlefield. The operational/logistic people do not expose themselves to the violent acts that al Qaeda carries out. But these people need to be captured or killed to win the war against them. There are legal ways to carry out the rendition program, President Obama has ordered his people to find a way to carry out this program legally. President Bush and his crew were not always concerned about legalities and ended up getting CIA agents indicted by foreign governments and kidnapping innocent people by mistake with their version of the extraordinary rendition program. President Obama can authorize a rendition program that is NOT the same as the Bush era rendition program, but is legal. Examples of legal rendition – Mir Aimal Kasi killed CIA employees in 1993 while they were at a stop light on their way to CIA headquarters. At 4 a.m. on the morning of June 15, 1997, an armed team of FBI agents, working with the Pakistani ISI, raided Kasi's hotel room. His fingerprints were taken on the scene, confirming his identity. There is some dispute over where Kasi was taken next—US authorities claim it was a holding facility run by Pakistani authorities, while Pakistani sources claim it was the US embassy in Islamabad — before being flown to the US on June 17 in a C-141 transport. During the flight, Kasi made a full oral and written confession to the FBI without being tortured. Kasi's extrajudicial rendition was controversial in Pakistan—no formal request for his extradition was made, and no extradition proceedings were initiated. US authorities would later assert the rendition was legal under an extradition treaty signed with the UK, before Partition when India was under colonial rule. Kasi argued against his rendition in court but his assertions were found to have no basis in law. The Court wrote: …the treaty between the United States and Pakistan contains no provision that bars forcible abductions, nor does it otherwise 'purport to specify the only way in which one country may gain custody of a national of the other country for the purposes of prosecution.' Id. at 664 (emphasis added). Nor does the treaty provide that, once a request for extradition is made, the procedures outlined in the treaty become the sole means of transferring custody of a suspected criminal from one country to the other. Finally, because Kasi was not returned to the United States via extradition proceedings initiated under the Extradition Treaty between the United States and Pakistan, Kasi's reliance upon United States v. Rauscher does not avail him Kasi was executed by lethal injection on November 14, 2002. On February 7, 1995, Pakistani intelligence and U.S. Bureau of Diplomatic Security Special Agents Bill Miller and Jeff Riner captured Ramzi Ahmed Yousefin Islamabad, Pakistan. Yousef was flown back to the United States where he was convicted of the 1993 bombing of the North Tower of the World Trade Center. This dangerous terrorist, who is the nephew of 9/11 master mind, Khalid Shaikh Mohammed is serving a life sentence in an American prison. On March 1, 2003, the Pakistani Inter-Services Intelligence reported that they had captured Khalid Shaikh Mohammed in a raid in Rawalpindi, Pakistan in a joint raid with the CIA's Special Activities Division paramilitary operatives. Following the report of the capture, some Pakistani officials say he was immediately transferred to U.S. custody without extradition proceedings, while others said he remained in Pakistani custody. Where the rendition became illegal - he was not transported to the United States or to a declared detention center but was sent to a secret prison – which is a violation of international law. Secret prisons were outlawed by the international community after WWII because the Nazis used to make people disappear without their families or local authorities being informed of the person's situation.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:42:00", 
        "title": "Reconciling Rendition", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "intTime": 20090520, 
        "postID": 56, 
        "quote": "The ONE cannot possibly error, or think as the devil BUSH had thought . .", 
        "reply": " One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:44:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it... How many detainees have been renditioned under Obama's watch?", 
        "intTime": 20090520, 
        "postID": 57, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "reply": " How many detainees have been renditioned under Obama's watch?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:59:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform. Sorry but President Obama has just trashed the GOP in that particular area. Do your research.", 
        "intTime": 20090520, 
        "postID": 58, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "reply": " Sorry but President Obama has just trashed the GOP in that particular area. Do your research.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 23:01:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "intTime": 20090520, 
        "postID": 59, 
        "quote": "", 
        "reply": "So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 17:39:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "intTime": 20090520, 
        "postID": 60, 
        "quote": "", 
        "reply": "Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 17:54:00", 
        "title": "Reconciling Rendition", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "intTime": 20090520, 
        "postID": 61, 
        "quote": "", 
        "reply": "Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:23:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction? That's a good question but we have to remind ourselves that within the past several months we ARE living in a different world. Prepare yourself. My whole heart goes out to those in uniform who are there with sincere intentions to be part of ensuring our freedom. But .... they lack the backing of the new administration. I'm so sad and sorry about that. More than anything else, my heart goes out to them. They are young men and women who don't deserve this. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090520, 
        "postID": 62, 
        "quote": "Originally posted by psychoABN: So, President Obama issues an executive order stating that we, the United States, will not torture. However, he leaves rendition in place, with which we turn detainees over to another country, and we let them do the torturing for us, and they don't just waterboard, they do the real deal. How exactly is that reconciled, it seems a contridiction to me. Seriously, these other countries torture to the point of permanently scaring and maiming, and the left is getting their panties in a wad over pouring some water down the nose. This is the current Obama administration policy, how does the left reconcile this contradiction?", 
        "reply": " That's a good question but we have to remind ourselves that within the past several months we ARE living in a different world. Prepare yourself. My whole heart goes out to those in uniform who are there with sincere intentions to be part of ensuring our freedom. But .... they lack the backing of the new administration. I'm so sad and sorry about that. More than anything else, my heart goes out to them. They are young men and women who don't deserve this. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:32:00", 
        "title": "Reconciling Rendition", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "intTime": 20090520, 
        "postID": 63, 
        "quote": "Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions.", 
        "reply": " I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "intTime": 20090520, 
        "postID": 64, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer.", 
        "reply": " Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:51:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "From the LA Times: Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 The CIA's secret prisons are being shuttered. Harsh interrogation techniques are off-limits. And Guantanamo Bay will eventually go back to being a wind-swept naval base on the southeastern corner of Cuba. But even while dismantling these programs, President Obama left intact an equally controversial counter-terrorism tool. Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. Current and former U.S. intelligence officials said that the rendition program might be poised to play an expanded role going forward because it was the main remaining mechanism -- aside from Predator missile strikes -- for taking suspected terrorists off the street. The rendition program became a source of embarrassment for the CIA, and a target of international scorn, as details emerged in recent years of botched captures, mistaken identities and allegations that prisoners were turned over to countries where they were tortured. The European Parliament condemned renditions as \"an illegal instrument used by the United States.\" Prisoners swept up in the program have sued the CIA as well as a Boeing Co. subsidiary accused of working with the agency on dozens of rendition flights. But the Obama administration appears to have determined that the rendition program was one component of the Bush administration's war on terrorism that it could not afford to discard. The decision underscores the fact that the battle with Al Qaeda and other terrorist groups is far from over and that even if the United States is shutting down the prisons, it is not done taking prisoners. \"Obviously you need to preserve some tools, you still have to go after the bad guys,\" said an Obama administration official, speaking on condition of anonymity when discussing the legal reasoning. \"The legal advisors working on this looked at rendition. It is controversial in some circles and kicked up a big storm in Europe. But if done within certain parameters, it is an acceptable practice.\" One provision in one of Obama's orders appears to preserve the CIA's ability to detain and interrogate terrorism suspects as long as they are not held long-term. The little-noticed provision states that the instructions to close the CIA's secret prison sites \"do not refer to facilities used only to hold people on a short-term, transitory basis.\" Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 Despite concern about rendition, Obama's prohibition against the use of most other counter-terrorism tools could prompt intelligence officers to resort more frequently to the \"transitory\" technique. The decision to preserve the program did not draw major protests, even among human rights groups. Leaders of such organizations said that reflected a sense that the United States and other nations needed certain tools to combat terrorism. \"Under limited circumstances, there is a legitimate place\" for renditions, said Tom Malinowski, the Washington advocacy director for Human Rights Watch. \"What I heard loud and clear from the president's order was that they want to design a system that doesn't result in people being sent to foreign dungeons to be tortured. But that designing that system is going to take some time.\" Malinowski said that he had urged the Obama administration to require that prisoners be transferred to other countries only when they would be guaranteed a public hearing in an official court. \"Producing a prisoner before a real court is a key safeguard against torture, abuse and disappearance,\" Malinowski said. CIA veterans involved in the rendition program said that it was an important capability, but used mainly for terrorism suspects not valuable enough for the agency to keep, and that the program was of limited use in gathering intelligence. \"The reason we did interrogations [ourselves] is because renditions for the most part weren't very productive,\" said a former senior CIA official who spoke on condition of anonymity because of the sensitive nature of the subject. The most valuable intelligence on Al Qaeda came from prisoners who were in CIA custody and questioned by agency experts, the official said. Once prisoners were turned over to other countries, such as Egypt and Jordan, the agency had limited ability to influence how much intelligence was shared, how prisoners were treated and whether they were later released. \"In some ways, [rendition] is the worst option,\" the former official said. \"If they are in U.S. hands, you have a lot of checks and balances, medics and lawyers. Once you turn them over to another service, you lose control.\" In his executive order on lawful interrogations, Obama created a task force to reexamine renditions to make sure that they \"do not result in the transfer of individuals to other nations to face torture,\" or otherwise circumvent human rights laws and treaties.", 
        "intTime": 20090520, 
        "postID": 65, 
        "quote": "", 
        "reply": "From the LA Times: Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 The CIA's secret prisons are being shuttered. Harsh interrogation techniques are off-limits. And Guantanamo Bay will eventually go back to being a wind-swept naval base on the southeastern corner of Cuba. But even while dismantling these programs, President Obama left intact an equally controversial counter-terrorism tool. Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. Current and former U.S. intelligence officials said that the rendition program might be poised to play an expanded role going forward because it was the main remaining mechanism -- aside from Predator missile strikes -- for taking suspected terrorists off the street. The rendition program became a source of embarrassment for the CIA, and a target of international scorn, as details emerged in recent years of botched captures, mistaken identities and allegations that prisoners were turned over to countries where they were tortured. The European Parliament condemned renditions as \"an illegal instrument used by the United States.\" Prisoners swept up in the program have sued the CIA as well as a Boeing Co. subsidiary accused of working with the agency on dozens of rendition flights. But the Obama administration appears to have determined that the rendition program was one component of the Bush administration's war on terrorism that it could not afford to discard. The decision underscores the fact that the battle with Al Qaeda and other terrorist groups is far from over and that even if the United States is shutting down the prisons, it is not done taking prisoners. \"Obviously you need to preserve some tools, you still have to go after the bad guys,\" said an Obama administration official, speaking on condition of anonymity when discussing the legal reasoning. \"The legal advisors working on this looked at rendition. It is controversial in some circles and kicked up a big storm in Europe. But if done within certain parameters, it is an acceptable practice.\" One provision in one of Obama's orders appears to preserve the CIA's ability to detain and interrogate terrorism suspects as long as they are not held long-term. The little-noticed provision states that the instructions to close the CIA's secret prison sites \"do not refer to facilities used only to hold people on a short-term, transitory basis.\" Obama preserves renditions as counter-terrorism tool The role of the CIA's controversial prisoner-transfer program may expand, intelligence experts say. By Greg Miller February 01, 2009 Despite concern about rendition, Obama's prohibition against the use of most other counter-terrorism tools could prompt intelligence officers to resort more frequently to the \"transitory\" technique. The decision to preserve the program did not draw major protests, even among human rights groups. Leaders of such organizations said that reflected a sense that the United States and other nations needed certain tools to combat terrorism. \"Under limited circumstances, there is a legitimate place\" for renditions, said Tom Malinowski, the Washington advocacy director for Human Rights Watch. \"What I heard loud and clear from the president's order was that they want to design a system that doesn't result in people being sent to foreign dungeons to be tortured. But that designing that system is going to take some time.\" Malinowski said that he had urged the Obama administration to require that prisoners be transferred to other countries only when they would be guaranteed a public hearing in an official court. \"Producing a prisoner before a real court is a key safeguard against torture, abuse and disappearance,\" Malinowski said. CIA veterans involved in the rendition program said that it was an important capability, but used mainly for terrorism suspects not valuable enough for the agency to keep, and that the program was of limited use in gathering intelligence. \"The reason we did interrogations [ourselves] is because renditions for the most part weren't very productive,\" said a former senior CIA official who spoke on condition of anonymity because of the sensitive nature of the subject. The most valuable intelligence on Al Qaeda came from prisoners who were in CIA custody and questioned by agency experts, the official said. Once prisoners were turned over to other countries, such as Egypt and Jordan, the agency had limited ability to influence how much intelligence was shared, how prisoners were treated and whether they were later released. \"In some ways, [rendition] is the worst option,\" the former official said. \"If they are in U.S. hands, you have a lot of checks and balances, medics and lawyers. Once you turn them over to another service, you lose control.\" In his executive order on lawful interrogations, Obama created a task force to reexamine renditions to make sure that they \"do not result in the transfer of individuals to other nations to face torture,\" or otherwise circumvent human rights laws and treaties.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 19:57:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof? You might want to look up the word \"proof\".", 
        "intTime": 20090520, 
        "postID": 66, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Come on, Lefites...How do you reconcile that President Obama declared \"torture\" illegal, yet has left renditon in place, and just let other countries do our dirty work for us, only much, much dirtier than we were actually doing it. To be realistic, we are still \"torturing\", only were not actually getting \"our\" hands dirty. That might take courage of convictions. I am pretty sure that EO Ensuring Lawful Interrogations, Section 6 prohibits extraordinary rendition: quote: Construction with Other Laws. Nothing in this order shall be construed to affect the obligations of officers, employees, and other agents of the United States Government to comply with all pertinent laws and treaties of the United States governing detention and interrogation, including but not limited to: the Fifth and Eighth Amendments to the United States Constitution; the Federal torture statute, 18 U.S.C. 2340-2340A; the War Crimes Act, 18 U.S.C. 2441; the Federal assault statute, 18 U.S.C. 113; the Federal maiming statute, 18 U.S.C. 114; the Federal \"stalking\" statute, 18 U.S.C. 2261A; articles 93, 124, 128, and 134 of the Uniform Code of Military Justice, 10 U.S.C. 893, 924, 928, and 934; section 1003 of the Detainee Treatment Act of 2005, 42 U.S.C. 2000dd; section 6(c) of the Military Commissions Act of 2006, Public Law 109?366; the Geneva Conventions; and the Convention Against Torture. But hey, I am not a lawyer. Oh no, full rendition is still in play. We still have the option to turn detainees over to, lets say Egypt, where they'll do a hell of a lot more than pouring water down their nose or giving them an open hand slap. Want proof?", 
        "reply": " You might want to look up the word \"proof\".", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:05:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "According to the article above, the most intelligence was collected when the detainees remained in CIA control. Perhaps using the EITs, perhaps not. But, now that the interrogation memos were released, the enemy knows that nothing much will happen to them, so that option is ruined. We still have rendition though, which isn't as effective as far as gathering intelligence, and will probably result in the detainees actually being tortured with no medics present to tend to their medical needs, no lawyers present to tell the interrogators to back off if they start to cross the line, none of that. Seems a$$ backwards to me. So much for the \"smart power\" tht was touted during the election, doesn't seem too smart to me.", 
        "intTime": 20090520, 
        "postID": 67, 
        "quote": "", 
        "reply": "According to the article above, the most intelligence was collected when the detainees remained in CIA control. Perhaps using the EITs, perhaps not. But, now that the interrogation memos were released, the enemy knows that nothing much will happen to them, so that option is ruined. We still have rendition though, which isn't as effective as far as gathering intelligence, and will probably result in the detainees actually being tortured with no medics present to tend to their medical needs, no lawyers present to tell the interrogators to back off if they start to cross the line, none of that. Seems a$$ backwards to me. So much for the \"smart power\" tht was touted during the election, doesn't seem too smart to me.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:08:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Remove the hot link... It snuck in. Who me? Where? I'll take it out...", 
        "intTime": 20090520, 
        "postID": 68, 
        "quote": "Originally posted by klassylady25: Remove the hot link... It snuck in.", 
        "reply": " Who me? Where? I'll take it out...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:09:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "[/QUOTE]You might want to look up the word \"proof\".[/QUOTE] Proof-evidence sufficient to establish a thing as true, or to produce belief in its truth. Well, the article I posted from the LA Times pretty much provides proof. Unless you can produce an article from a valid, reputable source that states that the Obama administration hasn't continued the policy of rendition. So, how do you reconcile the use of rendition, even the possible expansion as stated in the article (because our intelligence capabilities were diminished by the release of the \"torture\" memos), by the current administration?", 
        "intTime": 20090520, 
        "postID": 69, 
        "quote": "", 
        "reply": "[/QUOTE]You might want to look up the word \"proof\".[/QUOTE] Proof-evidence sufficient to establish a thing as true, or to produce belief in its truth. Well, the article I posted from the LA Times pretty much provides proof. Unless you can produce an article from a valid, reputable source that states that the Obama administration hasn't continued the policy of rendition. So, how do you reconcile the use of rendition, even the possible expansion as stated in the article (because our intelligence capabilities were diminished by the release of the \"torture\" memos), by the current administration?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:17:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "intTime": 20090520, 
        "postID": 70, 
        "quote": "pretty much provides proof.", 
        "reply": " Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:34:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "intTime": 20090520, 
        "postID": 71, 
        "quote": "Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny.", 
        "reply": " The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:39:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "intTime": 20090520, 
        "postID": 72, 
        "quote": "Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "reply": "Okay, okay....let me give you a hand here...  So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects... Very well said!", 
        "intTime": 20090520, 
        "postID": 73, 
        "quote": "Originally posted by strobelvets: Personally, Im not of the left or right...but I can say that I feel no remorse at Folks who send their children out to blow themselves up...or cut off the heads of innocent people... I do believe in a kinder, gentler Nation...but only as We the People are met in kind... Le them sow as they have reaped... In War, We the People must be prepared to meet the enemy...atrocity for atrocity...or be considered weak. The Fundamental issue is that it is nearly impossible for the secure and protected to fully comprehend the plight of the desperate and impoverished. So they cling to the rhetoric of blamemanship espoused by petty tyrants... The desperate will always blame the secure...and enlist to the endeavors of religious and/or despotic zealots who expound reforms on their behalf... Either cut off their access to educate later generations to the \"faith\"..or eradicate the exponents of terrorism in their entirety... Both time consuming prospects...", 
        "reply": " Very well said!", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:44:00", 
        "title": "Reconciling Rendition", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited.", 
        "intTime": 20090520, 
        "postID": 74, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article.", 
        "reply": " There was a lot more than regs sited.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 20:46:00", 
        "title": "Reconciling Rendition", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited. Doesn't matter. If it's done in secret, the only ones that know are the ones that ordered it, in this case, President Obama, down a straight chain of command to the ones that execute the mission. Regs don't matter in black ops. That's why they call them \"black ops\".", 
        "intTime": 20090520, 
        "postID": 75, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: quote: Originally posted by DMarkUhler: quote: pretty much provides proof. Pretty much? So you have a law degree and you have read all of the sited regs and laws in the EO? Or you just trust the LA Times... How funny. The regs have nothing to do with rendition. Once again, please do your reading, there's a very good explaination of rendition in the article. There was a lot more than regs sited.", 
        "reply": " Doesn't matter. If it's done in secret, the only ones that know are the ones that ordered it, in this case, President Obama, down a straight chain of command to the ones that execute the mission. Regs don't matter in black ops. That's why they call them \"black ops\".", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:20:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Here, read this again: quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "intTime": 20090520, 
        "postID": 76, 
        "quote": "Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States.", 
        "reply": "Here, read this again: ", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:21:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome! Breaking your message down to 5th grade reading level still won't get the LIBs to accept the truth, \"their minds are made up...\" This one is a \"Hung Jumper\" . . ., cut the line, let'em go . . .", 
        "intTime": 20090520, 
        "postID": 77, 
        "quote": "Originally posted by psychoABN: Okay, okay....let me give you a hand here... quote: Under executive orders issued by Obama recently, the CIA still has authority to carry out what are known as renditions, secret abductions and transfers of prisoners to countries that cooperate with the United States. So, it states that, by Executive Order,issued by President Obama himself, secret abductions and transfers of prisoners to countries that cooperate with the United States are in effect. If the abductions and transfers are in secret, those regs you quoted just don't apply. The guy just disappears. Your welcome!", 
        "reply": " Breaking your message down to 5th grade reading level still won't get the LIBs to accept the truth, \"their minds are made up...\" This one is a \"Hung Jumper\" . . ., cut the line, let'em go . . .", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:30:00", 
        "title": "Reconciling Rendition", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "intTime": 20090520, 
        "postID": 78, 
        "quote": "", 
        "reply": "I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:36:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "intTime": 20090520, 
        "postID": 79, 
        "quote": "Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that?", 
        "reply": " There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:43:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "intTime": 20090520, 
        "postID": 80, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining?", 
        "reply": " That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 21:56:00", 
        "title": "Reconciling Rendition", 
        "userID": "psychoABN"
    }, 
    {
        "content": "It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "intTime": 20090520, 
        "postID": 81, 
        "quote": "", 
        "reply": "It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:25:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The bleeding hearts will never take National Security away from the GOP, its just not in their nature to be tuff, too many sissys on their side with utopian views of the world..", 
        "intTime": 20090520, 
        "postID": 82, 
        "quote": "", 
        "reply": "The bleeding hearts will never take National Security away from the GOP, its just not in their nature to be tuff, too many sissys on their side with utopian views of the world..", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:28:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet.... IRS, you know you are pizzing off the devout LIBs, you know that... you are trying to humanize PO, all the while his faithful followers see him in a much higher sense of \"the all knowing\" and an answer to their feeble existence... The ONE cannot possibly error, or think as the devil BUSH had thought . . .", 
        "intTime": 20090520, 
        "postID": 83, 
        "quote": "Originally posted by Irwin_R_Schyster: It truly is remarkable how George W Bush is being vindicated by Liberal darling, President Obama. Rendition Guantanamo Bay Military Tribunals All reviled by liberals during the Bush Administration, but now perfectly acceptable in the Obama administration. This is encouraging, it really does seem like President Obama is atleast trying to keep this nation safe, and using virtually all of the techniques forged during the Bush administration... Dubyas legacy is not written in stone yet....", 
        "reply": " IRS, you know you are pizzing off the devout LIBs, you know that... you are trying to humanize PO, all the while his faithful followers see him in a much higher sense of \"the all knowing\" and an answer to their feeble existence... The ONE cannot possibly error, or think as the devil BUSH had thought . . .", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:33:00", 
        "title": "Reconciling Rendition", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "The Rendition program is necessary to winning the type of war America is fighting today because the enemy does not fight as a regular army. The planners who radicalize Muslims to become suicide bombers do not go onto a battlefield. The operational/logistic people do not expose themselves to the violent acts that al Qaeda carries out. But these people need to be captured or killed to win the war against them. There are legal ways to carry out the rendition program, President Obama has ordered his people to find a way to carry out this program legally. President Bush and his crew were not always concerned about legalities and ended up getting CIA agents indicted by foreign governments and kidnapping innocent people by mistake with their version of the extraordinary rendition program. President Obama can authorize a rendition program that is NOT the same as the Bush era rendition program, but is legal. Examples of legal rendition – Mir Aimal Kasi killed CIA employees in 1993 while they were at a stop light on their way to CIA headquarters. At 4 a.m. on the morning of June 15, 1997, an armed team of FBI agents, working with the Pakistani ISI, raided Kasi's hotel room. His fingerprints were taken on the scene, confirming his identity. There is some dispute over where Kasi was taken next—US authorities claim it was a holding facility run by Pakistani authorities, while Pakistani sources claim it was the US embassy in Islamabad — before being flown to the US on June 17 in a C-141 transport. During the flight, Kasi made a full oral and written confession to the FBI without being tortured. Kasi's extrajudicial rendition was controversial in Pakistan—no formal request for his extradition was made, and no extradition proceedings were initiated. US authorities would later assert the rendition was legal under an extradition treaty signed with the UK, before Partition when India was under colonial rule. Kasi argued against his rendition in court but his assertions were found to have no basis in law. The Court wrote: …the treaty between the United States and Pakistan contains no provision that bars forcible abductions, nor does it otherwise 'purport to specify the only way in which one country may gain custody of a national of the other country for the purposes of prosecution.' Id. at 664 (emphasis added). Nor does the treaty provide that, once a request for extradition is made, the procedures outlined in the treaty become the sole means of transferring custody of a suspected criminal from one country to the other. Finally, because Kasi was not returned to the United States via extradition proceedings initiated under the Extradition Treaty between the United States and Pakistan, Kasi's reliance upon United States v. Rauscher does not avail him Kasi was executed by lethal injection on November 14, 2002. On February 7, 1995, Pakistani intelligence and U.S. Bureau of Diplomatic Security Special Agents Bill Miller and Jeff Riner captured Ramzi Ahmed Yousefin Islamabad, Pakistan. Yousef was flown back to the United States where he was convicted of the 1993 bombing of the North Tower of the World Trade Center. This dangerous terrorist, who is the nephew of 9/11 master mind, Khalid Shaikh Mohammed is serving a life sentence in an American prison. On March 1, 2003, the Pakistani Inter-Services Intelligence reported that they had captured Khalid Shaikh Mohammed in a raid in Rawalpindi, Pakistan in a joint raid with the CIA's Special Activities Division paramilitary operatives. Following the report of the capture, some Pakistani officials say he was immediately transferred to U.S. custody without extradition proceedings, while others said he remained in Pakistani custody. Where the rendition became illegal - he was not transported to the United States or to a declared detention center but was sent to a secret prison – which is a violation of international law. Secret prisons were outlawed by the international community after WWII because the Nazis used to make people disappear without their families or local authorities being informed of the person's situation.", 
        "intTime": 20090520, 
        "postID": 84, 
        "quote": "", 
        "reply": "The Rendition program is necessary to winning the type of war America is fighting today because the enemy does not fight as a regular army. The planners who radicalize Muslims to become suicide bombers do not go onto a battlefield. The operational/logistic people do not expose themselves to the violent acts that al Qaeda carries out. But these people need to be captured or killed to win the war against them. There are legal ways to carry out the rendition program, President Obama has ordered his people to find a way to carry out this program legally. President Bush and his crew were not always concerned about legalities and ended up getting CIA agents indicted by foreign governments and kidnapping innocent people by mistake with their version of the extraordinary rendition program. President Obama can authorize a rendition program that is NOT the same as the Bush era rendition program, but is legal. Examples of legal rendition – Mir Aimal Kasi killed CIA employees in 1993 while they were at a stop light on their way to CIA headquarters. At 4 a.m. on the morning of June 15, 1997, an armed team of FBI agents, working with the Pakistani ISI, raided Kasi's hotel room. His fingerprints were taken on the scene, confirming his identity. There is some dispute over where Kasi was taken next—US authorities claim it was a holding facility run by Pakistani authorities, while Pakistani sources claim it was the US embassy in Islamabad — before being flown to the US on June 17 in a C-141 transport. During the flight, Kasi made a full oral and written confession to the FBI without being tortured. Kasi's extrajudicial rendition was controversial in Pakistan—no formal request for his extradition was made, and no extradition proceedings were initiated. US authorities would later assert the rendition was legal under an extradition treaty signed with the UK, before Partition when India was under colonial rule. Kasi argued against his rendition in court but his assertions were found to have no basis in law. The Court wrote: …the treaty between the United States and Pakistan contains no provision that bars forcible abductions, nor does it otherwise 'purport to specify the only way in which one country may gain custody of a national of the other country for the purposes of prosecution.' Id. at 664 (emphasis added). Nor does the treaty provide that, once a request for extradition is made, the procedures outlined in the treaty become the sole means of transferring custody of a suspected criminal from one country to the other. Finally, because Kasi was not returned to the United States via extradition proceedings initiated under the Extradition Treaty between the United States and Pakistan, Kasi's reliance upon United States v. Rauscher does not avail him Kasi was executed by lethal injection on November 14, 2002. On February 7, 1995, Pakistani intelligence and U.S. Bureau of Diplomatic Security Special Agents Bill Miller and Jeff Riner captured Ramzi Ahmed Yousefin Islamabad, Pakistan. Yousef was flown back to the United States where he was convicted of the 1993 bombing of the North Tower of the World Trade Center. This dangerous terrorist, who is the nephew of 9/11 master mind, Khalid Shaikh Mohammed is serving a life sentence in an American prison. On March 1, 2003, the Pakistani Inter-Services Intelligence reported that they had captured Khalid Shaikh Mohammed in a raid in Rawalpindi, Pakistan in a joint raid with the CIA's Special Activities Division paramilitary operatives. Following the report of the capture, some Pakistani officials say he was immediately transferred to U.S. custody without extradition proceedings, while others said he remained in Pakistani custody. Where the rendition became illegal - he was not transported to the United States or to a declared detention center but was sent to a secret prison – which is a violation of international law. Secret prisons were outlawed by the international community after WWII because the Nazis used to make people disappear without their families or local authorities being informed of the person's situation.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:42:00", 
        "title": "Reconciling Rendition", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "intTime": 20090520, 
        "postID": 85, 
        "quote": "The ONE cannot possibly error, or think as the devil BUSH had thought . .", 
        "reply": " One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:44:00", 
        "title": "Reconciling Rendition", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it... How many detainees have been renditioned under Obama's watch?", 
        "intTime": 20090520, 
        "postID": 86, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: I've yet to get a direct answer to my original question. How does the left reconcile the use of rendition by the Obama administration, where detainees are turned over to governments, like Egypt, Pakistan, Turkey, for interrogation? The interrogation tactics that these countries are severe, they maim and scar. The Obama administration has reatined this option, inspite of releasing the \"interrogation memos\", and in effect, drastically set back our ability to collect good intelligence because the enemy knows that nothing will happen to them. In effect, we're condoning more severe \"torture\" for high profile detainees than the EITs ever were. How does the left leaning mind reconcile that? There's nothing to reconcile. It's still there for a reason. Can you figure it out without a lot of wingnut whining? That's not a direct answer, and no one's whining...I leave that to the lefties. So, the current administration says no torture, that it's beneath dignity to do that, but detainees are turned over to governments that do torture, so the the detainees will be tortured to gain intelligence....In effect, the current administration tortures... indirectly. What's wrong, do you find the hypocrisy is getting under your skin? Come on, I'm too easy, remember? How do you explain the hypocrisy? Don't pull a Nancy Pelosi here, let's hear it...", 
        "reply": " How many detainees have been renditioned under Obama's watch?", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 22:59:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform. Sorry but President Obama has just trashed the GOP in that particular area. Do your research.", 
        "intTime": 20090520, 
        "postID": 87, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: The ONE cannot possibly error, or think as the devil BUSH had thought . . One thing is for sure, the lunatic fringe on the left is going to come out of the wood work on this...and when they do, BAM...The GOP is going to set up shop on the National Security platform.", 
        "reply": " Sorry but President Obama has just trashed the GOP in that particular area. Do your research.", 
        "threadID": "409192893_7890008322001", 
        "time": "2009-05-20 23:01:00", 
        "title": "Reconciling Rendition", 
        "userID": "Thud357L"
    }
]