[
    {
        "content": "quote: May 29, 2009 Associated Press WASHINGTON - The United States could fight an old-fashioned war against North Korea if necessary, even while newer forms of conflict against terrorists and extremists continue, the Army's top officer said Thursday. Asked whether the United States would be prepared to fight if war broke out between South Korea and North Korea, Gen. George Casey replied, \"The short answer is yes,\" then added that \"it would probably take us a little bit longer to shift gears\" away from the type of counterinsurgency fighting that now occupies the Army. Casey said his usual rubric for how long it would take the Army to gear up for a new \"conventional\" war is about 90 days. That doesn't mean it would take 90 days for the U.S. to effectively fight the North's million-man army, he said. I agree with the general in the sense that we have the best fighting force in the world that will respond when ordered too... Its refreshing to hear someone have faith in our Military.", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "May 29, 2009 Associated Press WASHINGTON - The United States could fight an old-fashioned war against North Korea if necessary, even while newer forms of conflict against terrorists and extremists continue, the Army's top officer said Thursday. Asked whether the United States would be prepared to fight if war broke out between South Korea and North Korea, Gen. George Casey replied, \"The short answer is yes,\" then added that \"it would probably take us a little bit longer to shift gears\" away from the type of counterinsurgency fighting that now occupies the Army. Casey said his usual rubric for how long it would take the Army to gear up for a new \"conventional\" war is about 90 days. That doesn't mean it would take 90 days for the U.S. to effectively fight the North's million-man army, he said.", 
        "reply": " I agree with the general in the sense that we have the best fighting force in the world that will respond when ordered too... Its refreshing to hear someone have faith in our Military.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 11:54:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "But can we afford to?", 
        "intTime": 20090529, 
        "postID": 2, 
        "quote": "", 
        "reply": "But can we afford to?", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 11:55:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: But can we afford to? Short answer: Yes.", 
        "intTime": 20090529, 
        "postID": 3, 
        "quote": "Originally posted by IHAWKER: But can we afford to?", 
        "reply": " Short answer: Yes.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 12:04:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: General Casey: We can fight North Korea. War is too important to be left to the generals. -Georges Clemenceau \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090529, 
        "postID": 4, 
        "quote": "General Casey: We can fight North Korea.", 
        "reply": " War is too important to be left to the generals. -Georges Clemenceau \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 12:13:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "NSNN"
    }, 
    {
        "content": "US can probably fight. But should it? Not unless Kim seriously Ill will attack first, which he will not. Leave Kim to China, and save yourself the trouble.", 
        "intTime": 20090529, 
        "postID": 5, 
        "quote": "", 
        "reply": "US can probably fight. But should it? Not unless Kim seriously Ill will attack first, which he will not. Leave Kim to China, and save yourself the trouble.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 13:31:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "I agree that we can fight NK...... and kick their azz to boot.... buuuuuuuut there be those fella's on the other side of the river that'll be showing up that bothers me. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090529, 
        "postID": 6, 
        "quote": "", 
        "reply": "I agree that we can fight NK...... and kick their azz to boot.... buuuuuuuut there be those fella's on the other side of the river that'll be showing up that bothers me. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 13:42:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: I agree that we can fight NK...... and kick their azz to boot.... buuuuuuuut there be those fella's on the other side of the river that'll be showing up that bothers me. Well, this is not 1951 and NK has been a thorn living right next door for quite sometime now. Time has changed and for China to stay within world affairs (they have too much to lose now) if NK starts anything, especially the release of a nuclear weapon, China would have their first opportunity to use one of theirs and I doubt if they would be condemned either.", 
        "intTime": 20090529, 
        "postID": 7, 
        "quote": "Originally posted by m551sheridan: I agree that we can fight NK...... and kick their azz to boot.... buuuuuuuut there be those fella's on the other side of the river that'll be showing up that bothers me.", 
        "reply": " Well, this is not 1951 and NK has been a thorn living right next door for quite sometime now. Time has changed and for China to stay within world affairs (they have too much to lose now) if NK starts anything, especially the release of a nuclear weapon, China would have their first opportunity to use one of theirs and I doubt if they would be condemned either.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 14:09:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by m551sheridan: I agree that we can fight NK...... and kick their azz to boot.... buuuuuuuut there be those fella's on the other side of the river that'll be showing up that bothers me. Well, this is not 1951 and NK has been a thorn living right next door for quite sometime now. Time has changed and for China to stay within world affairs (they have too much to lose now) if NK starts anything, especially the release of a nuclear weapon, China would have their first opportunity to use one of theirs and I doubt if they would be condemned either. I tend to agree...The Chinese arent recalcitrant when it comes to their own interests. This NK loose cannon undermines economic stability for all. AS they spin up long range missiles...all must react...a waste of resources for all...in these stark economic times... I find it appalling that the NK people ...who have been starved, brainwashed and manipulated by such a despot...might ...at the end of the day...only have gamma radiation for nourishment... SUBJECT: CONSTITUTIONAL LAW ISSUING-DEPT: SUPREME PEOPLE'S ASSEMBLY ISSUE-DATE: 09/05/1998 IMPLEMENT-DATE: 09/05/1998 LENGTH: 7513 words TEXT: Preface The Democratic People's Republic of Korea is a socialist fatherland of Juche which embodies the idea of and guidance by the great leader Comrade Kim Il Sung. The great leader Comrade Kim Il Sung is the founder of the DPRK and the socialist Korea. Comrade Kim Il Sung founded the immortal Juche idea, organized and guided an anti-Japanese revolutionary struggle under its banner, created revolutionary tradition, attained the historical cause of the national liberation, and founded the DPRK, built up a solid basis of construction of a sovereign and independent state in the fields of politics, economy, culture and military, and founded the DPRK. Comrade Kim Il Sung put forward an independent revolutionary line, wisely guided the social revolution and construction at various levels, strengthened and developed the Republic into a people-centered socialist country and a socialist state of independence, self-sustenance, and self-defense. Comrade Kim Il Sung clarified the fundamental principle of State building and activities, established the most superior state social system and political method, and social management system and method, and provided a firm basis for the prosperous and powerful socialist fatherland and the continuation of the task of completing the Juche revolutionary cause. Comrade Kim Il Sung regarded \"believing in the people as in heaven\" as his motto, was always with the people, devoted his whole life to them, took care of and guided them with a noble politics of benevolence, and turned the whole society into one big and united family. The great leader Comrade Kim Il Sung is the sun of the nation and the lodestar of the reunification of the fatherland. Comrade Kim Il Sung set the reunification of the country as the nation 's supreme task, and devoted all his work and endeavors entirely to its realization. Comrade Kim Il Sung, while turning the Republic into a mighty fortress for national reunification, indicated fundamental principles and methods for national reunification, developed the national reunification movement into a pan-national movement, and opened up a way for that cause, to be attained by the united strength of the entire nation. The great leader Comrade Kim Il Sung made clear the fundamental idea of the Republic 's external policy, expanded and developed diplomatic relations on this basis, and heightened the international prestige of the Republic. Comrade Kim Il Sung as a veteran world political leader, hew out a new era of independence, vigorously worked for the reinforcement and development of the socialist movement and the nonaligned movement, and for world peace and friendship between peoples, and made an immortal contribution to the mankind 's independent cause. Comrade Kim Il Sung was a genius ideological theoretician and a genius art leader, an ever-victorious, iron-willed brilliant commander, a great revolutionary and politician, and a great human being. Comrade Kim Il Sung 's great idea and achievements in leadership are the eternal treasures of the nation and a fundamental guarantee for the prosperity and efflorescence of the DPRK. The DPRK and the entire Korean people will uphold the great leader Comrade Kim Il Sung as the eternal President of the Republic, defend and carry forward his ideas and exploits and complete the Juche revolution under the leadership of the Workers ' Party of Korea. The DPRK Socialist Constitution is a Kim Il Sung constitution which legally embodies Comrade Kim Il Sung 's Juche state construction ideology and achievements. Chapter 1 Politics Article 1 The Democratic People 's Republic of Korea is an independent socialist state representing the interests of all the Korean people. Article 2 The DPRK is a revolutionary state which has inherited brilliant traditions formed during the glorious revolutionary struggle against the imperialist aggressors, in the struggle to achieve the liberation of the homeland and the freedom and well-being of the people. Article 3 The DPRK is guided in its activities by the Juche idea, a world outlook centered on people, a revolutionary ideology for achieving the independence of the masses of people. Article 4 The sovereignty of the DPRK resides in the workers, peasants, working intellectuals and all other working people. The working people exercise power through their representative organs -- the Supreme People 's Assembly and local people 's assemblies at all levels. Article 5 All the State organs in the DPRK are formed and function on the principle of democratic centralism. Article 6 The organs of State power at all levels, from the county People's Assembly to the SPA, are elected on the principle of universal, equal and direct suffrage by secret ballot. Article 7 Deputies to the organs of State power at all levels have close ties with their constituents and are accountable to them for their work. The electors may recall the deputies they have elected if the latter are not to be trusted. Article 8 The social system of the DPRK is a people-centered system under which the working people are masters of everything, and everything in society serves the working people. The State shall defend and protect the interests of the workers, peasants and working intellectuals who have been freed from exploitation and oppression and become masters of the State and society. Article 9 The DPRK shall strive to achieve the complete victory of socialism in the northern half of Korea by strengthening the people 's power and vigorously performing the three revolutions -- the ideological, cultural and technical -- and reunify the country on the principle of independence, peaceful reunification and great national unity. Article 1 The DPRK bases itself on the political and ideological unity of the entire people based on the worker-peasant alliance in which the working class plays a leading role. The State strengthens the ideological revolution and revolutionizes and working-classizes all the social members, and binds the whole society in a united group, linked up with comradeship. Article 11 The DPRK shall conduct all activities under the leadership of the Workers ' Party of Korea. Article 12 The State shall adhere to the class line, strengthen the dictatorship of people 's democracy and firmly defend the people's power and socialist system against all subversive acts of hostile elements at home and abroad. Article 13 The State shall implement the mass line and apply the Chongsanri spirit and Chongsanri method to all its activities, the spirit and method by which superiors assist their subordinates, mix with the masses to find solutions to problems and rouse them to conscious enthusiasm preferentially through political work, with people. Article 14 The State shall powerfully conduct the Three- Revolution Red Flag Movement and other mass movements and accelerate the building of socialism to the maximum. Article 15 The DPRK shall champion the democratic, national rights of Koreans overseas and their rights recognized by the international law. Article 16 The DPRK shall guarantee the legal rights and interests of foreigners in its region. Article 17 Independence, peace, and solidarity are the basic ideals of the foreign policy and the principles of external activities of the DPRK. The State shall establish diplomatic as well as political, economic and cultural relations with all friendly countries, on principles of complete equality, independence, mutual respect, noninterference in each other 's affairs and mutual benefit. The State shall promote unity with the world public defending peoples who oppose all forms of aggression and interference and fight for their countries ' independence and national and class emancipation. Article 18 The law of the DPRK reflects the wishes and interests of the working people and is a basic instrument for State administration. Respect for the law and its strict adherence and execution is the duty of all institutions, enterprises, organizations and citizens. The State shall perfect the system of socialist law and promote the socialist law-abiding life. Chapter 2 Economy Article 19 The DPRK relies on the socialist production relations and on the foundation of an independent national economy. Article 2 In the DPRK, the means of production are owned only by the State and social cooperative organizations. Article 21 The property of the State belongs to the entire people. There is no limit to the property which the State can own. Only the State possesses all the natural resources, railways, airports, transportation, communication organs and major factories, enterprises, ports and banks. The State shall guarantee giving priority to the growth of its property which plays a leading role in the development of the national economy. Article 22 The property of social cooperative organizations belongs to the collective property of working people within the organizations concerned. Social cooperative organizations can possess such property as land, agricultural machinery, ships, medium-small sized factories and enterprises. The State shall protect the property of social cooperative organizations. Article 23 The State shall enhance the ideological consciousness and the technical and cultural level of the peasants, increase the role of the property of the entire people in leading the cooperative property so as to combine the two forms of property systematically, shall consolidate and develop the socialist cooperative economic system by improving the guidance and management of the cooperative economy and gradually transform the property of cooperative organizations into the property of the people as a whole based on the voluntary will of all their members. Article 24 Private property is confirmed to property meeting the simple and individual aims of the citizen. Private property consists of socialist distributions of the result of labor and additional benefits of the State and society. The products of individual sideline activities including those from the kitchen gardens of cooperative farmers and income from other legal economic activities shall also belong to private property. The State shall protect private property and guarantee its legal inheritance. Article 25 The DPRK regards the steady improvement of the material and cultural standards of the people as the supreme principle of its activities. The constantly-increasing material wealth of society in our country, where taxes have been abolished, is used entirely for promoting the well-being of the working people. The State shall provide all working people with every condition for obtaining food, clothing and housing. Article 26 The independent national economy of the DPRK is a solid foundation for the people 's happy socialist life and for the prosperity of the fatherland. The State, holding fast to the line of building an independent national economy, shall accelerate Juche-orientation, modernization and scientific sophistication of the national economy, develop the national economy into a highly developed Juche-oriented one, strive to build a solid material and technical foundation commensurate with a complete socialist society. Article 27 The technical revolution is vital to the development of the socialist economy. The State shall perform all economic activities by giving top priority to solving the problem of technical development, push vigorously ahead with a mass technical revolution movement by accelerating scientific and technical development and the technical innovation of the national economy, free the working masses from backbreaking labor and narrow down the differences between physical and mental labor. Article 28 The State shall accelerate the technical revolution in the rural areas in order to eliminate differences between urban and rural areas, and class distinctions between the working class and the peasantry, industrialize and modernize agriculture, strengthen the guidance and assistance to rural areas by enhancing the role of the county. The State shall undertake, at its own expense, the building of production facilities for the cooperative farms and modern houses in the countryside. Article 29 Socialism and Communism are built by the creative labor of the working masses. In the DPRK, labor is an independent and creative work of the working masses, who have been freed from exploitation and suppression. The State renders the labor of our working people, who do not worry about unemployment, more joyful and worthwhile, so that they willingly work with enthusiasm and creativeness for society, organizations and for themselves. Article 3 The daily working hours of the working masses are eight hours. The State will decide to shorten the daily working hours depending on the hardness and special conditions of labor. The State shall organize labor effectively, strengthen labor rules and take fully utilize labor 's working hours. Article 31 In the DPRK, the minimum working age is 16 years old. The State shall prohibit child labor under the stipulated working age. Article 32 The State shall firmly adhere to the principle of properly combining political guidance with economic and technical guidance, the unified guidance of the State with the creativity of each unit, monolithic leadership with democracy, political and moral incentives with material incentives in the guidance and management of the socialist economy. Article 33 The State shall guide and manage the national economy according to the Taean Work System, which is a socialist economic management form whereby the economy is operated and managed in a scientific and rational way depending on the collective power of the producing masses, and according to the agricultural guidance system whereby agricultural management is conducted by industrial methods. The State shall introduce a cost accounting system in the economic management according to the demand of the Taean work system, and utilize such economic levers as prime costs, prices and profits. Article 34 The national economy of the DPRK is a planned economy. The State shall balance a proportion between accumulation and consumption properly, accelerate the economic construction, continue to raise people 's living standard and formulate and implement national economic development plans in order to strengthen the national defense capability. The State shall formulate unified and detailed plans and guarantee a high rate production growth and a balanced development of the national economy. Article 35 The DPRK shall compile and implement the State budget along with the national economic development plan. The State will intensify campaigns for increased production and expanded economy, carry out financial regulations strictly, increase the State 's savings, and expand and develop the socialist property. Article 36 In the DPRK, the State and social cooperative organizations shall conduct foreign trade activities. The State shall develop foreign trade on the principles of complete equality and mutual benefit. Article 37 The State shall encourage institutions, enterprises or associations of the DPRK to establish and operate equity and contractual joint venture enterprises with corporations or individuals of foreign countries within a special economic zone. Article 38 The State shall pursue a tariff policy with the aim of protecting the independent national economy. Chapter 3 Culture Article 39 Socialist culture, which is flourishing and developing in the DPRK, contributes to the improvement of the creative ability of the working people and to meeting their sound cultural and aesthetic demands. Article 4 The DPRK shall, by carrying out a thorough cultural revolution, train the working people to be builders of socialism and communism equipped with a profound knowledge of nature and society and a high level of culture and technology, thus making the whole of society intellectual. Article 41 The DPRK shall develop a truly popular, revolutionary culture which serves the socialist working people. In building a socialist national culture, the State shall oppose the cultural infiltration of imperialism and any tendency to return to the past, protect its national cultural heritage, and develop it in keeping with the existing socialist situation. Article 42 The State shall eliminate the way of life inherited from the outmoded society and establish a new socialist way of life in every sphere. Article 43 The State shall put the principles of socialist education into practice and raise the new generation to be steadfast revolutionaries who will fight for society and the people, to be people of a new communist type who are knowledgeable, morally sound and physically healthy. Article 44 The State shall give precedence to public education and the training of cadres for the nation and combine general education with technological education, and education with productive labor. Article 45 The State shall develop universal compulsory 11-year education which includes a compulsory one-year preschool education at a high level in accordance with the trend of modern science and technology and the practical requirements of socialist construction. Article 46 The State shall train competent technicians and experts by enhancing the regular educational system as well as different forms of study while working, and by improving the scientific and theoretical levels of technical education and education on social science and basic science. Article 47 The State shall provide education to all pupils and students free of charge and grant allowances to students of universities and colleges. Article 48 The State shall strengthen social education and provide the working people with all available conditions for study. Article 49 The State shall maintain all children of preschool age in creches and kindergartens at State and public expense. Article 5 The State shall establish Juche in scientific research, introduce advanced science and technology in every possible way, open up new areas of science and technology and raise the country 's science and technology to the world level. Article 51 The State shall draw up a proper plan for scientific research work, consolidate creative cooperation between scientists, specialists and producer masses. Article 52 The State shall develop a Juche-oriented, revolutionary literature and art, national in form and socialist in content. The State shall develop a Juche-oriented, revolutionary literature and art, national in form and socialist in content. The State shall encourage creative workers and artists to produce works of high ideological and artistic value and enlist the working masses widely in literary and artistic activity. Article 53 The State shall provide sufficient modern cultural facilities to meet the demands of the people who want to continually improve themselves, both mentally and physically, so that the working people may enjoy a socialist cultured, aesthetic life to their hearts ' content. Article 54 The State shall safeguard our language from all attempts to obliterate it and shall develop it to meet present-day needs. Article 55 The State shall popularize physical culture and make it in a habit of people's life to make people fully prepared for labor and national defense; and develop physical technique conforming to the actual situation of our country and trends in the development of modern physical technique. Article 56 The State shallconsolidate and develop the system of universal free medical service, and consolidates the section doctor system and the system of preventive medicine to protect people's life and improve working people's health. Article 57 The State shall adopt measures to protect the environment in preference to production, preserve and promote the natural environment and prevent environmental pollution so as to provide the people with a hygienic environment and working conditions. Chapter 4 National Defense Article 58 The Democratic People 's Republic of K orea rests on the people 's nationwide defence system. Article 59 The mission of the armed forces of the DPRK is to safeguard the interests of the working people, to defend the socialist system and the gains of the revolution from aggression and to protect the freedom, independence and peace of the country. Article 6 The State shall implement the line of self-reliant defence, the import of which is to arm the entire people, fortify the country, train the army into a cadre army and modernize the army on the basis of equipping the army and the people politically and ideologically. Article 61 The State shall strengthen military and mass discipline in the army and promote the display of the noble traditional trait of unity between officers and men and unity between the army and the people. Chapter 5 Fundamental Rights and Duties of Citizens Article 62 The terms for becoming a citizen of the Democratic People 's Republic of Korea are defined by the Law on Nationality. A citizen is under the protection of the DPRK regardless of the domicile. Article 63 In the DPRK the rights and duties of citizens are based on the collectivist principle, One for all and all for one. Article 64 The State shall effectively guarantee genuine democratic rights and liberties as well as the material and cultural well-being of its citizens. In the DPRK the rights and freedom of citizens shall be amplified with the consolidation and development of the social system. Article 65 Citizens enjoy equal rights in all spheres of State and public activities. Article 66 All citizens who have reached the age of 17 have the right to elect and to be elected, irrespective of sex, race, occupation, length of residence, property status, education party affiliation, political views or religion. Citizens serving in the armed forces also have the right to elect and to be elected. A person who has been disenfranchised by a Court decision and a person legally certified insane do not have the right to elect or to be elected. Article 67 Citizens are guaranteed freedom of speech, of the press, of assembly, demonstration and association. The State shall guarantee conditions for the free activity of democratic political parties and social organizations. Article 68 Citizens have freedom of religious beliefs. This right is granted by approving the construction of religious buildings and the holding of religious ceremonies. No one may use religion as a pretext for drawing in foreign forces or for harming the State and social order. Article 69 Citizens are entitled to submit complaints and petitions. Complaints and petitions shall be investigated and dealt with according to procedure and within the period fixed by law. Article 7 Citizens have the right to work. All able-bodied citizens choose occupations in accordance with their wishes and skills and are provided with stable jobs and working conditions. Citizens work according to their abilities and are paid in accordance with the quantity and quality of their work. Article 71 Citizens have the right to relaxation. This right is ensured by the establishment of the working hours, the provision of holidays, paid leave, accommodation at health resorts and holiday homes at State expense and by a growing network of cultural facilities. Article 72 Citizens are entitled to free medical care, and all persons who are no longer able to work because of old age, illness or a physical disability, the old and children who have no means of support are all entitled to material assistance. This right is ensured by free medical care, an expanding network of hospitals, sanatoria and other medical institutions, State social insurance and other social security systems. Article 73 Citizens have the right to education. This right is ensured by an advanced educational system and by the educational measures enacted by the State for the benefit of the people. Article 74 Citizens are free to engage in scientific, literary and artistic pursuits. The State shall grant benefits to inventors and innovators. Copyright and patent rights shall be protected by law. Article 75 The citizens shall have freedom to reside in and travel to any place. Article 76 Revolutionary fighters, the families of revolutionary and patriotic martyrs, the families of soldiers of the People 's Army and disabled enjoy the special protection of the State and society. Article 77 Women are accorded an equal social status and rights with men. The State shall afford special protection to mothers and children by providing maternity leave, reduced working hours for mothers with many children, a wide network of maternity hospitals, creches and kindergartens, and other measures. The State shall provide all conditions for women to play a full role in society. Article 78 Marriages and the family shall be protected by the State. The State pays great attention to consolidating the family, the basic unit of social life. Article 79 Citizens are guaranteed inviolability of the person and the home and privacy of correspondence. No citizens can be placed under control or be arrested nor can their homes be searched without a legal warrant. Article 8 The DPRK shall grant the right of asylum to foreign nationals persecuted for struggling or peace and democracy, national independence and socialism for the freedom of scientific and cultural pursuit. Article 81 Citizens shall firmly safeguard the political and ideological unity and solidarity of the people. Citizens must value organizations and collectives, and must demonstrate the spirit of devoting themselves to the work for the society and the people. Article 82 Citizens shall strictly observe the laws of the State and the socialist standards of life and defend their honor and dignity as citizens of the DPRK. Article 83 Work is noble duty and honor of a citizen. Citizens shall willingly and conscientiously participate in work and strictly observe labor discipline and the working hours. Article 84 Citizens shall take good care of State and communal property, combat all forms of misappropriation and waste and manage the nation 's economy diligently as the masters. The property of the State and the social, cooperative organization is inviolable. Article 85 Citizens shall constantly increase their revolutionary vigilance and devotedly fight for the security of the State. Article 86 National defense is the supreme duty and honor of citizens. Citizens shall defend the country and serve in the army as required by law. Chapter 6 The Structure of the State Paragraph I) The Supreme People 's Assembly Article 87 The Supreme People 's Assembly is the highest organ of State power in the DPRK. Article 88 The SPA exercises legislative power. When the SPA is not in session, the SPA Presidium also can exercise legislative power. Article 89 The SPA is composed of deputies elected on the principle of universal, equal and direct suffrage by secret ballot. Article 9 The SPA is elected for a term of five years. A new election is held before the term expires according to the decision of the SPA Presidium. The term is extended if an election is not held due to unavoidable circumstances. Article 91 The SPA has the authority to: 1. amend and supplement the Constitution, 2. adopt, amend and supplement departmental laws, 3. approve major departmental laws adopted by the SPA Presidium in the intervals between the sessions of the SPA, 4. establish the basic principles of the State 's domestic and foreign policies, 5. elect or transfer the Chairman of the DPRK National Defense Commission, 6. elect or remove the President of the SPA Presidium, 7. elect or transfer the first vice-chairman, vice-chairmen and members of the National Defense Commission according to the recommendation of the Chairman of the DPRK National Defense Commission, 8. elect or transfer the vice-presidents, honorary vice presidents, secretary and members of the SPA Presidium, 9. elect or transfer the Premier of the Cabinet, 1. appoint the vice premiers of the Cabinet, chairmen of commissions, ministers and other members of the Cabinet according to the recommendation of the Premier of the Cabinet, 11. appoint or remove the Prosecutor-general, 12. elect or transfer the Chief Justice, 13. elect or transfer the chairmen, vice chairmen and members of the committees of the SPA, 14. examine and approve the State plan for the development of the national economy and a report on its fulfillment, 15. examine and approve a report on the State budget and on its implementation, 16. receive a report on the work of the Cabinet and national institutions and adopt measures, if necessary, 17. decide on the ratification or abrogation of treaties submitted to the SPA. Article 92 The SPA holds regular and extraordinary sessions. Regular sessions are convened once or twice a year by the SPA Presidium . Extraordinary sessions are convened when the SPA Presidium deems them necessary or at the request of a minimum of one-third of the total number of deputies. Article 93 The SPA requires a quorum of at least two-thirds of the total number of deputies in order to meet. Article 94 The SPA elects its Chairman and vice chairmen. The Chairman presides over the sessions. Article 95 An item on the agenda to be deliberated on by the SPA is submitted to the SPA Presidium, Cabinet and SPA committees. Article 96 Each of the first session of the SPA elects a Credentials Committee and, on hearing the Committee 's report, adopts a decision confirming the credentials of deputies. Article 97 The SPA adopts laws and decisions. Laws and decisions of the SPA are adopted when more than half of the deputies attending signify approval by a show of hands. The Constitution is amended and supplemented with the approval of more than two-thirds of the total number of deputies to the SPA. Article 98 The SPA sets up committees such as the legislation committee and the budget committee. The SPA committees consist of its chairman, vice chairmen and members. The SPA committees assist in the work of the SPA; they plan or deliberate on the State policy and bills and take measures for their implementation. When the SPA is not in session, committees operate under the guidance of the SPA Presidium. Article 99 Deputies to the SPA are guaranteed inviolability as such. No deputy to the SPA can be arrested or punished without the consent of the SPA or, when it is not in session, without the consent of the SPA Presidium, except for a flagrant offence. Paragraph II) The National Defense Commission Article 1 The National Defense Commission is the highest military leading organ of State power and an organ for general control over national defense. Article 11 The NDC consists of its Chairman, first vice chairman, vice chairmen and members. The term of the NDC Chairman is the same as that of the SPA. Article 12 The Chairman of the NDC directs and commands all the armed forces and guides defense affairs as a whole. Article 13 The NDC has the duties and authority to: 1. guide the armed forces and guide the State in defense building as a whole, 2. set up or abolish a national institution in the defense sector, 3. appoint or remove major military cadres, 4. set up military titles and confer the military rank of general and higher ranks, 5. proclaim a state of war and orders for mobilization. Article 14 The NDC issues decisions and orders. Article 15 The NDC is accountable to the SPA. Paragraph III) The SPA Presidium Article 16 The SPA Presidium is the highest organ of power in the intervals between sessions of the SPA. Article 17 The SPA Presidium consists of its Chairman, vice chairman, secretaries and members. Article 18 The SPA Presidium may appoint some honorary vice chairmen. The honorary vice chairmen may be those from among SPA deputies who have participated in State construction works for a long time and made a noticeable contribution. Article 19 The term of the SPA Presidium is the same as that of the SPA. The SPA Presidium continuously fulfill its duty after its term expires until a new SPA Presidium is elected. Article 11 The SPA Presidium has the duties and authority to 1. convene sessions of the SPA, 2. examine and adopt new departmental bills and regulations, raised when the SPA is in recess, and examine and adopt drafts of amendment and supplement to departmental bills and regulations in force, and receive approval from the next SPA session on important departmental bills which will be adopted and implemented, 3. examine and approve the State plan for the development of the national economy, the State budget and its adjusted plan, raised when the SPA is in recess due to unavoidable circumstances, 4. interpret the Constitution, departmental laws and regulations in force. 5. supervise the observance of laws of State organs, and adopt measures, 6. abolish State organs ' decisions which violate the Constitution, SPA 's laws and decisions, NDC 's decisions and orders and the SPA Presidium 's decrees, decisions and directions, and suspend the implementation of unwarranted decisions by a local people 's assembly, 7. do work for an SPA deputy election, and organize an election for deputies in a local people 's assembly, 8. do work with SPA deputies, 9. do work with SPA departmental committees, 1. form or abolish commissions and ministries of the Cabinet, 11. appoint or remove vice premiers, chairman, and Cabinet and ministry members upon a proposal by Premier when the SPA is in recess, 12. appoint or remove members of departmental committees of the SPA Presidium, 13. elect or transfer judges of the Central Court and people 's assessors, 14. ratify or abrogate treaties concluded with other countries, 15. decide on and publish the appointment or recall of diplomatic envoys accredited to foreign countries, 16. institute a decoration, a medal, an honorary title and a diplomatic rank, and grant a decoration, a medal, and an honorary title, 17. exercise the right to grant general amnesties or special pardon, 18. institute and reorganize an administration unit and district. Article 111 The President of the SPA Presidium organizes and guides the work of the presidium. The President of the SPA Presidium represents the State and receives credentials and letters of recall of diplomatic representatives accredited by a foreign state. Article 112 The SPA Presidium convenes a plenary meeting and an executive meeting. The plenary meeting consists of all the members and the executive meeting of the President, vice presidents, and secretary. Article 113 The SPA Presidium 's plenary meeting deliberates on and adopts important issues for the Presidium to implement its duties and authority. The executive meeting deliberates on and adopts issues which are entrusted to it by the plenary meeting. Article 114 The SPA Presidium issues decrees, decisions and directions. Article 115 The SPA Presidium may set up its assistant departmental committees. Article 116 The SPA Presidium is accountable to the SPA. Paragraph IV) Cabinet Article 117 The Cabinet is the administrative and executive body of the highest organ of State power and a general state management organ. Article 118 The Cabinet consists of the Premier, vice premiers, chairmen of commissions, ministers and some other necessary members. The Cabinet 's term is the same as that of the SPA. Article 119 The Cabinet has duties and authority to: 1. adopt measures to execute state policy, 2. institute, amend, and supplement regulations concerning state management based on the Constitution and departmental laws, 3. guide the work of the Cabinet commissions, ministries, direct organs of the Cabinet, local people 's committees, 4. set up and remove direct organs of the Cabinet, main administrative economic organizations, and enterprises, and adopt measures to improve the State management structure, 5. draft the State plan for the development of the national economy and adopt measures to put it into effect, 6. compile the State budget and adopt measures to implement it, 7. organize and exercise works in the fields of industry, agriculture, construction, transportation, communications, commerce, trade, land management, city management, education, science, culture, health, physical training, labor administration, environmental protection, tourism and others, 8. adopt measures to strengthen the monetary and banking system, 9. do inspection and control work to establish a state management order, 1. adopt measures to maintain social order, protect State and social cooperation body 's possession and interests, and to guarantee citizens ' rights, 11. conclude treaties with foreign countries, and conduct external activities, 12. abolish decisions and directions by economic administrative organs, which run counter to the Cabinet decisions or directions, Article 12 The Premier of the Cabinet organizes and guides the work of the Cabinet. The Premier represents the government of the DPRK. Article 121 The Cabinet convenes a plenary meeting and an executive meeting. The plenary meeting consists of all the Cabinet members and the executive meeting of the Premier, vice premier and other Cabinet members whom the Premier nominates. Article 122 The Cabinet plenary meeting deliberates on and adopts new and important issues in economic administrative work. Article 123 The Cabinet adopts decisions and directions. Article 124 The Cabinet may set up non-permanent departmental committees which assist in its works. Article 125 The Cabinet is accountable to the SPA, and to the SPA Presidium when the SPA is in recess. Article 126 The newly elected Premier of the Cabinet makes an oath in the SPA, representing Cabinet members. Article 127 The Cabinet commission and ministries are departmental executive organs, and departmental management organs. Article 128 The Cabinet commissions and ministries grasp, guide and manage the work in charge, under the guidance of the Cabinet. Article 129 The Cabinet commissions and ministries manage committee assemblies and cadres assemblies. Commission and ministry committee assemblies and cadres assemblies deliberate on and adopt measures to exercise Cabinet decisions, and directions and other important issues. Article 13 The Cabinet commissions and ministries issue directions. Paragraph V) Local People's Assembly Article 131 Provincial (or municiparity directly under the central authority), municipal (district), and county local people 's assemblies are local sovereign power organs. Article 132 The LPA consists of deputies elected on the principle of universal, equal and direct suffrage by secret ballot. Article 133 The term of provincial (or municipality directly under the central authority), municipal (district), and county local people 's assemblies are four years. A new election of the LPA is held according to a decision of a Local People 's Committee (LPC) at the corresponding level before the LPA 's term expires. Article 134 The LPA has the duties and authority to: 1. deliberate on and approve a report on local plans for the development of the national economy, and their implementation, 2. deliberate on and approve a report on a local budget and its execution, 3. adopt measures to exercise State laws in the area concerned, 4. elect or recall the chairman, vice chairmen, secretary of the people 's committee at the corresponding level, 5. elect or recall judges of a court and people 's assessors, 6. abolish unwarranted decisions and directions adopted by a people 's committee, and a lower people 's assembly. Article 135 The LPA convenes a regular assembly and an extraordinary assembly. The regular assembly is convened once or twice in a year by an LPC at the corresponding level. The extraordinary assembly is held when the people 's committee at the corresponding level deems it necessary or at the request of a minimum of one-third of the total numbers of deputies. Article 136 The LPA forms a quorum when the two-third of the deputies participate in it. Article 137 The LPA elects its chairman. Article 138 The LPA issues its decisions. Paragraph VI) Local People's Committee Article 139 Provincial (or municipality directly under the central authority), municipal (district), and county local people 's committees are local sovereign power organs when the corresponding LPAs are in recess, and are administrative executive organs of local sovereignty. Article 14 The LPC consists of its chairman, vice chairmen, secretaries and members. The term of LPC is the same as that of the LPA. Article 141 The LPC has the duties and authorities to: 1. convene a people 's assembly, 2. do preparatory work for the election of a local assembly, 3. do work with deputies of a people 's assembly, 4. exercise laws, decrees, decisions and directions of the people 's assembly at the corresponding level, upper people 's assemblies, people 's committees, and the Cabinet, Cabinet commissions, and ministries, 5. organize and exercise all the administrative work in the area concerned, 6. draft a local plan for the development of the national economy and adopt measures to put it into effect, 7. compile a local budget and adopt measures to put it into effect, 8. adopt measures to maintain social order in the area concerned, protect the property and interests of the State and social cooperative organizations, and to guarantee citizens ' rights, 9. do inspection and control work to establish order in state management in the area concerned, 1. guide the lower people 's committees in its work, 11. abolish unwarranted decisions and direction adopted by a lower people 's committee, and suspend implementation of unwarranted decisions made by a lower people 's committee. Article 142 The LPC convenes a plenary meeting and an executive meeting. The plenary meeting consists of all the LPC members, and the executive meeting of the chairman, vice chairmen, and secretary. Article 143 The plenary meeting deliberates on and adopts important issues for the LPC to implement its duties and authority. Article 144 The LPC issues decisions and directions. Article 145 The LPC may set up non-permanent departmental committees which assist in its works. Article 146 The LPC is accountable to the LPA at the correspondent level. The LPC is subordinate to the upper people 's committees and the Cabinet. Paragraph VII) Public Procurators ' Office and Court Article 147 Justice is administered by the Central Court, the Court of the province (or municipality directly under the central authority), municipal and county courts and the Special Court. Article 148 The term of office of the President of the Central Court is the same as that of the SPA. Article 149 The Central Procurators ' Office appoints and recalls a public procurator. Article 15 The functions of the Public Procurators ' Office are to: 1.ensure the strict observance of laws by institutions, enterprises, organizations and by citizens, 2. ensure that decisions and directives of State bodies conform with the Constitution, the SPA 's laws and decisions, the NDC 's decisions and orders, the SPA Presidium 's decrees, decisions, and directions, and the Cabinet decisions. 3. expose and institute legal proceedings against criminals and offenders in order to protect the State power of the DPRK, the socialist system, the property of the State and social, cooperative organizations and personal rights as guaranteed by the Consitution and the people 's lives and property. Article 151 Investigation are prosecution are conducted under the unified direction of the Central Public Procurators' Office, and all Public Procurators Offices are subordinate to their higher offices and the Central Procurators ' Office. Article 152 The Central Procurators' Office is accountable to the SPA, and to the SPA Presidium when the SPA is in recess. Article 153 Justice is administered by the Central Court, Provincial (or municipality directly under the central authority) Court, People's Court or by the Special Court. Verdicts are delivered in the name of the DPRK. Article 154 The term of director of the Central Court is the same as that of the SPA. The term of judges of the Central Court, Provincial (or municipality directly under the central authority) Court, People's Court, and that of the people's assessors are the same as that of the people's a", 
        "intTime": 20090529, 
        "postID": 8, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by m551sheridan: I agree that we can fight NK...... and kick their azz to boot.... buuuuuuuut there be those fella's on the other side of the river that'll be showing up that bothers me. Well, this is not 1951 and NK has been a thorn living right next door for quite sometime now. Time has changed and for China to stay within world affairs (they have too much to lose now) if NK starts anything, especially the release of a nuclear weapon, China would have their first opportunity to use one of theirs and I doubt if they would be condemned either.", 
        "reply": " I tend to agree...The Chinese arent recalcitrant when it comes to their own interests. This NK loose cannon undermines economic stability for all. AS they spin up long range missiles...all must react...a waste of resources for all...in these stark economic times... I find it appalling that the NK people ...who have been starved, brainwashed and manipulated by such a despot...might ...at the end of the day...only have gamma radiation for nourishment... SUBJECT: CONSTITUTIONAL LAW ISSUING-DEPT: SUPREME PEOPLE'S ASSEMBLY ISSUE-DATE: 09/05/1998 IMPLEMENT-DATE: 09/05/1998 LENGTH: 7513 words TEXT: Preface The Democratic People's Republic of Korea is a socialist fatherland of Juche which embodies the idea of and guidance by the great leader Comrade Kim Il Sung. The great leader Comrade Kim Il Sung is the founder of the DPRK and the socialist Korea. Comrade Kim Il Sung founded the immortal Juche idea, organized and guided an anti-Japanese revolutionary struggle under its banner, created revolutionary tradition, attained the historical cause of the national liberation, and founded the DPRK, built up a solid basis of construction of a sovereign and independent state in the fields of politics, economy, culture and military, and founded the DPRK. Comrade Kim Il Sung put forward an independent revolutionary line, wisely guided the social revolution and construction at various levels, strengthened and developed the Republic into a people-centered socialist country and a socialist state of independence, self-sustenance, and self-defense. Comrade Kim Il Sung clarified the fundamental principle of State building and activities, established the most superior state social system and political method, and social management system and method, and provided a firm basis for the prosperous and powerful socialist fatherland and the continuation of the task of completing the Juche revolutionary cause. Comrade Kim Il Sung regarded \"believing in the people as in heaven\" as his motto, was always with the people, devoted his whole life to them, took care of and guided them with a noble politics of benevolence, and turned the whole society into one big and united family. The great leader Comrade Kim Il Sung is the sun of the nation and the lodestar of the reunification of the fatherland. Comrade Kim Il Sung set the reunification of the country as the nation 's supreme task, and devoted all his work and endeavors entirely to its realization. Comrade Kim Il Sung, while turning the Republic into a mighty fortress for national reunification, indicated fundamental principles and methods for national reunification, developed the national reunification movement into a pan-national movement, and opened up a way for that cause, to be attained by the united strength of the entire nation. The great leader Comrade Kim Il Sung made clear the fundamental idea of the Republic 's external policy, expanded and developed diplomatic relations on this basis, and heightened the international prestige of the Republic. Comrade Kim Il Sung as a veteran world political leader, hew out a new era of independence, vigorously worked for the reinforcement and development of the socialist movement and the nonaligned movement, and for world peace and friendship between peoples, and made an immortal contribution to the mankind 's independent cause. Comrade Kim Il Sung was a genius ideological theoretician and a genius art leader, an ever-victorious, iron-willed brilliant commander, a great revolutionary and politician, and a great human being. Comrade Kim Il Sung 's great idea and achievements in leadership are the eternal treasures of the nation and a fundamental guarantee for the prosperity and efflorescence of the DPRK. The DPRK and the entire Korean people will uphold the great leader Comrade Kim Il Sung as the eternal President of the Republic, defend and carry forward his ideas and exploits and complete the Juche revolution under the leadership of the Workers ' Party of Korea. The DPRK Socialist Constitution is a Kim Il Sung constitution which legally embodies Comrade Kim Il Sung 's Juche state construction ideology and achievements. Chapter 1 Politics Article 1 The Democratic People 's Republic of Korea is an independent socialist state representing the interests of all the Korean people. Article 2 The DPRK is a revolutionary state which has inherited brilliant traditions formed during the glorious revolutionary struggle against the imperialist aggressors, in the struggle to achieve the liberation of the homeland and the freedom and well-being of the people. Article 3 The DPRK is guided in its activities by the Juche idea, a world outlook centered on people, a revolutionary ideology for achieving the independence of the masses of people. Article 4 The sovereignty of the DPRK resides in the workers, peasants, working intellectuals and all other working people. The working people exercise power through their representative organs -- the Supreme People 's Assembly and local people 's assemblies at all levels. Article 5 All the State organs in the DPRK are formed and function on the principle of democratic centralism. Article 6 The organs of State power at all levels, from the county People's Assembly to the SPA, are elected on the principle of universal, equal and direct suffrage by secret ballot. Article 7 Deputies to the organs of State power at all levels have close ties with their constituents and are accountable to them for their work. The electors may recall the deputies they have elected if the latter are not to be trusted. Article 8 The social system of the DPRK is a people-centered system under which the working people are masters of everything, and everything in society serves the working people. The State shall defend and protect the interests of the workers, peasants and working intellectuals who have been freed from exploitation and oppression and become masters of the State and society. Article 9 The DPRK shall strive to achieve the complete victory of socialism in the northern half of Korea by strengthening the people 's power and vigorously performing the three revolutions -- the ideological, cultural and technical -- and reunify the country on the principle of independence, peaceful reunification and great national unity. Article 1 The DPRK bases itself on the political and ideological unity of the entire people based on the worker-peasant alliance in which the working class plays a leading role. The State strengthens the ideological revolution and revolutionizes and working-classizes all the social members, and binds the whole society in a united group, linked up with comradeship. Article 11 The DPRK shall conduct all activities under the leadership of the Workers ' Party of Korea. Article 12 The State shall adhere to the class line, strengthen the dictatorship of people 's democracy and firmly defend the people's power and socialist system against all subversive acts of hostile elements at home and abroad. Article 13 The State shall implement the mass line and apply the Chongsanri spirit and Chongsanri method to all its activities, the spirit and method by which superiors assist their subordinates, mix with the masses to find solutions to problems and rouse them to conscious enthusiasm preferentially through political work, with people. Article 14 The State shall powerfully conduct the Three- Revolution Red Flag Movement and other mass movements and accelerate the building of socialism to the maximum. Article 15 The DPRK shall champion the democratic, national rights of Koreans overseas and their rights recognized by the international law. Article 16 The DPRK shall guarantee the legal rights and interests of foreigners in its region. Article 17 Independence, peace, and solidarity are the basic ideals of the foreign policy and the principles of external activities of the DPRK. The State shall establish diplomatic as well as political, economic and cultural relations with all friendly countries, on principles of complete equality, independence, mutual respect, noninterference in each other 's affairs and mutual benefit. The State shall promote unity with the world public defending peoples who oppose all forms of aggression and interference and fight for their countries ' independence and national and class emancipation. Article 18 The law of the DPRK reflects the wishes and interests of the working people and is a basic instrument for State administration. Respect for the law and its strict adherence and execution is the duty of all institutions, enterprises, organizations and citizens. The State shall perfect the system of socialist law and promote the socialist law-abiding life. Chapter 2 Economy Article 19 The DPRK relies on the socialist production relations and on the foundation of an independent national economy. Article 2 In the DPRK, the means of production are owned only by the State and social cooperative organizations. Article 21 The property of the State belongs to the entire people. There is no limit to the property which the State can own. Only the State possesses all the natural resources, railways, airports, transportation, communication organs and major factories, enterprises, ports and banks. The State shall guarantee giving priority to the growth of its property which plays a leading role in the development of the national economy. Article 22 The property of social cooperative organizations belongs to the collective property of working people within the organizations concerned. Social cooperative organizations can possess such property as land, agricultural machinery, ships, medium-small sized factories and enterprises. The State shall protect the property of social cooperative organizations. Article 23 The State shall enhance the ideological consciousness and the technical and cultural level of the peasants, increase the role of the property of the entire people in leading the cooperative property so as to combine the two forms of property systematically, shall consolidate and develop the socialist cooperative economic system by improving the guidance and management of the cooperative economy and gradually transform the property of cooperative organizations into the property of the people as a whole based on the voluntary will of all their members. Article 24 Private property is confirmed to property meeting the simple and individual aims of the citizen. Private property consists of socialist distributions of the result of labor and additional benefits of the State and society. The products of individual sideline activities including those from the kitchen gardens of cooperative farmers and income from other legal economic activities shall also belong to private property. The State shall protect private property and guarantee its legal inheritance. Article 25 The DPRK regards the steady improvement of the material and cultural standards of the people as the supreme principle of its activities. The constantly-increasing material wealth of society in our country, where taxes have been abolished, is used entirely for promoting the well-being of the working people. The State shall provide all working people with every condition for obtaining food, clothing and housing. Article 26 The independent national economy of the DPRK is a solid foundation for the people 's happy socialist life and for the prosperity of the fatherland. The State, holding fast to the line of building an independent national economy, shall accelerate Juche-orientation, modernization and scientific sophistication of the national economy, develop the national economy into a highly developed Juche-oriented one, strive to build a solid material and technical foundation commensurate with a complete socialist society. Article 27 The technical revolution is vital to the development of the socialist economy. The State shall perform all economic activities by giving top priority to solving the problem of technical development, push vigorously ahead with a mass technical revolution movement by accelerating scientific and technical development and the technical innovation of the national economy, free the working masses from backbreaking labor and narrow down the differences between physical and mental labor. Article 28 The State shall accelerate the technical revolution in the rural areas in order to eliminate differences between urban and rural areas, and class distinctions between the working class and the peasantry, industrialize and modernize agriculture, strengthen the guidance and assistance to rural areas by enhancing the role of the county. The State shall undertake, at its own expense, the building of production facilities for the cooperative farms and modern houses in the countryside. Article 29 Socialism and Communism are built by the creative labor of the working masses. In the DPRK, labor is an independent and creative work of the working masses, who have been freed from exploitation and suppression. The State renders the labor of our working people, who do not worry about unemployment, more joyful and worthwhile, so that they willingly work with enthusiasm and creativeness for society, organizations and for themselves. Article 3 The daily working hours of the working masses are eight hours. The State will decide to shorten the daily working hours depending on the hardness and special conditions of labor. The State shall organize labor effectively, strengthen labor rules and take fully utilize labor 's working hours. Article 31 In the DPRK, the minimum working age is 16 years old. The State shall prohibit child labor under the stipulated working age. Article 32 The State shall firmly adhere to the principle of properly combining political guidance with economic and technical guidance, the unified guidance of the State with the creativity of each unit, monolithic leadership with democracy, political and moral incentives with material incentives in the guidance and management of the socialist economy. Article 33 The State shall guide and manage the national economy according to the Taean Work System, which is a socialist economic management form whereby the economy is operated and managed in a scientific and rational way depending on the collective power of the producing masses, and according to the agricultural guidance system whereby agricultural management is conducted by industrial methods. The State shall introduce a cost accounting system in the economic management according to the demand of the Taean work system, and utilize such economic levers as prime costs, prices and profits. Article 34 The national economy of the DPRK is a planned economy. The State shall balance a proportion between accumulation and consumption properly, accelerate the economic construction, continue to raise people 's living standard and formulate and implement national economic development plans in order to strengthen the national defense capability. The State shall formulate unified and detailed plans and guarantee a high rate production growth and a balanced development of the national economy. Article 35 The DPRK shall compile and implement the State budget along with the national economic development plan. The State will intensify campaigns for increased production and expanded economy, carry out financial regulations strictly, increase the State 's savings, and expand and develop the socialist property. Article 36 In the DPRK, the State and social cooperative organizations shall conduct foreign trade activities. The State shall develop foreign trade on the principles of complete equality and mutual benefit. Article 37 The State shall encourage institutions, enterprises or associations of the DPRK to establish and operate equity and contractual joint venture enterprises with corporations or individuals of foreign countries within a special economic zone. Article 38 The State shall pursue a tariff policy with the aim of protecting the independent national economy. Chapter 3 Culture Article 39 Socialist culture, which is flourishing and developing in the DPRK, contributes to the improvement of the creative ability of the working people and to meeting their sound cultural and aesthetic demands. Article 4 The DPRK shall, by carrying out a thorough cultural revolution, train the working people to be builders of socialism and communism equipped with a profound knowledge of nature and society and a high level of culture and technology, thus making the whole of society intellectual. Article 41 The DPRK shall develop a truly popular, revolutionary culture which serves the socialist working people. In building a socialist national culture, the State shall oppose the cultural infiltration of imperialism and any tendency to return to the past, protect its national cultural heritage, and develop it in keeping with the existing socialist situation. Article 42 The State shall eliminate the way of life inherited from the outmoded society and establish a new socialist way of life in every sphere. Article 43 The State shall put the principles of socialist education into practice and raise the new generation to be steadfast revolutionaries who will fight for society and the people, to be people of a new communist type who are knowledgeable, morally sound and physically healthy. Article 44 The State shall give precedence to public education and the training of cadres for the nation and combine general education with technological education, and education with productive labor. Article 45 The State shall develop universal compulsory 11-year education which includes a compulsory one-year preschool education at a high level in accordance with the trend of modern science and technology and the practical requirements of socialist construction. Article 46 The State shall train competent technicians and experts by enhancing the regular educational system as well as different forms of study while working, and by improving the scientific and theoretical levels of technical education and education on social science and basic science. Article 47 The State shall provide education to all pupils and students free of charge and grant allowances to students of universities and colleges. Article 48 The State shall strengthen social education and provide the working people with all available conditions for study. Article 49 The State shall maintain all children of preschool age in creches and kindergartens at State and public expense. Article 5 The State shall establish Juche in scientific research, introduce advanced science and technology in every possible way, open up new areas of science and technology and raise the country 's science and technology to the world level. Article 51 The State shall draw up a proper plan for scientific research work, consolidate creative cooperation between scientists, specialists and producer masses. Article 52 The State shall develop a Juche-oriented, revolutionary literature and art, national in form and socialist in content. The State shall develop a Juche-oriented, revolutionary literature and art, national in form and socialist in content. The State shall encourage creative workers and artists to produce works of high ideological and artistic value and enlist the working masses widely in literary and artistic activity. Article 53 The State shall provide sufficient modern cultural facilities to meet the demands of the people who want to continually improve themselves, both mentally and physically, so that the working people may enjoy a socialist cultured, aesthetic life to their hearts ' content. Article 54 The State shall safeguard our language from all attempts to obliterate it and shall develop it to meet present-day needs. Article 55 The State shall popularize physical culture and make it in a habit of people's life to make people fully prepared for labor and national defense; and develop physical technique conforming to the actual situation of our country and trends in the development of modern physical technique. Article 56 The State shallconsolidate and develop the system of universal free medical service, and consolidates the section doctor system and the system of preventive medicine to protect people's life and improve working people's health. Article 57 The State shall adopt measures to protect the environment in preference to production, preserve and promote the natural environment and prevent environmental pollution so as to provide the people with a hygienic environment and working conditions. Chapter 4 National Defense Article 58 The Democratic People 's Republic of K orea rests on the people 's nationwide defence system. Article 59 The mission of the armed forces of the DPRK is to safeguard the interests of the working people, to defend the socialist system and the gains of the revolution from aggression and to protect the freedom, independence and peace of the country. Article 6 The State shall implement the line of self-reliant defence, the import of which is to arm the entire people, fortify the country, train the army into a cadre army and modernize the army on the basis of equipping the army and the people politically and ideologically. Article 61 The State shall strengthen military and mass discipline in the army and promote the display of the noble traditional trait of unity between officers and men and unity between the army and the people. Chapter 5 Fundamental Rights and Duties of Citizens Article 62 The terms for becoming a citizen of the Democratic People 's Republic of Korea are defined by the Law on Nationality. A citizen is under the protection of the DPRK regardless of the domicile. Article 63 In the DPRK the rights and duties of citizens are based on the collectivist principle, One for all and all for one. Article 64 The State shall effectively guarantee genuine democratic rights and liberties as well as the material and cultural well-being of its citizens. In the DPRK the rights and freedom of citizens shall be amplified with the consolidation and development of the social system. Article 65 Citizens enjoy equal rights in all spheres of State and public activities. Article 66 All citizens who have reached the age of 17 have the right to elect and to be elected, irrespective of sex, race, occupation, length of residence, property status, education party affiliation, political views or religion. Citizens serving in the armed forces also have the right to elect and to be elected. A person who has been disenfranchised by a Court decision and a person legally certified insane do not have the right to elect or to be elected. Article 67 Citizens are guaranteed freedom of speech, of the press, of assembly, demonstration and association. The State shall guarantee conditions for the free activity of democratic political parties and social organizations. Article 68 Citizens have freedom of religious beliefs. This right is granted by approving the construction of religious buildings and the holding of religious ceremonies. No one may use religion as a pretext for drawing in foreign forces or for harming the State and social order. Article 69 Citizens are entitled to submit complaints and petitions. Complaints and petitions shall be investigated and dealt with according to procedure and within the period fixed by law. Article 7 Citizens have the right to work. All able-bodied citizens choose occupations in accordance with their wishes and skills and are provided with stable jobs and working conditions. Citizens work according to their abilities and are paid in accordance with the quantity and quality of their work. Article 71 Citizens have the right to relaxation. This right is ensured by the establishment of the working hours, the provision of holidays, paid leave, accommodation at health resorts and holiday homes at State expense and by a growing network of cultural facilities. Article 72 Citizens are entitled to free medical care, and all persons who are no longer able to work because of old age, illness or a physical disability, the old and children who have no means of support are all entitled to material assistance. This right is ensured by free medical care, an expanding network of hospitals, sanatoria and other medical institutions, State social insurance and other social security systems. Article 73 Citizens have the right to education. This right is ensured by an advanced educational system and by the educational measures enacted by the State for the benefit of the people. Article 74 Citizens are free to engage in scientific, literary and artistic pursuits. The State shall grant benefits to inventors and innovators. Copyright and patent rights shall be protected by law. Article 75 The citizens shall have freedom to reside in and travel to any place. Article 76 Revolutionary fighters, the families of revolutionary and patriotic martyrs, the families of soldiers of the People 's Army and disabled enjoy the special protection of the State and society. Article 77 Women are accorded an equal social status and rights with men. The State shall afford special protection to mothers and children by providing maternity leave, reduced working hours for mothers with many children, a wide network of maternity hospitals, creches and kindergartens, and other measures. The State shall provide all conditions for women to play a full role in society. Article 78 Marriages and the family shall be protected by the State. The State pays great attention to consolidating the family, the basic unit of social life. Article 79 Citizens are guaranteed inviolability of the person and the home and privacy of correspondence. No citizens can be placed under control or be arrested nor can their homes be searched without a legal warrant. Article 8 The DPRK shall grant the right of asylum to foreign nationals persecuted for struggling or peace and democracy, national independence and socialism for the freedom of scientific and cultural pursuit. Article 81 Citizens shall firmly safeguard the political and ideological unity and solidarity of the people. Citizens must value organizations and collectives, and must demonstrate the spirit of devoting themselves to the work for the society and the people. Article 82 Citizens shall strictly observe the laws of the State and the socialist standards of life and defend their honor and dignity as citizens of the DPRK. Article 83 Work is noble duty and honor of a citizen. Citizens shall willingly and conscientiously participate in work and strictly observe labor discipline and the working hours. Article 84 Citizens shall take good care of State and communal property, combat all forms of misappropriation and waste and manage the nation 's economy diligently as the masters. The property of the State and the social, cooperative organization is inviolable. Article 85 Citizens shall constantly increase their revolutionary vigilance and devotedly fight for the security of the State. Article 86 National defense is the supreme duty and honor of citizens. Citizens shall defend the country and serve in the army as required by law. Chapter 6 The Structure of the State Paragraph I) The Supreme People 's Assembly Article 87 The Supreme People 's Assembly is the highest organ of State power in the DPRK. Article 88 The SPA exercises legislative power. When the SPA is not in session, the SPA Presidium also can exercise legislative power. Article 89 The SPA is composed of deputies elected on the principle of universal, equal and direct suffrage by secret ballot. Article 9 The SPA is elected for a term of five years. A new election is held before the term expires according to the decision of the SPA Presidium. The term is extended if an election is not held due to unavoidable circumstances. Article 91 The SPA has the authority to: 1. amend and supplement the Constitution, 2. adopt, amend and supplement departmental laws, 3. approve major departmental laws adopted by the SPA Presidium in the intervals between the sessions of the SPA, 4. establish the basic principles of the State 's domestic and foreign policies, 5. elect or transfer the Chairman of the DPRK National Defense Commission, 6. elect or remove the President of the SPA Presidium, 7. elect or transfer the first vice-chairman, vice-chairmen and members of the National Defense Commission according to the recommendation of the Chairman of the DPRK National Defense Commission, 8. elect or transfer the vice-presidents, honorary vice presidents, secretary and members of the SPA Presidium, 9. elect or transfer the Premier of the Cabinet, 1. appoint the vice premiers of the Cabinet, chairmen of commissions, ministers and other members of the Cabinet according to the recommendation of the Premier of the Cabinet, 11. appoint or remove the Prosecutor-general, 12. elect or transfer the Chief Justice, 13. elect or transfer the chairmen, vice chairmen and members of the committees of the SPA, 14. examine and approve the State plan for the development of the national economy and a report on its fulfillment, 15. examine and approve a report on the State budget and on its implementation, 16. receive a report on the work of the Cabinet and national institutions and adopt measures, if necessary, 17. decide on the ratification or abrogation of treaties submitted to the SPA. Article 92 The SPA holds regular and extraordinary sessions. Regular sessions are convened once or twice a year by the SPA Presidium . Extraordinary sessions are convened when the SPA Presidium deems them necessary or at the request of a minimum of one-third of the total number of deputies. Article 93 The SPA requires a quorum of at least two-thirds of the total number of deputies in order to meet. Article 94 The SPA elects its Chairman and vice chairmen. The Chairman presides over the sessions. Article 95 An item on the agenda to be deliberated on by the SPA is submitted to the SPA Presidium, Cabinet and SPA committees. Article 96 Each of the first session of the SPA elects a Credentials Committee and, on hearing the Committee 's report, adopts a decision confirming the credentials of deputies. Article 97 The SPA adopts laws and decisions. Laws and decisions of the SPA are adopted when more than half of the deputies attending signify approval by a show of hands. The Constitution is amended and supplemented with the approval of more than two-thirds of the total number of deputies to the SPA. Article 98 The SPA sets up committees such as the legislation committee and the budget committee. The SPA committees consist of its chairman, vice chairmen and members. The SPA committees assist in the work of the SPA; they plan or deliberate on the State policy and bills and take measures for their implementation. When the SPA is not in session, committees operate under the guidance of the SPA Presidium. Article 99 Deputies to the SPA are guaranteed inviolability as such. No deputy to the SPA can be arrested or punished without the consent of the SPA or, when it is not in session, without the consent of the SPA Presidium, except for a flagrant offence. Paragraph II) The National Defense Commission Article 1 The National Defense Commission is the highest military leading organ of State power and an organ for general control over national defense. Article 11 The NDC consists of its Chairman, first vice chairman, vice chairmen and members. The term of the NDC Chairman is the same as that of the SPA. Article 12 The Chairman of the NDC directs and commands all the armed forces and guides defense affairs as a whole. Article 13 The NDC has the duties and authority to: 1. guide the armed forces and guide the State in defense building as a whole, 2. set up or abolish a national institution in the defense sector, 3. appoint or remove major military cadres, 4. set up military titles and confer the military rank of general and higher ranks, 5. proclaim a state of war and orders for mobilization. Article 14 The NDC issues decisions and orders. Article 15 The NDC is accountable to the SPA. Paragraph III) The SPA Presidium Article 16 The SPA Presidium is the highest organ of power in the intervals between sessions of the SPA. Article 17 The SPA Presidium consists of its Chairman, vice chairman, secretaries and members. Article 18 The SPA Presidium may appoint some honorary vice chairmen. The honorary vice chairmen may be those from among SPA deputies who have participated in State construction works for a long time and made a noticeable contribution. Article 19 The term of the SPA Presidium is the same as that of the SPA. The SPA Presidium continuously fulfill its duty after its term expires until a new SPA Presidium is elected. Article 11 The SPA Presidium has the duties and authority to 1. convene sessions of the SPA, 2. examine and adopt new departmental bills and regulations, raised when the SPA is in recess, and examine and adopt drafts of amendment and supplement to departmental bills and regulations in force, and receive approval from the next SPA session on important departmental bills which will be adopted and implemented, 3. examine and approve the State plan for the development of the national economy, the State budget and its adjusted plan, raised when the SPA is in recess due to unavoidable circumstances, 4. interpret the Constitution, departmental laws and regulations in force. 5. supervise the observance of laws of State organs, and adopt measures, 6. abolish State organs ' decisions which violate the Constitution, SPA 's laws and decisions, NDC 's decisions and orders and the SPA Presidium 's decrees, decisions and directions, and suspend the implementation of unwarranted decisions by a local people 's assembly, 7. do work for an SPA deputy election, and organize an election for deputies in a local people 's assembly, 8. do work with SPA deputies, 9. do work with SPA departmental committees, 1. form or abolish commissions and ministries of the Cabinet, 11. appoint or remove vice premiers, chairman, and Cabinet and ministry members upon a proposal by Premier when the SPA is in recess, 12. appoint or remove members of departmental committees of the SPA Presidium, 13. elect or transfer judges of the Central Court and people 's assessors, 14. ratify or abrogate treaties concluded with other countries, 15. decide on and publish the appointment or recall of diplomatic envoys accredited to foreign countries, 16. institute a decoration, a medal, an honorary title and a diplomatic rank, and grant a decoration, a medal, and an honorary title, 17. exercise the right to grant general amnesties or special pardon, 18. institute and reorganize an administration unit and district. Article 111 The President of the SPA Presidium organizes and guides the work of the presidium. The President of the SPA Presidium represents the State and receives credentials and letters of recall of diplomatic representatives accredited by a foreign state. Article 112 The SPA Presidium convenes a plenary meeting and an executive meeting. The plenary meeting consists of all the members and the executive meeting of the President, vice presidents, and secretary. Article 113 The SPA Presidium 's plenary meeting deliberates on and adopts important issues for the Presidium to implement its duties and authority. The executive meeting deliberates on and adopts issues which are entrusted to it by the plenary meeting. Article 114 The SPA Presidium issues decrees, decisions and directions. Article 115 The SPA Presidium may set up its assistant departmental committees. Article 116 The SPA Presidium is accountable to the SPA. Paragraph IV) Cabinet Article 117 The Cabinet is the administrative and executive body of the highest organ of State power and a general state management organ. Article 118 The Cabinet consists of the Premier, vice premiers, chairmen of commissions, ministers and some other necessary members. The Cabinet 's term is the same as that of the SPA. Article 119 The Cabinet has duties and authority to: 1. adopt measures to execute state policy, 2. institute, amend, and supplement regulations concerning state management based on the Constitution and departmental laws, 3. guide the work of the Cabinet commissions, ministries, direct organs of the Cabinet, local people 's committees, 4. set up and remove direct organs of the Cabinet, main administrative economic organizations, and enterprises, and adopt measures to improve the State management structure, 5. draft the State plan for the development of the national economy and adopt measures to put it into effect, 6. compile the State budget and adopt measures to implement it, 7. organize and exercise works in the fields of industry, agriculture, construction, transportation, communications, commerce, trade, land management, city management, education, science, culture, health, physical training, labor administration, environmental protection, tourism and others, 8. adopt measures to strengthen the monetary and banking system, 9. do inspection and control work to establish a state management order, 1. adopt measures to maintain social order, protect State and social cooperation body 's possession and interests, and to guarantee citizens ' rights, 11. conclude treaties with foreign countries, and conduct external activities, 12. abolish decisions and directions by economic administrative organs, which run counter to the Cabinet decisions or directions, Article 12 The Premier of the Cabinet organizes and guides the work of the Cabinet. The Premier represents the government of the DPRK. Article 121 The Cabinet convenes a plenary meeting and an executive meeting. The plenary meeting consists of all the Cabinet members and the executive meeting of the Premier, vice premier and other Cabinet members whom the Premier nominates. Article 122 The Cabinet plenary meeting deliberates on and adopts new and important issues in economic administrative work. Article 123 The Cabinet adopts decisions and directions. Article 124 The Cabinet may set up non-permanent departmental committees which assist in its works. Article 125 The Cabinet is accountable to the SPA, and to the SPA Presidium when the SPA is in recess. Article 126 The newly elected Premier of the Cabinet makes an oath in the SPA, representing Cabinet members. Article 127 The Cabinet commission and ministries are departmental executive organs, and departmental management organs. Article 128 The Cabinet commissions and ministries grasp, guide and manage the work in charge, under the guidance of the Cabinet. Article 129 The Cabinet commissions and ministries manage committee assemblies and cadres assemblies. Commission and ministry committee assemblies and cadres assemblies deliberate on and adopt measures to exercise Cabinet decisions, and directions and other important issues. Article 13 The Cabinet commissions and ministries issue directions. Paragraph V) Local People's Assembly Article 131 Provincial (or municiparity directly under the central authority), municipal (district), and county local people 's assemblies are local sovereign power organs. Article 132 The LPA consists of deputies elected on the principle of universal, equal and direct suffrage by secret ballot. Article 133 The term of provincial (or municipality directly under the central authority), municipal (district), and county local people 's assemblies are four years. A new election of the LPA is held according to a decision of a Local People 's Committee (LPC) at the corresponding level before the LPA 's term expires. Article 134 The LPA has the duties and authority to: 1. deliberate on and approve a report on local plans for the development of the national economy, and their implementation, 2. deliberate on and approve a report on a local budget and its execution, 3. adopt measures to exercise State laws in the area concerned, 4. elect or recall the chairman, vice chairmen, secretary of the people 's committee at the corresponding level, 5. elect or recall judges of a court and people 's assessors, 6. abolish unwarranted decisions and directions adopted by a people 's committee, and a lower people 's assembly. Article 135 The LPA convenes a regular assembly and an extraordinary assembly. The regular assembly is convened once or twice in a year by an LPC at the corresponding level. The extraordinary assembly is held when the people 's committee at the corresponding level deems it necessary or at the request of a minimum of one-third of the total numbers of deputies. Article 136 The LPA forms a quorum when the two-third of the deputies participate in it. Article 137 The LPA elects its chairman. Article 138 The LPA issues its decisions. Paragraph VI) Local People's Committee Article 139 Provincial (or municipality directly under the central authority), municipal (district), and county local people 's committees are local sovereign power organs when the corresponding LPAs are in recess, and are administrative executive organs of local sovereignty. Article 14 The LPC consists of its chairman, vice chairmen, secretaries and members. The term of LPC is the same as that of the LPA. Article 141 The LPC has the duties and authorities to: 1. convene a people 's assembly, 2. do preparatory work for the election of a local assembly, 3. do work with deputies of a people 's assembly, 4. exercise laws, decrees, decisions and directions of the people 's assembly at the corresponding level, upper people 's assemblies, people 's committees, and the Cabinet, Cabinet commissions, and ministries, 5. organize and exercise all the administrative work in the area concerned, 6. draft a local plan for the development of the national economy and adopt measures to put it into effect, 7. compile a local budget and adopt measures to put it into effect, 8. adopt measures to maintain social order in the area concerned, protect the property and interests of the State and social cooperative organizations, and to guarantee citizens ' rights, 9. do inspection and control work to establish order in state management in the area concerned, 1. guide the lower people 's committees in its work, 11. abolish unwarranted decisions and direction adopted by a lower people 's committee, and suspend implementation of unwarranted decisions made by a lower people 's committee. Article 142 The LPC convenes a plenary meeting and an executive meeting. The plenary meeting consists of all the LPC members, and the executive meeting of the chairman, vice chairmen, and secretary. Article 143 The plenary meeting deliberates on and adopts important issues for the LPC to implement its duties and authority. Article 144 The LPC issues decisions and directions. Article 145 The LPC may set up non-permanent departmental committees which assist in its works. Article 146 The LPC is accountable to the LPA at the correspondent level. The LPC is subordinate to the upper people 's committees and the Cabinet. Paragraph VII) Public Procurators ' Office and Court Article 147 Justice is administered by the Central Court, the Court of the province (or municipality directly under the central authority), municipal and county courts and the Special Court. Article 148 The term of office of the President of the Central Court is the same as that of the SPA. Article 149 The Central Procurators ' Office appoints and recalls a public procurator. Article 15 The functions of the Public Procurators ' Office are to: 1.ensure the strict observance of laws by institutions, enterprises, organizations and by citizens, 2. ensure that decisions and directives of State bodies conform with the Constitution, the SPA 's laws and decisions, the NDC 's decisions and orders, the SPA Presidium 's decrees, decisions, and directions, and the Cabinet decisions. 3. expose and institute legal proceedings against criminals and offenders in order to protect the State power of the DPRK, the socialist system, the property of the State and social, cooperative organizations and personal rights as guaranteed by the Consitution and the people 's lives and property. Article 151 Investigation are prosecution are conducted under the unified direction of the Central Public Procurators' Office, and all Public Procurators Offices are subordinate to their higher offices and the Central Procurators ' Office. Article 152 The Central Procurators' Office is accountable to the SPA, and to the SPA Presidium when the SPA is in recess. Article 153 Justice is administered by the Central Court, Provincial (or municipality directly under the central authority) Court, People's Court or by the Special Court. Verdicts are delivered in the name of the DPRK. Article 154 The term of director of the Central Court is the same as that of the SPA. The term of judges of the Central Court, Provincial (or municipality directly under the central authority) Court, People's Court, and that of the people's assessors are the same as that of the people's a", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 15:20:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "I just heard that.", 
        "intTime": 20090529, 
        "postID": 9, 
        "quote": "", 
        "reply": "I just heard that.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 15:21:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "What happens when China shows up to play? Has that been considered? Not that I don't have faith in our military, I do. Remember what happened during the Korean War, when China showed up to the party. Just not too enthused about sending our military in and suffering more losses at the moment. quote: Originally posted by Irwin_R_Schyster: quote: May 29, 2009 Associated Press WASHINGTON - The United States could fight an old-fashioned war against North Korea if necessary, even while newer forms of conflict against terrorists and extremists continue, the Army's top officer said Thursday. Asked whether the United States would be prepared to fight if war broke out between South Korea and North Korea, Gen. George Casey replied, \"The short answer is yes,\" then added that \"it would probably take us a little bit longer to shift gears\" away from the type of counterinsurgency fighting that now occupies the Army. Casey said his usual rubric for how long it would take the Army to gear up for a new \"conventional\" war is about 90 days. That doesn't mean it would take 90 days for the U.S. to effectively fight the North's million-man army, he said. I agree with the general in the sense that we have the best fighting force in the world that will respond when ordered too... Its refreshing to hear someone have faith in our Military.", 
        "intTime": 20090529, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: May 29, 2009 Associated Press WASHINGTON - The United States could fight an old-fashioned war against North Korea if necessary, even while newer forms of conflict against terrorists and extremists continue, the Army's top officer said Thursday. Asked whether the United States would be prepared to fight if war broke out between South Korea and North Korea, Gen. George Casey replied, \"The short answer is yes,\" then added that \"it would probably take us a little bit longer to shift gears\" away from the type of counterinsurgency fighting that now occupies the Army. Casey said his usual rubric for how long it would take the Army to gear up for a new \"conventional\" war is about 90 days. That doesn't mean it would take 90 days for the U.S. to effectively fight the North's million-man army, he said. I agree with the general in the sense that we have the best fighting force in the world that will respond when ordered too... Its refreshing to hear someone have faith in our Military.", 
        "reply": "What happens when China shows up to play? Has that been considered? Not that I don't have faith in our military, I do. Remember what happened during the Korean War, when China showed up to the party. Just not too enthused about sending our military in and suffering more losses at the moment. ", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-29 15:37:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "If we get into a war with North Korea do you all think we could win? Do we have enough troops who know how to fight in cold weather? Will China help us? Can we afford it money wise? If we do win do we turn North Korea over to South Korea? If Obama attacks North Korea will Fox news support him? Will NBC and CNN? What percentage of our troops will get PTSD when the first snow falls? Will Murtha call our troops murders again? Will Bush offer advice to Barry? Will Pelosi change her mind on water boarding again? These are just a few questions that must be answered.", 
        "intTime": 20090530, 
        "postID": 11, 
        "quote": "", 
        "reply": "If we get into a war with North Korea do you all think we could win? Do we have enough troops who know how to fight in cold weather? Will China help us? Can we afford it money wise? If we do win do we turn North Korea over to South Korea? If Obama attacks North Korea will Fox news support him? Will NBC and CNN? What percentage of our troops will get PTSD when the first snow falls? Will Murtha call our troops murders again? Will Bush offer advice to Barry? Will Pelosi change her mind on water boarding again? These are just a few questions that must be answered.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-30 14:08:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Duster6"
    }, 
    {
        "content": "This will not be a \"Team Spirit\" style conflict... \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 12, 
        "quote": "", 
        "reply": "This will not be a \"Team Spirit\" style conflict... \"The World's Finest\"", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-30 14:11:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "We can fight anybody but going hot with NK is a dumb idea since we don't have to.", 
        "intTime": 20090530, 
        "postID": 13, 
        "quote": "", 
        "reply": "We can fight anybody but going hot with NK is a dumb idea since we don't have to.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-30 15:37:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Personally, I think if NK and China have half a brain...they will know the dragons in proximity to Taiwan and nearby...are now targetting NK...I would think... This is NOT a threat of conventional warfare...but a threat of obliteration... Let me speak plainly...NK must realize that a threat of this magnitude to SK and Japan could result in the obliteration of the North Korean society... There is no one up-man-ship in the Nuclear game...all lose something... China MUST reign-in their lapdogs...", 
        "intTime": 20090530, 
        "postID": 14, 
        "quote": "", 
        "reply": "Personally, I think if NK and China have half a brain...they will know the dragons in proximity to Taiwan and nearby...are now targetting NK...I would think... This is NOT a threat of conventional warfare...but a threat of obliteration... Let me speak plainly...NK must realize that a threat of this magnitude to SK and Japan could result in the obliteration of the North Korean society... There is no one up-man-ship in the Nuclear game...all lose something... China MUST reign-in their lapdogs...", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-30 16:28:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "I think the people of North Korea want a war not to win but simply to be liberated and taken out of the dark ages. They have their fingers crossed that the US will be involved so they can get any stimulus money if we still have any left over.", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "", 
        "reply": "I think the people of North Korea want a war not to win but simply to be liberated and taken out of the dark ages. They have their fingers crossed that the US will be involved so they can get any stimulus money if we still have any left over.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-30 18:43:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I think the people of North Korea want a war not to win but simply to be liberated and taken out of the dark ages. They have their fingers crossed that the US will be involved so they can get any stimulus money if we still have any left over.", 
        "intTime": 20090530, 
        "postID": 16, 
        "quote": "Originally posted by Duster6: I think the people of North Korea want a war not to win but simply to be liberated and taken out of the dark ages. They have their fingers crossed that the US will be involved so they can get any stimulus money if we still have any left over.", 
        "reply": "", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-30 19:49:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "We need to remember they still have two American journalist that according to Chinese sources, are being treated well. Although he's shooting off his little missiles, we don't see any significant troop movement so he's just following his usual pattern of bluster and BS. He's not wanting to really start anything. He's playing \"let's make a deal\", same as always. The real question is how we should react this time. I don't think his future is fraught with longevity. The Korean people are desperately wanting a breath of fresh air.", 
        "intTime": 20090531, 
        "postID": 17, 
        "quote": "", 
        "reply": "We need to remember they still have two American journalist that according to Chinese sources, are being treated well. Although he's shooting off his little missiles, we don't see any significant troop movement so he's just following his usual pattern of bluster and BS. He's not wanting to really start anything. He's playing \"let's make a deal\", same as always. The real question is how we should react this time. I don't think his future is fraught with longevity. The Korean people are desperately wanting a breath of fresh air.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-31 01:46:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "If Menta-lee Ill starts a war by attacking the US or South Korea The US and SK forces will obliterate the NKs, and the Chinese will do nothing to stop it because they had their fill of these commie P!ss-ants as well.", 
        "intTime": 20090531, 
        "postID": 18, 
        "quote": "", 
        "reply": "If Menta-lee Ill starts a war by attacking the US or South Korea The US and SK forces will obliterate the NKs, and the Chinese will do nothing to stop it because they had their fill of these commie P!ss-ants as well.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-31 05:25:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "McMax"
    }, 
    {
        "content": "Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife.", 
        "intTime": 20090531, 
        "postID": 19, 
        "quote": "", 
        "reply": "Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-31 05:51:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife. I tend to disagree Bleah...the NK's are now confronting us with supposed Nuclear weapons of various yields...and proven delivery systems to SK and Japan... The usual extortion/ blackmail scheme has escalated somewhat. Do We the People put our foot down...or pacify them once again...as We did over their nuclear development program...or missile development programs...for concessions We gave up aide... They seem NOT to have worked... As Roosevelt said, might be time to \" walk softly and carry a big \"Megaton\" stick...", 
        "intTime": 20090531, 
        "postID": 20, 
        "quote": "Originally posted by Bleah: Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife.", 
        "reply": " I tend to disagree Bleah...the NK's are now confronting us with supposed Nuclear weapons of various yields...and proven delivery systems to SK and Japan... The usual extortion/ blackmail scheme has escalated somewhat. Do We the People put our foot down...or pacify them once again...as We did over their nuclear development program...or missile development programs...for concessions We gave up aide... They seem NOT to have worked... As Roosevelt said, might be time to \" walk softly and carry a big \"Megaton\" stick...", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-31 16:56:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: quote: Originally posted by Bleah: Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife. I tend to disagree Bleah...the NK's are now confronting us with supposed Nuclear weapons of various yields...and proven delivery systems to SK and Japan... The usual extortion/ blackmail scheme has escalated somewhat. Do We the People put our foot down...or pacify them once again...as We did over their nuclear development program...or missile development programs...for concessions We gave up aide... They seem NOT to have worked... As Roosevelt said, might be time to \" walk softly and carry a big \"Megaton\" stick... NK has a well established pattern of saber rattling that has gone on at least since the Clinton Administration. The world's responses has been to give them something to get them to stop. They take the offers, use them up and then come back with more saber rattling. Now they want some more. I don't think they have any intention of attacking anyone. They are not stupid and they are not suicidal. And China is not going to back NK. The US is in debt to China to the hilt. China knows what will happen if they join in with NK. They will not get their money from the US. And on top of that, China does not want to deal with the millions of refugees that would flood across their borders into China. I think NK is more of a problem for China than it is for the US. NK wants nuke status because they think that status will keep them from being attacked by the US. The US has never pre-emptively attacked a country that has nukes. If it is NK's goal to unite the Korea's by a first strike, where do all the refugees go? That's right, China and China definitely does not want that. Frankly, I don't think anyone is going to do anything but what they have been doing since the 1990's - more economic sanctions and isolation tactics that really do no harm to the NK military. The civilians are the ones that are injured and starved and the NK regime doesn't care squat about its poor and starving public. So far, all we have gotten are setting off of bombs and missles, tough talk from those who object and scramblings to go on alert by the different militaries.", 
        "intTime": 20090531, 
        "postID": 21, 
        "quote": "Originally posted by strobelvets: quote: Originally posted by Bleah: Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife. I tend to disagree Bleah...the NK's are now confronting us with supposed Nuclear weapons of various yields...and proven delivery systems to SK and Japan... The usual extortion/ blackmail scheme has escalated somewhat. Do We the People put our foot down...or pacify them once again...as We did over their nuclear development program...or missile development programs...for concessions We gave up aide... They seem NOT to have worked... As Roosevelt said, might be time to \" walk softly and carry a big \"Megaton\" stick...", 
        "reply": " NK has a well established pattern of saber rattling that has gone on at least since the Clinton Administration. The world's responses has been to give them something to get them to stop. They take the offers, use them up and then come back with more saber rattling. Now they want some more. I don't think they have any intention of attacking anyone. They are not stupid and they are not suicidal. And China is not going to back NK. The US is in debt to China to the hilt. China knows what will happen if they join in with NK. They will not get their money from the US. And on top of that, China does not want to deal with the millions of refugees that would flood across their borders into China. I think NK is more of a problem for China than it is for the US. NK wants nuke status because they think that status will keep them from being attacked by the US. The US has never pre-emptively attacked a country that has nukes. If it is NK's goal to unite the Korea's by a first strike, where do all the refugees go? That's right, China and China definitely does not want that. Frankly, I don't think anyone is going to do anything but what they have been doing since the 1990's - more economic sanctions and isolation tactics that really do no harm to the NK military. The civilians are the ones that are injured and starved and the NK regime doesn't care squat about its poor and starving public. So far, all we have gotten are setting off of bombs and missles, tough talk from those who object and scramblings to go on alert by the different militaries.", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-05-31 21:02:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: quote: Originally posted by Bleah: Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife. I tend to disagree Bleah...the NK's are now confronting us with supposed Nuclear weapons of various yields...and proven delivery systems to SK and Japan... The usual extortion/ blackmail scheme has escalated somewhat. Do We the People put our foot down...or pacify them once again...as We did over their nuclear development program...or missile development programs...for concessions We gave up aide... They seem NOT to have worked... As Roosevelt said, might be time to \" walk softly and carry a big \"Megaton\" stick... I must agree with Brett Strobelvets here is my opinion made on another but similar topic on Sound Off Oliver North: quote: Originally posted by yanqui69: So will PBHO bring \"change\" or be just like the rest of the previous \"watch & wait\" presidents since Truman who got our butts in this Korea mess in the first place? In my opinion it was action that needed to be taken at the time in history. The Korean War began with an attack made by North Korean forces across the 38th parallel dividing North and South Korea on June 24th 1950, it was a complete surprise to the American people. It was feared that this attack was the beginning of World War III. I remember it vividly as I was 9 and 1/2 when it started and over 12 when fighting ceased. Most adult people remembered Chamberlain's 1938 Munich capitulation to Germany, this affected American policy makers. Most seemed to feel that it was better to fight a small war in the present, than a large scale war later. The Soviet Union was boycotting United Nations sessions, thus the United States obtained a resolution calling for a U.N. force to oppose the invasion. The U.S. fought under the United Nations flag. North Korean forces managed to advance far to the south, trapping Americans near the city of Pusan. The amphibious landing in Inchon in September turned the tide of the war. By November, American forces had almost reached the Chinese border. Chinese troops intervened, however, forcing back American forces. Finally, the military positions stabilized, not far from the original border where the war had began. General MacArthur, Supreme Allied Commander of the U.N. Forces, called for the use of additional power against the Chinese, including the use of nuclear weapons. The President and the rest of the Administration decided instead that it was more important to concentrate on defending Europe. As fear of a Soviet attack loomed, that too affected those of us who read and heard the news. General MacArthur continued to speak out against the administration's policies, President Truman fired him. It took another two years to reach a cease-fire agreement. Chinese troops intervened, November 1, 1950. Thousands of Chinese had attacked from the north, northwest, and west against scattered U.S. and South Korean (Republic of Korea or ROK) units moving deep into North Korea. The Chinese seemed to come out of nowhere as they swarmed around the flanks and over the defensive positions of the surprised United Nations (UN) troops. Will they again? That is the question. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090601, 
        "postID": 22, 
        "quote": "Originally posted by strobelvets: quote: Originally posted by Bleah: Sure we can beat the Norks, eventually. That doesn't make a resumption of open warfare a wise choice. Really, what is it with the people in our country? I'm as proud of our military as the next guy -hell, I've served it for a decade - but it should be our last resort, not our first. This is the reason our world reputation is something akin to Yosemite Sam or Barney Fife. I tend to disagree Bleah...the NK's are now confronting us with supposed Nuclear weapons of various yields...and proven delivery systems to SK and Japan... The usual extortion/ blackmail scheme has escalated somewhat. Do We the People put our foot down...or pacify them once again...as We did over their nuclear development program...or missile development programs...for concessions We gave up aide... They seem NOT to have worked... As Roosevelt said, might be time to \" walk softly and carry a big \"Megaton\" stick...", 
        "reply": " I must agree with Brett Strobelvets here is my opinion made on another but similar topic on Sound Off Oliver North: quote: Originally posted by yanqui69: So will PBHO bring \"change\" or be just like the rest of the previous \"watch & wait\" presidents since Truman who got our butts in this Korea mess in the first place? In my opinion it was action that needed to be taken at the time in history. The Korean War began with an attack made by North Korean forces across the 38th parallel dividing North and South Korea on June 24th 1950, it was a complete surprise to the American people. It was feared that this attack was the beginning of World War III. I remember it vividly as I was 9 and 1/2 when it started and over 12 when fighting ceased. Most adult people remembered Chamberlain's 1938 Munich capitulation to Germany, this affected American policy makers. Most seemed to feel that it was better to fight a small war in the present, than a large scale war later. The Soviet Union was boycotting United Nations sessions, thus the United States obtained a resolution calling for a U.N. force to oppose the invasion. The U.S. fought under the United Nations flag. North Korean forces managed to advance far to the south, trapping Americans near the city of Pusan. The amphibious landing in Inchon in September turned the tide of the war. By November, American forces had almost reached the Chinese border. Chinese troops intervened, however, forcing back American forces. Finally, the military positions stabilized, not far from the original border where the war had began. General MacArthur, Supreme Allied Commander of the U.N. Forces, called for the use of additional power against the Chinese, including the use of nuclear weapons. The President and the rest of the Administration decided instead that it was more important to concentrate on defending Europe. As fear of a Soviet attack loomed, that too affected those of us who read and heard the news. General MacArthur continued to speak out against the administration's policies, President Truman fired him. It took another two years to reach a cease-fire agreement. Chinese troops intervened, November 1, 1950. Thousands of Chinese had attacked from the north, northwest, and west against scattered U.S. and South Korean (Republic of Korea or ROK) units moving deep into North Korea. The Chinese seemed to come out of nowhere as they swarmed around the flanks and over the defensive positions of the surprised United Nations (UN) troops. Will they again? That is the question. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_2750006422001", 
        "time": "2009-06-01 02:57:00", 
        "title": "General Casey: We can fight North Korea.", 
        "userID": "DaveBarker"
    }
]