[
    {
        "content": "Why would Colin Powell stoop to try to lead the Republican Party while it is in the throes of death. If he doesn't become a Democrat he could join the Libertarians who will oppose the Democrats in the future. I'm sure grateful that the Democrats who lead our Country are so dedicated to doing what's best for us in the way of social justice,a fair tax system with prosperity for all and leading us in the fight against global warming. When the Republicans controlled the Congress from 1994 until more recently did they balance the budget or lead with integrity? No, they all were hypnotized by Rush Limbaugh who misled them to all become evil. I mean how else would they have ended up nominating the illiterate George W. Bush? Take pity on those poor misinformed Republicans like Newt Gingrich. Why he doesn't even have a Law Degree. How could he have become a Law Maker who could deal with intellectual heavyweights like President Clinton who balanced the Budget and restored confidence in our Nation? I feel also feel sorry for Dick Cheney who has obviously not been exposed to the truth of what the world has been dealing with because of Rush Limbaugh. And what about Rush Limbaugh? What Agency appointed him to such a prominent role of telling us what to think? All I've heard about Rush Limbaugh is that he was somehow a sports commentator before he burst onto the World Stage. And now he has finally stepped down as leader of the Republican Party and is offering the job to Colin Powell. This is so surreal. This message has been edited. Last edited by: billford1, Sun 24 May 2009 06:39 PM", 
        "intTime": 20090524, 
        "postID": 1, 
        "quote": "", 
        "reply": "Why would Colin Powell stoop to try to lead the Republican Party while it is in the throes of death. If he doesn't become a Democrat he could join the Libertarians who will oppose the Democrats in the future. I'm sure grateful that the Democrats who lead our Country are so dedicated to doing what's best for us in the way of social justice,a fair tax system with prosperity for all and leading us in the fight against global warming. When the Republicans controlled the Congress from 1994 until more recently did they balance the budget or lead with integrity? No, they all were hypnotized by Rush Limbaugh who misled them to all become evil. I mean how else would they have ended up nominating the illiterate George W. Bush? Take pity on those poor misinformed Republicans like Newt Gingrich. Why he doesn't even have a Law Degree. How could he have become a Law Maker who could deal with intellectual heavyweights like President Clinton who balanced the Budget and restored confidence in our Nation? I feel also feel sorry for Dick Cheney who has obviously not been exposed to the truth of what the world has been dealing with because of Rush Limbaugh. And what about Rush Limbaugh? What Agency appointed him to such a prominent role of telling us what to think? All I've heard about Rush Limbaugh is that he was somehow a sports commentator before he burst onto the World Stage. And now he has finally stepped down as leader of the Republican Party and is offering the job to Colin Powell. This is so surreal. This message has been edited. Last edited by: billford1, Sun 24 May 2009 06:39 PM", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-24 18:21:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "billford1"
    }, 
    {
        "content": "IS THIS FRIGGING THREAD FOR REAL????", 
        "intTime": 20090524, 
        "postID": 2, 
        "quote": "", 
        "reply": "IS THIS FRIGGING THREAD FOR REAL????", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-24 22:37:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "tawodi"
    }, 
    {
        "content": "This is perhaps the most pointless thread I have seen in some time. The former chairman of the joint chiefs of staff may still be refering to himself as a Republican but his actions speak louder than his words. Dick Cheny is very well informed. Limbaugh is a loose cannon and a pawn of the Democrats to distract the public from their questionable policies.", 
        "intTime": 20090525, 
        "postID": 3, 
        "quote": "", 
        "reply": "This is perhaps the most pointless thread I have seen in some time. The former chairman of the joint chiefs of staff may still be refering to himself as a Republican but his actions speak louder than his words. Dick Cheny is very well informed. Limbaugh is a loose cannon and a pawn of the Democrats to distract the public from their questionable policies.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 00:50:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Limbaugh is a loose cannon and a pawn of the Democrats to distract the public from their questionable policies. “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.”", 
        "intTime": 20090525, 
        "postID": 4, 
        "quote": "Limbaugh is a loose cannon and a pawn of the Democrats to distract the public from their questionable policies.", 
        "reply": " “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.”", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 01:15:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Steele understands that many people like Rush and is reluctant to criticse the man. The leader of the GOP may not emurge for another year or two. Mike Huckabee may be the one. Rock On!", 
        "intTime": 20090525, 
        "postID": 5, 
        "quote": "", 
        "reply": "Steele understands that many people like Rush and is reluctant to criticse the man. The leader of the GOP may not emurge for another year or two. Mike Huckabee may be the one. Rock On!", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 01:47:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Steele understands that Rush is the de-facto leader of the GOP and he could have him out of a job in no time if he chose to cross Rush.", 
        "intTime": 20090525, 
        "postID": 6, 
        "quote": "", 
        "reply": "Steele understands that Rush is the de-facto leader of the GOP and he could have him out of a job in no time if he chose to cross Rush.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 01:55:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: Steele understands that Rush is the de-facto leader of the GOP and he could have him out of a job in no time if he chose to cross Rush. If you say so...", 
        "intTime": 20090525, 
        "postID": 7, 
        "quote": "Originally posted by karlhungusjr: Steele understands that Rush is the de-facto leader of the GOP and he could have him out of a job in no time if he chose to cross Rush.", 
        "reply": " If you say so...", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 02:14:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "why else would he be \"reluctant\" to criticize him?", 
        "intTime": 20090525, 
        "postID": 8, 
        "quote": "", 
        "reply": "why else would he be \"reluctant\" to criticize him?", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 02:45:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Powell is either a little misguided, or a democratic plant, and Mr. Cheney is far from being \"ill-informed.\" \"The World's Finest\"", 
        "intTime": 20090525, 
        "postID": 9, 
        "quote": "", 
        "reply": "Powell is either a little misguided, or a democratic plant, and Mr. Cheney is far from being \"ill-informed.\" \"The World's Finest\"", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 03:25:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: or a democratic plant, BWAHAHAHAHAHAHA! He's been undercover for how many decades now? amazing.", 
        "intTime": 20090525, 
        "postID": 10, 
        "quote": "or a democratic plant,", 
        "reply": " BWAHAHAHAHAHAHA! He's been undercover for how many decades now? amazing.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 03:29:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: or a democratic plant, BWAHAHAHAHAHAHA! He's been undercover for how many decades now? amazing. He did vote for a radical, hard-core, liberal activist for president. He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. I am willing to give him the benefit of the doubt by calling his actions of late towards the GOP misguided. At best, he is a RINO. \"The World's Finest\"", 
        "intTime": 20090525, 
        "postID": 11, 
        "quote": "Originally posted by karlhungusjr: quote: or a democratic plant, BWAHAHAHAHAHAHA! He's been undercover for how many decades now? amazing.", 
        "reply": " He did vote for a radical, hard-core, liberal activist for president. He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. I am willing to give him the benefit of the doubt by calling his actions of late towards the GOP misguided. At best, he is a RINO. \"The World's Finest\"", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 03:44:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO?", 
        "intTime": 20090525, 
        "postID": 12, 
        "quote": "He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes.", 
        "reply": " apparently he was correct. So how does stating that make him a RINO?", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 03:58:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "'http://abcnews.go.com/Politics/story?id=7667369&page=1' The trouble with this report is that they keep playing the loop of \"I won\". You want more people to address the Parties shortcomings, then forget about the Democrats and get back to basics. \"Powell finds himself in the middle of an increasingly bitter family feud over how to bring the GOP back to life\" I still haven't heard him say what should be done. He should know that you can't generalize after being a General. You don't bring his problems, you bring him solutions. \"You can only do two things with a base: you can sit on it and watch the world go by or you can build on the base.\" There's the problem Mr Powell, now what's the solution? Karl Rove thinks that there's room for Mr Powell in the GOP... \"lay out his vision, and then back it up by finding people share it and working like heck to get them.\" Colin Powell: Still a Republican? Perhaps but he's not bringing any solutions to the table. If he wants to help put feet (a base) to those words and then I might consider his propositions as valid.", 
        "intTime": 20090525, 
        "postID": 13, 
        "quote": "", 
        "reply": "'http://abcnews.go.com/Politics/story?id=7667369&page=1' The trouble with this report is that they keep playing the loop of \"I won\". You want more people to address the Parties shortcomings, then forget about the Democrats and get back to basics. \"Powell finds himself in the middle of an increasingly bitter family feud over how to bring the GOP back to life\" I still haven't heard him say what should be done. He should know that you can't generalize after being a General. You don't bring his problems, you bring him solutions. \"You can only do two things with a base: you can sit on it and watch the world go by or you can build on the base.\" There's the problem Mr Powell, now what's the solution? Karl Rove thinks that there's room for Mr Powell in the GOP... \"lay out his vision, and then back it up by finding people share it and working like heck to get them.\" Colin Powell: Still a Republican? Perhaps but he's not bringing any solutions to the table. If he wants to help put feet (a base) to those words and then I might consider his propositions as valid.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 06:53:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "This is nothing but more backstabbing that is ongoing in the Republican Party. And as long as the Party has the likes of Rush \"Tokyo Rose\" Limbaugh in the lead pack, mouthing off asinine, divisive remarks, the Party will remain in disarray. This is nothing but more whining and sour grapes by Tokyo Rose Limbaugh and will amount to nothing more but divisiveness within the Party. Colin Powell was back stabbed when he made his UN appearance with defective information and now he is being back stabbed because he voted for Obama. I can just envision the looney toons laughing that is ongoing in the Democratic hallways.", 
        "intTime": 20090525, 
        "postID": 14, 
        "quote": "", 
        "reply": "This is nothing but more backstabbing that is ongoing in the Republican Party. And as long as the Party has the likes of Rush \"Tokyo Rose\" Limbaugh in the lead pack, mouthing off asinine, divisive remarks, the Party will remain in disarray. This is nothing but more whining and sour grapes by Tokyo Rose Limbaugh and will amount to nothing more but divisiveness within the Party. Colin Powell was back stabbed when he made his UN appearance with defective information and now he is being back stabbed because he voted for Obama. I can just envision the looney toons laughing that is ongoing in the Democratic hallways.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 08:39:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: why else would he be \"reluctant\" to criticize him? Unlike President Obama and his followers, he uses his time to do his job. Instead of attacking private citizens. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090525, 
        "postID": 15, 
        "quote": "Originally posted by karlhungusjr: why else would he be \"reluctant\" to criticize him?", 
        "reply": " Unlike President Obama and his followers, he uses his time to do his job. Instead of attacking private citizens. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 08:46:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Conservatives support lower taxes and a smaller government. Conservatives believe lower taxes create more incentive for people to work, save, invest, and engage in entrepreneurial endeavors. Money is best spent by those who earn it. Liberals and Powell support higher taxes and a larger government. Liberals believe high taxes enable the government to do good and create jobs. Liberals need high taxes for social welfare programs, to provide for the poor, etc. Liberals believe we can’t afford to cut taxes. Powell is a RINO. \"The World's Finest\"", 
        "intTime": 20090525, 
        "postID": 16, 
        "quote": "Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO?", 
        "reply": " Conservatives support lower taxes and a smaller government. Conservatives believe lower taxes create more incentive for people to work, save, invest, and engage in entrepreneurial endeavors. Money is best spent by those who earn it. Liberals and Powell support higher taxes and a larger government. Liberals believe high taxes enable the government to do good and create jobs. Liberals need high taxes for social welfare programs, to provide for the poor, etc. Liberals believe we can’t afford to cut taxes. Powell is a RINO. \"The World's Finest\"", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 10:01:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Strange, it was either Zogby or Ramussen Poll that recently came out that said just the opposite of what you and Powell are saying. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090525, 
        "postID": 17, 
        "quote": "Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO?", 
        "reply": " Strange, it was either Zogby or Ramussen Poll that recently came out that said just the opposite of what you and Powell are saying. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 10:25:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Strange, it was either Zogby or Ramussen Poll that recently came out that said just the opposite of what you and Powell are saying. As did the majority of the citizens of California.", 
        "intTime": 20090525, 
        "postID": 18, 
        "quote": "Originally posted by L0A1: quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Strange, it was either Zogby or Ramussen Poll that recently came out that said just the opposite of what you and Powell are saying.", 
        "reply": " As did the majority of the citizens of California.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 11:00:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Strange, it was either Zogby or Ramussen Poll that recently came out that said just the opposite of what you and Powell are saying. actually its about even on we pay just about the right amount and we pay to much.When you add the \"we pay to little to the we pay just about the right amount, well figure it out for yourself --Savage", 
        "intTime": 20090525, 
        "postID": 19, 
        "quote": "Originally posted by L0A1: quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Strange, it was either Zogby or Ramussen Poll that recently came out that said just the opposite of what you and Powell are saying.", 
        "reply": " actually its about even on we pay just about the right amount and we pay to much.When you add the \"we pay to little to the we pay just about the right amount, well figure it out for yourself --Savage", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 13:06:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Conservatives support lower taxes and a smaller government. Conservatives believe lower taxes create more incentive for people to work, save, invest, and engage in entrepreneurial endeavors. Money is best spent by those who earn it. Liberals and Powell support higher taxes and a larger government. Liberals believe high taxes enable the government to do good and create jobs. Liberals need high taxes for social welfare programs, to provide for the poor, etc. Liberals believe we can’t afford to cut taxes. Powell is a RINO. ______________________________________________ Kegler, that should be posted every day. That stupid argument that the liberals keep trying to have. \"What is a coservative?? What is a RINO?? You splained it short and simple. The question is simple, If Powell says he still is a Republican, Why didn't he support McCain, a fellow middle of the roader and ex-military??? Or could it really have been a racial thing?? And the concept of big government was contrary to the founding principals of our nation...Go read the Federalist Papers. We never, ever were intended to be a Socialist society. It was the RINO of all RINOs Teddy Roosevelt who got this big government idea going and Woody Wilson who really gave it traction.", 
        "intTime": 20090525, 
        "postID": 20, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by karlhungusjr: quote: He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. apparently he was correct. So how does stating that make him a RINO? Conservatives support lower taxes and a smaller government. Conservatives believe lower taxes create more incentive for people to work, save, invest, and engage in entrepreneurial endeavors. Money is best spent by those who earn it. Liberals and Powell support higher taxes and a larger government. Liberals believe high taxes enable the government to do good and create jobs. Liberals need high taxes for social welfare programs, to provide for the poor, etc. Liberals believe we can’t afford to cut taxes. Powell is a RINO.", 
        "reply": " ______________________________________________ Kegler, that should be posted every day. That stupid argument that the liberals keep trying to have. \"What is a coservative?? What is a RINO?? You splained it short and simple. The question is simple, If Powell says he still is a Republican, Why didn't he support McCain, a fellow middle of the roader and ex-military??? Or could it really have been a racial thing?? And the concept of big government was contrary to the founding principals of our nation...Go read the Federalist Papers. We never, ever were intended to be a Socialist society. It was the RINO of all RINOs Teddy Roosevelt who got this big government idea going and Woody Wilson who really gave it traction.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-25 19:03:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "stosh301"
    }, 
    {
        "content": "Teddy Roosevelt was an ethical humanitarian who knew Upton Sinclair. Things were horrible for workers back then. I think George W. Bush would have done the same.", 
        "intTime": 20090526, 
        "postID": 21, 
        "quote": "", 
        "reply": "Teddy Roosevelt was an ethical humanitarian who knew Upton Sinclair. Things were horrible for workers back then. I think George W. Bush would have done the same.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-26 20:37:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "billford1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by karlhungusjr: quote: or a democratic plant, BWAHAHAHAHAHAHA! He's been undercover for how many decades now? amazing. He did vote for a radical, hard-core, liberal activist for president. He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. I am willing to give him the benefit of the doubt by calling his actions of late towards the GOP misguided. At best, he is a RINO. And if you read his autobiography, My American Journey you would find that he voted for LBJ instead of Barry M Goldwater.", 
        "intTime": 20090526, 
        "postID": 22, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by karlhungusjr: quote: or a democratic plant, BWAHAHAHAHAHAHA! He's been undercover for how many decades now? amazing. He did vote for a radical, hard-core, liberal activist for president. He's openly stated that Americans want bigger government, and are more than willing to pay higher taxes. I am willing to give him the benefit of the doubt by calling his actions of late towards the GOP misguided. At best, he is a RINO.", 
        "reply": " And if you read his autobiography, My American Journey you would find that he voted for LBJ instead of Barry M Goldwater.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-26 23:08:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "so out of 9 presidential elections we know he voted for a democrat twice. He's been campaigning for Republicans since at least 95 and we also know he campaigned for MCcain in 2000 and for George Bush. YET...since he voted for LBJ and since he said he was voting for Obama(and didnt campaign for him) now all the sudden he's just some dirty lib... The way republicans will eat their own after decades of loyalty simply amazes me.", 
        "intTime": 20090527, 
        "postID": 23, 
        "quote": "", 
        "reply": "so out of 9 presidential elections we know he voted for a democrat twice. He's been campaigning for Republicans since at least 95 and we also know he campaigned for MCcain in 2000 and for George Bush. YET...since he voted for LBJ and since he said he was voting for Obama(and didnt campaign for him) now all the sudden he's just some dirty lib... The way republicans will eat their own after decades of loyalty simply amazes me.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-27 02:29:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: so out of 9 presidential elections we know he voted for a democrat twice. He's been campaigning for Republicans since at least 95 and we also know he campaigned for MCcain in 2000 and for George Bush. YET...since he voted for LBJ and since he said he was voting for Obama(and didnt campaign for him) now all the sudden he's just some dirty lib... The way republicans will eat their own after decades of loyalty simply amazes me. Yeah, it's like that one, \"Awe schit.\" So then, that leaves only one reason he voted for Obama...because he's black. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 24, 
        "quote": "Originally posted by karlhungusjr: so out of 9 presidential elections we know he voted for a democrat twice. He's been campaigning for Republicans since at least 95 and we also know he campaigned for MCcain in 2000 and for George Bush. YET...since he voted for LBJ and since he said he was voting for Obama(and didnt campaign for him) now all the sudden he's just some dirty lib... The way republicans will eat their own after decades of loyalty simply amazes me.", 
        "reply": " Yeah, it's like that one, \"Awe schit.\" So then, that leaves only one reason he voted for Obama...because he's black. \"The World's Finest\"", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-27 02:30:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: So then, that leaves only one reason he voted for Obama...because he's black. which would explain why he also voted for Alan Keyes, Jesse Jackson and Al Sharpton..... If Powell voted for Obama because he's black then every white person who voted for McCain did so just because he's white.", 
        "intTime": 20090527, 
        "postID": 25, 
        "quote": "So then, that leaves only one reason he voted for Obama...because he's black.", 
        "reply": " which would explain why he also voted for Alan Keyes, Jesse Jackson and Al Sharpton..... If Powell voted for Obama because he's black then every white person who voted for McCain did so just because he's white.", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-27 03:21:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: So then, that leaves only one reason he voted for Obama...because he's black. which would explain why he also voted for Alan Keyes, Jesse Jackson and Al Sharpton..... If Powell voted for Obama because he's black then every white person who voted for McCain did so just because he's white. I voted for McCain because he was the more conservative of the two, not because he's white. I didn't vote for Obama because I don't support infanticide and abortion, I don't support socialism, I don't support bigger government, I don't support higher taxes, I don't support a weakened national defense, etc., which are the hallmarks of democratic socialists. How does Powell go from being a Reagan conservative, serving in several high level posts under Republican presidents, to voting for and supporting a radical, socialist leftist seemingly overnight? Everything that Powell espouses were McCain attributes. So my conclusion is that there was only one stark difference that motivated Powell to vote for Obama over McCain. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 26, 
        "quote": "Originally posted by karlhungusjr: quote: So then, that leaves only one reason he voted for Obama...because he's black. which would explain why he also voted for Alan Keyes, Jesse Jackson and Al Sharpton..... If Powell voted for Obama because he's black then every white person who voted for McCain did so just because he's white.", 
        "reply": " I voted for McCain because he was the more conservative of the two, not because he's white. I didn't vote for Obama because I don't support infanticide and abortion, I don't support socialism, I don't support bigger government, I don't support higher taxes, I don't support a weakened national defense, etc., which are the hallmarks of democratic socialists. How does Powell go from being a Reagan conservative, serving in several high level posts under Republican presidents, to voting for and supporting a radical, socialist leftist seemingly overnight? Everything that Powell espouses were McCain attributes. So my conclusion is that there was only one stark difference that motivated Powell to vote for Obama over McCain. \"The World's Finest\"", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-27 04:31:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: So my conclusion is that there was only one stark difference that motivated Powell to vote for Obama over McCain. riiiiight...which would explain why he also voted for Alan Keyes, Jesse Jackson and Al Sharpton.....", 
        "intTime": 20090527, 
        "postID": 27, 
        "quote": "So my conclusion is that there was only one stark difference that motivated Powell to vote for Obama over McCain.", 
        "reply": " riiiiight...which would explain why he also voted for Alan Keyes, Jesse Jackson and Al Sharpton.....", 
        "threadID": "409192893_8870071422001", 
        "time": "2009-05-27 04:43:00", 
        "title": "Rush Limbaugh will not get his wish and Mr. Cheney is ill-informed", 
        "userID": "karlhungusjr"
    }
]