[
    {
        "content": "What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. I don’t want you taking over private business like banks and auto makers with money that does not exist. I don’t want you borrowing money from me, my children or my grandchildren. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. I don’t want legalized killing of the most defenseless among us – the unborn. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I don’t want the illegal aliens given citizenship after breaking our laws. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. I don’t want you apologizing for America around the world. I don’t want judges who ignore the Constitution and written law. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. You are a shameless thief. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend. \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 1, 
        "quote": "Dear Barak Obama, I don’t want your socialized medicine. I don’t want you taking over private business like banks and auto makers with money that does not exist. I don’t want you borrowing money from me, my children or my grandchildren. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. I don’t want legalized killing of the most defenseless among us – the unborn. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I don’t want the illegal aliens given citizenship after breaking our laws. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. I don’t want you apologizing for America around the world. I don’t want judges who ignore the Constitution and written law. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. You are a shameless thief. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long.", 
        "reply": "What an appropriate, and timely letter:  Received from a Marine patriot and friend. \"The World's Finest\"", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-16 11:06:00", 
        "title": "Letter to President Obama", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Nicely put. If only we could fast forward until the next election.", 
        "intTime": 20090516, 
        "postID": 2, 
        "quote": "", 
        "reply": "Nicely put. If only we could fast forward until the next election.", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-16 12:00:00", 
        "title": "Letter to President Obama", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. President Obama does not advocate single payer, socialized health care. I don’t want you taking over private business like banks and auto makers with money that does not exist. President Obama is following he advice of most economists and doing what President Bush did in bailing out the banks. I don't like the dept either, but what is the alternative plan? I don’t want you borrowing money from me, my children or my grandchildren. When President Reagan took office, the Natioanl debt was $1.9 trillion. Over the next 28 years, all but 8 had Republican Presidents - the national debt went to over $10 trillion. Your grandchildren were in debt before President Obama was elected. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. President Obama has never endorsed the fairness doctrine. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. As President, President Obama has not advocated any weapons ban legislation/. I don’t want legalized killing of the most defenseless among us – the unborn. Abortion is legal on a state by state basis. President Reagan signed legislation making abortion legal in California when he was Governor there. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I have not heard that right wing rant - can't comment. I don’t want the illegal aliens given citizenship after breaking our laws. President Reagan signed legislation giving amnesty to illegal aliens when he was President. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. President Obama never did this, Rush just said he did, and bushies believed him I don’t want you apologizing for America around the world. President Obama never did this, Rush just said he did, and bushies believed him. I don’t want judges who ignore the Constitution and written law. Both sides say judges are activists when the ruling does not go their way. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. President did not look the other way when North Korea tested a nuclear bomb on his watch, there was just nothing he could do short of war. What do you suggest to stop Iran from getting a nuclear weapon? I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. Deny all you want, but take a look at a map of Antarctica - it is melting. You do not have to be aa scientist to figure out something is wrong. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. You do not know what the plan is, since it has not been fully laid out. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Huh? Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. Rants already addressed You are a shameless thief. No real Marine would say this about the Commander in Chief of the United States without disgracing the uniform. Any Marine that disgraces the uniform is not a real Marine. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. Opinion, influenced by conspiracy theories and Rush. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend.", 
        "intTime": 20090516, 
        "postID": 3, 
        "quote": "Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. President Obama does not advocate single payer, socialized health care. I don’t want you taking over private business like banks and auto makers with money that does not exist. President Obama is following he advice of most economists and doing what President Bush did in bailing out the banks. I don't like the dept either, but what is the alternative plan? I don’t want you borrowing money from me, my children or my grandchildren. When President Reagan took office, the Natioanl debt was $1.9 trillion. Over the next 28 years, all but 8 had Republican Presidents - the national debt went to over $10 trillion. Your grandchildren were in debt before President Obama was elected. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. President Obama has never endorsed the fairness doctrine. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. As President, President Obama has not advocated any weapons ban legislation/. I don’t want legalized killing of the most defenseless among us – the unborn. Abortion is legal on a state by state basis. President Reagan signed legislation making abortion legal in California when he was Governor there. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I have not heard that right wing rant - can't comment. I don’t want the illegal aliens given citizenship after breaking our laws. President Reagan signed legislation giving amnesty to illegal aliens when he was President. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. President Obama never did this, Rush just said he did, and bushies believed him I don’t want you apologizing for America around the world. President Obama never did this, Rush just said he did, and bushies believed him. I don’t want judges who ignore the Constitution and written law. Both sides say judges are activists when the ruling does not go their way. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. President did not look the other way when North Korea tested a nuclear bomb on his watch, there was just nothing he could do short of war. What do you suggest to stop Iran from getting a nuclear weapon? I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. Deny all you want, but take a look at a map of Antarctica - it is melting. You do not have to be aa scientist to figure out something is wrong. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. You do not know what the plan is, since it has not been fully laid out. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Huh? Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. Rants already addressed You are a shameless thief. No real Marine would say this about the Commander in Chief of the United States without disgracing the uniform. Any Marine that disgraces the uniform is not a real Marine. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. Opinion, influenced by conspiracy theories and Rush. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend.", 
        "reply": "", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-16 14:16:00", 
        "title": "Letter to President Obama", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. President Obama does not advocate single payer, socialized health care. I don’t want you taking over private business like banks and auto makers with money that does not exist. President Obama is following the advice of most economists and doing what President Bush did in bailing out the banks and industry. I don't like the debt either, but what is the alternative plan? I don’t want you borrowing money from me, my children or my grandchildren. When President Reagan took office, the Natioanl debt was $1.9 trillion. Over the next 28 years, all but 8 had Republican Presidents - the national debt went to over $10 trillion. Your grandchildren were in debt before President Obama was elected. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. President Obama has never endorsed the fairness doctrine. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. As President, President Obama has not advocated any weapons ban legislation/. I don’t want legalized killing of the most defenseless among us – the unborn. Abortion is legal on a state by state basis. President Reagan signed legislation making abortion legal in California when he was Governor there. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I have not heard that right wing rant - can't comment. I don’t want the illegal aliens given citizenship after breaking our laws. President Reagan signed legislation giving amnesty to illegal aliens when he was President. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. President Obama never did this, Rush just said he did, and bushies believed him I don’t want you apologizing for America around the world. President Obama never did this, Rush just said he did, and bushies believed him. I don’t want judges who ignore the Constitution and written law. Both sides say judges are activists when the ruling does not go their way. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. President Bush did not look the other way when North Korea tested a nuclear bomb on his watch, there was just nothing he could do short of war. What do you suggest to stop Iran from getting a nuclear weapon? I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. Deny all you want, but take a look at a map of Antarctica - it is melting. You do not have to be aa scientist to figure out something is wrong. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. You do not know what the plan is, since it has not been fully laid out. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Huh? Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. Rants already addressed You are a shameless thief. No real Marine would say this about the Commander in Chief of the United States without disgracing the uniform. Any Marine that disgraces the uniform is not a real Marine. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. Opinion, influenced by conspiracy theories and Rush. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend.", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "Originally posted by xerello: quote: Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. President Obama does not advocate single payer, socialized health care. I don’t want you taking over private business like banks and auto makers with money that does not exist. President Obama is following the advice of most economists and doing what President Bush did in bailing out the banks and industry. I don't like the debt either, but what is the alternative plan? I don’t want you borrowing money from me, my children or my grandchildren. When President Reagan took office, the Natioanl debt was $1.9 trillion. Over the next 28 years, all but 8 had Republican Presidents - the national debt went to over $10 trillion. Your grandchildren were in debt before President Obama was elected. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. President Obama has never endorsed the fairness doctrine. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. As President, President Obama has not advocated any weapons ban legislation/. I don’t want legalized killing of the most defenseless among us – the unborn. Abortion is legal on a state by state basis. President Reagan signed legislation making abortion legal in California when he was Governor there. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I have not heard that right wing rant - can't comment. I don’t want the illegal aliens given citizenship after breaking our laws. President Reagan signed legislation giving amnesty to illegal aliens when he was President. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. President Obama never did this, Rush just said he did, and bushies believed him I don’t want you apologizing for America around the world. President Obama never did this, Rush just said he did, and bushies believed him. I don’t want judges who ignore the Constitution and written law. Both sides say judges are activists when the ruling does not go their way. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. President Bush did not look the other way when North Korea tested a nuclear bomb on his watch, there was just nothing he could do short of war. What do you suggest to stop Iran from getting a nuclear weapon? I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. Deny all you want, but take a look at a map of Antarctica - it is melting. You do not have to be aa scientist to figure out something is wrong. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. You do not know what the plan is, since it has not been fully laid out. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Huh? Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. Rants already addressed You are a shameless thief. No real Marine would say this about the Commander in Chief of the United States without disgracing the uniform. Any Marine that disgraces the uniform is not a real Marine. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. Opinion, influenced by conspiracy theories and Rush. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend.", 
        "reply": "", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-16 14:18:00", 
        "title": "Letter to President Obama", 
        "userID": "xerello"
    }, 
    {
        "content": "Thanks, Kegler. \"I'll take my gun, money and freedom. You can have the change.\" \"Don't 'spread the wealth' - spread the work ethic.\" \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "", 
        "reply": "Thanks, Kegler. \"I'll take my gun, money and freedom. You can have the change.\" \"Don't 'spread the wealth' - spread the work ethic.\" \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-16 18:38:00", 
        "title": "Letter to President Obama", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. I don’t want you taking over private business like banks and auto makers with money that does not exist. I don’t want you borrowing money from me, my children or my grandchildren. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. I don’t want legalized killing of the most defenseless among us – the unborn. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I don’t want the illegal aliens given citizenship after breaking our laws. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. I don’t want you apologizing for America around the world. I don’t want judges who ignore the Constitution and written law. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. You are a shameless thief. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend.", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. I don’t want you taking over private business like banks and auto makers with money that does not exist. I don’t want you borrowing money from me, my children or my grandchildren. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. I don’t want legalized killing of the most defenseless among us – the unborn. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I don’t want the illegal aliens given citizenship after breaking our laws. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. I don’t want you apologizing for America around the world. I don’t want judges who ignore the Constitution and written law. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. You are a shameless thief. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend.", 
        "reply": "", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-18 10:44:00", 
        "title": "Letter to President Obama", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Good grief Kegler, what kind of American are you? We accept responsibility for nothing, in Hussein's America! I'll Allow No Megalomania When I Rule The World", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "", 
        "reply": "Good grief Kegler, what kind of American are you? We accept responsibility for nothing, in Hussein's America! I'll Allow No Megalomania When I Rule The World", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-18 11:09:00", 
        "title": "Letter to President Obama", 
        "userID": "redjohn48"
    }, 
    {
        "content": "Yeah this is ungodly stupid. I hate emotional appeals, especially ones this crass. I wonder what the \"author\" of this chain email thought about Bush's actions on the following points: \"I don’t want you borrowing money from me, my children or my grandchildren. I don’t want legalized killing of the most defenseless among us – the unborn. I don’t want the illegal aliens given citizenship after breaking our laws. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”.\" ...Because it seems to me that abortion was legal throughout Bush's presidency. His massive deficit spending and tax cuts during wartime ARE borrowing from our future generations. Illegal immigration was not significantly reduced under Bush. American is no more a nanny state now than it was under Bush.\" This whole post was stupid. Anyone who applauds the idea that Obama somehow managed to conceal his place of birth is flat out wrong. Not to mention delusional. The GOP team investigating Obama sure screwed the pooch on that one If I ever though of becoming a Republican, I apologize to myself. Crap like this makes me sick, sort of like the \"Bush blew up the dikes during Katrina\" thing made me sick.", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yeah this is ungodly stupid. I hate emotional appeals, especially ones this crass. I wonder what the \"author\" of this chain email thought about Bush's actions on the following points: \"I don’t want you borrowing money from me, my children or my grandchildren. I don’t want legalized killing of the most defenseless among us – the unborn. I don’t want the illegal aliens given citizenship after breaking our laws. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”.\" ...Because it seems to me that abortion was legal throughout Bush's presidency. His massive deficit spending and tax cuts during wartime ARE borrowing from our future generations. Illegal immigration was not significantly reduced under Bush. American is no more a nanny state now than it was under Bush.\" This whole post was stupid. Anyone who applauds the idea that Obama somehow managed to conceal his place of birth is flat out wrong. Not to mention delusional. The GOP team investigating Obama sure screwed the pooch on that one If I ever though of becoming a Republican, I apologize to myself. Crap like this makes me sick, sort of like the \"Bush blew up the dikes during Katrina\" thing made me sick.", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-18 11:30:00", 
        "title": "Letter to President Obama", 
        "userID": "foxred03"
    }, 
    {
        "content": "As many know here, I am no Obama supporter, but this email is a compilation of bogus stuff. Most of it really doesn't apply to President Obama, these are things some on the Right are AFRAID of, nothing more. As far as the spending goes, that is the only problem I have. Knowing he will have to tax everyone to payit off and it does nothing for our overall economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "", 
        "reply": "As many know here, I am no Obama supporter, but this email is a compilation of bogus stuff. Most of it really doesn't apply to President Obama, these are things some on the Right are AFRAID of, nothing more. As far as the spending goes, that is the only problem I have. Knowing he will have to tax everyone to payit off and it does nothing for our overall economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-18 11:35:00", 
        "title": "Letter to President Obama", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by xerello: quote: Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. President Obama does not advocate single payer, socialized health care. I don’t want you taking over private business like banks and auto makers with money that does not exist. President Obama is following the advice of most economists and doing what President Bush did in bailing out the banks and industry. I don't like the debt either, but what is the alternative plan? I don’t want you borrowing money from me, my children or my grandchildren. When President Reagan took office, the Natioanl debt was $1.9 trillion. Over the next 28 years, all but 8 had Republican Presidents - the national debt went to over $10 trillion. Your grandchildren were in debt before President Obama was elected. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. President Obama has never endorsed the fairness doctrine. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. As President, President Obama has not advocated any weapons ban legislation/. I don’t want legalized killing of the most defenseless among us – the unborn. Abortion is legal on a state by state basis. President Reagan signed legislation making abortion legal in California when he was Governor there. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I have not heard that right wing rant - can't comment. I don’t want the illegal aliens given citizenship after breaking our laws. President Reagan signed legislation giving amnesty to illegal aliens when he was President. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. President Obama never did this, Rush just said he did, and bushies believed him I don’t want you apologizing for America around the world. President Obama never did this, Rush just said he did, and bushies believed him. I don’t want judges who ignore the Constitution and written law. Both sides say judges are activists when the ruling does not go their way. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. President Bush did not look the other way when North Korea tested a nuclear bomb on his watch, there was just nothing he could do short of war. What do you suggest to stop Iran from getting a nuclear weapon? I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. Deny all you want, but take a look at a map of Antarctica - it is melting. You do not have to be aa scientist to figure out something is wrong. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. You do not know what the plan is, since it has not been fully laid out. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Huh? Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. Rants already addressed You are a shameless thief. No real Marine would say this about the Commander in Chief of the United States without disgracing the uniform. Any Marine that disgraces the uniform is not a real Marine. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. Opinion, influenced by conspiracy theories and Rush. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend. Good on you xerello for setting the record straight!......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 10, 
        "quote": "Originally posted by xerello: quote: Originally posted by xerello: quote: Originally posted by Kegler300: What an appropriate, and timely letter: quote: Dear Barak Obama, I don’t want your socialized medicine. President Obama does not advocate single payer, socialized health care. I don’t want you taking over private business like banks and auto makers with money that does not exist. President Obama is following the advice of most economists and doing what President Bush did in bailing out the banks and industry. I don't like the debt either, but what is the alternative plan? I don’t want you borrowing money from me, my children or my grandchildren. When President Reagan took office, the Natioanl debt was $1.9 trillion. Over the next 28 years, all but 8 had Republican Presidents - the national debt went to over $10 trillion. Your grandchildren were in debt before President Obama was elected. I don’t want you infringing on my constitutional rights under the guise of “fairness” doctrine or political correctness. President Obama has never endorsed the fairness doctrine. I don’t want you assaulting the 2nd amendment – regulating or taxing my firearms or ammo. As President, President Obama has not advocated any weapons ban legislation/. I don’t want legalized killing of the most defenseless among us – the unborn. Abortion is legal on a state by state basis. President Reagan signed legislation making abortion legal in California when he was Governor there. I don’t want you diminishing the sovereignty of the United States by giving foreign entities rights to control or tax US citizens. I have not heard that right wing rant - can't comment. I don’t want the illegal aliens given citizenship after breaking our laws. President Reagan signed legislation giving amnesty to illegal aliens when he was President. I don’t want you dismissing Christianity which is deeply intertwined in the founding of this great country. President Obama never did this, Rush just said he did, and bushies believed him I don’t want you apologizing for America around the world. President Obama never did this, Rush just said he did, and bushies believed him. I don’t want judges who ignore the Constitution and written law. Both sides say judges are activists when the ruling does not go their way. I don’t want you looking the other way while our sworn enemies develop nuclear weapons. President Bush did not look the other way when North Korea tested a nuclear bomb on his watch, there was just nothing he could do short of war. What do you suggest to stop Iran from getting a nuclear weapon? I don’t accept the global warming scam and neither do the majority of scientists who are entitled to a professional opinion on the subject. Deny all you want, but take a look at a map of Antarctica - it is melting. You do not have to be aa scientist to figure out something is wrong. I don’t accept the CO2 scam and the cap and trade plan to bilk the American public out of their hard earned money. You do not know what the plan is, since it has not been fully laid out. I don’t want you entering agreements with foreign entities to tax or control the actions of US citizens. Huh? Let me sum it up for you: You are a tax and spend socialist. You don’t even have the decency to spend money that exists; instead you spend my children’s money and my grandchildren’s money to grow government, reduce my freedom and liberty, to pay back political favors and to buy future votes. Rants already addressed You are a shameless thief. No real Marine would say this about the Commander in Chief of the United States without disgracing the uniform. Any Marine that disgraces the uniform is not a real Marine. You are both an economic and national security disaster and you are literally taking this country over a cliff. I refuse to call you my president because you have refused to provide legitimate proof of your birthplace. You are a smooth talker who found a ripe audience – influenced by the liberal press and educated by the liberal dominated education institutions. You suckered a lot of people who don’t know squat about the history of this great nation or the potential impact of your goals. Opinion, influenced by conspiracy theories and Rush. I believe in America, its strength and traditions, its leadership role in the world and a strong military. I believe in freedom, liberty and our Constitution. I believe in capitalism, small government and fiscal responsibility. I don’t want America to become a “nanny state”. You don’t like America and you want to change it. I know that by your past and present associations including Rev. Wright and Bill Ayers. Your like-minded wife has flatly stated that America is “a downright mean country”. I hope you fail. I hope you fail with a passion. I hope you fail because I love MY country and I don’t want your change. I know that in America there is room for improvement, largely because liberals like you have gotten their way for far too long. Received from a Marine patriot and friend.", 
        "reply": " Good on you xerello for setting the record straight!......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-18 17:09:00", 
        "title": "Letter to President Obama", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Thanks, Kegler. \"I'll take my gun, money and freedom. You can have the change.\" \"Don't 'spread the wealth' - spread the work ethic.\" My thoughts exactly Pink. In this Country, you should have the right to your own destiny, if you want it, you should have to work for it. The world does NOT owe anyone a living.", 
        "intTime": 20090519, 
        "postID": 11, 
        "quote": "Originally posted by PinkBlossoms: Thanks, Kegler. \"I'll take my gun, money and freedom. You can have the change.\" \"Don't 'spread the wealth' - spread the work ethic.\"", 
        "reply": " My thoughts exactly Pink. In this Country, you should have the right to your own destiny, if you want it, you should have to work for it. The world does NOT owe anyone a living.", 
        "threadID": "409192893_3640054322001", 
        "time": "2009-05-19 03:59:00", 
        "title": "Letter to President Obama", 
        "userID": "mnoble1066"
    }
]