[
    {
        "content": "Yep, I verified it myself and so can you. Download the .PDF file of the DHS report on right-wing extremism and check the properties of the document. You will find that the file was created on 01/23/2007. However, it was modified on 04/12/2009. Who knows what info was put in when? This message has been edited. Last edited by: 10Tenths, Thu 16 April 2009 09:29 PM", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "Yep, I verified it myself and so can you. Download the .PDF file of the DHS report on right-wing extremism and check the properties of the document. You will find that the file was created on 01/23/2007. However, it was modified on 04/12/2009. Who knows what info was put in when? This message has been edited. Last edited by: 10Tenths, Thu 16 April 2009 09:29 PM", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 20:59:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Yep, I verified it myself and so can you. Download the .PDF file of the DHS report on right-wing extremism and check the properties of the document. You will find that the file was created on 01/23/2007. However, it was modified on 04/12/2009. Who knows what info was put in when? And yo wont find out, this adm only releases Top secret info And nobody would have known about this if it were not for law enforcent. remember people here on the left said it was bs and it was a rumor and not true then, bam! confirmed. then it doesnt mean anything and the bush adm wrote it! and they wrote one about the left but a side by side comparison are worlds apart in the lacking dept on the righty one. they got caught with their pants down, and proof of what people suspected it would do was played out this week with the Tea Bag deal. The media and dems have been labeling those people right wing extremist.", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "Originally posted by 10tenths: Yep, I verified it myself and so can you. Download the .PDF file of the DHS report on right-wing extremism and check the properties of the document. You will find that the file was created on 01/23/2007. However, it was modified on 04/12/2009. Who knows what info was put in when?", 
        "reply": " And yo wont find out, this adm only releases Top secret info And nobody would have known about this if it were not for law enforcent. remember people here on the left said it was bs and it was a rumor and not true then, bam! confirmed. then it doesnt mean anything and the bush adm wrote it! and they wrote one about the left but a side by side comparison are worlds apart in the lacking dept on the righty one. they got caught with their pants down, and proof of what people suspected it would do was played out this week with the Tea Bag deal. The media and dems have been labeling those people right wing extremist.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 21:40:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "In any case, the government (repub or dem) has something up its sleeves. Stuff is just getting to weird and crazy lately. I am having a very bad feeling about things. I didn't even get this feeling when I was in the Gulf. This feeling is something that has only happened a few times in my life and none of those incidences ended well. Gunny, I am actually a little nervous.", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "In any case, the government (repub or dem) has something up its sleeves. Stuff is just getting to weird and crazy lately. I am having a very bad feeling about things. I didn't even get this feeling when I was in the Gulf. This feeling is something that has only happened a few times in my life and none of those incidences ended well. Gunny, I am actually a little nervous.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 21:52:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I have a christian fish on my car and the USAR and USAF, emblems, I spent one yr Army reserve 5 yrs Air Force reg. I got two American flags and maybe my go patriots football team. OMG I'm going to get stopped at some point and questioned? searched? Do they frisk females? geeze isn't that list basically everyone that is most likely to oppose what Obama stands for? Oh And I go to the VA when I need my care and receive a check from DFAS monthly! Then when my absentee ballot is looked at found that I didn't vote for him... what, prision? OMG wtf oh and not that it matters, I read this on the internet then saw a clip that FOX had out that got right to the point! Which I like. I'm considered a domestic terrorist. Is this correct? tell me, ???", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "", 
        "reply": "I have a christian fish on my car and the USAR and USAF, emblems, I spent one yr Army reserve 5 yrs Air Force reg. I got two American flags and maybe my go patriots football team. OMG I'm going to get stopped at some point and questioned? searched? Do they frisk females? geeze isn't that list basically everyone that is most likely to oppose what Obama stands for? Oh And I go to the VA when I need my care and receive a check from DFAS monthly! Then when my absentee ballot is looked at found that I didn't vote for him... what, prision? OMG wtf oh and not that it matters, I read this on the internet then saw a clip that FOX had out that got right to the point! Which I like. I'm considered a domestic terrorist. Is this correct? tell me, ???", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 22:14:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "", 
        "reply": "President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 22:30:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I remember hearing Obama on TV when asked where are the weapons coming from and he said from the states. I didn't think it was a true statement but it certainly is a way for anyone with weapons, licened to have them taken away. Does that mean if I go buy a gun soon, eventually it will be taken from me?", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "", 
        "reply": "I remember hearing Obama on TV when asked where are the weapons coming from and he said from the states. I didn't think it was a true statement but it certainly is a way for anyone with weapons, licened to have them taken away. Does that mean if I go buy a gun soon, eventually it will be taken from me?", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 22:40:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "Yeah, I'm pretty worried, as well. I fear that the Obama Admin is more worried about \"right wingers\" in our country than terrorist out there planning their next attack on our country! JMHO, I could be wrong...", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "", 
        "reply": "Yeah, I'm pretty worried, as well. I fear that the Obama Admin is more worried about \"right wingers\" in our country than terrorist out there planning their next attack on our country! JMHO, I could be wrong...", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 22:47:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country no he didn't. \"MEXICO CITY (AP) — President Barack Obama says he prefers to focus on enforcing existing laws to keep assault weapons out of Mexico, rather than trying to renew a U.S. ban on the weapons.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gjfh3lr87qvFC6xE-GyllobR-UZwD97JQMD84\"", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country", 
        "reply": " no he didn't. \"MEXICO CITY (AP) — President Barack Obama says he prefers to focus on enforcing existing laws to keep assault weapons out of Mexico, rather than trying to renew a U.S. ban on the weapons.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gjfh3lr87qvFC6xE-GyllobR-UZwD97JQMD84\"", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-16 22:48:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: In any case, the government (repub or dem) has something up its sleeves. Stuff is just getting to weird and crazy lately. I am having a very bad feeling about things. I didn't even get this feeling when I was in the Gulf. This feeling is something that has only happened a few times in my life and none of those incidences ended well. Gunny, I am actually a little nervous. You should be your Libertarian status is being questioned and you're being labled as a rightwinger co'z you disagree with the Left on certain issues here. What the memo was meant to do.", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "Originally posted by 10tenths: In any case, the government (repub or dem) has something up its sleeves. Stuff is just getting to weird and crazy lately. I am having a very bad feeling about things. I didn't even get this feeling when I was in the Gulf. This feeling is something that has only happened a few times in my life and none of those incidences ended well. Gunny, I am actually a little nervous.", 
        "reply": " You should be your Libertarian status is being questioned and you're being labled as a rightwinger co'z you disagree with the Left on certain issues here. What the memo was meant to do.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-17 05:58:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them.", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country", 
        "reply": " Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-17 06:04:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them. Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck!", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them.", 
        "reply": " Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck!", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-17 06:05:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them. Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck! Are you talking to me or IRS? as far as bans, he better inform the rest of his adm. Well see how he skirts around it like everything else. Next will be ammo.", 
        "intTime": 20090417, 
        "postID": 12, 
        "quote": "Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them. Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck!", 
        "reply": " Are you talking to me or IRS? as far as bans, he better inform the rest of his adm. Well see how he skirts around it like everything else. Next will be ammo.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-17 06:08:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them. Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck! Are you talking to me or IRS? as far as bans, he better inform the rest of his adm. Well see how he skirts around it like everything else. Next will be ammo. MEXICO CITY (AP) — President Barack Obama says he prefers to focus on enforcing existing laws to keep assault weapons out of Mexico, rather than trying to renew a U.S. ban on the weapons.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gjfh3lr87qvFC6xE-GyllobR-UZwD97JQMD84\"", 
        "intTime": 20090417, 
        "postID": 13, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them. Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck! Are you talking to me or IRS? as far as bans, he better inform the rest of his adm. Well see how he skirts around it like everything else. Next will be ammo.", 
        "reply": " MEXICO CITY (AP) — President Barack Obama says he prefers to focus on enforcing existing laws to keep assault weapons out of Mexico, rather than trying to renew a U.S. ban on the weapons.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gjfh3lr87qvFC6xE-GyllobR-UZwD97JQMD84\"", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-17 06:12:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them. Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck! Are you talking to me or IRS? as far as bans, he better inform the rest of his adm. Well see how he skirts around it like everything else. Next will be ammo. MEXICO CITY (AP) — President Barack Obama says he prefers to focus on enforcing existing laws to keep assault weapons out of Mexico, rather than trying to renew a U.S. ban on the weapons.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gjfh3lr87qvFC6xE-GyllobR-UZwD97JQMD84\" I heard him blame the US for most of the guns going into Mexico, and I can't remember but I sure he took this opportunity to put down our country again. If he says it's US fault then he justifies taking our weapons, not the ones that have them illegly of course. I am very dissapointed and concern for my country.", 
        "intTime": 20090417, 
        "postID": 14, 
        "quote": "Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by esample1: quote: Originally posted by GunnyRet03: quote: Originally posted by Irwin_R_Schyster: President Obama reassured Mexican President Felipe Calderon that the United States is committed to renewing the assault-weapons ban because of violence in his country Yeh, Obama and his Adm cant let facts get in their way. All this would be solved if he would just shut the border down finish the wall. Those weapons would still be bought if the 18% from the US dried up. Other countries seel weapons to mexico and buy their drugs. But Obama goes on stage and slams America again and sounded just like the Mehican Prez. Now, we have our President cowering under pressure from Mexico on all fronts. They threatened sanctions because we stopped their trucks from entering and now Obama is going to lift the ban. And his Adm is saying it's a 2 way street. Our trucks will have busy and can go south also. Problem is our trucks dont want to go to that shiithole and be robbed and murdered. The teamsters are against this and I find myself agreeing with them. Prrof was already posted that he never said that. If you've heard otherwise, feel free to post it. Good luck! Are you talking to me or IRS? as far as bans, he better inform the rest of his adm. Well see how he skirts around it like everything else. Next will be ammo. MEXICO CITY (AP) — President Barack Obama says he prefers to focus on enforcing existing laws to keep assault weapons out of Mexico, rather than trying to renew a U.S. ban on the weapons.\" \"http://www.google.com/hostednews/ap/article/ALeqM5gjfh3lr87qvFC6xE-GyllobR-UZwD97JQMD84\"", 
        "reply": " I heard him blame the US for most of the guns going into Mexico, and I can't remember but I sure he took this opportunity to put down our country again. If he says it's US fault then he justifies taking our weapons, not the ones that have them illegly of course. I am very dissapointed and concern for my country.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-17 14:13:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 10tenths: In any case, the government (repub or dem) has something up its sleeves. Stuff is just getting to weird and crazy lately. I am having a very bad feeling about things. I didn't even get this feeling when I was in the Gulf. This feeling is something that has only happened a few times in my life and none of those incidences ended well. Gunny, I am actually a little nervous. You should be your Libertarian status is being questioned and you're being labled as a rightwinger co'z you disagree with the Left on certain issues here. What the memo was meant to do. As we both know and have agreed on, there are many issues in which I disagree with people on the right, as well. But, that would be because I am neither left wing, nor right wing. But, I do support the 2nd, I do support smaller government, I do support states rights and those of the people, I do support sound monetary policy, I do support lower taxation and no taxation on income, etc. These are the things that the left fears from people like myself. I have been called a republican many times in recent days by the liberals on this board because these are the issues in which I side with the republicans. But, it is plainly obvious that I am a Libertarian. I have been very consistent in my views and they are the views that form the basic platform of the Libertarian Party. It seems that the liberals forget that I also support views from the left. I am pro choice, I support legalizing marijuana (all drugs actually), I support the legalization of prostitution, I can care less if gay people want to get married, I support social freedom, I favor diplomacy over military solutions (noninterventionism), I support stem cell research, I do not support trade agreements, I support equal opportunity, I am against torture of any kind, I support people wanting to organize a union (I belong to four unions, myself), etc. But, my support of some of the things from the left does not seem to make up for the things that I support from the right. It is the changing of the tide, really. I was viewed as a liberal when conservatives were in charge. Now that liberals are in charge, I am viewed as a conservative. However, little me has been a Libertarian the whole time. It amazes me how ignorant some people really are. It just further supports my belief that most people truly are idiots. This memo really is irresponsible. It will further divide this country by doing two things. First, it will make the left more antagonistic toward those on the right. They will immediately label them a right wing extremist and as with most liberals, they will be pretty outspoken and blunt about that. The other thing it will do is make the right extremely po'd. And, no matter what political affiliation you have, getting people po'd is not a good idea because they tend to do stupid things when they a mad. So, I imagine that there will be some angry people who actually make themselves fit the description who would have otherwise not fit it before. I see bad things happening in the future. Not just from this report, but from a multitude of things that are happening right now. This is a crazy time and it will only get crazier.", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 10tenths: In any case, the government (repub or dem) has something up its sleeves. Stuff is just getting to weird and crazy lately. I am having a very bad feeling about things. I didn't even get this feeling when I was in the Gulf. This feeling is something that has only happened a few times in my life and none of those incidences ended well. Gunny, I am actually a little nervous. You should be your Libertarian status is being questioned and you're being labled as a rightwinger co'z you disagree with the Left on certain issues here. What the memo was meant to do.", 
        "reply": " As we both know and have agreed on, there are many issues in which I disagree with people on the right, as well. But, that would be because I am neither left wing, nor right wing. But, I do support the 2nd, I do support smaller government, I do support states rights and those of the people, I do support sound monetary policy, I do support lower taxation and no taxation on income, etc. These are the things that the left fears from people like myself. I have been called a republican many times in recent days by the liberals on this board because these are the issues in which I side with the republicans. But, it is plainly obvious that I am a Libertarian. I have been very consistent in my views and they are the views that form the basic platform of the Libertarian Party. It seems that the liberals forget that I also support views from the left. I am pro choice, I support legalizing marijuana (all drugs actually), I support the legalization of prostitution, I can care less if gay people want to get married, I support social freedom, I favor diplomacy over military solutions (noninterventionism), I support stem cell research, I do not support trade agreements, I support equal opportunity, I am against torture of any kind, I support people wanting to organize a union (I belong to four unions, myself), etc. But, my support of some of the things from the left does not seem to make up for the things that I support from the right. It is the changing of the tide, really. I was viewed as a liberal when conservatives were in charge. Now that liberals are in charge, I am viewed as a conservative. However, little me has been a Libertarian the whole time. It amazes me how ignorant some people really are. It just further supports my belief that most people truly are idiots. This memo really is irresponsible. It will further divide this country by doing two things. First, it will make the left more antagonistic toward those on the right. They will immediately label them a right wing extremist and as with most liberals, they will be pretty outspoken and blunt about that. The other thing it will do is make the right extremely po'd. And, no matter what political affiliation you have, getting people po'd is not a good idea because they tend to do stupid things when they a mad. So, I imagine that there will be some angry people who actually make themselves fit the description who would have otherwise not fit it before. I see bad things happening in the future. Not just from this report, but from a multitude of things that are happening right now. This is a crazy time and it will only get crazier.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-17 17:36:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "10Tenths"
    }, 
    {
        "content": "OK, so what if the document originated in 2007?? WE never saw or read the original contents. Who knows what was added in or edited out of the original document?? Even so, we ALL know that GWB wasn't in favor of following the Constitution. It's even worse that the Obama administration is following suit and probably even heightening the prior administration's rhetoric and blatant violations of the Constitution. In Obama's own words, he sees the Constitution as a fundamentally flawed and outdated document..... \"Ideas are more powerful than guns. We would not let people have guns ...why should we let them have ideas? --Joseph Stalin\"", 
        "intTime": 20090418, 
        "postID": 16, 
        "quote": "", 
        "reply": "OK, so what if the document originated in 2007?? WE never saw or read the original contents. Who knows what was added in or edited out of the original document?? Even so, we ALL know that GWB wasn't in favor of following the Constitution. It's even worse that the Obama administration is following suit and probably even heightening the prior administration's rhetoric and blatant violations of the Constitution. In Obama's own words, he sees the Constitution as a fundamentally flawed and outdated document..... \"Ideas are more powerful than guns. We would not let people have guns ...why should we let them have ideas? --Joseph Stalin\"", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-18 08:38:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "BigRobT"
    }, 
    {
        "content": "Indeed, Mr. Obama DID IN FACT say he was NOT going to reinstate the so called Assault Weapons Ban. That's a good thing. He REPEATED the false statment that 90% of illegally used guns in Mexico come from the USA, when they do not. 13% or so ORIGINATED in the USA. Repitition of misinformation is bad. BTW, the so called anti-aircraft M G sure looked to me like a 1919 A4 Browning aircooled MG, Usually used in an INFANTRY role. As the newshawks are normally firearms ILLETERATE, they should look this stuff up, get subscriptions to JANE's for goodness gracious! Anyway, the thrust is incorrect here. The object needs to be border enforcement, not the tools, available anywhere on Earth, the cartels use.", 
        "intTime": 20090418, 
        "postID": 17, 
        "quote": "", 
        "reply": "Indeed, Mr. Obama DID IN FACT say he was NOT going to reinstate the so called Assault Weapons Ban. That's a good thing. He REPEATED the false statment that 90% of illegally used guns in Mexico come from the USA, when they do not. 13% or so ORIGINATED in the USA. Repitition of misinformation is bad. BTW, the so called anti-aircraft M G sure looked to me like a 1919 A4 Browning aircooled MG, Usually used in an INFANTRY role. As the newshawks are normally firearms ILLETERATE, they should look this stuff up, get subscriptions to JANE's for goodness gracious! Anyway, the thrust is incorrect here. The object needs to be border enforcement, not the tools, available anywhere on Earth, the cartels use.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-18 11:20:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by ACEINFI: I remember hearing Obama on TV when asked where are the weapons coming from and he said from the states. [17% from the US. The preponderance from Russian mafia, other Latin American nations, stolen or sold by corrupt Mexican authorities to druggies for money. The weapons brought over from the US (all illegally, so enforce the existing laws, Obama!) would be made up easily from other sources; so even if the obamanation controlled the border as they should (they won't), there will be no noticeable difference in Mexico. The only reason obamanites hype this crap for stupid or swill-sucking fools to believe is to \"justify\" taking firearms from American citizens in direct violation of the Second Amendment and mockery of American freedom. When they do such a thing, then we'll know that the control freaks have ceased the most rudimentary representative behavior toward the citizens of America. They will do whatever they calculate they can get away with. These are NOT people who respect the Constitution of the US.]I didn't think it was a true statement but it certainly is a way for anyone with weapons, licened to have them taken away. Does that mean if I go buy a gun soon, eventually it will be taken from me? [Only from your cold, dead fingers. ]", 
        "intTime": 20090418, 
        "postID": 18, 
        "quote": "Originally posted by ACEINFI: I remember hearing Obama on TV when asked where are the weapons coming from and he said from the states. [17% from the US. The preponderance from Russian mafia, other Latin American nations, stolen or sold by corrupt Mexican authorities to druggies for money. The weapons brought over from the US (all illegally, so enforce the existing laws, Obama!) would be made up easily from other sources; so even if the obamanation controlled the border as they should (they won't), there will be no noticeable difference in Mexico. The only reason obamanites hype this crap for stupid or swill-sucking fools to believe is to \"justify\" taking firearms from American citizens in direct violation of the Second Amendment and mockery of American freedom. When they do such a thing, then we'll know that the control freaks have ceased the most rudimentary representative behavior toward the citizens of America. They will do whatever they calculate they can get away with. These are NOT people who respect the Constitution of the US.]I didn't think it was a true statement but it certainly is a way for anyone with weapons, licened to have them taken away. Does that mean if I go buy a gun soon, eventually it will be taken from me? [Only from your cold, dead fingers. ]", 
        "reply": "", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-18 11:41:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "RRR52"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090418, 
        "postID": 19, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-18 12:03:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I often wonder if ppl who keep defending Obama so quickly too. I wonder do they even recognize what direction he has been taken the whole country in? Do they recognize the massive meanings behind many of the changes already made? As they keep blurting out for his defense. Do they actually stop and see that they are affected too?!? It's not about color,race... Religion may be another matter. Are we that defenseless that say me for example. I have the earmarks of being a domestic Terrorist and much insight on many things already going down hill. But is it true, I can't do a dam thing about it? And if I spent 365 days trying to get through to someone that constantly defends the actions of our Gov because Obama is part black and or a democrate, by time the light bulb went off in this persons head, it'll be WAY too late! Times like this I wish I were 97 yrs old and just about to pass away.", 
        "intTime": 20090418, 
        "postID": 20, 
        "quote": "", 
        "reply": "I often wonder if ppl who keep defending Obama so quickly too. I wonder do they even recognize what direction he has been taken the whole country in? Do they recognize the massive meanings behind many of the changes already made? As they keep blurting out for his defense. Do they actually stop and see that they are affected too?!? It's not about color,race... Religion may be another matter. Are we that defenseless that say me for example. I have the earmarks of being a domestic Terrorist and much insight on many things already going down hill. But is it true, I can't do a dam thing about it? And if I spent 365 days trying to get through to someone that constantly defends the actions of our Gov because Obama is part black and or a democrate, by time the light bulb went off in this persons head, it'll be WAY too late! Times like this I wish I were 97 yrs old and just about to pass away.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-18 15:08:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090424, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-24 10:44:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by ACEINFI: I have a christian fish on my car and the USAR and USAF, emblems, I spent one yr Army reserve 5 yrs Air Force reg. I got two American flags and maybe my go patriots football team. OMG I'm going to get stopped at some point and questioned? searched? Do they frisk females? geeze isn't that list basically everyone that is most likely to oppose what Obama stands for? Oh And I go to the VA when I need my care and receive a check from DFAS monthly! Then when my absentee ballot is looked at found that I didn't vote for him... what, prision? OMG wtf oh and not that it matters, I read this on the internet then saw a clip that FOX had out that got right to the point! Which I like. I'm considered a domestic terrorist. Is this correct? tell me, ??? Post a picture of yourself, and then we will discuss the frisking and strip searches.", 
        "intTime": 20090424, 
        "postID": 22, 
        "quote": "Originally posted by ACEINFI: I have a christian fish on my car and the USAR and USAF, emblems, I spent one yr Army reserve 5 yrs Air Force reg. I got two American flags and maybe my go patriots football team. OMG I'm going to get stopped at some point and questioned? searched? Do they frisk females? geeze isn't that list basically everyone that is most likely to oppose what Obama stands for? Oh And I go to the VA when I need my care and receive a check from DFAS monthly! Then when my absentee ballot is looked at found that I didn't vote for him... what, prision? OMG wtf oh and not that it matters, I read this on the internet then saw a clip that FOX had out that got right to the point! Which I like. I'm considered a domestic terrorist. Is this correct? tell me, ???", 
        "reply": " Post a picture of yourself, and then we will discuss the frisking and strip searches.", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-24 12:56:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Yep, I verified it myself and so can you. Download the .PDF file of the DHS report on right-wing extremism and check the properties of the document. You will find that the file was created on 01/23/2007. However, it was modified on 04/12/2009. Who knows what info was put in when? All those dates tell you is that a .PDF file was made on 01/23/2007. The document can easily have existed in another format (eg as a word document) long before that, so it do not really tell us when the document was written. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090424, 
        "postID": 23, 
        "quote": "Originally posted by 10tenths: Yep, I verified it myself and so can you. Download the .PDF file of the DHS report on right-wing extremism and check the properties of the document. You will find that the file was created on 01/23/2007. However, it was modified on 04/12/2009. Who knows what info was put in when?", 
        "reply": " All those dates tell you is that a .PDF file was made on 01/23/2007. The document can easily have existed in another format (eg as a word document) long before that, so it do not really tell us when the document was written. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_8240089022001", 
        "time": "2009-04-24 20:30:00", 
        "title": "DHS \"Right-Wing Extremist\" document was created on 01/23/2007", 
        "userID": "JakobA_DK"
    }
]