[
    {
        "content": "Hilarious Stuff I Daresay It Is Time We Deal With the Mutineers Aboard the S.S. Conservatism T. Coddington Van Voorhees VII Editor, the National Topsider Membership Chairman, The Newport Club READ THE FULL TEXT HERE: 'http://iowahawk.typepad.com/iowahawk/' SNIP: quote: Much has been written about the fate of the conservative movement in the months since last I corresponded with you. I won't belabor the barrels of ink expended in the printing of its obituary, nor will I bore you with further reading of its entrails. Suffice it to say the grand old ship is in the doldrums, adrift in the electoral currents, with nary a harbor on the horizon. But it is time we leave such map room mopery aside and navigate a bold new course for the conservative armada. One needn't have a 400-year old heirloom scrimshaw sextant for this task; but, fortunately, I do. Today the Van Voorhees family sextant rests proudly atop my private shipboard desk. I'm admiring it now; there it sits, in its protective crystal bell jar, alongside Marinus' rapier, both still bearing the sanguinary patina of their provenance. They were, of course, the deathbed bequest of my visionary father, T.C. Van Voorhees VI, rakish founder of the National Topsider and the modern conservative movement. Last year, after our final emotional handshake, he looked at me with those anxious, fading eyes, and said: \"the helm awaits, my lad; I trust you will steer it well. And, it appears, I have soiled myself.\" This was, as you know, the theme of the National Topsider's exclusive January conference at the private Breakers Club in Nassau where I hosted a veritable murderer's row of top tory thinkers to diagnose the troubles with conservatism. Dame Peggy Noonan was there, of course, along with Kathleen Parker, Douglas Kmiec, and those two mighty Davids of conservative intellect, Brooks and Frum. But enough of the namedropping. The order of the day, after mixed badminton doubles, was to formulate an Rx for our ailing patient. In this regard we were in surprising accord: in order to survive, conservativism simply must start appealing to a better class of people. The sad fact of the matter, as we noted, is that one no longer finds admitted conservatives in any of America's prestige zip codes nor the faculty redoubts of her selective academies. During our Bahamian summit many gambits were proposed to win back America's elite electoral precincts from the left; sponsoring various hip hop colloquia at the better Ivies, supporting integration of gays into Nascar, endorsing state ownership of the means of production. Rod Dreher, whose sensational exegesis \"Crunchy Cons\" sold well over 200 copies last year, recommended a full embrace of the environmental movement, which as I understand is quite the rage among youthful voters and the trendsetting thespians of Hollywood. Good and bold ideas all, and necessary steps to get the movement started again. But there remains a daunting obstacle - namely, the benighted rubes who constitute so much of our so-called \"base,\" and whose existence make it nigh on impossible to recruit their social betters. That conundrum of electoral calculus was the topic of much discussion two weeks ago, when my Nassau confreres and I were summoned to the White House for an intimate repast with the new President and his inner circle. Mr. Obama was radiant as ever, still basking in the afterglow of his historic victory. I admit to a recent wobble or two in my faith in him, as the severe beatings suffered by my various family trusts have necessitated some unanticipated cutbacks in my household staff. But that easy, commanding elegance was a bracing reminder of why I endorsed Mr. Obama as the true conservative presidential choice. After dessert (black walnut dacquoise with sections of quince) we retired to the Blue Room where chief of staff Rahm Emanuel entertained us with some droll tales of his days as terpsichorean with the Mossad ballet auxiliary, even treating us to a few thrilling, if f-bomb laced, arabesques. He was followed by Vice President Joe Biden, who put on a fine display of his famed wit and penchant for unpredictable cerebral infarctions. Amid the sparkling bonhomie the President solicited our views on the causes of -- and solutions to -- conservatism's sad state. Seizing the opportunity for a tete-a-tete with the world's most powerful, popular, and beautiful man, I explained the tragic plague of rubes who stand athwart our modernization program. \"Why not just drive them out?\" asked the President, elegantly French inhaling his Marlboro Light 100. \"Under the old bus, so to speak.\" \"Alas, were it so easy,\" interrupted Brooks, in a clumsy attempt to draw Mr. Obama's attentions from me like some cocquettish debutante. Parker, Noonan and Frum were too lost in orgasmic schoolgirl giggling to offer anything more substantive. I ignored their embarrasing faux pas and pressed on with my thesis. \"We've tried, Mr. President,\" I explained. \"But there are unsavory elements within the party who keep bringing them back in.\" As I explained all this to President Obama, I assured him that there are still many conservatives like us who patriotically wish him every success, no matter what policies he has in mind. After extinguishing his Marlboro he paused for a few moments, nodded, and assured me that he would dispatch his staff and allies in the press to deal with the Limbaugh problem, thereby clearing the Council of Nassau to forge a new, improved, more fashionable Republican party. In that instant my faith in Mr. Obama's innate conservatism was reborn, for his offer of bipartisan kindness was a manifest sign that he only has our best interests at heart. Yes, I know there remain some conservatives of the better sort who have been shaken by the recent distressing market turns as our gallant young admiral struggles to find his sea legs and a coherent bank nationalization strategy. I confess to such quiet misgivings myself, which I brought up in our conversation. In response the President assured me that he would keep my portfolio in mind in the next round of corporate bailouts. Let us conservatives take comfort in that assurance, and in the fact that no matter what new taxes he proposes, Mr. Obama has at least assembled a cabinet with no personal enthusiasm for paying them. We must maintain our faith that the President's inner conservative will eventually emerge, and remain firm in the conviction that He works in mysterious ways.", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "Much has been written about the fate of the conservative movement in the months since last I corresponded with you. I won't belabor the barrels of ink expended in the printing of its obituary, nor will I bore you with further reading of its entrails. Suffice it to say the grand old ship is in the doldrums, adrift in the electoral currents, with nary a harbor on the horizon. But it is time we leave such map room mopery aside and navigate a bold new course for the conservative armada. One needn't have a 400-year old heirloom scrimshaw sextant for this task; but, fortunately, I do. Today the Van Voorhees family sextant rests proudly atop my private shipboard desk. I'm admiring it now; there it sits, in its protective crystal bell jar, alongside Marinus' rapier, both still bearing the sanguinary patina of their provenance. They were, of course, the deathbed bequest of my visionary father, T.C. Van Voorhees VI, rakish founder of the National Topsider and the modern conservative movement. Last year, after our final emotional handshake, he looked at me with those anxious, fading eyes, and said: \"the helm awaits, my lad; I trust you will steer it well. And, it appears, I have soiled myself.\" This was, as you know, the theme of the National Topsider's exclusive January conference at the private Breakers Club in Nassau where I hosted a veritable murderer's row of top tory thinkers to diagnose the troubles with conservatism. Dame Peggy Noonan was there, of course, along with Kathleen Parker, Douglas Kmiec, and those two mighty Davids of conservative intellect, Brooks and Frum. But enough of the namedropping. The order of the day, after mixed badminton doubles, was to formulate an Rx for our ailing patient. In this regard we were in surprising accord: in order to survive, conservativism simply must start appealing to a better class of people. The sad fact of the matter, as we noted, is that one no longer finds admitted conservatives in any of America's prestige zip codes nor the faculty redoubts of her selective academies. During our Bahamian summit many gambits were proposed to win back America's elite electoral precincts from the left; sponsoring various hip hop colloquia at the better Ivies, supporting integration of gays into Nascar, endorsing state ownership of the means of production. Rod Dreher, whose sensational exegesis \"Crunchy Cons\" sold well over 200 copies last year, recommended a full embrace of the environmental movement, which as I understand is quite the rage among youthful voters and the trendsetting thespians of Hollywood. Good and bold ideas all, and necessary steps to get the movement started again. But there remains a daunting obstacle - namely, the benighted rubes who constitute so much of our so-called \"base,\" and whose existence make it nigh on impossible to recruit their social betters. That conundrum of electoral calculus was the topic of much discussion two weeks ago, when my Nassau confreres and I were summoned to the White House for an intimate repast with the new President and his inner circle. Mr. Obama was radiant as ever, still basking in the afterglow of his historic victory. I admit to a recent wobble or two in my faith in him, as the severe beatings suffered by my various family trusts have necessitated some unanticipated cutbacks in my household staff. But that easy, commanding elegance was a bracing reminder of why I endorsed Mr. Obama as the true conservative presidential choice. After dessert (black walnut dacquoise with sections of quince) we retired to the Blue Room where chief of staff Rahm Emanuel entertained us with some droll tales of his days as terpsichorean with the Mossad ballet auxiliary, even treating us to a few thrilling, if f-bomb laced, arabesques. He was followed by Vice President Joe Biden, who put on a fine display of his famed wit and penchant for unpredictable cerebral infarctions. Amid the sparkling bonhomie the President solicited our views on the causes of -- and solutions to -- conservatism's sad state. Seizing the opportunity for a tete-a-tete with the world's most powerful, popular, and beautiful man, I explained the tragic plague of rubes who stand athwart our modernization program. \"Why not just drive them out?\" asked the President, elegantly French inhaling his Marlboro Light 100. \"Under the old bus, so to speak.\" \"Alas, were it so easy,\" interrupted Brooks, in a clumsy attempt to draw Mr. Obama's attentions from me like some cocquettish debutante. Parker, Noonan and Frum were too lost in orgasmic schoolgirl giggling to offer anything more substantive. I ignored their embarrasing faux pas and pressed on with my thesis. \"We've tried, Mr. President,\" I explained. \"But there are unsavory elements within the party who keep bringing them back in.\" As I explained all this to President Obama, I assured him that there are still many conservatives like us who patriotically wish him every success, no matter what policies he has in mind. After extinguishing his Marlboro he paused for a few moments, nodded, and assured me that he would dispatch his staff and allies in the press to deal with the Limbaugh problem, thereby clearing the Council of Nassau to forge a new, improved, more fashionable Republican party. In that instant my faith in Mr. Obama's innate conservatism was reborn, for his offer of bipartisan kindness was a manifest sign that he only has our best interests at heart. Yes, I know there remain some conservatives of the better sort who have been shaken by the recent distressing market turns as our gallant young admiral struggles to find his sea legs and a coherent bank nationalization strategy. I confess to such quiet misgivings myself, which I brought up in our conversation. In response the President assured me that he would keep my portfolio in mind in the next round of corporate bailouts. Let us conservatives take comfort in that assurance, and in the fact that no matter what new taxes he proposes, Mr. Obama has at least assembled a cabinet with no personal enthusiasm for paying them. We must maintain our faith that the President's inner conservative will eventually emerge, and remain firm in the conviction that He works in mysterious ways.", 
        "reply": "Hilarious Stuff I Daresay It Is Time We Deal With the Mutineers Aboard the S.S. Conservatism T. Coddington Van Voorhees VII Editor, the National Topsider Membership Chairman, The Newport Club READ THE FULL TEXT HERE: 'http://iowahawk.typepad.com/iowahawk/' SNIP: ", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 08:39:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Good article, not because I know where it's going, the point, or even if I care, but it's just a good piece of literature if nothing else. The author is a good writer.", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good article, not because I know where it's going, the point, or even if I care, but it's just a good piece of literature if nothing else. The author is a good writer.", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 08:48:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: Good article, not because I know where it's going, the point, or even if I care, but it's just a good piece of literature if nothing else. The author is a good writer. The man does have talent no doubt. Did you read the full article? What happened to you original screen name?", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "Originally posted by SgtSalaamv2: Good article, not because I know where it's going, the point, or even if I care, but it's just a good piece of literature if nothing else. The author is a good writer.", 
        "reply": " The man does have talent no doubt. Did you read the full article? What happened to you original screen name?", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 08:54:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Well... its entertaining at least.", 
        "intTime": 20090305, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well... its entertaining at least.", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 08:57:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "It may go over some peoples heads unless they read the whole article.", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "", 
        "reply": "It may go over some peoples heads unless they read the whole article.", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 09:03:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Hilarious Stuff I Daresay It Is Time We Deal With the Mutineers Aboard the S.S. Conservatism T. Coddington Van Voorhees VII Editor, the National Topsider Membership Chairman, The Newport Club READ THE FULL TEXT HERE: 'http://iowahawk.typepad.com/iowahawk/' SNIP: quote: Much has been written about the fate of the conservative movement in the months since last I corresponded with you. I won't belabor the barrels of ink expended in the printing of its obituary, nor will I bore you with further reading of its entrails. Suffice it to say the grand old ship is in the doldrums, adrift in the electoral currents, with nary a harbor on the horizon. But it is time we leave such map room mopery aside and navigate a bold new course for the conservative armada. One needn't have a 400-year old heirloom scrimshaw sextant for this task; but, fortunately, I do. Today the Van Voorhees family sextant rests proudly atop my private shipboard desk. I'm admiring it now; there it sits, in its protective crystal bell jar, alongside Marinus' rapier, both still bearing the sanguinary patina of their provenance. They were, of course, the deathbed bequest of my visionary father, T.C. Van Voorhees VI, rakish founder of the National Topsider and the modern conservative movement. Last year, after our final emotional handshake, he looked at me with those anxious, fading eyes, and said: \"the helm awaits, my lad; I trust you will steer it well. And, it appears, I have soiled myself.\" This was, as you know, the theme of the National Topsider's exclusive January conference at the private Breakers Club in Nassau where I hosted a veritable murderer's row of top tory thinkers to diagnose the troubles with conservatism. Dame Peggy Noonan was there, of course, along with Kathleen Parker, Douglas Kmiec, and those two mighty Davids of conservative intellect, Brooks and Frum. But enough of the namedropping. The order of the day, after mixed badminton doubles, was to formulate an Rx for our ailing patient. In this regard we were in surprising accord: in order to survive, conservativism simply must start appealing to a better class of people. The sad fact of the matter, as we noted, is that one no longer finds admitted conservatives in any of America's prestige zip codes nor the faculty redoubts of her selective academies. During our Bahamian summit many gambits were proposed to win back America's elite electoral precincts from the left; sponsoring various hip hop colloquia at the better Ivies, supporting integration of gays into Nascar, endorsing state ownership of the means of production. Rod Dreher, whose sensational exegesis \"Crunchy Cons\" sold well over 200 copies last year, recommended a full embrace of the environmental movement, which as I understand is quite the rage among youthful voters and the trendsetting thespians of Hollywood. Good and bold ideas all, and necessary steps to get the movement started again. But there remains a daunting obstacle - namely, the benighted rubes who constitute so much of our so-called \"base,\" and whose existence make it nigh on impossible to recruit their social betters. That conundrum of electoral calculus was the topic of much discussion two weeks ago, when my Nassau confreres and I were summoned to the White House for an intimate repast with the new President and his inner circle. Mr. Obama was radiant as ever, still basking in the afterglow of his historic victory. I admit to a recent wobble or two in my faith in him, as the severe beatings suffered by my various family trusts have necessitated some unanticipated cutbacks in my household staff. But that easy, commanding elegance was a bracing reminder of why I endorsed Mr. Obama as the true conservative presidential choice. After dessert (black walnut dacquoise with sections of quince) we retired to the Blue Room where chief of staff Rahm Emanuel entertained us with some droll tales of his days as terpsichorean with the Mossad ballet auxiliary, even treating us to a few thrilling, if f-bomb laced, arabesques. He was followed by Vice President Joe Biden, who put on a fine display of his famed wit and penchant for unpredictable cerebral infarctions. Amid the sparkling bonhomie the President solicited our views on the causes of -- and solutions to -- conservatism's sad state. Seizing the opportunity for a tete-a-tete with the world's most powerful, popular, and beautiful man, I explained the tragic plague of rubes who stand athwart our modernization program. \"Why not just drive them out?\" asked the President, elegantly French inhaling his Marlboro Light 100. \"Under the old bus, so to speak.\" \"Alas, were it so easy,\" interrupted Brooks, in a clumsy attempt to draw Mr. Obama's attentions from me like some cocquettish debutante. Parker, Noonan and Frum were too lost in orgasmic schoolgirl giggling to offer anything more substantive. I ignored their embarrasing faux pas and pressed on with my thesis. \"We've tried, Mr. President,\" I explained. \"But there are unsavory elements within the party who keep bringing them back in.\" As I explained all this to President Obama, I assured him that there are still many conservatives like us who patriotically wish him every success, no matter what policies he has in mind. After extinguishing his Marlboro he paused for a few moments, nodded, and assured me that he would dispatch his staff and allies in the press to deal with the Limbaugh problem, thereby clearing the Council of Nassau to forge a new, improved, more fashionable Republican party. In that instant my faith in Mr. Obama's innate conservatism was reborn, for his offer of bipartisan kindness was a manifest sign that he only has our best interests at heart. Yes, I know there remain some conservatives of the better sort who have been shaken by the recent distressing market turns as our gallant young admiral struggles to find his sea legs and a coherent bank nationalization strategy. I confess to such quiet misgivings myself, which I brought up in our conversation. In response the President assured me that he would keep my portfolio in mind in the next round of corporate bailouts. Let us conservatives take comfort in that assurance, and in the fact that no matter what new taxes he proposes, Mr. Obama has at least assembled a cabinet with no personal enthusiasm for paying them. We must maintain our faith that the President's inner conservative will eventually emerge, and remain firm in the conviction that He works in mysterious ways. I had a Tech Sgt who would listen to about 30 seconds of what most officers had to say, then he would cut in and say gruffly: \"So, what's yer Point, Sir!? Cuz I got things to do - !\" He always got away with it because he KNEW his stuff, and had been picked as \"Most Outstanding NCO/Supervisor\" in several IG Inspections... Did he every pull that on me? Often, deservedly - - Cut to the chase - Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "Originally posted by GunnyRet03: Hilarious Stuff I Daresay It Is Time We Deal With the Mutineers Aboard the S.S. Conservatism T. Coddington Van Voorhees VII Editor, the National Topsider Membership Chairman, The Newport Club READ THE FULL TEXT HERE: 'http://iowahawk.typepad.com/iowahawk/' SNIP: quote: Much has been written about the fate of the conservative movement in the months since last I corresponded with you. I won't belabor the barrels of ink expended in the printing of its obituary, nor will I bore you with further reading of its entrails. Suffice it to say the grand old ship is in the doldrums, adrift in the electoral currents, with nary a harbor on the horizon. But it is time we leave such map room mopery aside and navigate a bold new course for the conservative armada. One needn't have a 400-year old heirloom scrimshaw sextant for this task; but, fortunately, I do. Today the Van Voorhees family sextant rests proudly atop my private shipboard desk. I'm admiring it now; there it sits, in its protective crystal bell jar, alongside Marinus' rapier, both still bearing the sanguinary patina of their provenance. They were, of course, the deathbed bequest of my visionary father, T.C. Van Voorhees VI, rakish founder of the National Topsider and the modern conservative movement. Last year, after our final emotional handshake, he looked at me with those anxious, fading eyes, and said: \"the helm awaits, my lad; I trust you will steer it well. And, it appears, I have soiled myself.\" This was, as you know, the theme of the National Topsider's exclusive January conference at the private Breakers Club in Nassau where I hosted a veritable murderer's row of top tory thinkers to diagnose the troubles with conservatism. Dame Peggy Noonan was there, of course, along with Kathleen Parker, Douglas Kmiec, and those two mighty Davids of conservative intellect, Brooks and Frum. But enough of the namedropping. The order of the day, after mixed badminton doubles, was to formulate an Rx for our ailing patient. In this regard we were in surprising accord: in order to survive, conservativism simply must start appealing to a better class of people. The sad fact of the matter, as we noted, is that one no longer finds admitted conservatives in any of America's prestige zip codes nor the faculty redoubts of her selective academies. During our Bahamian summit many gambits were proposed to win back America's elite electoral precincts from the left; sponsoring various hip hop colloquia at the better Ivies, supporting integration of gays into Nascar, endorsing state ownership of the means of production. Rod Dreher, whose sensational exegesis \"Crunchy Cons\" sold well over 200 copies last year, recommended a full embrace of the environmental movement, which as I understand is quite the rage among youthful voters and the trendsetting thespians of Hollywood. Good and bold ideas all, and necessary steps to get the movement started again. But there remains a daunting obstacle - namely, the benighted rubes who constitute so much of our so-called \"base,\" and whose existence make it nigh on impossible to recruit their social betters. That conundrum of electoral calculus was the topic of much discussion two weeks ago, when my Nassau confreres and I were summoned to the White House for an intimate repast with the new President and his inner circle. Mr. Obama was radiant as ever, still basking in the afterglow of his historic victory. I admit to a recent wobble or two in my faith in him, as the severe beatings suffered by my various family trusts have necessitated some unanticipated cutbacks in my household staff. But that easy, commanding elegance was a bracing reminder of why I endorsed Mr. Obama as the true conservative presidential choice. After dessert (black walnut dacquoise with sections of quince) we retired to the Blue Room where chief of staff Rahm Emanuel entertained us with some droll tales of his days as terpsichorean with the Mossad ballet auxiliary, even treating us to a few thrilling, if f-bomb laced, arabesques. He was followed by Vice President Joe Biden, who put on a fine display of his famed wit and penchant for unpredictable cerebral infarctions. Amid the sparkling bonhomie the President solicited our views on the causes of -- and solutions to -- conservatism's sad state. Seizing the opportunity for a tete-a-tete with the world's most powerful, popular, and beautiful man, I explained the tragic plague of rubes who stand athwart our modernization program. \"Why not just drive them out?\" asked the President, elegantly French inhaling his Marlboro Light 100. \"Under the old bus, so to speak.\" \"Alas, were it so easy,\" interrupted Brooks, in a clumsy attempt to draw Mr. Obama's attentions from me like some cocquettish debutante. Parker, Noonan and Frum were too lost in orgasmic schoolgirl giggling to offer anything more substantive. I ignored their embarrasing faux pas and pressed on with my thesis. \"We've tried, Mr. President,\" I explained. \"But there are unsavory elements within the party who keep bringing them back in.\" As I explained all this to President Obama, I assured him that there are still many conservatives like us who patriotically wish him every success, no matter what policies he has in mind. After extinguishing his Marlboro he paused for a few moments, nodded, and assured me that he would dispatch his staff and allies in the press to deal with the Limbaugh problem, thereby clearing the Council of Nassau to forge a new, improved, more fashionable Republican party. In that instant my faith in Mr. Obama's innate conservatism was reborn, for his offer of bipartisan kindness was a manifest sign that he only has our best interests at heart. Yes, I know there remain some conservatives of the better sort who have been shaken by the recent distressing market turns as our gallant young admiral struggles to find his sea legs and a coherent bank nationalization strategy. I confess to such quiet misgivings myself, which I brought up in our conversation. In response the President assured me that he would keep my portfolio in mind in the next round of corporate bailouts. Let us conservatives take comfort in that assurance, and in the fact that no matter what new taxes he proposes, Mr. Obama has at least assembled a cabinet with no personal enthusiasm for paying them. We must maintain our faith that the President's inner conservative will eventually emerge, and remain firm in the conviction that He works in mysterious ways.", 
        "reply": " I had a Tech Sgt who would listen to about 30 seconds of what most officers had to say, then he would cut in and say gruffly: \"So, what's yer Point, Sir!? Cuz I got things to do - !\" He always got away with it because he KNEW his stuff, and had been picked as \"Most Outstanding NCO/Supervisor\" in several IG Inspections... Did he every pull that on me? Often, deservedly - - Cut to the chase - Wandering and Wondering", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 09:19:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Cut to the chase - Basically, So called Conservatives(The Beltway Ivy League Sippers) that are really no different than Liberals are trying to say what needs to happen in the Conservative movement and disregard everyday people.", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "Cut to the chase -", 
        "reply": " Basically, So called Conservatives(The Beltway Ivy League Sippers) that are really no different than Liberals are trying to say what needs to happen in the Conservative movement and disregard everyday people.", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 09:54:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Conservatism is dead because those in power despise the people having a voice. The media hacks are too dumb to realize the constitution has more relevance now than when it was written.", 
        "intTime": 20090305, 
        "postID": 8, 
        "quote": "", 
        "reply": "Conservatism is dead because those in power despise the people having a voice. The media hacks are too dumb to realize the constitution has more relevance now than when it was written.", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 11:13:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Conservatism is dead because those in power despise the people having a voice. The media hacks are too dumb to realize the constitution has more relevance now than when it was written.", 
        "intTime": 20090305, 
        "postID": 9, 
        "quote": "Originally posted by soscorpio: Conservatism is dead because those in power despise the people having a voice. The media hacks are too dumb to realize the constitution has more relevance now than when it was written.", 
        "reply": "", 
        "threadID": "409192893_3200099612001", 
        "time": "2009-03-05 11:38:00", 
        "title": "Time We Deal With the Mutineers Aboard the S.S. Conservatism", 
        "userID": "GunnyRet03"
    }
]