[
    {
        "content": "How will We celebrate those who have given the last full measure? Will We in these times? Feel free to debate this topic...or memorialize your loved ones who have laid their lives upon the altar of American Freedom...", 
        "intTime": 20090509, 
        "postID": 1, 
        "quote": "", 
        "reply": "How will We celebrate those who have given the last full measure? Will We in these times? Feel free to debate this topic...or memorialize your loved ones who have laid their lives upon the altar of American Freedom...", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-09 16:01:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: How will We celebrate those who have given the last full measure? Will We in these times? Feel free to debate this topic...or memorialize your loved ones who have laid their lives upon the altar of American Freedom... I will, I always do and Veteran's Day. I always go to some services, either locally or to a National Cemetary and just take a long walk through them. This year it will be locally since I volunteered this year to decorate our local memorial for the service.", 
        "intTime": 20090509, 
        "postID": 2, 
        "quote": "Originally posted by strobelvets: How will We celebrate those who have given the last full measure? Will We in these times? Feel free to debate this topic...or memorialize your loved ones who have laid their lives upon the altar of American Freedom...", 
        "reply": " I will, I always do and Veteran's Day. I always go to some services, either locally or to a National Cemetary and just take a long walk through them. This year it will be locally since I volunteered this year to decorate our local memorial for the service.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-09 16:15:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I will wear my grandfather's WWII Victory Medal, as i always have in honor of him.", 
        "intTime": 20090509, 
        "postID": 3, 
        "quote": "", 
        "reply": "I will wear my grandfather's WWII Victory Medal, as i always have in honor of him.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-09 17:50:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "brian1973m"
    }, 
    {
        "content": "Since I live in Germany,I plan to visit as many overseas cemeteries throughout Europe. This should be mandatory for every service member serving here. MEUSE-ARGONNE AMERICAN CEMETERY AND MEMORIAL SOMME AMERICAN CEMETERY AND MEMORIAL ARDENNES AMERICAN CEMETERY AND MEMORIAL", 
        "intTime": 20090510, 
        "postID": 4, 
        "quote": "", 
        "reply": "Since I live in Germany,I plan to visit as many overseas cemeteries throughout Europe. This should be mandatory for every service member serving here. MEUSE-ARGONNE AMERICAN CEMETERY AND MEMORIAL SOMME AMERICAN CEMETERY AND MEMORIAL ARDENNES AMERICAN CEMETERY AND MEMORIAL", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-10 06:05:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "samh32"
    }, 
    {
        "content": "I'm privileged to have been given permissive TDY and will be at The Wall on Memorial Day. I'll be doing \"story telling\" at the Women's Memorial at 1100 hrs. on Memorial Day, and will attend events there at 1300. I would be honored to meet some of you there. I'll also be going to Arlington to honor my father (WWII, Korea, VN) and my mother (WWII), both buried there.", 
        "intTime": 20090510, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm privileged to have been given permissive TDY and will be at The Wall on Memorial Day. I'll be doing \"story telling\" at the Women's Memorial at 1100 hrs. on Memorial Day, and will attend events there at 1300. I would be honored to meet some of you there. I'll also be going to Arlington to honor my father (WWII, Korea, VN) and my mother (WWII), both buried there.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-10 12:51:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: How will We celebrate those who have given the last full measure? Will We in these times? Feel free to debate this topic...or memorialize your loved ones who have laid their lives upon the altar of American Freedom... I will do as I have done every year since I became an adult. I will have flowers and flags placed on the graves of relaties in other states. For my uncles and family friends buried within driving distance, I will take flowers and flags myself and at each grave offer a prayer of thanksgiving for their service and their sacrifice. I always take a small hand shovel and rake to do a little tending to a very small country cemetary that few ever visit and take extra flags to place on the graves of other military who have no family to stand over them. God bless our Marines, our military and the famiies waiting for their return... and for those who gave the last full measure of devotion and the families they left behind, may God give comfort, strength and peace.", 
        "intTime": 20090510, 
        "postID": 6, 
        "quote": "Originally posted by strobelvets: How will We celebrate those who have given the last full measure? Will We in these times? Feel free to debate this topic...or memorialize your loved ones who have laid their lives upon the altar of American Freedom...", 
        "reply": " I will do as I have done every year since I became an adult. I will have flowers and flags placed on the graves of relaties in other states. For my uncles and family friends buried within driving distance, I will take flowers and flags myself and at each grave offer a prayer of thanksgiving for their service and their sacrifice. I always take a small hand shovel and rake to do a little tending to a very small country cemetary that few ever visit and take extra flags to place on the graves of other military who have no family to stand over them. God bless our Marines, our military and the famiies waiting for their return... and for those who gave the last full measure of devotion and the families they left behind, may God give comfort, strength and peace.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-10 14:42:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "I will be honored to address the crowd during Memorial Day ceremonies at the Kentucky Vietnam Veteran's Memorial, in Frankfort. I will be accompanied by roughly 30 former members of Co C, 2/1 Inf, 196th Light Infantry Brigade, and members of the family of one of our fallen brothers, SP/4 James R. Stout, as we honor his service and lay a wreath at his name on the Memorial. If any of you are nearby and would like to attend, the service begins at 1000 hours on Monday, May 25th.", 
        "intTime": 20090510, 
        "postID": 7, 
        "quote": "", 
        "reply": "I will be honored to address the crowd during Memorial Day ceremonies at the Kentucky Vietnam Veteran's Memorial, in Frankfort. I will be accompanied by roughly 30 former members of Co C, 2/1 Inf, 196th Light Infantry Brigade, and members of the family of one of our fallen brothers, SP/4 James R. Stout, as we honor his service and lay a wreath at his name on the Memorial. If any of you are nearby and would like to attend, the service begins at 1000 hours on Monday, May 25th.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-10 18:45:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "stillkit"
    }, 
    {
        "content": "Part of mine will be the rededication of the 4ID memorial at Fort Hood with the addition of the names of the Soldiers we lost in our deployment.", 
        "intTime": 20090510, 
        "postID": 8, 
        "quote": "", 
        "reply": "Part of mine will be the rededication of the 4ID memorial at Fort Hood with the addition of the names of the Soldiers we lost in our deployment.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-10 18:54:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I will be standing on the grounds where many people with my last name are buried. Many of them served. I will be remembering my Grandfathers, who both served in the Korean War, and my Dad, who served in peacetime, and passed away just two years ago, and at only 46. Indeed all three of them passed away in the past two years, and the grief is still raw. As far as honoring a person killed in action, it will be a friend named Stephen P Snowberger III, or \"Snow,\" as we called him. He died about four years ago in an IED outside of Baghdad. He had to wait until he was 18 to ship out to be with us over there, and he wasn't there for long at all before he was killed. I will remember him for the rest of my Memorial Days when I salute that flag. Because we all know that after a little while in the service, it's no longer that flag that you're saluting so much as your fallen comrades, whether friends or strangers. \"http://www.iraqwarheroes.com/photos10/stephen_snowberger04.jpg\"", 
        "intTime": 20090510, 
        "postID": 9, 
        "quote": "", 
        "reply": "I will be standing on the grounds where many people with my last name are buried. Many of them served. I will be remembering my Grandfathers, who both served in the Korean War, and my Dad, who served in peacetime, and passed away just two years ago, and at only 46. Indeed all three of them passed away in the past two years, and the grief is still raw. As far as honoring a person killed in action, it will be a friend named Stephen P Snowberger III, or \"Snow,\" as we called him. He died about four years ago in an IED outside of Baghdad. He had to wait until he was 18 to ship out to be with us over there, and he wasn't there for long at all before he was killed. I will remember him for the rest of my Memorial Days when I salute that flag. Because we all know that after a little while in the service, it's no longer that flag that you're saluting so much as your fallen comrades, whether friends or strangers. \"http://www.iraqwarheroes.com/photos10/stephen_snowberger04.jpg\"", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-10 20:34:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "Ruanne"
    }, 
    {
        "content": "As I do on every Memorial Day now, I will quietly raise a glass to the memory of the members of my Ranger Team from Company, P, 75th Army Rangers, Quang Tri, RVN 1970 (I am, sadly, the only living member). I will then read aloud the beautiful speech Shakespeare wrote for Henry V: quote: If we are mark'd to die, we are enow To do our country loss; and if to live, The fewer men, the greater share of honour. God's will! I pray thee, wish not one man more. By Jove, I am not covetous for gold, Nor care I who doth feed upon my cost; It yearns me not if men my garments wear; Such outward things dwell not in my desires: But if it be a sin to covet honour, I am the most offending soul alive. No, faith, my coz, wish not a man from England: God's peace! I would not lose so great an honour As one man more, methinks, would share from me For the best hope I have. O, do not wish one more! Rather proclaim it, Westmoreland, through my host, That he which hath no stomach to this fight, Let him depart; his passport shall be made And crowns for convoy put into his purse: We would not die in that man's company That fears his fellowship to die with us. This day is called the feast of Crispian: He that outlives this day, and comes safe home, Will stand a tip-toe when the day is named, And rouse him at the name of Crispian. He that shall live this day, and see old age, Will yearly on the vigil feast his neighbours, And say 'To-morrow is Saint Crispian:' Then will he strip his sleeve and show his scars. And say 'These wounds I had on Crispin's day.' Old men forget: yet all shall be forgot, But he'll remember with advantages What feats he did that day: then shall our names. Familiar in his mouth as household words Harry the king, Bedford and Exeter, Warwick and Talbot, Salisbury and Gloucester, Be in their flowing cups freshly remember'd. This story shall the good man teach his son; And Crispin Crispian shall ne'er go by, From this day to the ending of the world, But we in it shall be remember'd; We few, we happy few, we band of brothers; For he to-day that sheds his blood with me Shall be my brother; be he ne'er so vile, This day shall gentle his condition: And gentlemen in England now a-bed Shall think themselves accursed they were not here, And hold their manhoods cheap whiles any speaks That fought with us upon Saint Crispin's day. I will finish by praying that, where ever they may be, their souls may be in peace.", 
        "intTime": 20090511, 
        "postID": 10, 
        "quote": "If we are mark'd to die, we are enow To do our country loss; and if to live, The fewer men, the greater share of honour. God's will! I pray thee, wish not one man more. By Jove, I am not covetous for gold, Nor care I who doth feed upon my cost; It yearns me not if men my garments wear; Such outward things dwell not in my desires: But if it be a sin to covet honour, I am the most offending soul alive. No, faith, my coz, wish not a man from England: God's peace! I would not lose so great an honour As one man more, methinks, would share from me For the best hope I have. O, do not wish one more! Rather proclaim it, Westmoreland, through my host, That he which hath no stomach to this fight, Let him depart; his passport shall be made And crowns for convoy put into his purse: We would not die in that man's company That fears his fellowship to die with us. This day is called the feast of Crispian: He that outlives this day, and comes safe home, Will stand a tip-toe when the day is named, And rouse him at the name of Crispian. He that shall live this day, and see old age, Will yearly on the vigil feast his neighbours, And say 'To-morrow is Saint Crispian:' Then will he strip his sleeve and show his scars. And say 'These wounds I had on Crispin's day.' Old men forget: yet all shall be forgot, But he'll remember with advantages What feats he did that day: then shall our names. Familiar in his mouth as household words Harry the king, Bedford and Exeter, Warwick and Talbot, Salisbury and Gloucester, Be in their flowing cups freshly remember'd. This story shall the good man teach his son; And Crispin Crispian shall ne'er go by, From this day to the ending of the world, But we in it shall be remember'd; We few, we happy few, we band of brothers; For he to-day that sheds his blood with me Shall be my brother; be he ne'er so vile, This day shall gentle his condition: And gentlemen in England now a-bed Shall think themselves accursed they were not here, And hold their manhoods cheap whiles any speaks That fought with us upon Saint Crispin's day.", 
        "reply": "As I do on every Memorial Day now, I will quietly raise a glass to the memory of the members of my Ranger Team from Company, P, 75th Army Rangers, Quang Tri, RVN 1970 (I am, sadly, the only living member). I will then read aloud the beautiful speech Shakespeare wrote for Henry V:  I will finish by praying that, where ever they may be, their souls may be in peace.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-11 05:01:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I will most likely be quoting Johnny Cash in my remarks. This is from his song, \"The Big Battle:\" The fight yet to come's not with cannon nor will the fight be hand to hand No one will regroup the forces no charge will a general command The battle will rage in the bosom of mother and sweetheart and wife Brother and sister and daughter will grieve for the rest of their lives Now go ahead rise from your cover be thankful that God let you live Go fight the rest of the battle for those who gave all they could give", 
        "intTime": 20090511, 
        "postID": 11, 
        "quote": "", 
        "reply": "I will most likely be quoting Johnny Cash in my remarks. This is from his song, \"The Big Battle:\" The fight yet to come's not with cannon nor will the fight be hand to hand No one will regroup the forces no charge will a general command The battle will rage in the bosom of mother and sweetheart and wife Brother and sister and daughter will grieve for the rest of their lives Now go ahead rise from your cover be thankful that God let you live Go fight the rest of the battle for those who gave all they could give", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-11 06:52:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "stillkit"
    }, 
    {
        "content": "I will be, as every year, at our small local cemetery holding an American Legion service and reading the names of the area veterans who have gone before, we will salute them with a firing squad, Taps, and all honors. Our service is at 0800 followed by refreshments for the attendees. We usually get a good crowd and they appreciate the service. Flags will be placed at each Veterans resting place. I had the pleasure last year of presenting one of our WWII Marines with some sand and photos of Pelilu where he fought. The items were from the courtesy of a poster on here who had been to the island and brought back extra sand and vials in honor of a relative of hers. The vial of sand I gave the Marine was from the beach on which he went ashore. Eyeball sweat time for many of the people there, it was a great experience.", 
        "intTime": 20090512, 
        "postID": 12, 
        "quote": "", 
        "reply": "I will be, as every year, at our small local cemetery holding an American Legion service and reading the names of the area veterans who have gone before, we will salute them with a firing squad, Taps, and all honors. Our service is at 0800 followed by refreshments for the attendees. We usually get a good crowd and they appreciate the service. Flags will be placed at each Veterans resting place. I had the pleasure last year of presenting one of our WWII Marines with some sand and photos of Pelilu where he fought. The items were from the courtesy of a poster on here who had been to the island and brought back extra sand and vials in honor of a relative of hers. The vial of sand I gave the Marine was from the beach on which he went ashore. Eyeball sweat time for many of the people there, it was a great experience.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-12 20:44:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "OldDoc"
    }, 
    {
        "content": "When I was in Connecticut my Post put flags at all veterans memorials...individual graves...I did it every year. I still miss that event.", 
        "intTime": 20090512, 
        "postID": 13, 
        "quote": "", 
        "reply": "When I was in Connecticut my Post put flags at all veterans memorials...individual graves...I did it every year. I still miss that event.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-12 22:03:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: I'm privileged to have been given permissive TDY and will be at The Wall on Memorial Day. I'll be doing \"story telling\" at the Women's Memorial at 1100 hrs. on Memorial Day, and will attend events there at 1300. I would be honored to meet some of you there. I'll also be going to Arlington to honor my father (WWII, Korea, VN) and my mother (WWII), both buried there. I'd love to see some photos of your ceremony. I've been to the Wall but never able to attend a ceremony there.", 
        "intTime": 20090513, 
        "postID": 14, 
        "quote": "Originally posted by Cider33_Alpha: I'm privileged to have been given permissive TDY and will be at The Wall on Memorial Day. I'll be doing \"story telling\" at the Women's Memorial at 1100 hrs. on Memorial Day, and will attend events there at 1300. I would be honored to meet some of you there. I'll also be going to Arlington to honor my father (WWII, Korea, VN) and my mother (WWII), both buried there.", 
        "reply": " I'd love to see some photos of your ceremony. I've been to the Wall but never able to attend a ceremony there.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-13 11:18:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "SgtWilliams, I don't know how many photos I'll be able to take (but my camera WILL be with me), but PM me with your email and I'll send you what I can get.", 
        "intTime": 20090513, 
        "postID": 15, 
        "quote": "", 
        "reply": "SgtWilliams, I don't know how many photos I'll be able to take (but my camera WILL be with me), but PM me with your email and I'll send you what I can get.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-13 11:53:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Ladies and gentlemen, I humbly request pictures of all you plan to attend. My routine will remain the same: I will go to the local VA (here in Dallas, now) and spend the day with the convalescent care patients, reading from the bible and handing out challenge coins. We'll pray together, talk, laugh, and they'll remember that some of us remember. I will raise a beer to all of those that have secured my freedom - including myself. Dad - 12 years a Marine. Bless your soul, sir. Bless your memory. You passed in 1984, and not a day goes by I do not remember you. 1 Bronze Star and 3 Purple Hearts from Korea and 'Nam. Mom - 10 years, United States Navy. One of the first WAC's, and one of the VERY few females that sports a Vietnam Campaign Ribbon as well as a Purple Heart. You are and have always been my hero. You passed 6 months ago, and I can still feel your hugs. George, the step dad - United States Army. Heaven is a better place with you in it, sir, and I know that mom loved you with her entire being. You died, what? 13 years ago? And yet your gentle smile still haunts my memories over your loving and stern discipline. There are two ways for a man to have a want for a better family. Fortunately, I'm not aware of either of them. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090513, 
        "postID": 16, 
        "quote": "", 
        "reply": "Ladies and gentlemen, I humbly request pictures of all you plan to attend. My routine will remain the same: I will go to the local VA (here in Dallas, now) and spend the day with the convalescent care patients, reading from the bible and handing out challenge coins. We'll pray together, talk, laugh, and they'll remember that some of us remember. I will raise a beer to all of those that have secured my freedom - including myself. Dad - 12 years a Marine. Bless your soul, sir. Bless your memory. You passed in 1984, and not a day goes by I do not remember you. 1 Bronze Star and 3 Purple Hearts from Korea and 'Nam. Mom - 10 years, United States Navy. One of the first WAC's, and one of the VERY few females that sports a Vietnam Campaign Ribbon as well as a Purple Heart. You are and have always been my hero. You passed 6 months ago, and I can still feel your hugs. George, the step dad - United States Army. Heaven is a better place with you in it, sir, and I know that mom loved you with her entire being. You died, what? 13 years ago? And yet your gentle smile still haunts my memories over your loving and stern discipline. There are two ways for a man to have a want for a better family. Fortunately, I'm not aware of either of them. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-13 12:07:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: SgtWilliams, I don't know how many photos I'll be able to take (but my camera WILL be with me), but PM me with your email and I'll send you what I can get. No can do anymore because of the private profile change by admin...........", 
        "intTime": 20090513, 
        "postID": 17, 
        "quote": "Originally posted by Cider33_Alpha: SgtWilliams, I don't know how many photos I'll be able to take (but my camera WILL be with me), but PM me with your email and I'll send you what I can get.", 
        "reply": " No can do anymore because of the private profile change by admin...........", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-13 12:21:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: I'm privileged to have been given permissive TDY and will be at The Wall on Memorial Day. I'll be doing \"story telling\" at the Women's Memorial at 1100 hrs. on Memorial Day, and will attend events there at 1300. I would be honored to meet some of you there. I won't be there, but my mom is there: SSG Mary Lovett, Army Air Corps.", 
        "intTime": 20090513, 
        "postID": 18, 
        "quote": "Originally posted by Cider33_Alpha: I'm privileged to have been given permissive TDY and will be at The Wall on Memorial Day. I'll be doing \"story telling\" at the Women's Memorial at 1100 hrs. on Memorial Day, and will attend events there at 1300. I would be honored to meet some of you there.", 
        "reply": " I won't be there, but my mom is there: SSG Mary Lovett, Army Air Corps.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-13 12:45:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "67NOV"
    }, 
    {
        "content": "In these times, I think of all our family members have sacrificed. I miss my Father, my Grandfather and my Gr-Uncles. Those who taught me all...how to lace my shoes...tie a tie...handle victory and defeat with dignity. Appreciate a summer breeze and survive a winter blizzard. And inculcated a deep love and respect for this Great Nation...and those who comprise it...their wisdom, work ethic and sense of community. I pray that They will find Peace...and understand that We the People will honor their traditions.", 
        "intTime": 20090517, 
        "postID": 19, 
        "quote": "", 
        "reply": "In these times, I think of all our family members have sacrificed. I miss my Father, my Grandfather and my Gr-Uncles. Those who taught me all...how to lace my shoes...tie a tie...handle victory and defeat with dignity. Appreciate a summer breeze and survive a winter blizzard. And inculcated a deep love and respect for this Great Nation...and those who comprise it...their wisdom, work ethic and sense of community. I pray that They will find Peace...and understand that We the People will honor their traditions.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-17 17:49:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: As I do on every Memorial Day now, I will quietly raise a glass to the memory of the members of my Ranger Team from Company, P, 75th Army Rangers, Quang Tri, RVN 1970 (I am, sadly, the only living member). I will then read aloud the beautiful speech Shakespeare wrote for Henry V: quote: If we are mark'd to die, we are enow To do our country loss; and if to live, The fewer men, the greater share of honour. God's will! I pray thee, wish not one man more. By Jove, I am not covetous for gold, Nor care I who doth feed upon my cost; It yearns me not if men my garments wear; Such outward things dwell not in my desires: But if it be a sin to covet honour, I am the most offending soul alive. No, faith, my coz, wish not a man from England: God's peace! I would not lose so great an honour As one man more, methinks, would share from me For the best hope I have. O, do not wish one more! Rather proclaim it, Westmoreland, through my host, That he which hath no stomach to this fight, Let him depart; his passport shall be made And crowns for convoy put into his purse: We would not die in that man's company That fears his fellowship to die with us. This day is called the feast of Crispian: He that outlives this day, and comes safe home, Will stand a tip-toe when the day is named, And rouse him at the name of Crispian. He that shall live this day, and see old age, Will yearly on the vigil feast his neighbours, And say 'To-morrow is Saint Crispian:' Then will he strip his sleeve and show his scars. And say 'These wounds I had on Crispin's day.' Old men forget: yet all shall be forgot, But he'll remember with advantages What feats he did that day: then shall our names. Familiar in his mouth as household words Harry the king, Bedford and Exeter, Warwick and Talbot, Salisbury and Gloucester, Be in their flowing cups freshly remember'd. This story shall the good man teach his son; And Crispin Crispian shall ne'er go by, From this day to the ending of the world, But we in it shall be remember'd; We few, we happy few, we band of brothers; For he to-day that sheds his blood with me Shall be my brother; be he ne'er so vile, This day shall gentle his condition: And gentlemen in England now a-bed Shall think themselves accursed they were not here, And hold their manhoods cheap whiles any speaks That fought with us upon Saint Crispin's day. I will finish by praying that, where ever they may be, their souls may be in peace. Drink one for the Airborne Ranger in the sky", 
        "intTime": 20090517, 
        "postID": 20, 
        "quote": "Originally posted by Fightdirector: As I do on every Memorial Day now, I will quietly raise a glass to the memory of the members of my Ranger Team from Company, P, 75th Army Rangers, Quang Tri, RVN 1970 (I am, sadly, the only living member). I will then read aloud the beautiful speech Shakespeare wrote for Henry V: quote: If we are mark'd to die, we are enow To do our country loss; and if to live, The fewer men, the greater share of honour. God's will! I pray thee, wish not one man more. By Jove, I am not covetous for gold, Nor care I who doth feed upon my cost; It yearns me not if men my garments wear; Such outward things dwell not in my desires: But if it be a sin to covet honour, I am the most offending soul alive. No, faith, my coz, wish not a man from England: God's peace! I would not lose so great an honour As one man more, methinks, would share from me For the best hope I have. O, do not wish one more! Rather proclaim it, Westmoreland, through my host, That he which hath no stomach to this fight, Let him depart; his passport shall be made And crowns for convoy put into his purse: We would not die in that man's company That fears his fellowship to die with us. This day is called the feast of Crispian: He that outlives this day, and comes safe home, Will stand a tip-toe when the day is named, And rouse him at the name of Crispian. He that shall live this day, and see old age, Will yearly on the vigil feast his neighbours, And say 'To-morrow is Saint Crispian:' Then will he strip his sleeve and show his scars. And say 'These wounds I had on Crispin's day.' Old men forget: yet all shall be forgot, But he'll remember with advantages What feats he did that day: then shall our names. Familiar in his mouth as household words Harry the king, Bedford and Exeter, Warwick and Talbot, Salisbury and Gloucester, Be in their flowing cups freshly remember'd. This story shall the good man teach his son; And Crispin Crispian shall ne'er go by, From this day to the ending of the world, But we in it shall be remember'd; We few, we happy few, we band of brothers; For he to-day that sheds his blood with me Shall be my brother; be he ne'er so vile, This day shall gentle his condition: And gentlemen in England now a-bed Shall think themselves accursed they were not here, And hold their manhoods cheap whiles any speaks That fought with us upon Saint Crispin's day. I will finish by praying that, where ever they may be, their souls may be in peace.", 
        "reply": " Drink one for the Airborne Ranger in the sky", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-17 18:50:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I will do as I have for the past couple years and just raise a glass for those that have past. I do regreat that during my time over in Germany I did not get a chance to travel to and visit the Beach's in France. From what i understand those are the graves that dont get visited much by Americans. I may be wrong but its what I was told.", 
        "intTime": 20090517, 
        "postID": 21, 
        "quote": "", 
        "reply": "I will do as I have for the past couple years and just raise a glass for those that have past. I do regreat that during my time over in Germany I did not get a chance to travel to and visit the Beach's in France. From what i understand those are the graves that dont get visited much by Americans. I may be wrong but its what I was told.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-17 20:03:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: I will do as I have for the past couple years and just raise a glass for those that have past. I do regreat that during my time over in Germany I did not get a chance to travel to and visit the Beach's in France. From what i understand those are the graves that dont get visited much by Americans. I may be wrong but its what I was told. There are no US National Cemetaries in Germany, set that way for obvious reasons. When I was over there and couldn't make it to Belguim, France or Holland, I went to the nearest allied cemetary which was usually british on our Memorial Day and again on their Rememberence Day, Nov 11th.", 
        "intTime": 20090517, 
        "postID": 22, 
        "quote": "Originally posted by Usamp27: I will do as I have for the past couple years and just raise a glass for those that have past. I do regreat that during my time over in Germany I did not get a chance to travel to and visit the Beach's in France. From what i understand those are the graves that dont get visited much by Americans. I may be wrong but its what I was told.", 
        "reply": " There are no US National Cemetaries in Germany, set that way for obvious reasons. When I was over there and couldn't make it to Belguim, France or Holland, I went to the nearest allied cemetary which was usually british on our Memorial Day and again on their Rememberence Day, Nov 11th.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-17 20:23:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Well my thought is do what my Post did and go to any cemetary and put a flag on any grave that shows some one who served...I loved doing that and did it for a number of years...", 
        "intTime": 20090517, 
        "postID": 23, 
        "quote": "", 
        "reply": "Well my thought is do what my Post did and go to any cemetary and put a flag on any grave that shows some one who served...I loved doing that and did it for a number of years...", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-17 23:20:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "I SALUTE the Fallen memorialized here. Those who have given the last full measure of devotion...drive this Country forward...in terms of patriotism, loyalty and courage under extreme conditions. We the People stand humbled by their acts of heroism; and hope that our progeny live by these same ideals of Liberty...as driven home by these Patriots. Please continue to post here...if you have lost a love one upon the altar of American Freedom. God Bless...", 
        "intTime": 20090522, 
        "postID": 24, 
        "quote": "", 
        "reply": "I SALUTE the Fallen memorialized here. Those who have given the last full measure of devotion...drive this Country forward...in terms of patriotism, loyalty and courage under extreme conditions. We the People stand humbled by their acts of heroism; and hope that our progeny live by these same ideals of Liberty...as driven home by these Patriots. Please continue to post here...if you have lost a love one upon the altar of American Freedom. God Bless...", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-22 16:12:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "THE WHITE HOUSE Office of the Press Secretary For Immediate Release May 22, 2009 PRAYER FOR PEACE, MEMORIAL DAY, 2009 - - - - - - - BY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION For over two centuries, Americans have defended our Nation's security and protected our founding principles of democracy and equal justice under law. On Memorial Day, we honor those who have paid the ultimate price in defense of these freedoms. Members of the United States Armed Forces have placed our Nation's safety before their own for generations. From the first shots fired at Lexington and Concord to the current conflicts in Iraq and Afghanistan, these brave patriots have taken on great risks to keep us safe, and they have served with honor and distinction. All Americans who have enjoyed the blessings of peace and liberty remain in their debt. As we remember the selfless service of our fallen heroes, we pray for God's grace upon them. We also pray for all of our military personnel and veterans, their families, and all those who have lost loved ones in the defense of our freedom and safety. Today, as we commend their deeds, we also bear a heavy burden of responsibility to ensure that their sacrifices will not have been in vain. This means that, as we uphold the ideals for which many have given their last full measure of devotion, the United States must never waver in its determination to defend itself, to be faithful in protecting liberty at home and abroad, and to pursue peace in the world. In respect for their dedication and service to America, the Congress, by a joint resolution approved on May 11, 1950, as amended (36 U.S.C. 116), has requested the President to issue a proclamation calling on the people of the United States to observe each Memorial Day as a day of prayer for permanent peace and designating a period on that day when the people of the United States might unite in prayer. The Congress, by Public Law 106-579, has also designated 3:00 p.m. local time on that day as a time for all Americans to observe, in their own way, the National Moment of Remembrance. NOW, THEREFORE, I, BARACK OBAMA, President of the United States of America, do hereby proclaim Memorial Day, May 25, 2009, as a day of prayer for permanent peace, and I designate the hour beginning in each locality at 11:00 a.m. of that day as a time to unite in prayer. I also ask all Americans to observe the National Moment of Remembrance beginning at 3:00 p.m. local time on Memorial Day. I urge the press, radio, television, websites, and all other media to participate in these observances. I also request the Governors of the United States and the Commonwealth of Puerto Rico, and the appropriate officials of all units of government, to direct that the flag be flown at half-staff until noon on this Memorial Day on all buildings, grounds, and naval vessels throughout the United States, and in all areas under its jurisdiction and control. I also request the people of the United States to display the flag at half-staff from their homes for the customary forenoon period. IN WITNESS WHEREOF, I have hereunto set my hand this twenty-second day of May, in the year of our Lord two thousand nine, and of the Independence of the United States of America the two hundred and thirty-third. BARACK OBAMA >>>http://www.militarytimes.com/static/projects/pages/memorialday2009.pdf # # #", 
        "intTime": 20090522, 
        "postID": 25, 
        "quote": "", 
        "reply": "THE WHITE HOUSE Office of the Press Secretary For Immediate Release May 22, 2009 PRAYER FOR PEACE, MEMORIAL DAY, 2009 - - - - - - - BY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION For over two centuries, Americans have defended our Nation's security and protected our founding principles of democracy and equal justice under law. On Memorial Day, we honor those who have paid the ultimate price in defense of these freedoms. Members of the United States Armed Forces have placed our Nation's safety before their own for generations. From the first shots fired at Lexington and Concord to the current conflicts in Iraq and Afghanistan, these brave patriots have taken on great risks to keep us safe, and they have served with honor and distinction. All Americans who have enjoyed the blessings of peace and liberty remain in their debt. As we remember the selfless service of our fallen heroes, we pray for God's grace upon them. We also pray for all of our military personnel and veterans, their families, and all those who have lost loved ones in the defense of our freedom and safety. Today, as we commend their deeds, we also bear a heavy burden of responsibility to ensure that their sacrifices will not have been in vain. This means that, as we uphold the ideals for which many have given their last full measure of devotion, the United States must never waver in its determination to defend itself, to be faithful in protecting liberty at home and abroad, and to pursue peace in the world. In respect for their dedication and service to America, the Congress, by a joint resolution approved on May 11, 1950, as amended (36 U.S.C. 116), has requested the President to issue a proclamation calling on the people of the United States to observe each Memorial Day as a day of prayer for permanent peace and designating a period on that day when the people of the United States might unite in prayer. The Congress, by Public Law 106-579, has also designated 3:00 p.m. local time on that day as a time for all Americans to observe, in their own way, the National Moment of Remembrance. NOW, THEREFORE, I, BARACK OBAMA, President of the United States of America, do hereby proclaim Memorial Day, May 25, 2009, as a day of prayer for permanent peace, and I designate the hour beginning in each locality at 11:00 a.m. of that day as a time to unite in prayer. I also ask all Americans to observe the National Moment of Remembrance beginning at 3:00 p.m. local time on Memorial Day. I urge the press, radio, television, websites, and all other media to participate in these observances. I also request the Governors of the United States and the Commonwealth of Puerto Rico, and the appropriate officials of all units of government, to direct that the flag be flown at half-staff until noon on this Memorial Day on all buildings, grounds, and naval vessels throughout the United States, and in all areas under its jurisdiction and control. I also request the people of the United States to display the flag at half-staff from their homes for the customary forenoon period. IN WITNESS WHEREOF, I have hereunto set my hand this twenty-second day of May, in the year of our Lord two thousand nine, and of the Independence of the United States of America the two hundred and thirty-third. BARACK OBAMA >>>http://www.militarytimes.com/static/projects/pages/memorialday2009.pdf # # #", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-22 22:58:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "*", 
        "intTime": 20090523, 
        "postID": 26, 
        "quote": "", 
        "reply": "*", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-23 13:56:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: * 1* (the dense need to say that out loud, slowly, a few times) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 27, 
        "quote": "Originally posted by strobelvets: *", 
        "reply": " 1* (the dense need to say that out loud, slowly, a few times) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-23 14:14:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "God bless our Heroes who have given the last full measure of devotion...that We the People might be free. ************************************************ Our Father, who art in heaven, hallowed be thy name. Thy Kingdom come, thy will be done, on earth as it is in heaven Give us this day our daily bread. And forgive us our trespasses, as we forgive those who trespass against us. And lead us not into temptation, but deliver us from evil. For thine is the kingdom, the power and the glory. for ever and ever. Amen *********************************************** But, in a larger sense, we can not dedicate -- we can not consecrate -- we can not hallow -- this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. The world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced. It is rather for us to be here dedicated to the great task remaining before us -- that from these honored dead we take increased devotion to that cause for which they gave the last full measure of devotion -- that we here highly resolve that these dead shall not have died in vain -- that this nation, under God, shall have a new birth of freedom -- and that government of the people, by the people, for the people, shall not perish from the earth. -Lincoln ********************************************** On this particular Day ...let us pause to remember...", 
        "intTime": 20090524, 
        "postID": 28, 
        "quote": "", 
        "reply": "God bless our Heroes who have given the last full measure of devotion...that We the People might be free. ************************************************ Our Father, who art in heaven, hallowed be thy name. Thy Kingdom come, thy will be done, on earth as it is in heaven Give us this day our daily bread. And forgive us our trespasses, as we forgive those who trespass against us. And lead us not into temptation, but deliver us from evil. For thine is the kingdom, the power and the glory. for ever and ever. Amen *********************************************** But, in a larger sense, we can not dedicate -- we can not consecrate -- we can not hallow -- this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. The world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced. It is rather for us to be here dedicated to the great task remaining before us -- that from these honored dead we take increased devotion to that cause for which they gave the last full measure of devotion -- that we here highly resolve that these dead shall not have died in vain -- that this nation, under God, shall have a new birth of freedom -- and that government of the people, by the people, for the people, shall not perish from the earth. -Lincoln ********************************************** On this particular Day ...let us pause to remember...", 
        "threadID": "409192893_6790009222001", 
        "time": "2009-05-24 13:48:00", 
        "title": "Memorial Day is approaching...", 
        "userID": "strobelvets"
    }
]