[
    {
        "content": "His administration is telling Iran that they do not have to stop their nuclear activities before they come to the negotiating table. I simply do not trust the Iranians, I'm not somebody who believes they would use nuclear weapons, but it would change the entire dynamic in the region and change it for the worst as far as America is concerned. I also find it hard, incredibly hard to believe that Israel would not attack Iran if they received concrete intelligence that Iran has reached the point of no return...regardless of whether America approves or not. Better to stir the hornets nest and **** off your neighbor and friend than let them get a nuclear capability. Israel will act, this is a situation where talking is just not the answer. It's not going to work, what planet do some people live on? after 30 years of America telling them to \"STFU\" their suddenly going to embrace us?", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "His administration is telling Iran that they do not have to stop their nuclear activities before they come to the negotiating table. I simply do not trust the Iranians, I'm not somebody who believes they would use nuclear weapons, but it would change the entire dynamic in the region and change it for the worst as far as America is concerned. I also find it hard, incredibly hard to believe that Israel would not attack Iran if they received concrete intelligence that Iran has reached the point of no return...regardless of whether America approves or not. Better to stir the hornets nest and **** off your neighbor and friend than let them get a nuclear capability. Israel will act, this is a situation where talking is just not the answer. It's not going to work, what planet do some people live on? after 30 years of America telling them to \"STFU\" their suddenly going to embrace us?", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-14 23:23:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: His administration is telling Iran that they do not have to stop their nuclear activities before they come to the negotiating table. perhaps because ending their nuclear activities is what is going to be negotiated. quote: I also find it hard, incredibly hard to believe that Israel would not attack Iran if they received concrete intelligence that Iran has reached the point of no return... I'm shocked they haven't already. My guess they don't have proof otherwise there would be a couple of great big holes in Iran already.", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "His administration is telling Iran that they do not have to stop their nuclear activities before they come to the negotiating table.", 
        "reply": " perhaps because ending their nuclear activities is what is going to be negotiated. quote: I also find it hard, incredibly hard to believe that Israel would not attack Iran if they received concrete intelligence that Iran has reached the point of no return... I'm shocked they haven't already. My guess they don't have proof otherwise there would be a couple of great big holes in Iran already.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 00:48:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "They have the right to process uranium for peaceful purposes. We can't force them to stop that.", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "", 
        "reply": "They have the right to process uranium for peaceful purposes. We can't force them to stop that.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 14:04:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal?", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "", 
        "reply": "Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal?", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 14:10:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "navy8086"
    }, 
    {
        "content": "I don't think Israel will do it again. The political environment is much different than it was in the '80s, and they still haven't recovered internationally from their recent incursion into Gaza. Such a move would put the US under tremendous pressure internationally, particularly if we are now seen as making friendly gestures toward the Persians. It would be very difficult for the US to support them if the UN Security Council called for condemnation. We couldn't even get away with abstaining if Israel committed essentially an act of war against a sovereign entity. I call it an \"act of war\" because there's no proof that Iran's nuclear program is producing weapons, so their program cannot (from what we know) be called a hostile act.", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "", 
        "reply": "I don't think Israel will do it again. The political environment is much different than it was in the '80s, and they still haven't recovered internationally from their recent incursion into Gaza. Such a move would put the US under tremendous pressure internationally, particularly if we are now seen as making friendly gestures toward the Persians. It would be very difficult for the US to support them if the UN Security Council called for condemnation. We couldn't even get away with abstaining if Israel committed essentially an act of war against a sovereign entity. I call it an \"act of war\" because there's no proof that Iran's nuclear program is producing weapons, so their program cannot (from what we know) be called a hostile act.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 14:17:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "mcgreer"
    }, 
    {
        "content": "The Sword of Allah? Explain how that works in this context.", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "", 
        "reply": "The Sword of Allah? Explain how that works in this context.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 14:48:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal? No to many liberal jewish doctors and lawyers in NYC....Is that a problem for you?...ISRAEL", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal?", 
        "reply": " No to many liberal jewish doctors and lawyers in NYC....Is that a problem for you?...ISRAEL", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 14:51:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: President Obama's first big mistake quote: \"I promise..... I saw a bumper sticker today that said. \"Before we Elected President Obama I had a dollar, now I have change.\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090415, 
        "postID": 8, 
        "quote": "President Obama's first big mistake", 
        "reply": " quote: \"I promise..... I saw a bumper sticker today that said. \"Before we Elected President Obama I had a dollar, now I have change.\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 15:10:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: President Obama's first big mistake quote: \"I promise..... I saw a bumper sticker today that said. \"Before we Elected President Obama I had a dollar, now I have change.\" LOL...I voted for BO but thats some funny stuff Israel will act, and America will still stand by her.....What are we going to do? Side with the Iranians? get real", 
        "intTime": 20090415, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: quote: President Obama's first big mistake quote: \"I promise..... I saw a bumper sticker today that said. \"Before we Elected President Obama I had a dollar, now I have change.\"", 
        "reply": " LOL...I voted for BO but thats some funny stuff Israel will act, and America will still stand by her.....What are we going to do? Side with the Iranians? get real", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-15 15:30:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "President Obama's first big mistake.... ...was going allong with President Bush and his bailouts. But Obama took them to another level. And then there was the bloated stimulas bill. Follow up that with a 3.6 trillion dollar budget. Cabinet appointees who seem to believe that they need not pay taxes. Then there is the left wing radical, Rosa Brooks Obama assigned to the Pentagon. Can you say security risk? How many \"big mistakes\" are we up to so far? And then North Korea launches a long range missile and the president cant't get a UN resolution condemning this. First big mistake? Don't think so.", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "", 
        "reply": "President Obama's first big mistake.... ...was going allong with President Bush and his bailouts. But Obama took them to another level. And then there was the bloated stimulas bill. Follow up that with a 3.6 trillion dollar budget. Cabinet appointees who seem to believe that they need not pay taxes. Then there is the left wing radical, Rosa Brooks Obama assigned to the Pentagon. Can you say security risk? How many \"big mistakes\" are we up to so far? And then North Korea launches a long range missile and the president cant't get a UN resolution condemning this. First big mistake? Don't think so.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-16 00:41:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal? He won't declare war on Israel - but it will likely be the first time that the US has not abstained from voting when the UN Security Council holds the vote to condemn Isreal's actions - and will likely vote along with everybody else on the council for condemnation and sanctions. He might well also freeze weapons shipments to Israel. The odds of Israel striking Iran are slim at this point though - they would have to go through Iraqi airspace to do it - and the USAF OWNS that airspace.", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal?", 
        "reply": " He won't declare war on Israel - but it will likely be the first time that the US has not abstained from voting when the UN Security Council holds the vote to condemn Isreal's actions - and will likely vote along with everybody else on the council for condemnation and sanctions. He might well also freeze weapons shipments to Israel. The odds of Israel striking Iran are slim at this point though - they would have to go through Iraqi airspace to do it - and the USAF OWNS that airspace.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-16 00:52:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "We can keep the Israelis in check. They would have great difficulty crippling Iran without our consent and assistance. What they want to do and what will actually happen is not entirely in their hands. Israel is an ally but their national interest cannot have priority over ours.", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "", 
        "reply": "We can keep the Israelis in check. They would have great difficulty crippling Iran without our consent and assistance. What they want to do and what will actually happen is not entirely in their hands. Israel is an ally but their national interest cannot have priority over ours.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-16 02:51:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: They have the right to process uranium for peaceful purposes. We can't force them to stop that. A country awash in oil and they need peaceful nuke power, lmmfbo!", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "Originally posted by mcgreer: They have the right to process uranium for peaceful purposes. We can't force them to stop that.", 
        "reply": " A country awash in oil and they need peaceful nuke power, lmmfbo!", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-16 19:26:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: We can keep the Israelis in check. They would have great difficulty crippling Iran without our consent and assistance. What they want to do and what will actually happen is not entirely in their hands. Israel is an ally but their national interest cannot have priority over ours. Their survival has priority over our warm fuzzy diplomacy. If Chavez or Castro was building a nuke program and was constantly saying he will destroy the US and we wanted to hit his plants would we listen to other countries saying'don't do it!' I think not. We know what happened with Cuba before and it just about came to that.", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "Originally posted by Thud357L: We can keep the Israelis in check. They would have great difficulty crippling Iran without our consent and assistance. What they want to do and what will actually happen is not entirely in their hands. Israel is an ally but their national interest cannot have priority over ours.", 
        "reply": " Their survival has priority over our warm fuzzy diplomacy. If Chavez or Castro was building a nuke program and was constantly saying he will destroy the US and we wanted to hit his plants would we listen to other countries saying'don't do it!' I think not. We know what happened with Cuba before and it just about came to that.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-16 19:31:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal? He won't declare war on Israel - but it will likely be the first time that the US has not abstained from voting when the UN Security Council holds the vote to condemn Isreal's actions - and will likely vote along with everybody else on the council for condemnation and sanctions. He might well also freeze weapons shipments to Israel. The odds of Israel striking Iran are slim at this point though - they would have to go through Iraqi airspace to do it - and the USAF OWNS that airspace. But could not stop 40 Israeli jets from flying through it if they really wanted to. Israel when feeling threatened has cast our wishes aside before. Iran has purchased an incredibly effective air defense missile system from Russia. The Israelis calculate it will take 40 aircraft at least to overwhelm the system and accomplish the mission. If, as they would have to, they employ a mission package that big; what we have in Iraq would not be able to stop it.", 
        "intTime": 20090416, 
        "postID": 15, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal? He won't declare war on Israel - but it will likely be the first time that the US has not abstained from voting when the UN Security Council holds the vote to condemn Isreal's actions - and will likely vote along with everybody else on the council for condemnation and sanctions. He might well also freeze weapons shipments to Israel. The odds of Israel striking Iran are slim at this point though - they would have to go through Iraqi airspace to do it - and the USAF OWNS that airspace.", 
        "reply": " But could not stop 40 Israeli jets from flying through it if they really wanted to. Israel when feeling threatened has cast our wishes aside before. Iran has purchased an incredibly effective air defense missile system from Russia. The Israelis calculate it will take 40 aircraft at least to overwhelm the system and accomplish the mission. If, as they would have to, they employ a mission package that big; what we have in Iraq would not be able to stop it.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-16 19:40:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by PhoenixDark: quote: Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal? He won't declare war on Israel - but it will likely be the first time that the US has not abstained from voting when the UN Security Council holds the vote to condemn Isreal's actions - and will likely vote along with everybody else on the council for condemnation and sanctions. He might well also freeze weapons shipments to Israel. The odds of Israel striking Iran are slim at this point though - they would have to go through Iraqi airspace to do it - and the USAF OWNS that airspace. But could not stop 40 Israeli jets from flying through it if they really wanted to. Israel when feeling threatened has cast our wishes aside before. Iran has purchased an incredibly effective air defense missile system from Russia. The Israelis calculate it will take 40 aircraft at least to overwhelm the system and accomplish the mission. If, as they would have to, they employ a mission package that big; what we have in Iraq would not be able to stop it. And why would we? Oh, forgot the Israel haters here would want us to shoot down the IDF to protect Iranians nuke facilities.", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "Originally posted by M1Lase_n_Blaze: quote: Originally posted by PhoenixDark: quote: Originally posted by navy8086: Wonder if Isreal will blow the reactor to hell like they did in the '80's? If so, is 0bama gonna declare war on Isreal? He won't declare war on Israel - but it will likely be the first time that the US has not abstained from voting when the UN Security Council holds the vote to condemn Isreal's actions - and will likely vote along with everybody else on the council for condemnation and sanctions. He might well also freeze weapons shipments to Israel. The odds of Israel striking Iran are slim at this point though - they would have to go through Iraqi airspace to do it - and the USAF OWNS that airspace. But could not stop 40 Israeli jets from flying through it if they really wanted to. Israel when feeling threatened has cast our wishes aside before. Iran has purchased an incredibly effective air defense missile system from Russia. The Israelis calculate it will take 40 aircraft at least to overwhelm the system and accomplish the mission. If, as they would have to, they employ a mission package that big; what we have in Iraq would not be able to stop it.", 
        "reply": " And why would we? Oh, forgot the Israel haters here would want us to shoot down the IDF to protect Iranians nuke facilities.", 
        "threadID": "409192893_6160067022001", 
        "time": "2009-04-16 19:44:00", 
        "title": "President Obama's first big mistake....", 
        "userID": "GunnyRet03"
    }
]