[
    {
        "content": "Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points.", 
        "intTime": 20090410, 
        "postID": 1, 
        "quote": "", 
        "reply": "Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points.", 
        "threadID": "409192893_7120093022001", 
        "time": "2009-04-10 14:46:00", 
        "title": "Quote of the day:", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points. If only it were true! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090410, 
        "postID": 2, 
        "quote": "Originally posted by threerings: Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points.", 
        "reply": " If only it were true! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_7120093022001", 
        "time": "2009-04-10 15:35:00", 
        "title": "Quote of the day:", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by threerings: Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points. Obama IS a box of corn flakes ...", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "Originally posted by threerings: Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points.", 
        "reply": " Obama IS a box of corn flakes ...", 
        "threadID": "409192893_7120093022001", 
        "time": "2009-04-10 15:45:00", 
        "title": "Quote of the day:", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by threerings: Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points.", 
        "intTime": 20090410, 
        "postID": 4, 
        "quote": "Originally posted by threerings: Local radio right wing nut job Jay Severian on WTKK radio: A box of corn flakes could run against Obama next week and Obama would lose by ten points.", 
        "reply": "", 
        "threadID": "409192893_7120093022001", 
        "time": "2009-04-10 16:47:00", 
        "title": "Quote of the day:", 
        "userID": "NSYU"
    }, 
    {
        "content": "Well, the fact that he would vote for a box of corn flakes confirms his \"nut job\" status.", 
        "intTime": 20090410, 
        "postID": 5, 
        "quote": "", 
        "reply": "Well, the fact that he would vote for a box of corn flakes confirms his \"nut job\" status.", 
        "threadID": "409192893_7120093022001", 
        "time": "2009-04-10 17:03:00", 
        "title": "Quote of the day:", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well, the fact that he would vote for a box of corn flakes confirms his \"nut job\" status. But surly you must know that Obama is a godless communist who do not believe in any god except selfish power for himself. And that he is an longtime friend and follower of the fanatical Rev. Wright of Trinity United Church of Christ. And that he is a fundamentalist moslem who will do anything to inflict his lord Allahs will on everyone. And that ... well sorry I dont keep up with all the accusations made, but I am sure there are many more, equally consistent and well documented. regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090411, 
        "postID": 6, 
        "quote": "Originally posted by mcgreer: Well, the fact that he would vote for a box of corn flakes confirms his \"nut job\" status.", 
        "reply": " But surly you must know that Obama is a godless communist who do not believe in any god except selfish power for himself. And that he is an longtime friend and follower of the fanatical Rev. Wright of Trinity United Church of Christ. And that he is a fundamentalist moslem who will do anything to inflict his lord Allahs will on everyone. And that ... well sorry I dont keep up with all the accusations made, but I am sure there are many more, equally consistent and well documented. regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_7120093022001", 
        "time": "2009-04-11 13:08:00", 
        "title": "Quote of the day:", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "I don't think Mr. Obama is any of the things you accused him of........ I just think he is an inexperienced empty suit!!", 
        "intTime": 20090411, 
        "postID": 7, 
        "quote": "", 
        "reply": "I don't think Mr. Obama is any of the things you accused him of........ I just think he is an inexperienced empty suit!!", 
        "threadID": "409192893_7120093022001", 
        "time": "2009-04-11 18:21:00", 
        "title": "Quote of the day:", 
        "userID": "tawodi"
    }
]