[
    {
        "content": "Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "intTime": 20090502, 
        "postID": 1, 
        "quote": "", 
        "reply": "Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 18:58:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MightyB"
    }, 
    {
        "content": "We couldn't do that if we wanted to without either withdrawing from international conventions and treaties, or changing the Constitution. Treaties and agreements ratified by the Senate have the force of law in this country and to ignore them is illegal. Plus, I just don't think public support for what you propose exists.", 
        "intTime": 20090502, 
        "postID": 2, 
        "quote": "", 
        "reply": "We couldn't do that if we wanted to without either withdrawing from international conventions and treaties, or changing the Constitution. Treaties and agreements ratified by the Senate have the force of law in this country and to ignore them is illegal. Plus, I just don't think public support for what you propose exists.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 19:52:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "stillkit"
    }, 
    {
        "content": "Wassup Stillkit. I hear you but don't you personally think it is BS? That is what I'm talking about the hypocracy of it all. How in the hell is there a law governing war where one side is trying to end the other? And as I said, if you have to interpret what torture is, then you are torturing. That's plain and simple to me. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "intTime": 20090502, 
        "postID": 3, 
        "quote": "", 
        "reply": "Wassup Stillkit. I hear you but don't you personally think it is BS? That is what I'm talking about the hypocracy of it all. How in the hell is there a law governing war where one side is trying to end the other? And as I said, if you have to interpret what torture is, then you are torturing. That's plain and simple to me. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 20:10:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MightyB"
    }, 
    {
        "content": "It is what happens when we use a 20th century document (ie Geneva Conventions) to fight a 21st century war. The enemy has found a way to skirt the convention accords (not wear a uniform, not align with any state, hideout in protected areas like Mosques, hospitals etc). Now it is about time we do the same, either rewrite or revisit the accords to make them reflect today's warfare or scrape them all together. Hell when the accords were written the FLAMETHROWER was considered a weapon of choice, try using THAT one today. Medics were not to be fired upon (yeah Meddevacs were being shot out of the sky right and left in Iraq). So the Accords are outdated as hell and a waste of time in today's wars (I won't even get into the care medical treatment of \"enemy\" forces which has grown FAR BEYOND what it was meant to be).", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "", 
        "reply": "It is what happens when we use a 20th century document (ie Geneva Conventions) to fight a 21st century war. The enemy has found a way to skirt the convention accords (not wear a uniform, not align with any state, hideout in protected areas like Mosques, hospitals etc). Now it is about time we do the same, either rewrite or revisit the accords to make them reflect today's warfare or scrape them all together. Hell when the accords were written the FLAMETHROWER was considered a weapon of choice, try using THAT one today. Medics were not to be fired upon (yeah Meddevacs were being shot out of the sky right and left in Iraq). So the Accords are outdated as hell and a waste of time in today's wars (I won't even get into the care medical treatment of \"enemy\" forces which has grown FAR BEYOND what it was meant to be).", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:02:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "ronald45"
    }, 
    {
        "content": "It seems that the heated debate is defining torture. Is waterboarding torture? Is sleep deprivation torture? Is playing loud music all day and night torture? Is having a sexy female with slinky clothing interogating terrorist torture? Personally, I don't think it is and have debated many in here who seem to think it is. But, given the what if scenario, \"if your family member's life is in danger and you can extract info to save them from someone who knows, I truly believe we (whether we agree/disagree) would do anything to get that info\". But, more than anything, I cannot stand the moral equivalency to what we do to terrorists and what they do to us. They chop heads while we waterboard; they blow up innocent people and themselves while we go out of our way to not bomb their mosques. We follow rules of engagement while they don't. Just my 2 pennies... JMHO, I could be wrong...", 
        "intTime": 20090502, 
        "postID": 5, 
        "quote": "", 
        "reply": "It seems that the heated debate is defining torture. Is waterboarding torture? Is sleep deprivation torture? Is playing loud music all day and night torture? Is having a sexy female with slinky clothing interogating terrorist torture? Personally, I don't think it is and have debated many in here who seem to think it is. But, given the what if scenario, \"if your family member's life is in danger and you can extract info to save them from someone who knows, I truly believe we (whether we agree/disagree) would do anything to get that info\". But, more than anything, I cannot stand the moral equivalency to what we do to terrorists and what they do to us. They chop heads while we waterboard; they blow up innocent people and themselves while we go out of our way to not bomb their mosques. We follow rules of engagement while they don't. Just my 2 pennies... JMHO, I could be wrong...", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:06:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "All of your opinions make logical sense to me but they require the assumption that everyone that we torture has information that will be beneficial. Rules are made for the exceptions; the part of the society that is incapable of not only logically thought processing, but respecting the lives of others. That said it is frightening to think that a soldier returning from Iraq possibly left to live the rest of their lives with the effects of soft tissue damage from the detonation of roadside bombs - can then be imprisoned for up to 6 months without explanation and without access to legal counsel or the outside world; and all completely \"legal\" within the framework of the Homeland Security Act which allowed for the suspension of our civil rights granted by the constitution. And now combine that with the Banking and Insurance industries now being owned/controlled by our government with unconstitutional spending... It all begs the question of US question what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic?", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "", 
        "reply": "All of your opinions make logical sense to me but they require the assumption that everyone that we torture has information that will be beneficial. Rules are made for the exceptions; the part of the society that is incapable of not only logically thought processing, but respecting the lives of others. That said it is frightening to think that a soldier returning from Iraq possibly left to live the rest of their lives with the effects of soft tissue damage from the detonation of roadside bombs - can then be imprisoned for up to 6 months without explanation and without access to legal counsel or the outside world; and all completely \"legal\" within the framework of the Homeland Security Act which allowed for the suspension of our civil rights granted by the constitution. And now combine that with the Banking and Insurance industries now being owned/controlled by our government with unconstitutional spending... It all begs the question of US question what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:48:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic? Nowadays, katie couric decides, and after the polls are in, we concur. That's the beauty of a runaway gov't that taxes every facet of our lives...it leaves us in a situation where reality is not as important as just getting by.", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic?", 
        "reply": " Nowadays, katie couric decides, and after the polls are in, we concur. That's the beauty of a runaway gov't that taxes every facet of our lives...it leaves us in a situation where reality is not as important as just getting by.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:57:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Torture: Strapping somebody down and pulling out his fingernails with pliers, or shattering his kneecaps with a hammer. Causing extreme pain or serious permanent damage. NOT Torture: Yelling at someone, playing loud music, depriving them of sleep, making them stand naked or scaring them with a barking dog. Mistreatment? Yes. But torture? No.", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "", 
        "reply": "Torture: Strapping somebody down and pulling out his fingernails with pliers, or shattering his kneecaps with a hammer. Causing extreme pain or serious permanent damage. NOT Torture: Yelling at someone, playing loud music, depriving them of sleep, making them stand naked or scaring them with a barking dog. Mistreatment? Yes. But torture? No.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 02:27:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "mj101inf"
    }, 
    {
        "content": "If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\"", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "", 
        "reply": "If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\"", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 04:00:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "intTime": 20090503, 
        "postID": 10, 
        "quote": "", 
        "reply": "A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 06:02:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. As a warrior in a fight with an enemy that is trying to kill you, anything goes. Once that enemy becomes a prisoner, it’s different. Not only are there laws established by civilized societies to protect prisoners, it is dishonorable for a warrior to torture a prisoner. Even just slapping or kicking someone whose hands are tied is a chicken **** thing to do. As for that personal level that you talked about – below is what I posted on another thread. Answer the question, if you can. There have been times when I have extracted a pound of flesh from someone who has done me wrong. I saw a guy reach up my girl friend’s skirt one time. After knocking him on his ass, did I torture him? Damn sure did. I kicked and stomped on him until much damage was done. Was that the right or wrong thing to do? Certainly if there had not been a sympathetic crowd at the bar that night I could have gone to jail. It was illegal, but was it wrong? If a terrorist were holding my wife hostage, demanding money and the release of other terrorist would I, given the chance, torture his accomplice to try and get her released? Sure, because that is the natural reaction of a pizzed off, scared husband. If terrorists were holding my wife and others hostage, demanding money and the release of terrorist, should the government give into those demands? No, because the United States cannot negotiate with terrorists, no matter how much I would plead for my wife’s life. Same hostage situation, two different reactions – one is a personal choice/reaction the other is a matter of policy/law. In all cases, the law must prevail. We are a nation of laws – common laws that have been established by civilized societies over the course of centuries. America was established on the principles of those laws. Americans have fought and died to uphold those principles and laws. One of those laws is that prisoners cannot be tortured. You present the question: “Ask yourself not whether it is right or wrong, but is it necessary for the greater good.” Here is my answer/question: Without laws, who are you willing to allow to decide what is right and wrong for the greater good? Dick Cheney? President Obama?", 
        "intTime": 20090503, 
        "postID": 11, 
        "quote": "Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it.", 
        "reply": " As a warrior in a fight with an enemy that is trying to kill you, anything goes. Once that enemy becomes a prisoner, it’s different. Not only are there laws established by civilized societies to protect prisoners, it is dishonorable for a warrior to torture a prisoner. Even just slapping or kicking someone whose hands are tied is a chicken **** thing to do. As for that personal level that you talked about – below is what I posted on another thread. Answer the question, if you can. There have been times when I have extracted a pound of flesh from someone who has done me wrong. I saw a guy reach up my girl friend’s skirt one time. After knocking him on his ass, did I torture him? Damn sure did. I kicked and stomped on him until much damage was done. Was that the right or wrong thing to do? Certainly if there had not been a sympathetic crowd at the bar that night I could have gone to jail. It was illegal, but was it wrong? If a terrorist were holding my wife hostage, demanding money and the release of other terrorist would I, given the chance, torture his accomplice to try and get her released? Sure, because that is the natural reaction of a pizzed off, scared husband. If terrorists were holding my wife and others hostage, demanding money and the release of terrorist, should the government give into those demands? No, because the United States cannot negotiate with terrorists, no matter how much I would plead for my wife’s life. Same hostage situation, two different reactions – one is a personal choice/reaction the other is a matter of policy/law. In all cases, the law must prevail. We are a nation of laws – common laws that have been established by civilized societies over the course of centuries. America was established on the principles of those laws. Americans have fought and died to uphold those principles and laws. One of those laws is that prisoners cannot be tortured. You present the question: “Ask yourself not whether it is right or wrong, but is it necessary for the greater good.” Here is my answer/question: Without laws, who are you willing to allow to decide what is right and wrong for the greater good? Dick Cheney? President Obama?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 07:38:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "intTime": 20090503, 
        "postID": 12, 
        "quote": "Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it.", 
        "reply": " Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 10:38:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. JMHO, I could be wrong...", 
        "intTime": 20090503, 
        "postID": 13, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "reply": " JMHO, I could be wrong...", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 14:39:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight.", 
        "intTime": 20090503, 
        "postID": 14, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "reply": " Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 14:46:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight. I'm not an interrogator, are you? How many interrogations have you administered? I think if you have enough time and freedom to use any method you choose you will get what you get. You won't know what you have until you have time to verify it. Most of the good intel is obtained by other means than torture. The qualified and experienced oversight that you mentioned seems to agree.", 
        "intTime": 20090509, 
        "postID": 15, 
        "quote": "Originally posted by threerings: quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight.", 
        "reply": " I'm not an interrogator, are you? How many interrogations have you administered? I think if you have enough time and freedom to use any method you choose you will get what you get. You won't know what you have until you have time to verify it. Most of the good intel is obtained by other means than torture. The qualified and experienced oversight that you mentioned seems to agree.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-09 14:25:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Manure by any other name still stinks. If it causes pain it is torture. Call it what it is. THEN get on with the debate over whether it should be used or not. My opinion is that it shouldn't merely because it has been shown that torture isn't as effective a method of gathering information as other means that are used.", 
        "intTime": 20090514, 
        "postID": 16, 
        "quote": "", 
        "reply": "Manure by any other name still stinks. If it causes pain it is torture. Call it what it is. THEN get on with the debate over whether it should be used or not. My opinion is that it shouldn't merely because it has been shown that torture isn't as effective a method of gathering information as other means that are used.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-14 12:51:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "sthrnfriedrocker"
    }, 
    {
        "content": "What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 17, 
        "quote": "", 
        "reply": "What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-14 13:00:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\"", 
        "intTime": 20090514, 
        "postID": 18, 
        "quote": "Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture.", 
        "reply": " Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\"", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-14 14:00:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "11BnOIF"
    }, 
    {
        "content": "quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. And what happens if the person you believed had the information was the wrong person? Are you going to give the person his parts back? What if the person is a woman? What if she is a beautiful woman? Let's go farther than that? What if the person is a relative? What if the person is an ex wife or husband? What if the person is a mentally challeged?", 
        "intTime": 20090515, 
        "postID": 19, 
        "quote": "Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it.", 
        "reply": " And what happens if the person you believed had the information was the wrong person? Are you going to give the person his parts back? What if the person is a woman? What if she is a beautiful woman? Let's go farther than that? What if the person is a relative? What if the person is an ex wife or husband? What if the person is a mentally challeged?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 06:25:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\" All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 20, 
        "quote": "Originally posted by Fightdirector: If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\"", 
        "reply": " All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 07:30:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by 11BnOIF: quote: Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\" It does not specify Waterboarding, that's my point. Geneva convention does not cover \"insurgents\" just uniformed personell. Like I said, if we are to move forward, either there needs to be more added to the Geneva Convention or we need a new article of prisoner protection. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 21, 
        "quote": "Originally posted by 11BnOIF: quote: Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\"", 
        "reply": " It does not specify Waterboarding, that's my point. Geneva convention does not cover \"insurgents\" just uniformed personell. Like I said, if we are to move forward, either there needs to be more added to the Geneva Convention or we need a new article of prisoner protection. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 08:22:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "L0A1"
    }, 
    {
        "content": "When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's!", 
        "intTime": 20090515, 
        "postID": 22, 
        "quote": "", 
        "reply": "When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's!", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 08:38:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's! These folks are in civilian dress, not black matching PJ's as the vietcong were. Yea, we should just shot them for being spies then? Or do you agree that we need a revised doctrine to govern todays battlefield so that torture can be more defined. Article 17 in the GC doesn't cover terrorist. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 23, 
        "quote": "Originally posted by dragonflyer04: When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's!", 
        "reply": " These folks are in civilian dress, not black matching PJ's as the vietcong were. Yea, we should just shot them for being spies then? Or do you agree that we need a revised doctrine to govern todays battlefield so that torture can be more defined. Article 17 in the GC doesn't cover terrorist. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 09:05:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? First, do you think it matters what we think or do regarding Iran..? I don't! It is possible we could swing weight but they will do whatever they want to do - regardless... But the real question is \"why\"? Why would they need to torture her..? If we captured an Iranian, would just torture them? To my knowledge we never have yet, so why would we start... If this young lady belonged to a KNOWN terrorist group - a \"real\" - valid terrorist group, hey, if they concern that the terrorist group she supports is planning something that may injure their citizens - go for it. However, between 1998-2003 Iran SLAUGHTERED and TORTURED - 60-thousand of its OWN people to maintain control. No one seemed to mind - not much is ever said about it... To my knowledge the only ones we used enhanced techniques on were those considered to have vitil information. I think it is a mistake to give terrorists the privilege of the GC status because it ligitimizes their cause. It feeds another Palestinian issue.", 
        "intTime": 20090515, 
        "postID": 24, 
        "quote": "Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "reply": " First, do you think it matters what we think or do regarding Iran..? I don't! It is possible we could swing weight but they will do whatever they want to do - regardless... But the real question is \"why\"? Why would they need to torture her..? If we captured an Iranian, would just torture them? To my knowledge we never have yet, so why would we start... If this young lady belonged to a KNOWN terrorist group - a \"real\" - valid terrorist group, hey, if they concern that the terrorist group she supports is planning something that may injure their citizens - go for it. However, between 1998-2003 Iran SLAUGHTERED and TORTURED - 60-thousand of its OWN people to maintain control. No one seemed to mind - not much is ever said about it... To my knowledge the only ones we used enhanced techniques on were those considered to have vitil information. I think it is a mistake to give terrorists the privilege of the GC status because it ligitimizes their cause. It feeds another Palestinian issue.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 10:31:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture. I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways.", 
        "intTime": 20090515, 
        "postID": 25, 
        "quote": "Originally posted by FollowMeInfantry: All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture.", 
        "reply": " I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 10:46:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk...", 
        "intTime": 20090515, 
        "postID": 26, 
        "quote": "Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "reply": " If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk...", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:09:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways. Preface: I served with Tim McVeigh, though we were in different companies. He was either B or C Co, 2/16, and I was D Co. But we were both stationed at Riley at the same time, and his barracks were right next to us. I no doubt saw the man standing in formation on more than one occasion. Freaky. I can't completely disagree, though I do believe you're trying to find a very narrow definition I simply don't share. One (McVeigh) is a criminal, protected under the Constitutional rights endowed unto all citizens of the USA. He is a protected class due to his nationality. The other (Joe Terrorist) is NOT a domestic threat, but a foreign one. Therefore, he cannot claim citizenship and, as such, is subject only to the laws of HIS nation or the Geneva Convention (which I still think is bunk - if his nation didn't sign the GC, they should get NO rights at all, ever). There was never anything even remotely suggesting that McVeigh was a head of a large group of millions hellbent on destroying America. We \"torture\" terrorists because they are already PROVEN to have information on an organization hellbent on destroying America. You're right: can't have your cake and eat it, too. Now tell that to the whiny terrorists that want protections from the nations they refused to join and be a productive part of, choosing instead to murder innocents in the name of God. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 27, 
        "quote": "Originally posted by Fightdirector: I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways.", 
        "reply": " Preface: I served with Tim McVeigh, though we were in different companies. He was either B or C Co, 2/16, and I was D Co. But we were both stationed at Riley at the same time, and his barracks were right next to us. I no doubt saw the man standing in formation on more than one occasion. Freaky. I can't completely disagree, though I do believe you're trying to find a very narrow definition I simply don't share. One (McVeigh) is a criminal, protected under the Constitutional rights endowed unto all citizens of the USA. He is a protected class due to his nationality. The other (Joe Terrorist) is NOT a domestic threat, but a foreign one. Therefore, he cannot claim citizenship and, as such, is subject only to the laws of HIS nation or the Geneva Convention (which I still think is bunk - if his nation didn't sign the GC, they should get NO rights at all, ever). There was never anything even remotely suggesting that McVeigh was a head of a large group of millions hellbent on destroying America. We \"torture\" terrorists because they are already PROVEN to have information on an organization hellbent on destroying America. You're right: can't have your cake and eat it, too. Now tell that to the whiny terrorists that want protections from the nations they refused to join and be a productive part of, choosing instead to murder innocents in the name of God. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:19:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk... Now THAT'S a real example of \"apples and oranges\"!!!!! She has been released and is now in Austria - but what possible connection could there be between her being tortured or not tortured by the Iranian government and \"You libs are destroying this nation and putting her at risk\". Is she at risk of torture by the Iranians because we torture Iraqis - or is she not at risk of torture by the Iranians because we torture Iraqis? I can't connect those dots you were apparently able to connect. Can you be more clear?", 
        "intTime": 20090515, 
        "postID": 28, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk...", 
        "reply": " Now THAT'S a real example of \"apples and oranges\"!!!!! She has been released and is now in Austria - but what possible connection could there be between her being tortured or not tortured by the Iranian government and \"You libs are destroying this nation and putting her at risk\". Is she at risk of torture by the Iranians because we torture Iraqis - or is she not at risk of torture by the Iranians because we torture Iraqis? I can't connect those dots you were apparently able to connect. Can you be more clear?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:22:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "It doesn't matter what we do or say it todays world.....Iran and other rogue nations will do what we LET them do unless we put our foot down on their throats.", 
        "intTime": 20090515, 
        "postID": 29, 
        "quote": "", 
        "reply": "It doesn't matter what we do or say it todays world.....Iran and other rogue nations will do what we LET them do unless we put our foot down on their throats.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:31:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "intTime": 20090502, 
        "postID": 30, 
        "quote": "", 
        "reply": "Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 18:58:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MightyB"
    }, 
    {
        "content": "We couldn't do that if we wanted to without either withdrawing from international conventions and treaties, or changing the Constitution. Treaties and agreements ratified by the Senate have the force of law in this country and to ignore them is illegal. Plus, I just don't think public support for what you propose exists.", 
        "intTime": 20090502, 
        "postID": 31, 
        "quote": "", 
        "reply": "We couldn't do that if we wanted to without either withdrawing from international conventions and treaties, or changing the Constitution. Treaties and agreements ratified by the Senate have the force of law in this country and to ignore them is illegal. Plus, I just don't think public support for what you propose exists.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 19:52:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "stillkit"
    }, 
    {
        "content": "Wassup Stillkit. I hear you but don't you personally think it is BS? That is what I'm talking about the hypocracy of it all. How in the hell is there a law governing war where one side is trying to end the other? And as I said, if you have to interpret what torture is, then you are torturing. That's plain and simple to me. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "intTime": 20090502, 
        "postID": 32, 
        "quote": "", 
        "reply": "Wassup Stillkit. I hear you but don't you personally think it is BS? That is what I'm talking about the hypocracy of it all. How in the hell is there a law governing war where one side is trying to end the other? And as I said, if you have to interpret what torture is, then you are torturing. That's plain and simple to me. WHAT WE HAVE DONE FOR OURSELVES ALONE DIES WITH US;WHAT WE HAVE DONE FOR OTHERS AND THE WORLD IS AND REMAINS IMMORTAL", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 20:10:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MightyB"
    }, 
    {
        "content": "It is what happens when we use a 20th century document (ie Geneva Conventions) to fight a 21st century war. The enemy has found a way to skirt the convention accords (not wear a uniform, not align with any state, hideout in protected areas like Mosques, hospitals etc). Now it is about time we do the same, either rewrite or revisit the accords to make them reflect today's warfare or scrape them all together. Hell when the accords were written the FLAMETHROWER was considered a weapon of choice, try using THAT one today. Medics were not to be fired upon (yeah Meddevacs were being shot out of the sky right and left in Iraq). So the Accords are outdated as hell and a waste of time in today's wars (I won't even get into the care medical treatment of \"enemy\" forces which has grown FAR BEYOND what it was meant to be).", 
        "intTime": 20090502, 
        "postID": 33, 
        "quote": "", 
        "reply": "It is what happens when we use a 20th century document (ie Geneva Conventions) to fight a 21st century war. The enemy has found a way to skirt the convention accords (not wear a uniform, not align with any state, hideout in protected areas like Mosques, hospitals etc). Now it is about time we do the same, either rewrite or revisit the accords to make them reflect today's warfare or scrape them all together. Hell when the accords were written the FLAMETHROWER was considered a weapon of choice, try using THAT one today. Medics were not to be fired upon (yeah Meddevacs were being shot out of the sky right and left in Iraq). So the Accords are outdated as hell and a waste of time in today's wars (I won't even get into the care medical treatment of \"enemy\" forces which has grown FAR BEYOND what it was meant to be).", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:02:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "ronald45"
    }, 
    {
        "content": "It seems that the heated debate is defining torture. Is waterboarding torture? Is sleep deprivation torture? Is playing loud music all day and night torture? Is having a sexy female with slinky clothing interogating terrorist torture? Personally, I don't think it is and have debated many in here who seem to think it is. But, given the what if scenario, \"if your family member's life is in danger and you can extract info to save them from someone who knows, I truly believe we (whether we agree/disagree) would do anything to get that info\". But, more than anything, I cannot stand the moral equivalency to what we do to terrorists and what they do to us. They chop heads while we waterboard; they blow up innocent people and themselves while we go out of our way to not bomb their mosques. We follow rules of engagement while they don't. Just my 2 pennies... JMHO, I could be wrong...", 
        "intTime": 20090502, 
        "postID": 34, 
        "quote": "", 
        "reply": "It seems that the heated debate is defining torture. Is waterboarding torture? Is sleep deprivation torture? Is playing loud music all day and night torture? Is having a sexy female with slinky clothing interogating terrorist torture? Personally, I don't think it is and have debated many in here who seem to think it is. But, given the what if scenario, \"if your family member's life is in danger and you can extract info to save them from someone who knows, I truly believe we (whether we agree/disagree) would do anything to get that info\". But, more than anything, I cannot stand the moral equivalency to what we do to terrorists and what they do to us. They chop heads while we waterboard; they blow up innocent people and themselves while we go out of our way to not bomb their mosques. We follow rules of engagement while they don't. Just my 2 pennies... JMHO, I could be wrong...", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:06:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "All of your opinions make logical sense to me but they require the assumption that everyone that we torture has information that will be beneficial. Rules are made for the exceptions; the part of the society that is incapable of not only logically thought processing, but respecting the lives of others. That said it is frightening to think that a soldier returning from Iraq possibly left to live the rest of their lives with the effects of soft tissue damage from the detonation of roadside bombs - can then be imprisoned for up to 6 months without explanation and without access to legal counsel or the outside world; and all completely \"legal\" within the framework of the Homeland Security Act which allowed for the suspension of our civil rights granted by the constitution. And now combine that with the Banking and Insurance industries now being owned/controlled by our government with unconstitutional spending... It all begs the question of US question what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic?", 
        "intTime": 20090502, 
        "postID": 35, 
        "quote": "", 
        "reply": "All of your opinions make logical sense to me but they require the assumption that everyone that we torture has information that will be beneficial. Rules are made for the exceptions; the part of the society that is incapable of not only logically thought processing, but respecting the lives of others. That said it is frightening to think that a soldier returning from Iraq possibly left to live the rest of their lives with the effects of soft tissue damage from the detonation of roadside bombs - can then be imprisoned for up to 6 months without explanation and without access to legal counsel or the outside world; and all completely \"legal\" within the framework of the Homeland Security Act which allowed for the suspension of our civil rights granted by the constitution. And now combine that with the Banking and Insurance industries now being owned/controlled by our government with unconstitutional spending... It all begs the question of US question what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:48:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic? Nowadays, katie couric decides, and after the polls are in, we concur. That's the beauty of a runaway gov't that taxes every facet of our lives...it leaves us in a situation where reality is not as important as just getting by.", 
        "intTime": 20090502, 
        "postID": 36, 
        "quote": "what does it mean to solemnly swear to defend the Constitution of the United States against all enemies, foreign and domestic?", 
        "reply": " Nowadays, katie couric decides, and after the polls are in, we concur. That's the beauty of a runaway gov't that taxes every facet of our lives...it leaves us in a situation where reality is not as important as just getting by.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-02 22:57:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Torture: Strapping somebody down and pulling out his fingernails with pliers, or shattering his kneecaps with a hammer. Causing extreme pain or serious permanent damage. NOT Torture: Yelling at someone, playing loud music, depriving them of sleep, making them stand naked or scaring them with a barking dog. Mistreatment? Yes. But torture? No.", 
        "intTime": 20090503, 
        "postID": 37, 
        "quote": "", 
        "reply": "Torture: Strapping somebody down and pulling out his fingernails with pliers, or shattering his kneecaps with a hammer. Causing extreme pain or serious permanent damage. NOT Torture: Yelling at someone, playing loud music, depriving them of sleep, making them stand naked or scaring them with a barking dog. Mistreatment? Yes. But torture? No.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 02:27:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "mj101inf"
    }, 
    {
        "content": "If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\"", 
        "intTime": 20090503, 
        "postID": 38, 
        "quote": "", 
        "reply": "If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\"", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 04:00:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "intTime": 20090503, 
        "postID": 39, 
        "quote": "", 
        "reply": "A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 06:02:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. As a warrior in a fight with an enemy that is trying to kill you, anything goes. Once that enemy becomes a prisoner, it’s different. Not only are there laws established by civilized societies to protect prisoners, it is dishonorable for a warrior to torture a prisoner. Even just slapping or kicking someone whose hands are tied is a chicken **** thing to do. As for that personal level that you talked about – below is what I posted on another thread. Answer the question, if you can. There have been times when I have extracted a pound of flesh from someone who has done me wrong. I saw a guy reach up my girl friend’s skirt one time. After knocking him on his ass, did I torture him? Damn sure did. I kicked and stomped on him until much damage was done. Was that the right or wrong thing to do? Certainly if there had not been a sympathetic crowd at the bar that night I could have gone to jail. It was illegal, but was it wrong? If a terrorist were holding my wife hostage, demanding money and the release of other terrorist would I, given the chance, torture his accomplice to try and get her released? Sure, because that is the natural reaction of a pizzed off, scared husband. If terrorists were holding my wife and others hostage, demanding money and the release of terrorist, should the government give into those demands? No, because the United States cannot negotiate with terrorists, no matter how much I would plead for my wife’s life. Same hostage situation, two different reactions – one is a personal choice/reaction the other is a matter of policy/law. In all cases, the law must prevail. We are a nation of laws – common laws that have been established by civilized societies over the course of centuries. America was established on the principles of those laws. Americans have fought and died to uphold those principles and laws. One of those laws is that prisoners cannot be tortured. You present the question: “Ask yourself not whether it is right or wrong, but is it necessary for the greater good.” Here is my answer/question: Without laws, who are you willing to allow to decide what is right and wrong for the greater good? Dick Cheney? President Obama?", 
        "intTime": 20090503, 
        "postID": 40, 
        "quote": "Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it.", 
        "reply": " As a warrior in a fight with an enemy that is trying to kill you, anything goes. Once that enemy becomes a prisoner, it’s different. Not only are there laws established by civilized societies to protect prisoners, it is dishonorable for a warrior to torture a prisoner. Even just slapping or kicking someone whose hands are tied is a chicken **** thing to do. As for that personal level that you talked about – below is what I posted on another thread. Answer the question, if you can. There have been times when I have extracted a pound of flesh from someone who has done me wrong. I saw a guy reach up my girl friend’s skirt one time. After knocking him on his ass, did I torture him? Damn sure did. I kicked and stomped on him until much damage was done. Was that the right or wrong thing to do? Certainly if there had not been a sympathetic crowd at the bar that night I could have gone to jail. It was illegal, but was it wrong? If a terrorist were holding my wife hostage, demanding money and the release of other terrorist would I, given the chance, torture his accomplice to try and get her released? Sure, because that is the natural reaction of a pizzed off, scared husband. If terrorists were holding my wife and others hostage, demanding money and the release of terrorist, should the government give into those demands? No, because the United States cannot negotiate with terrorists, no matter how much I would plead for my wife’s life. Same hostage situation, two different reactions – one is a personal choice/reaction the other is a matter of policy/law. In all cases, the law must prevail. We are a nation of laws – common laws that have been established by civilized societies over the course of centuries. America was established on the principles of those laws. Americans have fought and died to uphold those principles and laws. One of those laws is that prisoners cannot be tortured. You present the question: “Ask yourself not whether it is right or wrong, but is it necessary for the greater good.” Here is my answer/question: Without laws, who are you willing to allow to decide what is right and wrong for the greater good? Dick Cheney? President Obama?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 07:38:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "intTime": 20090503, 
        "postID": 41, 
        "quote": "Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it.", 
        "reply": " Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 10:38:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. JMHO, I could be wrong...", 
        "intTime": 20090503, 
        "postID": 42, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "reply": " JMHO, I could be wrong...", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 14:39:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight.", 
        "intTime": 20090503, 
        "postID": 43, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them.", 
        "reply": " Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-03 14:46:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight. I'm not an interrogator, are you? How many interrogations have you administered? I think if you have enough time and freedom to use any method you choose you will get what you get. You won't know what you have until you have time to verify it. Most of the good intel is obtained by other means than torture. The qualified and experienced oversight that you mentioned seems to agree.", 
        "intTime": 20090509, 
        "postID": 44, 
        "quote": "Originally posted by threerings: quote: Originally posted by Thud357L: quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. Got a few things on my plate about this one. First is war an atrocity or is it a fine and noble endeavor that needs to be burnished and glorified? I say it's an atrocity and when you get down to it, it does seem kind of silly to have rules of atrocity. On the surface. Say we do away with the ROE. Everybody gets to do what they want. Bayonet babies, shoot women after we rape 'em, loot, pillage and torture to our hearts content. Since they do that to us anyway, why not? As long as our Nazis beat their Nazis, it's all good right? We all stood the watch but I want no part of that and I will not associate with anyone that does. And neither will you. So the ROE can be frustrating and stupid sometimes but it's basically saying what I just said and it is absolutely necessary. We can't let some sadistic losers on the other side dictate our morality. As for torture, two thoughts on that. If I have you and your laptop with all that good encrypted intel and I need that password, you are going to give it to me because it is immediately verifiable and after that first lie you will know what's coming next so you will tell me, probably sooner than later. Those type of situations usually materialize downrange and that quick decision will be made by Pvts, Sgts, and junior grade officers and their decision, even if correct might land them in the hotseat. I've already stated my willingness to do a kneecap or two if it would save my people's lives but that's to a guy who was trying to kill me a few minutes ago. If I'm not really sure what you know then torture is probably going to quickly reach the point of diminishing returns. Yes I will get answers, any answer you think I want just to get me to stop. You will also sign anything I put in front of you so it will be great for getting a false confession. you will admit that you are Jack the Ripper and Mother Theresa. Since most interrogation specialists seem to regard torture as ineffective, I'll take my cue from them. Spoken like someone who has never sat down across from a detained indvidual.. You did manage to say: Well, sometimes torture ( I'm ignoring the fact that what we do is in NO way torture) is okay...Line gets blurry, no? Fact is: If I sit down across from anyone, ANYONE, given enough time, I'm going to get what i want. The thing is, that time...is paid for in blood. To sum up my views: I am against torture. I am for a massive expansion of our humint abilitys, both in terms of manpower and training. I am also for an expansion of of current regulations to provide for more effective techinues, given need and qualified, experienced oversight.", 
        "reply": " I'm not an interrogator, are you? How many interrogations have you administered? I think if you have enough time and freedom to use any method you choose you will get what you get. You won't know what you have until you have time to verify it. Most of the good intel is obtained by other means than torture. The qualified and experienced oversight that you mentioned seems to agree.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-09 14:25:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Manure by any other name still stinks. If it causes pain it is torture. Call it what it is. THEN get on with the debate over whether it should be used or not. My opinion is that it shouldn't merely because it has been shown that torture isn't as effective a method of gathering information as other means that are used.", 
        "intTime": 20090514, 
        "postID": 45, 
        "quote": "", 
        "reply": "Manure by any other name still stinks. If it causes pain it is torture. Call it what it is. THEN get on with the debate over whether it should be used or not. My opinion is that it shouldn't merely because it has been shown that torture isn't as effective a method of gathering information as other means that are used.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-14 12:51:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "sthrnfriedrocker"
    }, 
    {
        "content": "What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 46, 
        "quote": "", 
        "reply": "What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-14 13:00:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\"", 
        "intTime": 20090514, 
        "postID": 47, 
        "quote": "Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture.", 
        "reply": " Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\"", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-14 14:00:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "11BnOIF"
    }, 
    {
        "content": "quote: Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it. And what happens if the person you believed had the information was the wrong person? Are you going to give the person his parts back? What if the person is a woman? What if she is a beautiful woman? Let's go farther than that? What if the person is a relative? What if the person is an ex wife or husband? What if the person is a mentally challeged?", 
        "intTime": 20090515, 
        "postID": 48, 
        "quote": "Originally posted by MightyB: Just my thinking on the release of the memos and what is and isn't torture. The way I see it is if you have to have a discussion about if it is or isn't torture, then it probably is. I believe that most people know we torture. Hell we have had news of juvenile prison guards torturing juvenile prisoners and have been convicted of doing so, as well as, torture within our jails and adult prison population. (links upon request) So with this information at our disposal and the Abu Graib debacle, why even claim not to torture? Oh, because we claim this morale superiority which is BS in my opinion. So why not just say that we will do whatever it takes to protect American lives instead of all this back and forth? I know dog-gone well if someone had one of my grandbabies and was a threat to them, if I had someone who knew where they were being held, there is nothing I would not do to make them tell me. And I would go straight for the hardcore cutting off of appendages type of pursuasion. Can anyone honestly say they would not go to any lengths to save a member of their family? But America was one of the first countries to sign the Geneva Convention. We are one of the first to hollar about ROE. Let me get this straight. You are trying to kill me and I am suppose to use rules to stop you and kill you in turn? As a warrior this does not make any sense to me. You try to kill me and I try to kill you using whatever means to achieve that goal. Isn't that the meaning of war? This \"If you do this it is torture but if you only do a moderated version it is not\" is pure and simply BS in my opinion. Yours may differ and I would like to hear it.", 
        "reply": " And what happens if the person you believed had the information was the wrong person? Are you going to give the person his parts back? What if the person is a woman? What if she is a beautiful woman? Let's go farther than that? What if the person is a relative? What if the person is an ex wife or husband? What if the person is a mentally challeged?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 06:25:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\" All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 49, 
        "quote": "Originally posted by Fightdirector: If torture IS acceptable when dealing with people from other countries that someone believes has information about past or future attacks or crimes directed against Americans - Why isn't it acceptable to use those same \"enhanced interrogation techniques\" on Americans inside the United States? For example, Bernie Madoff apparently conned millions of dollars out of Americans with his alleged Ponzi scheme. Would it be acceptable to waterboard him until he revealed where he hid the money, so it can be re-paid to those he conned it from? Another example: Your kid is believed by the local police to be selling drugs, possibly even to MightyB's grandkids. They have no solid evidence, but he dresses in a way that makes him look suspicious and he hangs around with other suspicious-looking kids. Is it acceptable to waterboard him until he confesses to selling drugs and gives up the names of his supplier and customers? Of course it isn't acceptable - Bernie Madoff and your kid, in the examples above, are AMERICANS - which means they were born special and are more loved by God than non-Americans. To paraphrase the former professional wrestler, The Rock, \"Can you smell what's cooking? Can you smell the hypocrisy and double-stadard?\"", 
        "reply": " All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 07:30:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by 11BnOIF: quote: Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\" It does not specify Waterboarding, that's my point. Geneva convention does not cover \"insurgents\" just uniformed personell. Like I said, if we are to move forward, either there needs to be more added to the Geneva Convention or we need a new article of prisoner protection. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 50, 
        "quote": "Originally posted by 11BnOIF: quote: Originally posted by L0A1: What paragraph in the Geneva convention defines Waterboarding as torture? The Geneva convention or similar document needs to be written. We need to either add amendments to it or to be more specific on definition of torture. Article 17 pretty much covers it. Specifically, \"No physical or mental torture, nor any other form of coercion, may be inflicted on prisoners of war to secure from them information of any kind whatever. Prisoners of war who refuse to answer may not be threatened, insulted, or exposed to any unpleasant or disadvantageous treatment of any kind.\"", 
        "reply": " It does not specify Waterboarding, that's my point. Geneva convention does not cover \"insurgents\" just uniformed personell. Like I said, if we are to move forward, either there needs to be more added to the Geneva Convention or we need a new article of prisoner protection. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 08:22:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "L0A1"
    }, 
    {
        "content": "When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's!", 
        "intTime": 20090515, 
        "postID": 51, 
        "quote": "", 
        "reply": "When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's!", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 08:38:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's! These folks are in civilian dress, not black matching PJ's as the vietcong were. Yea, we should just shot them for being spies then? Or do you agree that we need a revised doctrine to govern todays battlefield so that torture can be more defined. Article 17 in the GC doesn't cover terrorist. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 52, 
        "quote": "Originally posted by dragonflyer04: When someone is taken prisoner in a combat role you call them a POW...it has nothing to do with clothing... The exceptions are the enemy in \"your sides uniforms\" (US, allies, etc) or civilian clothes...they can be considered spys, etc...but still have GC rights. In Vietnam the Victor Charlie (VC) showed up in black pj's or whatever they had... they were POW's!", 
        "reply": " These folks are in civilian dress, not black matching PJ's as the vietcong were. Yea, we should just shot them for being spies then? Or do you agree that we need a revised doctrine to govern todays battlefield so that torture can be more defined. Article 17 in the GC doesn't cover terrorist. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 09:05:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? First, do you think it matters what we think or do regarding Iran..? I don't! It is possible we could swing weight but they will do whatever they want to do - regardless... But the real question is \"why\"? Why would they need to torture her..? If we captured an Iranian, would just torture them? To my knowledge we never have yet, so why would we start... If this young lady belonged to a KNOWN terrorist group - a \"real\" - valid terrorist group, hey, if they concern that the terrorist group she supports is planning something that may injure their citizens - go for it. However, between 1998-2003 Iran SLAUGHTERED and TORTURED - 60-thousand of its OWN people to maintain control. No one seemed to mind - not much is ever said about it... To my knowledge the only ones we used enhanced techniques on were those considered to have vitil information. I think it is a mistake to give terrorists the privilege of the GC status because it ligitimizes their cause. It feeds another Palestinian issue.", 
        "intTime": 20090515, 
        "postID": 53, 
        "quote": "Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "reply": " First, do you think it matters what we think or do regarding Iran..? I don't! It is possible we could swing weight but they will do whatever they want to do - regardless... But the real question is \"why\"? Why would they need to torture her..? If we captured an Iranian, would just torture them? To my knowledge we never have yet, so why would we start... If this young lady belonged to a KNOWN terrorist group - a \"real\" - valid terrorist group, hey, if they concern that the terrorist group she supports is planning something that may injure their citizens - go for it. However, between 1998-2003 Iran SLAUGHTERED and TORTURED - 60-thousand of its OWN people to maintain control. No one seemed to mind - not much is ever said about it... To my knowledge the only ones we used enhanced techniques on were those considered to have vitil information. I think it is a mistake to give terrorists the privilege of the GC status because it ligitimizes their cause. It feeds another Palestinian issue.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 10:31:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture. I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways.", 
        "intTime": 20090515, 
        "postID": 54, 
        "quote": "Originally posted by FollowMeInfantry: All due respect, sir, but you're comparing apples to oranges. One is a crime against society. One is war. The two are not comparable. While the former disrupts socio-flow and harmony, the latter threatens sovereignty of that social environment. I don't agree with torture. But I don't think waterboarding is torture, despite what a bunch of UN Staff Weenies say about it. It has nothing to do with American versus non-American or even God. But it especially has nothing to do with the combination of the two. It is about securing our protection from those that fly planes into buildings in order to kill no one but innocents in a declaration of war. It is about bringing to justice those responsible for these murders, preventing future murders, and solidifying suspected intelligence information to expose our potential weaknesses. We can do none of these things with our arms tied behind our back because a bunch of weenies in offices want to dictate rules against a ruthless, ruleless, lawless enemy hellbent on killing every American man, woman and child they can in the twisted concept of a god's salt pillar. Once again -- hear me closely, bro -- I DO NOT condone torture. Not in any means or shape or form. I simply disagree that the discomfort and fear of waterboarding can truly be deemed as torture.", 
        "reply": " I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 10:46:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk...", 
        "intTime": 20090515, 
        "postID": 55, 
        "quote": "Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her?", 
        "reply": " If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk...", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:09:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways. Preface: I served with Tim McVeigh, though we were in different companies. He was either B or C Co, 2/16, and I was D Co. But we were both stationed at Riley at the same time, and his barracks were right next to us. I no doubt saw the man standing in formation on more than one occasion. Freaky. I can't completely disagree, though I do believe you're trying to find a very narrow definition I simply don't share. One (McVeigh) is a criminal, protected under the Constitutional rights endowed unto all citizens of the USA. He is a protected class due to his nationality. The other (Joe Terrorist) is NOT a domestic threat, but a foreign one. Therefore, he cannot claim citizenship and, as such, is subject only to the laws of HIS nation or the Geneva Convention (which I still think is bunk - if his nation didn't sign the GC, they should get NO rights at all, ever). There was never anything even remotely suggesting that McVeigh was a head of a large group of millions hellbent on destroying America. We \"torture\" terrorists because they are already PROVEN to have information on an organization hellbent on destroying America. You're right: can't have your cake and eat it, too. Now tell that to the whiny terrorists that want protections from the nations they refused to join and be a productive part of, choosing instead to murder innocents in the name of God. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 56, 
        "quote": "Originally posted by Fightdirector: I disagree, It is apples AND apples, not apples and oranges. Civilian, American criminals both \"disrupt socio-flow and harmony\" AND threaten the \"sovereignty of the social environment\". If you prefer, let's call waterboarding \"enhanced interrogation techniques\" rather than \"torture\". My position is, that if it is legitimate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists, than it is equally legitmate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals. Conversely, if it is not legitimate and correct to use \"enhanced interrogation techniques\" against Americans who are believed to be criminals, than it is equally not legitmate and correct to use \"enhanced interrogation techniques\" against non-Americans who are believed to be terrorists. Do you take the position that Timothy McVeigh should have been subjected to \"enhanced interrogation techniques\" prior to his execution for acts of terrorism? Such \"enhanced interrogation techniques\" might have revealed more of his co-conspirators - possibly an entire networks of Right-wing American anti-government terrorists. If it is legitimate and correct to use \"enhanced interrogation techniques\" on an Iraqi civilian who was turned in by his next-door neighbor for a cash reward and who may or may not have been a terrorist, why not use \"enhanced interrogation techniques\" on an American (McVeigh) who was actually convicted in an American court of law of committing a terrorist act? It is not apples and oranges - it's apples and apples - it's the same and you cannot legitimately have it both ways.", 
        "reply": " Preface: I served with Tim McVeigh, though we were in different companies. He was either B or C Co, 2/16, and I was D Co. But we were both stationed at Riley at the same time, and his barracks were right next to us. I no doubt saw the man standing in formation on more than one occasion. Freaky. I can't completely disagree, though I do believe you're trying to find a very narrow definition I simply don't share. One (McVeigh) is a criminal, protected under the Constitutional rights endowed unto all citizens of the USA. He is a protected class due to his nationality. The other (Joe Terrorist) is NOT a domestic threat, but a foreign one. Therefore, he cannot claim citizenship and, as such, is subject only to the laws of HIS nation or the Geneva Convention (which I still think is bunk - if his nation didn't sign the GC, they should get NO rights at all, ever). There was never anything even remotely suggesting that McVeigh was a head of a large group of millions hellbent on destroying America. We \"torture\" terrorists because they are already PROVEN to have information on an organization hellbent on destroying America. You're right: can't have your cake and eat it, too. Now tell that to the whiny terrorists that want protections from the nations they refused to join and be a productive part of, choosing instead to murder innocents in the name of God. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:19:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk... Now THAT'S a real example of \"apples and oranges\"!!!!! She has been released and is now in Austria - but what possible connection could there be between her being tortured or not tortured by the Iranian government and \"You libs are destroying this nation and putting her at risk\". Is she at risk of torture by the Iranians because we torture Iraqis - or is she not at risk of torture by the Iranians because we torture Iraqis? I can't connect those dots you were apparently able to connect. Can you be more clear?", 
        "intTime": 20090515, 
        "postID": 57, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: A young American lady was just captured and convicted of espionage in Iran...Is Iran \"justified\" in torturing her? If don't torture does that mean they won't either? You libs are destroying this nation and putting her at risk...", 
        "reply": " Now THAT'S a real example of \"apples and oranges\"!!!!! She has been released and is now in Austria - but what possible connection could there be between her being tortured or not tortured by the Iranian government and \"You libs are destroying this nation and putting her at risk\". Is she at risk of torture by the Iranians because we torture Iraqis - or is she not at risk of torture by the Iranians because we torture Iraqis? I can't connect those dots you were apparently able to connect. Can you be more clear?", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:22:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "It doesn't matter what we do or say it todays world.....Iran and other rogue nations will do what we LET them do unless we put our foot down on their throats.", 
        "intTime": 20090515, 
        "postID": 58, 
        "quote": "", 
        "reply": "It doesn't matter what we do or say it todays world.....Iran and other rogue nations will do what we LET them do unless we put our foot down on their throats.", 
        "threadID": "409192893_4560053222001", 
        "time": "2009-05-15 11:31:00", 
        "title": "Torture~Why Not Admit It?", 
        "userID": "Irwin_R_Schyster"
    }
]