[
    {
        "content": "actually if you read between the lines, he's blaming Bush. Why is it such a sin to not agree with Obama and his policies, proposals etc etc? If EU leaders are running scared so much, I guess we should too, us that also don't know how to bow.", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "", 
        "reply": "actually if you read between the lines, he's blaming Bush. Why is it such a sin to not agree with Obama and his policies, proposals etc etc? If EU leaders are running scared so much, I guess we should too, us that also don't know how to bow.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:02:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Whoever he is blaming he is pointing the finger at US. If you look around the Russian leadership has been saying the same things for awhile now. He is just being a good politician in the sphere of Russian influence. He is basically showing his colors. The EU reps that support US obviously have stated their disagreement. Politics in geographic regions is like a rock dropped in a pond, the waves move outward, the closet waves are the biggest. Czechs know the Russian bear better than most.", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "Whoever he is blaming he is pointing the finger at US. If you look around the Russian leadership has been saying the same things for awhile now. He is just being a good politician in the sphere of Russian influence. He is basically showing his colors. The EU reps that support US obviously have stated their disagreement. Politics in geographic regions is like a rock dropped in a pond, the waves move outward, the closet waves are the biggest. Czechs know the Russian bear better than most.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:19:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "", 
        "reply": "At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:19:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Kegler? What? China is a communist nation...the EU is much more socialistic than we are and they love it. Their politicians are socialists and represent them in the EU... This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this.", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "", 
        "reply": "Kegler? What? China is a communist nation...the EU is much more socialistic than we are and they love it. Their politicians are socialists and represent them in the EU... This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:26:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. That's hilarious! Dropped that bowling ball on your head again didn't you?", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status.", 
        "reply": " That's hilarious! Dropped that bowling ball on your head again didn't you?", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:35:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you? Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket? \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you?", 
        "reply": " Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket? \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:44:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!! No, I'm saying they recognize the evils of socialism and the benefits of capitalism. We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt. \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!!", 
        "reply": " No, I'm saying they recognize the evils of socialism and the benefits of capitalism. We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:58:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt. I think I was the first here to coin the phrase 'monopoly money' in regards to our monatary system of present. I'm glad to see you're spreading the wealth evenly........ , the \"Messiah\" would be pleased.", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "Originally posted by Kegler300: and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.", 
        "reply": " I think I was the first here to coin the phrase 'monopoly money' in regards to our monatary system of present. I'm glad to see you're spreading the wealth evenly........ , the \"Messiah\" would be pleased.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:09:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this. You do realize this was the same guy that was drooling all over Dubyas feet, begging for the ABM Shield? BTW, Europe disagreed with him back then too.", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "Originally posted by dragonflyer04: This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this.", 
        "reply": " You do realize this was the same guy that was drooling all over Dubyas feet, begging for the ABM Shield? BTW, Europe disagreed with him back then too.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:23:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you? Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket? At this point I think you can put the blame squarly on both Bush and Obama. They both seem to have some strange ideas about bailouts using our money, which by the way, is on the printing presses now. Get to the root of the problem and blame congress. Its their ballgame to submit bills for the presidents signature. If the president is stupid enough to put the country into debt for the next hundred years and the congress aggrees with it and submits the bill where does the blame lie? USS Liberty, Never Forget. I believe in Murrays Law, he thought Murphy was an optimist.", 
        "intTime": 20090325, 
        "postID": 10, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you? Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket?", 
        "reply": " At this point I think you can put the blame squarly on both Bush and Obama. They both seem to have some strange ideas about bailouts using our money, which by the way, is on the printing presses now. Get to the root of the problem and blame congress. Its their ballgame to submit bills for the presidents signature. If the president is stupid enough to put the country into debt for the next hundred years and the congress aggrees with it and submits the bill where does the blame lie? USS Liberty, Never Forget. I believe in Murrays Law, he thought Murphy was an optimist.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:29:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "GerryRM3"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!! No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it!", 
        "intTime": 20090325, 
        "postID": 11, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!! No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it!", 
        "reply": "", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:29:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Knele"
    }, 
    {
        "content": "[QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. Socialists all think they have a better system, as long as someone else has money to pay for it. \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 12, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. Socialists all think they have a better system, as long as someone else has money to pay for it. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:43:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: [QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? Luxembourg, Norway, Iceland, Ireland, Switzerland & Denmark have a higher GDP per capita then we do! And yes they have better health care too! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. So you don't have a solution? Socialists all think they have a better system, as long as someone else has money to pay for it.", 
        "intTime": 20090325, 
        "postID": 13, 
        "quote": "Originally posted by Kegler300: [QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? Luxembourg, Norway, Iceland, Ireland, Switzerland & Denmark have a higher GDP per capita then we do! And yes they have better health care too! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. So you don't have a solution? Socialists all think they have a better system, as long as someone else has money to pay for it.", 
        "reply": "", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 14:39:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>>", 
        "intTime": 20090325, 
        "postID": 14, 
        "quote": "Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S.", 
        "reply": " Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>>", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 16:30:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. Oh brother Keg. The sky is falling, the sky is falling. It will all be fine in the end.", 
        "intTime": 20090325, 
        "postID": 15, 
        "quote": "Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status.", 
        "reply": " Oh brother Keg. The sky is falling, the sky is falling. It will all be fine in the end.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 16:32:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war.", 
        "intTime": 20090325, 
        "postID": 16, 
        "quote": "", 
        "reply": "He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 16:54:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "TataH"
    }, 
    {
        "content": "quote: Originally posted by TataH: He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war. I disagree. Some institutions were allowed to get too big. Failure of these institutions will devastate the economy much more than deficits will. Government spending is required to make up for the lack of consumer spending. Someone has to buy these goods and services and if the consumer isn't then the government has to. Failure to do so will only lead to further job loss and less consumer spending. It will be a downward spiral.", 
        "intTime": 20090325, 
        "postID": 17, 
        "quote": "Originally posted by TataH: He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war.", 
        "reply": " I disagree. Some institutions were allowed to get too big. Failure of these institutions will devastate the economy much more than deficits will. Government spending is required to make up for the lack of consumer spending. Someone has to buy these goods and services and if the consumer isn't then the government has to. Failure to do so will only lead to further job loss and less consumer spending. It will be a downward spiral.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 17:05:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by WepsFP: quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>> He said it, now the rest is damage control. How do you know he said it? Did you do an independent translation??", 
        "intTime": 20090325, 
        "postID": 18, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by WepsFP: quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>> He said it, now the rest is damage control.", 
        "reply": " How do you know he said it? Did you do an independent translation??", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 17:06:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090325, 
        "postID": 19, 
        "quote": "Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status.", 
        "reply": " And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 19:13:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Obama has created more debt and deficit than every previous president combined as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim.", 
        "intTime": 20090325, 
        "postID": 20, 
        "quote": "Obama has created more debt and deficit than every previous president combined", 
        "reply": " as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 22:06:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "and for the record. the Czech Prime Minister said this a day after he lost a vote of no confidence to his government. oh....and he also said we needed tighter banking regulations too.", 
        "intTime": 20090325, 
        "postID": 21, 
        "quote": "", 
        "reply": "and for the record. the Czech Prime Minister said this a day after he lost a vote of no confidence to his government. oh....and he also said we needed tighter banking regulations too.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 22:10:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion. Oh, I'm not leaving. I'm staying and fighting the socialist commies trying to destroy my Country. And as expected, that's going to include a lot of lazy, welfare-minded, government teet sucking idiots who can't make it one their own, so they want someone else to provide for them. \"The World's Finest\"", 
        "intTime": 20090326, 
        "postID": 22, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion.", 
        "reply": " Oh, I'm not leaving. I'm staying and fighting the socialist commies trying to destroy my Country. And as expected, that's going to include a lot of lazy, welfare-minded, government teet sucking idiots who can't make it one their own, so they want someone else to provide for them. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 05:48:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. I thought Bush was the one isolating us? At some point you need to take a step back and take a critical look Obama and what he is doing. Of course the EU has there own agenda, however it one of the biggest complaints about Bush is now the same complaint about Obama (or worse!) then you need to acknowledge there is a problem..or be loss all creidtability and end up another scott..", 
        "intTime": 20090326, 
        "postID": 23, 
        "quote": "Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S.", 
        "reply": " I thought Bush was the one isolating us? At some point you need to take a step back and take a critical look Obama and what he is doing. Of course the EU has there own agenda, however it one of the biggest complaints about Bush is now the same complaint about Obama (or worse!) then you need to acknowledge there is a problem..or be loss all creidtability and end up another scott..", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 05:59:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. You were serious and I thought you were pulling our leg. Now that is as good as it gets. Socialist Europe and Communist China warning us about the evils of socialism. This has got to be one of your all time greatest hits! Kegler at his best! It amazes me that NO ONE can offer a complaint about Obama that you are willing to consider..not the center, not the left, not the right..not other nations..not educated economists... no one...", 
        "intTime": 20090326, 
        "postID": 24, 
        "quote": "Originally posted by dmuhler: quote: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. You were serious and I thought you were pulling our leg. Now that is as good as it gets. Socialist Europe and Communist China warning us about the evils of socialism. This has got to be one of your all time greatest hits! Kegler at his best!", 
        "reply": " It amazes me that NO ONE can offer a complaint about Obama that you are willing to consider..not the center, not the left, not the right..not other nations..not educated economists... no one...", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 06:04:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim. Source: \"http://www.askariali.com/page14.html\" The National Debt now stands at $11,057,620,476,762.19. This averages out to $36,125.81 per person, based on a population of 306,086,421. It is increasing at a rate of $78,310.63 per second (based on the past 6 months). \"The World's Finest\"", 
        "intTime": 20090326, 
        "postID": 25, 
        "quote": "Originally posted by karlhungusjr: as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim.", 
        "reply": " Source: \"http://www.askariali.com/page14.html\" The National Debt now stands at $11,057,620,476,762.19. This averages out to $36,125.81 per person, based on a population of 306,086,421. It is increasing at a rate of $78,310.63 per second (based on the past 6 months). \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 06:05:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "actually if you read between the lines, he's blaming Bush. Why is it such a sin to not agree with Obama and his policies, proposals etc etc? If EU leaders are running scared so much, I guess we should too, us that also don't know how to bow.", 
        "intTime": 20090325, 
        "postID": 26, 
        "quote": "", 
        "reply": "actually if you read between the lines, he's blaming Bush. Why is it such a sin to not agree with Obama and his policies, proposals etc etc? If EU leaders are running scared so much, I guess we should too, us that also don't know how to bow.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:02:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Whoever he is blaming he is pointing the finger at US. If you look around the Russian leadership has been saying the same things for awhile now. He is just being a good politician in the sphere of Russian influence. He is basically showing his colors. The EU reps that support US obviously have stated their disagreement. Politics in geographic regions is like a rock dropped in a pond, the waves move outward, the closet waves are the biggest. Czechs know the Russian bear better than most.", 
        "intTime": 20090325, 
        "postID": 27, 
        "quote": "", 
        "reply": "Whoever he is blaming he is pointing the finger at US. If you look around the Russian leadership has been saying the same things for awhile now. He is just being a good politician in the sphere of Russian influence. He is basically showing his colors. The EU reps that support US obviously have stated their disagreement. Politics in geographic regions is like a rock dropped in a pond, the waves move outward, the closet waves are the biggest. Czechs know the Russian bear better than most.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:19:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 28, 
        "quote": "", 
        "reply": "At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:19:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Kegler? What? China is a communist nation...the EU is much more socialistic than we are and they love it. Their politicians are socialists and represent them in the EU... This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this.", 
        "intTime": 20090325, 
        "postID": 29, 
        "quote": "", 
        "reply": "Kegler? What? China is a communist nation...the EU is much more socialistic than we are and they love it. Their politicians are socialists and represent them in the EU... This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:26:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. That's hilarious! Dropped that bowling ball on your head again didn't you?", 
        "intTime": 20090325, 
        "postID": 30, 
        "quote": "Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status.", 
        "reply": " That's hilarious! Dropped that bowling ball on your head again didn't you?", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:35:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you? Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket? \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 31, 
        "quote": "Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you?", 
        "reply": " Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket? \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:44:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!! No, I'm saying they recognize the evils of socialism and the benefits of capitalism. We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt. \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 32, 
        "quote": "Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!!", 
        "reply": " No, I'm saying they recognize the evils of socialism and the benefits of capitalism. We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 12:58:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt. I think I was the first here to coin the phrase 'monopoly money' in regards to our monatary system of present. I'm glad to see you're spreading the wealth evenly........ , the \"Messiah\" would be pleased.", 
        "intTime": 20090325, 
        "postID": 33, 
        "quote": "Originally posted by Kegler300: and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.", 
        "reply": " I think I was the first here to coin the phrase 'monopoly money' in regards to our monatary system of present. I'm glad to see you're spreading the wealth evenly........ , the \"Messiah\" would be pleased.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:09:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this. You do realize this was the same guy that was drooling all over Dubyas feet, begging for the ABM Shield? BTW, Europe disagreed with him back then too.", 
        "intTime": 20090325, 
        "postID": 34, 
        "quote": "Originally posted by dragonflyer04: This one dude is expressing a political view of neighbor Russia which is not represented in the EU and he is asking their constituents in his country for support by saying this.", 
        "reply": " You do realize this was the same guy that was drooling all over Dubyas feet, begging for the ABM Shield? BTW, Europe disagreed with him back then too.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:23:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you? Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket? At this point I think you can put the blame squarly on both Bush and Obama. They both seem to have some strange ideas about bailouts using our money, which by the way, is on the printing presses now. Get to the root of the problem and blame congress. Its their ballgame to submit bills for the presidents signature. If the president is stupid enough to put the country into debt for the next hundred years and the congress aggrees with it and submits the bill where does the blame lie? USS Liberty, Never Forget. I believe in Murrays Law, he thought Murphy was an optimist.", 
        "intTime": 20090325, 
        "postID": 35, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: That's hilarious! Dropped that bowling ball on your head again didn't you? Do you find it funny that Obama has created more debt and deficit than every previous president combined, which is only going to lead to more poverty and misery for Americans? America has lost trillions of dollars in wealth; Americans have lost their retirements; retirees have had to look for jobs to replace the retirement incomes they've lost; many 401K's aren't even 201K's now. Your humored by all of this? Are you a crab in a bucket?", 
        "reply": " At this point I think you can put the blame squarly on both Bush and Obama. They both seem to have some strange ideas about bailouts using our money, which by the way, is on the printing presses now. Get to the root of the problem and blame congress. Its their ballgame to submit bills for the presidents signature. If the president is stupid enough to put the country into debt for the next hundred years and the congress aggrees with it and submits the bill where does the blame lie? USS Liberty, Never Forget. I believe in Murrays Law, he thought Murphy was an optimist.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:29:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "GerryRM3"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!! No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it!", 
        "intTime": 20090325, 
        "postID": 36, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by dmuhler: It does not get any better than this. Kegler Are you saying they they are warning us about the evils of socialism??? OMG you are a funny guy!!! No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it!", 
        "reply": "", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:29:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Knele"
    }, 
    {
        "content": "[QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. Socialists all think they have a better system, as long as someone else has money to pay for it. \"The World's Finest\"", 
        "intTime": 20090325, 
        "postID": 37, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. Socialists all think they have a better system, as long as someone else has money to pay for it. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 13:43:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: [QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? Luxembourg, Norway, Iceland, Ireland, Switzerland & Denmark have a higher GDP per capita then we do! And yes they have better health care too! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. So you don't have a solution? Socialists all think they have a better system, as long as someone else has money to pay for it.", 
        "intTime": 20090325, 
        "postID": 38, 
        "quote": "Originally posted by Kegler300: [QUOTE]Originally posted by Knele: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. I know this is hard for you to comprehend, but Europe IS socialist and LOVING IT! Which European country is wealthier, has better health care, etc., than America? Luxembourg, Norway, Iceland, Ireland, Switzerland & Denmark have a higher GDP per capita then we do! And yes they have better health care too! We are accumulating more debt than all of the previous presidents combined, and the only solution Obama has is to spend even more money and have the Fed print monopoly money to pay the debt.You have a better solution to get us out of this mess then? Let’s hear it! Do you believe you can spend your way out of debt? Let your wife try, and tell me how that works. So you don't have a solution? Socialists all think they have a better system, as long as someone else has money to pay for it.", 
        "reply": "", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 14:39:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>>", 
        "intTime": 20090325, 
        "postID": 39, 
        "quote": "Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S.", 
        "reply": " Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>>", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 16:30:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. Oh brother Keg. The sky is falling, the sky is falling. It will all be fine in the end.", 
        "intTime": 20090325, 
        "postID": 40, 
        "quote": "Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status.", 
        "reply": " Oh brother Keg. The sky is falling, the sky is falling. It will all be fine in the end.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 16:32:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war.", 
        "intTime": 20090325, 
        "postID": 41, 
        "quote": "", 
        "reply": "He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 16:54:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "TataH"
    }, 
    {
        "content": "quote: Originally posted by TataH: He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war. I disagree. Some institutions were allowed to get too big. Failure of these institutions will devastate the economy much more than deficits will. Government spending is required to make up for the lack of consumer spending. Someone has to buy these goods and services and if the consumer isn't then the government has to. Failure to do so will only lead to further job loss and less consumer spending. It will be a downward spiral.", 
        "intTime": 20090325, 
        "postID": 42, 
        "quote": "Originally posted by TataH: He said what's on the mind of a lot of people. American dollar is not just American money, it's world currency. And some poorer Euro nations use it as it's own. Inflated American dollar hurts them, especially when their currency dropping against it at the same time. The bailouts only benefit few in America, even though lots of people around the world will be affected negatively by it. It's a huge mess we are getting deeper and deeper in. I just hope we can get out of it without a major war.", 
        "reply": " I disagree. Some institutions were allowed to get too big. Failure of these institutions will devastate the economy much more than deficits will. Government spending is required to make up for the lack of consumer spending. Someone has to buy these goods and services and if the consumer isn't then the government has to. Failure to do so will only lead to further job loss and less consumer spending. It will be a downward spiral.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 17:05:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by WepsFP: quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>> He said it, now the rest is damage control. How do you know he said it? Did you do an independent translation??", 
        "intTime": 20090325, 
        "postID": 43, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by WepsFP: quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. Translation problem. He never said that....so the mans deputy says. It's fun to watch the right wing lemmings pat themselves on the back though. <<<<//www.reuters.com/article/marketsNews/idUSLP97446520090325>>>>> He said it, now the rest is damage control.", 
        "reply": " How do you know he said it? Did you do an independent translation??", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 17:06:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090325, 
        "postID": 44, 
        "quote": "Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status.", 
        "reply": " And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 19:13:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Obama has created more debt and deficit than every previous president combined as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim.", 
        "intTime": 20090325, 
        "postID": 45, 
        "quote": "Obama has created more debt and deficit than every previous president combined", 
        "reply": " as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 22:06:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "and for the record. the Czech Prime Minister said this a day after he lost a vote of no confidence to his government. oh....and he also said we needed tighter banking regulations too.", 
        "intTime": 20090325, 
        "postID": 46, 
        "quote": "", 
        "reply": "and for the record. the Czech Prime Minister said this a day after he lost a vote of no confidence to his government. oh....and he also said we needed tighter banking regulations too.", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-25 22:10:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion. Oh, I'm not leaving. I'm staying and fighting the socialist commies trying to destroy my Country. And as expected, that's going to include a lot of lazy, welfare-minded, government teet sucking idiots who can't make it one their own, so they want someone else to provide for them. \"The World's Finest\"", 
        "intTime": 20090326, 
        "postID": 47, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by Kegler300: At least China and Europe recognize the disasterous path Obama is leading us down. They recognize what socialism, and redistribution of wealth schemes do to prosperity. Too bad we have a majority of wealth-envy, welfare-minded, Americans who choose to follow Obama straight into the hell he's creating for America. Obama is more than tripling our deficit with out of control socialism, and the Fed is busy printing what amounts to mononopoly money to pay for the debt. We were once the envy of the world, but the democrats have relegated us to Third World status. And to top it off, you are free to leave anytime you want. I'm sure it's so much better somewhere else. Complain til the cows come home somewhere else. You don't have to like what's going on but unless you have a better idea no one cares about your opinion.", 
        "reply": " Oh, I'm not leaving. I'm staying and fighting the socialist commies trying to destroy my Country. And as expected, that's going to include a lot of lazy, welfare-minded, government teet sucking idiots who can't make it one their own, so they want someone else to provide for them. \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 05:48:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S. I thought Bush was the one isolating us? At some point you need to take a step back and take a critical look Obama and what he is doing. Of course the EU has there own agenda, however it one of the biggest complaints about Bush is now the same complaint about Obama (or worse!) then you need to acknowledge there is a problem..or be loss all creidtability and end up another scott..", 
        "intTime": 20090326, 
        "postID": 48, 
        "quote": "Originally posted by dmuhler: Looks like the Czech Prime Minister took a play straight from the republicans: The day after you get thrown out, you attack president Obama. quote: Czech Prime Minister Mirek Topolanek, whose country currently holds the rotating EU presidency, told the European Parliament that President Barack Obama's massive stimulus package and banking bailout \"will undermine the liquidity of the global financial market.\" A day after his government collapsed because of a parliamentary vote of no-confidence, Topolanek took the EU presidency on a collision course with Washington over how to deal with the global economic recession. The blunt comments pushed other European politicians into damage control mode, with some reproaching the Czech leader for his language and others reaffirming their good diplomatic ties with the U.S.", 
        "reply": " I thought Bush was the one isolating us? At some point you need to take a step back and take a critical look Obama and what he is doing. Of course the EU has there own agenda, however it one of the biggest complaints about Bush is now the same complaint about Obama (or worse!) then you need to acknowledge there is a problem..or be loss all creidtability and end up another scott..", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 05:59:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. You were serious and I thought you were pulling our leg. Now that is as good as it gets. Socialist Europe and Communist China warning us about the evils of socialism. This has got to be one of your all time greatest hits! Kegler at his best! It amazes me that NO ONE can offer a complaint about Obama that you are willing to consider..not the center, not the left, not the right..not other nations..not educated economists... no one...", 
        "intTime": 20090326, 
        "postID": 49, 
        "quote": "Originally posted by dmuhler: quote: No, I'm saying they recognize the evils of socialism and the benefits of capitalism. You were serious and I thought you were pulling our leg. Now that is as good as it gets. Socialist Europe and Communist China warning us about the evils of socialism. This has got to be one of your all time greatest hits! Kegler at his best!", 
        "reply": " It amazes me that NO ONE can offer a complaint about Obama that you are willing to consider..not the center, not the left, not the right..not other nations..not educated economists... no one...", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 06:04:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim. Source: \"http://www.askariali.com/page14.html\" The National Debt now stands at $11,057,620,476,762.19. This averages out to $36,125.81 per person, based on a population of 306,086,421. It is increasing at a rate of $78,310.63 per second (based on the past 6 months). \"The World's Finest\"", 
        "intTime": 20090326, 
        "postID": 50, 
        "quote": "Originally posted by karlhungusjr: as usual, that's 100% untrue. now before you call me a godless commie feel free to provide the numbers to back up your claim.", 
        "reply": " Source: \"http://www.askariali.com/page14.html\" The National Debt now stands at $11,057,620,476,762.19. This averages out to $36,125.81 per person, based on a population of 306,086,421. It is increasing at a rate of $78,310.63 per second (based on the past 6 months). \"The World's Finest\"", 
        "threadID": "409192893_4110088812001", 
        "time": "2009-03-26 06:05:00", 
        "title": "EU presidency: US economic plans 'a road to hell'", 
        "userID": "Kegler300"
    }
]