[
    {
        "content": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:42:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "samh32"
    }, 
    {
        "content": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "", 
        "reply": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:53:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Do you wish upon a star? Like Tinkerbell?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "reply": " \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:57:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. Uniformed?? Please continue.", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response.", 
        "reply": " Uniformed?? Please continue.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 13:03:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:27:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "intTime": 20090425, 
        "postID": 8, 
        "quote": "", 
        "reply": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. Obama is not going to need any excuses in 2010.", 
        "intTime": 20090425, 
        "postID": 9, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " Obama is not going to need any excuses in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 10, 
        "quote": "Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "reply": " No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "intTime": 20090425, 
        "postID": 11, 
        "quote": "", 
        "reply": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:04:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "intTime": 20090425, 
        "postID": 12, 
        "quote": "", 
        "reply": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! You mean that many American's will still admit they are Republicans?", 
        "intTime": 20090425, 
        "postID": 13, 
        "quote": "Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%!", 
        "reply": " You mean that many American's will still admit they are Republicans?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:17:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "intTime": 20090425, 
        "postID": 14, 
        "quote": "", 
        "reply": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:21:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "intTime": 20090425, 
        "postID": 15, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "intTime": 20090425, 
        "postID": 16, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:41:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you! In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "intTime": 20090425, 
        "postID": 17, 
        "quote": "Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "reply": " In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:46:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. Where do you guys come up with this stuff?", 
        "intTime": 20090425, 
        "postID": 18, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " Where do you guys come up with this stuff?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:49:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 19, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "reply": " Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:50:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 20, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:02:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in? The reality where you cant just print money to pay for all your nanny state programs.", 
        "intTime": 20090425, 
        "postID": 21, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "reply": " The reality where you cant just print money to pay for all your nanny state programs.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "intTime": 20090425, 
        "postID": 22, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "intTime": 20090425, 
        "postID": 23, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless.", 
        "reply": " Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:24:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "intTime": 20090425, 
        "postID": 24, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:48:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "intTime": 20090425, 
        "postID": 25, 
        "quote": "", 
        "reply": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 18:23:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE? Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "intTime": 20090427, 
        "postID": 26, 
        "quote": "Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "reply": " Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 11:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "intTime": 20090427, 
        "postID": 27, 
        "quote": "", 
        "reply": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 12:14:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "transport1"
    }, 
    {
        "content": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "intTime": 20090425, 
        "postID": 28, 
        "quote": "", 
        "reply": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:42:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "samh32"
    }, 
    {
        "content": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "intTime": 20090425, 
        "postID": 29, 
        "quote": "", 
        "reply": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 30, 
        "quote": "", 
        "reply": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:53:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "intTime": 20090425, 
        "postID": 31, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Do you wish upon a star? Like Tinkerbell?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 32, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "reply": " \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:57:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. Uniformed?? Please continue.", 
        "intTime": 20090425, 
        "postID": 33, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response.", 
        "reply": " Uniformed?? Please continue.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 13:03:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "intTime": 20090425, 
        "postID": 34, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:27:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "intTime": 20090425, 
        "postID": 35, 
        "quote": "", 
        "reply": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. Obama is not going to need any excuses in 2010.", 
        "intTime": 20090425, 
        "postID": 36, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " Obama is not going to need any excuses in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 37, 
        "quote": "Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "reply": " No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "intTime": 20090425, 
        "postID": 38, 
        "quote": "", 
        "reply": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:04:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "intTime": 20090425, 
        "postID": 39, 
        "quote": "", 
        "reply": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! You mean that many American's will still admit they are Republicans?", 
        "intTime": 20090425, 
        "postID": 40, 
        "quote": "Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%!", 
        "reply": " You mean that many American's will still admit they are Republicans?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:17:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "intTime": 20090425, 
        "postID": 41, 
        "quote": "", 
        "reply": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:21:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "intTime": 20090425, 
        "postID": 42, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "intTime": 20090425, 
        "postID": 43, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:41:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you! In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "intTime": 20090425, 
        "postID": 44, 
        "quote": "Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "reply": " In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:46:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. Where do you guys come up with this stuff?", 
        "intTime": 20090425, 
        "postID": 45, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " Where do you guys come up with this stuff?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:49:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 46, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "reply": " Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:50:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 47, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:02:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in? The reality where you cant just print money to pay for all your nanny state programs.", 
        "intTime": 20090425, 
        "postID": 48, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "reply": " The reality where you cant just print money to pay for all your nanny state programs.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "intTime": 20090425, 
        "postID": 49, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "intTime": 20090425, 
        "postID": 50, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless.", 
        "reply": " Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:24:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "intTime": 20090425, 
        "postID": 51, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:48:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "intTime": 20090425, 
        "postID": 52, 
        "quote": "", 
        "reply": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 18:23:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE? Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "intTime": 20090427, 
        "postID": 53, 
        "quote": "Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "reply": " Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 11:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "intTime": 20090427, 
        "postID": 54, 
        "quote": "", 
        "reply": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 12:14:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "transport1"
    }, 
    {
        "content": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "intTime": 20090425, 
        "postID": 55, 
        "quote": "", 
        "reply": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:42:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "samh32"
    }, 
    {
        "content": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "intTime": 20090425, 
        "postID": 56, 
        "quote": "", 
        "reply": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 57, 
        "quote": "", 
        "reply": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:53:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "intTime": 20090425, 
        "postID": 58, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Do you wish upon a star? Like Tinkerbell?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 59, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "reply": " \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:57:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. Uniformed?? Please continue.", 
        "intTime": 20090425, 
        "postID": 60, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response.", 
        "reply": " Uniformed?? Please continue.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 13:03:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "intTime": 20090425, 
        "postID": 61, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:27:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "intTime": 20090425, 
        "postID": 62, 
        "quote": "", 
        "reply": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. Obama is not going to need any excuses in 2010.", 
        "intTime": 20090425, 
        "postID": 63, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " Obama is not going to need any excuses in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 64, 
        "quote": "Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "reply": " No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "intTime": 20090425, 
        "postID": 65, 
        "quote": "", 
        "reply": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:04:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "intTime": 20090425, 
        "postID": 66, 
        "quote": "", 
        "reply": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! You mean that many American's will still admit they are Republicans?", 
        "intTime": 20090425, 
        "postID": 67, 
        "quote": "Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%!", 
        "reply": " You mean that many American's will still admit they are Republicans?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:17:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "intTime": 20090425, 
        "postID": 68, 
        "quote": "", 
        "reply": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:21:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "intTime": 20090425, 
        "postID": 69, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "intTime": 20090425, 
        "postID": 70, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:41:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you! In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "intTime": 20090425, 
        "postID": 71, 
        "quote": "Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "reply": " In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:46:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. Where do you guys come up with this stuff?", 
        "intTime": 20090425, 
        "postID": 72, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " Where do you guys come up with this stuff?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:49:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 73, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "reply": " Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:50:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 74, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:02:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in? The reality where you cant just print money to pay for all your nanny state programs.", 
        "intTime": 20090425, 
        "postID": 75, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "reply": " The reality where you cant just print money to pay for all your nanny state programs.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "intTime": 20090425, 
        "postID": 76, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "intTime": 20090425, 
        "postID": 77, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless.", 
        "reply": " Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:24:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "intTime": 20090425, 
        "postID": 78, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:48:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "intTime": 20090425, 
        "postID": 79, 
        "quote": "", 
        "reply": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 18:23:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE? Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "intTime": 20090427, 
        "postID": 80, 
        "quote": "Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "reply": " Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 11:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "intTime": 20090427, 
        "postID": 81, 
        "quote": "", 
        "reply": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 12:14:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "transport1"
    }, 
    {
        "content": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "intTime": 20090425, 
        "postID": 82, 
        "quote": "", 
        "reply": "WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:42:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "samh32"
    }, 
    {
        "content": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "intTime": 20090425, 
        "postID": 83, 
        "quote": "", 
        "reply": "He's light years ahead of his predecessor. What a relief! Especially in international relationships. Go BHO!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 84, 
        "quote": "", 
        "reply": "Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:53:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "intTime": 20090425, 
        "postID": 85, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Do you wish upon a star? Like Tinkerbell?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 86, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell?", 
        "reply": " \"Thud\" just like your uniformed, unaware, liberal response. \"The World's Finest\"", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 12:57:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response. Uniformed?? Please continue.", 
        "intTime": 20090425, 
        "postID": 87, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Do you wish upon a star? Like Tinkerbell? \"Thud\" just like your uniformed, unaware, liberal response.", 
        "reply": " Uniformed?? Please continue.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 13:03:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "intTime": 20090425, 
        "postID": 88, 
        "quote": "Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya!", 
        "reply": " Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:27:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "intTime": 20090425, 
        "postID": 89, 
        "quote": "", 
        "reply": "All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. Obama is not going to need any excuses in 2010.", 
        "intTime": 20090425, 
        "postID": 90, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " Obama is not going to need any excuses in 2010.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\" No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 91, 
        "quote": "Originally posted by samh32: WASHINGTON (CNN) -- Nearly two out of three Americans approve of the job Barack Obama is doing as president, according to an average of the most recent national polls. President Obama is still being evaluated on how he does his job, CNN's polling director says. President Obama is still being evaluated on how he does his job, CNN's polling director says. In a CNN Poll of Polls compiled Thursday, 64 percent of those questioned in various surveys say they approve of how Obama is handling his duties as president. Twenty-eight percent disapprove. The president's approval rating also stood at 64 percent in a CNN Poll of Polls compiled in January, just after his inauguration. \"Most polls have shown Obama getting fairly high marks on most of the issues he has handled so far,\" CNN Polling Director Keating Holland said. \"One exception has been the way he has handled government assistance to failing banks and automakers. His numbers on the federal deficit are also low in comparison to his approval ratings on the economy and foreign policy.\"", 
        "reply": " No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "intTime": 20090425, 
        "postID": 92, 
        "quote": "", 
        "reply": "\"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:04:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "intTime": 20090425, 
        "postID": 93, 
        "quote": "", 
        "reply": "BTW I agree with Kegler. My thoughts exactly. It is the policies. Not the person. Cap and Trade is, to me, the worst of all. As Bo himself has said ...the price of electricity will skyrocket. Thank you.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! You mean that many American's will still admit they are Republicans?", 
        "intTime": 20090425, 
        "postID": 94, 
        "quote": "Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%!", 
        "reply": " You mean that many American's will still admit they are Republicans?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:17:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "intTime": 20090425, 
        "postID": 95, 
        "quote": "", 
        "reply": "Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:21:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "intTime": 20090425, 
        "postID": 96, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:38:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "intTime": 20090425, 
        "postID": 97, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:41:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you! In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "intTime": 20090425, 
        "postID": 98, 
        "quote": "Originally posted by Agent991: \"http://gatewaypundit.blogspot.com/2009/04/latest-ap-junk-poll-includes-get-this.html\" \"\"The AP is trumpeting a new poll showing that for the first time in many years, a MAJORITY of Americans believe America is headed in the right direction. At first read you might ask yourself, how the heck is this possible? Well it's easy is you totally jack the sample. This poll includes (get ready for it) only 18% REPUBLICANS! 18%! I guess that's what they had to get to to reach their majority saying America is headed in the right direction. This is an 18 point sampling advantage given to Democrats\"\"{SNIP} Shows graph of sampling poll. Just another view, IMO! Thank you!", 
        "reply": " In case you didn't notice, there is no D or R next to someone's name in the phone book. If a random sampling only comes up with 18% Republican, that does not bode well for the GOP.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:46:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. Where do you guys come up with this stuff?", 
        "intTime": 20090425, 
        "postID": 99, 
        "quote": "Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets.", 
        "reply": " Where do you guys come up with this stuff?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:49:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 100, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. more echoes from last Novembers drubbing...or was that the 06 drubbing?...Lost another house seat yesterday and then there is the poor coleman disaster...tick tick tick", 
        "reply": " Scotty, pardon my diversion from the topic, but what house seat was lost? I've not seen the news lately. And yes I heard Coleman lost \"yet\" again to Frankin. I don't see this as ever being resolved, Coleman continues to file law suits. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 15:50:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090425, 
        "postID": 101, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:02:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in? The reality where you cant just print money to pay for all your nanny state programs.", 
        "intTime": 20090425, 
        "postID": 102, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Kegler300: Watch his approval numbers fade when he starts the implementation of cap and trade, universal health care, etc. Additionally, the current health care plan foresees the expiration of Obama's \"Make Work Pay\" tax cut after 2010, and ends former President Bush's tax cuts for middle-class and wealthy Americans and eliminates income tax deductions for charitable gifts and mortgage interest. It's going to be fun times for all I tell ya! Watch his numbers go down for doing things the American people want him to do? What alternate universe do ya'll live in?", 
        "reply": " The reality where you cant just print money to pay for all your nanny state programs.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:07:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010. But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "intTime": 20090425, 
        "postID": 103, 
        "quote": "Originally posted by Irwin_R_Schyster: All Presidents enjoy these numbers during their first 100 days, even that monster GWB. The economy will not recover for quite some time, and there won't be enough welfare payments to calm the masses... \"Blame Bush\" is not going to work in 2010.", 
        "reply": " But the Repubs were still trying to Blame Clinton 8 years after he left office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 16:44:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless. Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "intTime": 20090425, 
        "postID": 104, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. That's an extremely noble thing for you to say JP and you should be applauded for it! All considering that many of us on these boards who suppport the President, have been hounded as traitors, nazis, communists, libturds, libtards, etc. And many of us are Proud Americans and Patriots. As to the denigrate list, it is endless.", 
        "reply": " Thanks, fellow Coastie! Oh, I think being happy and confident as liberals bothers them a lot. My dad was a stanch liberal, WW-II USCG hero (starting with the USCGC Taney 12-07-41 serving thru to the 1950s.) Patriotic through and through, member of all the Vet. organizations he could join up to his dieing day. My mom, a \"Mike Mansfield\" liberal, was one of the first women to join the Army Auxiliary Woman's Air Corp in Feb. 1942. Long line of liberals and patriots right up to today. As a note of interest, it was liberal administrations that won both WW-I and WW-II, and quickly. Want to see a BIG war end in victory and quickly, get the liberals in office.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:24:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right. Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "intTime": 20090425, 
        "postID": 105, 
        "quote": "Originally posted by reducetension: quote: Originally posted by Agent991: Only 18% of Republicans were utilized versus the remaining %% of Dems. But you knew that. Surprisingly, most of the Conservatives firmly support our Troops as well as the Vets. It's been my observation that MOST American's firmly support our Troops and the Vets. It's not a Conservative/Liberal owned issue. I'm very liberal, working with the troops (and veterans) daily (for many years now) and I put their well being and support first in my life. The policies of the previous administration are an other matter. I find fewer and fewer people, including troops, who will admit they are conservative... except on here. Which is fine, it takes us all, all kinds of us, to make the thing work right.", 
        "reply": " Thank you sir! I applaud your service. Surprisingly, my father is a staunch Democrat. My brother, being a preacher, is not. They, therefore, argue. Leaving me with a headache. LOL! The best quote on here so far is yours. \"\"..it takes us all, all kinds of us, to make ...it work\"\" That is so true. Outstanding. I wish the healing could or would begin. God Bless the USA!", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 17:48:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "Agent991"
    }, 
    {
        "content": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "intTime": 20090425, 
        "postID": 106, 
        "quote": "", 
        "reply": "100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-25 18:23:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE? Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "intTime": 20090427, 
        "postID": 107, 
        "quote": "Originally posted by _cash_: 100 days....or 100 miles in the wrong direction.......puts you a hundred the wrong direction and a hundred to get back to point zero. If Bush was BAD? Then maybe we're going from BAD to WORSE?", 
        "reply": " Eight YEARS in the wrong direction can NOT be fixed in 100 days.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 11:58:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "rayld2"
    }, 
    {
        "content": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "intTime": 20090427, 
        "postID": 108, 
        "quote": "", 
        "reply": "Has he gone one day yet without being on the television? Every day he's having one kind of press conference or another. Just don't let the reporters ask any questions harder than what he had for breakfast.", 
        "threadID": "409192893_6790047122001", 
        "time": "2009-04-27 12:14:00", 
        "title": "First 100 day approval numbers.", 
        "userID": "transport1"
    }
]