[
    {
        "content": "Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore.", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all.", 
        "reply": "Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him:  A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 05:05:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that?", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that?", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 05:13:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that? I concur with this, but you do realize that \"strong values\" are completely subjective, right? It's the same as the term \"family values,\" which is another phrase that you can't get any ten people to agree on exactly what comprises them! Most who hawk this term, when pressed, will point at the Bible, but that's just their guide, and is rather general in it's concepts as well! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "Originally posted by Duster6: All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that?", 
        "reply": " I concur with this, but you do realize that \"strong values\" are completely subjective, right? It's the same as the term \"family values,\" which is another phrase that you can't get any ten people to agree on exactly what comprises them! Most who hawk this term, when pressed, will point at the Bible, but that's just their guide, and is rather general in it's concepts as well! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 05:26:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Add another: Roberta McCain, mother of Senator John McCain \"http://www.youtube.com/watch?v=uO-lsARJwds&feature=related\"", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "", 
        "reply": "Add another: Roberta McCain, mother of Senator John McCain \"http://www.youtube.com/watch?v=uO-lsARJwds&feature=related\"", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 07:25:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Hey, just what this site needs! Another D v R thread! Do you people not realize that you're everything wrong with America today and NO -- zero, zilch, nada -- different than the very partisan politicians you so hypocritically condemn? NOTE: \"You people\" does not denote any one person or any one party. It means ALL partisan hacks. Enjoy tearing this nation apart. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "", 
        "reply": "Hey, just what this site needs! Another D v R thread! Do you people not realize that you're everything wrong with America today and NO -- zero, zilch, nada -- different than the very partisan politicians you so hypocritically condemn? NOTE: \"You people\" does not denote any one person or any one party. It means ALL partisan hacks. Enjoy tearing this nation apart. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 08:44:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. To day the bar has moved far to close to the left end of the scale and is way to far from the center for my tastes. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. BHO, Juan MexiCain and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same.", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "", 
        "reply": "It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. To day the bar has moved far to close to the left end of the scale and is way to far from the center for my tastes. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. BHO, Juan MexiCain and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 09:06:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. I would disagree. On the far left end is dictatorship - and on the far right end is also dictatorship. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. The Founding Fathers who pushed for a Constitution, such as Hamiliton and Madision, did so because they believed that the government under the Articles of Confederation was too close to being anarchy, with everybody going their own way and doing whatever was in their own self-interest and damn the other fellow. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. Today the bar has moved far too close to the left end of the scale and is way to far from the center for my tastes. I agree that it is way too far from the center for my taste as well - but I feel that over the past 8 years it had moved too far to the Right end of the bar, not to the Left. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Correction...the rightward slide, in my opinion Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. I want it as close to the Center as it can get - not to the Right of Center or to the Left of Center. The problem is that all too many Americans feel that, if it is in the Center, it is a betrayal of their personal Rightward or Leftward inclinations. BHO, Juan MexiCain Spelling correction: \"John McCain\". Of course if the mispelling was intention, you're showing that your bias is Rightward, not toward the Center. and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. And others would say that they are doing what they can to keep things in the Center - preventing the system from being too Right or Too Left. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As a conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If a mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. You are aware, are you not that by taking this position (which, by the way, you, I and the late Senator Goldwater share) those who identify themselves as Conservatives in 2009 will no longer accept you as being a \"True Conservative\"? The \"True Conservative\" positon of 2009 is that the States should decide - except when they decide differently than the anti-abortion Conservatives, at which time a federal law criminalizing abortion should be passed to supercede any state law that might legalize abortion. Just as when a state passes a law allowing same-sex marriage (such as Iowa), the \"True Conservatives\" of 2009 immediately call for a federal law to reverse the State of Iowa's law. State laws having precedence only applies, in their eyes, if the state law agrees with their \"moral values\", even if they do not reside in another state. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same. I definitely agree. I am a follower of the teachings of Jesus Christ - and I am not a Republican nor a Conservative (at least, not a 2009 Conservative). Living through the ever-increasing invasion of people personal lives during the past 8 years of the Bush Administration has made me more and more a Libertarian as a reaction.", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "Originally posted by shuman14: It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. I would disagree. On the far left end is dictatorship - and on the far right end is also dictatorship. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. The Founding Fathers who pushed for a Constitution, such as Hamiliton and Madision, did so because they believed that the government under the Articles of Confederation was too close to being anarchy, with everybody going their own way and doing whatever was in their own self-interest and damn the other fellow. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. Today the bar has moved far too close to the left end of the scale and is way to far from the center for my tastes. I agree that it is way too far from the center for my taste as well - but I feel that over the past 8 years it had moved too far to the Right end of the bar, not to the Left. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Correction...the rightward slide, in my opinion Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. I want it as close to the Center as it can get - not to the Right of Center or to the Left of Center. The problem is that all too many Americans feel that, if it is in the Center, it is a betrayal of their personal Rightward or Leftward inclinations. BHO, Juan MexiCain Spelling correction: \"John McCain\". Of course if the mispelling was intention, you're showing that your bias is Rightward, not toward the Center. and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. And others would say that they are doing what they can to keep things in the Center - preventing the system from being too Right or Too Left. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As a conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If a mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. You are aware, are you not that by taking this position (which, by the way, you, I and the late Senator Goldwater share) those who identify themselves as Conservatives in 2009 will no longer accept you as being a \"True Conservative\"? The \"True Conservative\" positon of 2009 is that the States should decide - except when they decide differently than the anti-abortion Conservatives, at which time a federal law criminalizing abortion should be passed to supercede any state law that might legalize abortion. Just as when a state passes a law allowing same-sex marriage (such as Iowa), the \"True Conservatives\" of 2009 immediately call for a federal law to reverse the State of Iowa's law. State laws having precedence only applies, in their eyes, if the state law agrees with their \"moral values\", even if they do not reside in another state. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same. I definitely agree. I am a follower of the teachings of Jesus Christ - and I am not a Republican nor a Conservative (at least, not a 2009 Conservative). Living through the ever-increasing invasion of people personal lives during the past 8 years of the Bush Administration has made me more and more a Libertarian as a reaction.", 
        "reply": "", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 09:59:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread! Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history.", 
        "intTime": 20090515, 
        "postID": 8, 
        "quote": "Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread!", 
        "reply": " Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:05:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "intTime": 20090515, 
        "postID": 9, 
        "quote": "", 
        "reply": "With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:07:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore. Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm", 
        "intTime": 20090515, 
        "postID": 10, 
        "quote": "Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore.", 
        "reply": " Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:22:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore. Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm No party should conform to the extreme regardless if it's the left or the right. That's what is tearing america up and causing the divisions in this country. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 11, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore. Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm", 
        "reply": " No party should conform to the extreme regardless if it's the left or the right. That's what is tearing america up and causing the divisions in this country. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:26:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. Obviously another RINO. The more the Republicans attack each other, the longer it will be that our nation will be a one party country - Democrat. It's reminding me more and more of the Democrats after the 1972 loss to \"Tricky Dick\" Nixon.", 
        "intTime": 20090515, 
        "postID": 12, 
        "quote": "Originally posted by jdksfcret: Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice.", 
        "reply": " Obviously another RINO. The more the Republicans attack each other, the longer it will be that our nation will be a one party country - Democrat. It's reminding me more and more of the Democrats after the 1972 loss to \"Tricky Dick\" Nixon.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:27:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread! Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history. Now that is something I can agree with. Left or right, people wind up under the bus in the political blame game every single time. I'm not trying to disrupt your thread, sir, and I hope you don't think that. I am just so sick and tired of seeing US -- you and me -- thrown under the damn bus because of this 2-party political system that I choke whenever I see us vets pointing fingers as puppets to play their destructive game. Personally, I think you're a very bright, very introspective, very thinking man. But exactly where are efforts focused when we put up threads like this that further divide the nation's people? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 13, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread! Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history.", 
        "reply": " Now that is something I can agree with. Left or right, people wind up under the bus in the political blame game every single time. I'm not trying to disrupt your thread, sir, and I hope you don't think that. I am just so sick and tired of seeing US -- you and me -- thrown under the damn bus because of this 2-party political system that I choke whenever I see us vets pointing fingers as puppets to play their destructive game. Personally, I think you're a very bright, very introspective, very thinking man. But exactly where are efforts focused when we put up threads like this that further divide the nation's people? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:28:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I know it might be blasphemy to suggest that some of you might want to watch a clip from the Rachel Maddow show, but she had Ron Paul's son on last night, Rand Paul. I had never heard of the man before, but if the libertarian's in the Repub party are looking for another leader, he might be their man. Check it out. http://www.msnbc.msn.com/id/26315908/#30754200", 
        "intTime": 20090515, 
        "postID": 14, 
        "quote": "", 
        "reply": "I know it might be blasphemy to suggest that some of you might want to watch a clip from the Rachel Maddow show, but she had Ron Paul's son on last night, Rand Paul. I had never heard of the man before, but if the libertarian's in the Repub party are looking for another leader, he might be their man. Check it out. http://www.msnbc.msn.com/id/26315908/#30754200", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 11:44:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Rich, You're still talking right and left when you're really talking up and down. If you say it's dictatorship at both ends, then anarchy is the middle, but we know that can't be because the Constitution is the middle. Your arguement is that Bush is too up/left not center/right. BHO is down/left, which is still too far left. What I want is center/center, well a tiny bit up/center. We are way to close to the left. Maybe I should relable the bar with Monarchy on the top and Communism on the bottom to make it clearer. I don't want a divine emperor (up/left) or a people's premier (down/left). I want a constitutional president with alittle executive authority (just above dead center). Is that clearer?", 
        "intTime": 20090515, 
        "postID": 15, 
        "quote": "", 
        "reply": "Rich, You're still talking right and left when you're really talking up and down. If you say it's dictatorship at both ends, then anarchy is the middle, but we know that can't be because the Constitution is the middle. Your arguement is that Bush is too up/left not center/right. BHO is down/left, which is still too far left. What I want is center/center, well a tiny bit up/center. We are way to close to the left. Maybe I should relable the bar with Monarchy on the top and Communism on the bottom to make it clearer. I don't want a divine emperor (up/left) or a people's premier (down/left). I want a constitutional president with alittle executive authority (just above dead center). Is that clearer?", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 13:39:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party. Naw..., patience is needed for the REPs to purge itself of its poison (RINOS)... Then, the \"proverbial phoenix\" (w/REP tatto on its arse) will rise...yeah, that's it, waiting on the bird to rear its head...gotta have the patience of a sniper, may be awhile...", 
        "intTime": 20090515, 
        "postID": 16, 
        "quote": "Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "reply": " Naw..., patience is needed for the REPs to purge itself of its poison (RINOS)... Then, the \"proverbial phoenix\" (w/REP tatto on its arse) will rise...yeah, that's it, waiting on the bird to rear its head...gotta have the patience of a sniper, may be awhile...", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 22:37:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party. Let it shrink a bit more....or a lot more....... or to oblivion...... Personally I could care less. That (Dubya) party left me long, long ago......... Good Riddance Pubs!!! This message has been edited. Last edited by: ProgMod, Sat 16 May 2009 05:22 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 17, 
        "quote": "Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "reply": " Let it shrink a bit more....or a lot more....... or to oblivion...... Personally I could care less. That (Dubya) party left me long, long ago......... Good Riddance Pubs!!! This message has been edited. Last edited by: ProgMod, Sat 16 May 2009 05:22 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 03:08:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Pretty soon, the only real Republicans will be Limbaugh, Coulter, and Cheney.", 
        "intTime": 20090516, 
        "postID": 18, 
        "quote": "", 
        "reply": "Pretty soon, the only real Republicans will be Limbaugh, Coulter, and Cheney.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 06:36:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "NavySubBubba"
    }, 
    {
        "content": "Hey, if the Republican Party dies, then that means half of the work is done. One party down, one more to go. I have been extremely happy to see the numbers as of recent. The number of people claiming to be Independent or Third Party has been rising incredibly. That is an extremely good sign considering that it has been both the Republican and Democratic parties that have been running our country into the ground over the last 100 years.", 
        "intTime": 20090516, 
        "postID": 19, 
        "quote": "", 
        "reply": "Hey, if the Republican Party dies, then that means half of the work is done. One party down, one more to go. I have been extremely happy to see the numbers as of recent. The number of people claiming to be Independent or Third Party has been rising incredibly. That is an extremely good sign considering that it has been both the Republican and Democratic parties that have been running our country into the ground over the last 100 years.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 16:55:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Off hand, the only two I can think of are Powell and, of course, McCain. I'm sure there are others as well. Weak. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 20, 
        "quote": "", 
        "reply": "Off hand, the only two I can think of are Powell and, of course, McCain. I'm sure there are others as well. Weak. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 17:59:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Can we trade Powell and McCain for Zell Miller? \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 21, 
        "quote": "", 
        "reply": "Can we trade Powell and McCain for Zell Miller? \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 18:32:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "intTime": 20090516, 
        "postID": 22, 
        "quote": "", 
        "reply": "The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 18:40:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... WOW!! You are wiser than your years! I applaud you for your insights. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 23, 
        "quote": "Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "reply": " WOW!! You are wiser than your years! I applaud you for your insights. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 18:58:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... WOW!! You are wiser than your years! I applaud you for your insights. Its just common sense, and remembering what made America great. I've set alot of people straight, and its so disturbing how quickly some people are too mold. These stupid liberal professors open their mouths and 80% of the class believes the garbage they say... I'm sick of english professors using race or gender as platforms for our writing....Its so predictable, It doesn't matter what class you enter, you'll be talking and writing about racism, gender discrimination....etc..etc", 
        "intTime": 20090516, 
        "postID": 24, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... WOW!! You are wiser than your years! I applaud you for your insights.", 
        "reply": " Its just common sense, and remembering what made America great. I've set alot of people straight, and its so disturbing how quickly some people are too mold. These stupid liberal professors open their mouths and 80% of the class believes the garbage they say... I'm sick of english professors using race or gender as platforms for our writing....Its so predictable, It doesn't matter what class you enter, you'll be talking and writing about racism, gender discrimination....etc..etc", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 20:09:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line.", 
        "intTime": 20090517, 
        "postID": 25, 
        "quote": "Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller?", 
        "reply": " See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-17 10:43:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "foxred03"
    }, 
    {
        "content": "Negative there FoxRed . . . Stand For Something, or Fall For Anything Conservative in exile (from REP party)", 
        "intTime": 20090517, 
        "postID": 26, 
        "quote": "", 
        "reply": "Negative there FoxRed . . . Stand For Something, or Fall For Anything Conservative in exile (from REP party)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-17 10:53:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... You probably can't comprehend what they're teaching you. Unregulated capitalism is destroying this country. Let me break it down for you: Since the dawn of this country, there have been 10-15 year cycles of financial panics, the worst of which was in 1929. You can see them all here: \"http://www.answers.com/topic/financial-panics\" After depression era regulations were passed, regulating the banks and the financial sector...50 years of prosperity! Then came the 80's, and calls for deregulation. It started with: DEPOSITORY INSTITUTIONS DEREGULATION AND MONETARY CONTROL ACT OF 1980 http://www.fdic.gov/regulations/laws/rules/8000-2200.html Removed all limitations on interest rates. GARN-ST. GERMAIN DEPOSITORY INSTITUTIONS ACT OF 1982 http://thomas.loc.gov/cgi-bin/bdquery/z?d097:HR06267:@@@L&summ2=m& Allowed adjustable rate mortgages. Deregulated the savings & loan industry. These acts helped cause the savings & loan crisis and stock market crash of 1987, requiring a government bailout of the industry. It also contributed to the early 90's recession. And finally: GRAMM-LEACH-BLILEY ACT OF 1999 http://banking.senate.gov/conf/grmleach.htm One of the main causes of the crisis we are in now. You should stop looking at reality through liberal/conservative glasses.", 
        "intTime": 20090517, 
        "postID": 27, 
        "quote": "Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "reply": " You probably can't comprehend what they're teaching you. Unregulated capitalism is destroying this country. Let me break it down for you: Since the dawn of this country, there have been 10-15 year cycles of financial panics, the worst of which was in 1929. You can see them all here: \"http://www.answers.com/topic/financial-panics\" After depression era regulations were passed, regulating the banks and the financial sector...50 years of prosperity! Then came the 80's, and calls for deregulation. It started with: DEPOSITORY INSTITUTIONS DEREGULATION AND MONETARY CONTROL ACT OF 1980 http://www.fdic.gov/regulations/laws/rules/8000-2200.html Removed all limitations on interest rates. GARN-ST. GERMAIN DEPOSITORY INSTITUTIONS ACT OF 1982 http://thomas.loc.gov/cgi-bin/bdquery/z?d097:HR06267:@@@L&summ2=m& Allowed adjustable rate mortgages. Deregulated the savings & loan industry. These acts helped cause the savings & loan crisis and stock market crash of 1987, requiring a government bailout of the industry. It also contributed to the early 90's recession. And finally: GRAMM-LEACH-BLILEY ACT OF 1999 http://banking.senate.gov/conf/grmleach.htm One of the main causes of the crisis we are in now. You should stop looking at reality through liberal/conservative glasses.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-17 13:40:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 28, 
        "quote": "Originally posted by foxred03: quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line.", 
        "reply": " No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-18 03:05:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? Zell Miller has already been traded. Try to keep up. And see, he already has the secret republican salute down.", 
        "intTime": 20090518, 
        "postID": 29, 
        "quote": "Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller?", 
        "reply": " Zell Miller has already been traded. Try to keep up. And see, he already has the secret republican salute down.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-18 03:53:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "Comparing Republicans to Nazis is offensive and you should know better. Using my sliding bar scale, the Nazis were far left on the scale and 3/4 the way up on the bar. Republicans are up but not that far left.", 
        "intTime": 20090518, 
        "postID": 30, 
        "quote": "", 
        "reply": "Comparing Republicans to Nazis is offensive and you should know better. Using my sliding bar scale, the Nazis were far left on the scale and 3/4 the way up on the bar. Republicans are up but not that far left.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-18 13:50:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "shuman14"
    }, 
    {
        "content": "Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore.", 
        "intTime": 20090515, 
        "postID": 31, 
        "quote": "A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all.", 
        "reply": "Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him:  A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 05:05:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that?", 
        "intTime": 20090515, 
        "postID": 32, 
        "quote": "", 
        "reply": "All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that?", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 05:13:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that? I concur with this, but you do realize that \"strong values\" are completely subjective, right? It's the same as the term \"family values,\" which is another phrase that you can't get any ten people to agree on exactly what comprises them! Most who hawk this term, when pressed, will point at the Bible, but that's just their guide, and is rather general in it's concepts as well! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090515, 
        "postID": 33, 
        "quote": "Originally posted by Duster6: All this crap about democrats VS Republicans will continue until honest, hard working Americans with strong values get out and vote in the next elections for the best man/woman for this country instead of just voting for a person because of his color or one or two of his issues. Do some back ground research for a few days then vote. For once put a blind fold on and forget what party the candidate is a member of. Can you all do that?", 
        "reply": " I concur with this, but you do realize that \"strong values\" are completely subjective, right? It's the same as the term \"family values,\" which is another phrase that you can't get any ten people to agree on exactly what comprises them! Most who hawk this term, when pressed, will point at the Bible, but that's just their guide, and is rather general in it's concepts as well! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 05:26:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Add another: Roberta McCain, mother of Senator John McCain \"http://www.youtube.com/watch?v=uO-lsARJwds&feature=related\"", 
        "intTime": 20090515, 
        "postID": 34, 
        "quote": "", 
        "reply": "Add another: Roberta McCain, mother of Senator John McCain \"http://www.youtube.com/watch?v=uO-lsARJwds&feature=related\"", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 07:25:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Hey, just what this site needs! Another D v R thread! Do you people not realize that you're everything wrong with America today and NO -- zero, zilch, nada -- different than the very partisan politicians you so hypocritically condemn? NOTE: \"You people\" does not denote any one person or any one party. It means ALL partisan hacks. Enjoy tearing this nation apart. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 35, 
        "quote": "", 
        "reply": "Hey, just what this site needs! Another D v R thread! Do you people not realize that you're everything wrong with America today and NO -- zero, zilch, nada -- different than the very partisan politicians you so hypocritically condemn? NOTE: \"You people\" does not denote any one person or any one party. It means ALL partisan hacks. Enjoy tearing this nation apart. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 08:44:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. To day the bar has moved far to close to the left end of the scale and is way to far from the center for my tastes. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. BHO, Juan MexiCain and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same.", 
        "intTime": 20090515, 
        "postID": 36, 
        "quote": "", 
        "reply": "It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. To day the bar has moved far to close to the left end of the scale and is way to far from the center for my tastes. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. BHO, Juan MexiCain and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 09:06:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. I would disagree. On the far left end is dictatorship - and on the far right end is also dictatorship. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. The Founding Fathers who pushed for a Constitution, such as Hamiliton and Madision, did so because they believed that the government under the Articles of Confederation was too close to being anarchy, with everybody going their own way and doing whatever was in their own self-interest and damn the other fellow. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. Today the bar has moved far too close to the left end of the scale and is way to far from the center for my tastes. I agree that it is way too far from the center for my taste as well - but I feel that over the past 8 years it had moved too far to the Right end of the bar, not to the Left. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Correction...the rightward slide, in my opinion Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. I want it as close to the Center as it can get - not to the Right of Center or to the Left of Center. The problem is that all too many Americans feel that, if it is in the Center, it is a betrayal of their personal Rightward or Leftward inclinations. BHO, Juan MexiCain Spelling correction: \"John McCain\". Of course if the mispelling was intention, you're showing that your bias is Rightward, not toward the Center. and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. And others would say that they are doing what they can to keep things in the Center - preventing the system from being too Right or Too Left. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As a conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If a mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. You are aware, are you not that by taking this position (which, by the way, you, I and the late Senator Goldwater share) those who identify themselves as Conservatives in 2009 will no longer accept you as being a \"True Conservative\"? The \"True Conservative\" positon of 2009 is that the States should decide - except when they decide differently than the anti-abortion Conservatives, at which time a federal law criminalizing abortion should be passed to supercede any state law that might legalize abortion. Just as when a state passes a law allowing same-sex marriage (such as Iowa), the \"True Conservatives\" of 2009 immediately call for a federal law to reverse the State of Iowa's law. State laws having precedence only applies, in their eyes, if the state law agrees with their \"moral values\", even if they do not reside in another state. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same. I definitely agree. I am a follower of the teachings of Jesus Christ - and I am not a Republican nor a Conservative (at least, not a 2009 Conservative). Living through the ever-increasing invasion of people personal lives during the past 8 years of the Bush Administration has made me more and more a Libertarian as a reaction.", 
        "intTime": 20090515, 
        "postID": 37, 
        "quote": "Originally posted by shuman14: It's easier to show this as drawing then to discribe it but I'm going to try. Imagine a left to right scale or meter. On the far left end is dictatorship. On the far right end is anarchy. I would disagree. On the far left end is dictatorship - and on the far right end is also dictatorship. This scale is the United States of America. On this scale is a floating bar. When the Articles of Confederation was signed, the bar was very close to the right end of the scale. The Founding Fathers who pushed for a Constitution, such as Hamiliton and Madision, did so because they believed that the government under the Articles of Confederation was too close to being anarchy, with everybody going their own way and doing whatever was in their own self-interest and damn the other fellow. When the Constitution was signed, the bar was moved to tap dead center, in perfect balance. Today the bar has moved far too close to the left end of the scale and is way to far from the center for my tastes. I agree that it is way too far from the center for my taste as well - but I feel that over the past 8 years it had moved too far to the Right end of the bar, not to the Left. I forgot to mention the floating bar is a scale too. On the Top of it is the Republican party and on the bottom is the Democrat party. You see we're all so busy fighting over the up and down movement that we never seem to notice the leftward slide. Correction...the rightward slide, in my opinion Sadly, I think that's the plan of many of our \"representatives\" in the Government, both Republican and Democrat, in the first place. We all need to stop and look at all of our leaders, regardless of party, and determine if they are helping the bar slide left, or if they are trying to push it back right. I want it as close to the Center as it can get - not to the Right of Center or to the Left of Center. The problem is that all too many Americans feel that, if it is in the Center, it is a betrayal of their personal Rightward or Leftward inclinations. BHO, Juan MexiCain Spelling correction: \"John McCain\". Of course if the mispelling was intention, you're showing that your bias is Rightward, not toward the Center. and his kin, Specter, Snowe, Collins, Powell, Reid and many others are helping the bar slide left. That is not good for our Nation. And others would say that they are doing what they can to keep things in the Center - preventing the system from being too Right or Too Left. As to Goldwater, he's right, every woman has the right to choose to kill their unborn or not. As a Roman Catholic, I'm a religious \"do-gooder\" that do everything within my power to convince a pregnant mother to not kill her child, but in the end, only she can make the choice. As a conservative, I will tell you that the ability to make that choice is none of the Federal Government's concern. The \"legality\" of killing an unborn child is the States' purview to allow it or not. If a mother so wished to kill her child and the State she lives in does not allow for abortion, then she would be free to travel to a State that does. You are aware, are you not that by taking this position (which, by the way, you, I and the late Senator Goldwater share) those who identify themselves as Conservatives in 2009 will no longer accept you as being a \"True Conservative\"? The \"True Conservative\" positon of 2009 is that the States should decide - except when they decide differently than the anti-abortion Conservatives, at which time a federal law criminalizing abortion should be passed to supercede any state law that might legalize abortion. Just as when a state passes a law allowing same-sex marriage (such as Iowa), the \"True Conservatives\" of 2009 immediately call for a federal law to reverse the State of Iowa's law. State laws having precedence only applies, in their eyes, if the state law agrees with their \"moral values\", even if they do not reside in another state. Please do not confuse the terms: Republican, Conservative, and Religious they are NOT one in the same. I definitely agree. I am a follower of the teachings of Jesus Christ - and I am not a Republican nor a Conservative (at least, not a 2009 Conservative). Living through the ever-increasing invasion of people personal lives during the past 8 years of the Bush Administration has made me more and more a Libertarian as a reaction.", 
        "reply": "", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 09:59:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread! Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history.", 
        "intTime": 20090515, 
        "postID": 38, 
        "quote": "Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread!", 
        "reply": " Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:05:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "intTime": 20090515, 
        "postID": 39, 
        "quote": "", 
        "reply": "With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:07:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore. Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm", 
        "intTime": 20090515, 
        "postID": 40, 
        "quote": "Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore.", 
        "reply": " Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:22:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore. Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm No party should conform to the extreme regardless if it's the left or the right. That's what is tearing america up and causing the divisions in this country. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 41, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by Fightdirector: Jim Jeffords of Vermont is gone, Lincoln Chaffee of Rhode Island is gone, Arlen Specter of Pennsylvania is gone, but Olympia Snowe and Susan Collins, the two Senators from Maine, are still in the Republican Party and are constantly being attacked for being RINOs (Republicans In Name Only). Rush \"Chickenhawk\" Limbum, the leader of the Republican Party, has denounced Colin Powell, Senator John McCain and Senator McCain's daughter as RINOS. I've found another RINO. Here is a quote from him: quote: A lot of so-called conservatives today don't know what the word means. They think I've turned liberal because I believe a woman has a right to an abortion. That's a decision that's up to the pregnant woman, not up to the pope or some do-gooders on the religious right. It's not a conservative issue at all. A Republican that is pro-choice? Unthinkable! He's obviously a RINO and needs to be expelled from the Republican Party rolls! His name - Barry Goldwater. Granted it would be a posthumous purge, since Goldwater is dead - but aren't the Republicans people who stand on their principles? Surely their principles cannot allow them to allow Goldwater to be considered a Republican anymore. Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. http://www.ontheissues.org/Tom_Ridge.htm", 
        "reply": " No party should conform to the extreme regardless if it's the left or the right. That's what is tearing america up and causing the divisions in this country. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:26:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice. Obviously another RINO. The more the Republicans attack each other, the longer it will be that our nation will be a one party country - Democrat. It's reminding me more and more of the Democrats after the 1972 loss to \"Tricky Dick\" Nixon.", 
        "intTime": 20090515, 
        "postID": 42, 
        "quote": "Originally posted by jdksfcret: Lets not forget Tom Ridge, a moderate Republican who is getting press here in PA as a possible candidate for the Senate in 2010. However, he doesn't and will never fit the uber right wing mold since he is pro-choice.", 
        "reply": " Obviously another RINO. The more the Republicans attack each other, the longer it will be that our nation will be a one party country - Democrat. It's reminding me more and more of the Democrats after the 1972 loss to \"Tricky Dick\" Nixon.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:27:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread! Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history. Now that is something I can agree with. Left or right, people wind up under the bus in the political blame game every single time. I'm not trying to disrupt your thread, sir, and I hope you don't think that. I am just so sick and tired of seeing US -- you and me -- thrown under the damn bus because of this 2-party political system that I choke whenever I see us vets pointing fingers as puppets to play their destructive game. Personally, I think you're a very bright, very introspective, very thinking man. But exactly where are efforts focused when we put up threads like this that further divide the nation's people? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 43, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by FollowMeInfantry: Hey, just what this site needs! Another D v R thread! Actually, I see it as a \"Notice how the political party that loses a major election turns on itself - like eating their young\" kind of thread. Just another example of a cycle that repeats and repeats itself throughout our nation's history.", 
        "reply": " Now that is something I can agree with. Left or right, people wind up under the bus in the political blame game every single time. I'm not trying to disrupt your thread, sir, and I hope you don't think that. I am just so sick and tired of seeing US -- you and me -- thrown under the damn bus because of this 2-party political system that I choke whenever I see us vets pointing fingers as puppets to play their destructive game. Personally, I think you're a very bright, very introspective, very thinking man. But exactly where are efforts focused when we put up threads like this that further divide the nation's people? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 10:28:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I know it might be blasphemy to suggest that some of you might want to watch a clip from the Rachel Maddow show, but she had Ron Paul's son on last night, Rand Paul. I had never heard of the man before, but if the libertarian's in the Repub party are looking for another leader, he might be their man. Check it out. http://www.msnbc.msn.com/id/26315908/#30754200", 
        "intTime": 20090515, 
        "postID": 44, 
        "quote": "", 
        "reply": "I know it might be blasphemy to suggest that some of you might want to watch a clip from the Rachel Maddow show, but she had Ron Paul's son on last night, Rand Paul. I had never heard of the man before, but if the libertarian's in the Repub party are looking for another leader, he might be their man. Check it out. http://www.msnbc.msn.com/id/26315908/#30754200", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 11:44:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Rich, You're still talking right and left when you're really talking up and down. If you say it's dictatorship at both ends, then anarchy is the middle, but we know that can't be because the Constitution is the middle. Your arguement is that Bush is too up/left not center/right. BHO is down/left, which is still too far left. What I want is center/center, well a tiny bit up/center. We are way to close to the left. Maybe I should relable the bar with Monarchy on the top and Communism on the bottom to make it clearer. I don't want a divine emperor (up/left) or a people's premier (down/left). I want a constitutional president with alittle executive authority (just above dead center). Is that clearer?", 
        "intTime": 20090515, 
        "postID": 45, 
        "quote": "", 
        "reply": "Rich, You're still talking right and left when you're really talking up and down. If you say it's dictatorship at both ends, then anarchy is the middle, but we know that can't be because the Constitution is the middle. Your arguement is that Bush is too up/left not center/right. BHO is down/left, which is still too far left. What I want is center/center, well a tiny bit up/center. We are way to close to the left. Maybe I should relable the bar with Monarchy on the top and Communism on the bottom to make it clearer. I don't want a divine emperor (up/left) or a people's premier (down/left). I want a constitutional president with alittle executive authority (just above dead center). Is that clearer?", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 13:39:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party. Naw..., patience is needed for the REPs to purge itself of its poison (RINOS)... Then, the \"proverbial phoenix\" (w/REP tatto on its arse) will rise...yeah, that's it, waiting on the bird to rear its head...gotta have the patience of a sniper, may be awhile...", 
        "intTime": 20090515, 
        "postID": 46, 
        "quote": "Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "reply": " Naw..., patience is needed for the REPs to purge itself of its poison (RINOS)... Then, the \"proverbial phoenix\" (w/REP tatto on its arse) will rise...yeah, that's it, waiting on the bird to rear its head...gotta have the patience of a sniper, may be awhile...", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-15 22:37:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party. Let it shrink a bit more....or a lot more....... or to oblivion...... Personally I could care less. That (Dubya) party left me long, long ago......... Good Riddance Pubs!!! This message has been edited. Last edited by: ProgMod, Sat 16 May 2009 05:22 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090516, 
        "postID": 47, 
        "quote": "Originally posted by SenClaghorn: With membership in the republican party at 21% of the electorate and shrinking, none of this should surprise anyone. Maybe it is time for a new party.", 
        "reply": " Let it shrink a bit more....or a lot more....... or to oblivion...... Personally I could care less. That (Dubya) party left me long, long ago......... Good Riddance Pubs!!! This message has been edited. Last edited by: ProgMod, Sat 16 May 2009 05:22 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 03:08:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Pretty soon, the only real Republicans will be Limbaugh, Coulter, and Cheney.", 
        "intTime": 20090516, 
        "postID": 48, 
        "quote": "", 
        "reply": "Pretty soon, the only real Republicans will be Limbaugh, Coulter, and Cheney.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 06:36:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "NavySubBubba"
    }, 
    {
        "content": "Hey, if the Republican Party dies, then that means half of the work is done. One party down, one more to go. I have been extremely happy to see the numbers as of recent. The number of people claiming to be Independent or Third Party has been rising incredibly. That is an extremely good sign considering that it has been both the Republican and Democratic parties that have been running our country into the ground over the last 100 years.", 
        "intTime": 20090516, 
        "postID": 49, 
        "quote": "", 
        "reply": "Hey, if the Republican Party dies, then that means half of the work is done. One party down, one more to go. I have been extremely happy to see the numbers as of recent. The number of people claiming to be Independent or Third Party has been rising incredibly. That is an extremely good sign considering that it has been both the Republican and Democratic parties that have been running our country into the ground over the last 100 years.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 16:55:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Off hand, the only two I can think of are Powell and, of course, McCain. I'm sure there are others as well. Weak. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 50, 
        "quote": "", 
        "reply": "Off hand, the only two I can think of are Powell and, of course, McCain. I'm sure there are others as well. Weak. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 17:59:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "Can we trade Powell and McCain for Zell Miller? \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 51, 
        "quote": "", 
        "reply": "Can we trade Powell and McCain for Zell Miller? \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 18:32:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "intTime": 20090516, 
        "postID": 52, 
        "quote": "", 
        "reply": "The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 18:40:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... WOW!! You are wiser than your years! I applaud you for your insights. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090516, 
        "postID": 53, 
        "quote": "Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "reply": " WOW!! You are wiser than your years! I applaud you for your insights. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 18:58:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... WOW!! You are wiser than your years! I applaud you for your insights. Its just common sense, and remembering what made America great. I've set alot of people straight, and its so disturbing how quickly some people are too mold. These stupid liberal professors open their mouths and 80% of the class believes the garbage they say... I'm sick of english professors using race or gender as platforms for our writing....Its so predictable, It doesn't matter what class you enter, you'll be talking and writing about racism, gender discrimination....etc..etc", 
        "intTime": 20090516, 
        "postID": 54, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... WOW!! You are wiser than your years! I applaud you for your insights.", 
        "reply": " Its just common sense, and remembering what made America great. I've set alot of people straight, and its so disturbing how quickly some people are too mold. These stupid liberal professors open their mouths and 80% of the class believes the garbage they say... I'm sick of english professors using race or gender as platforms for our writing....Its so predictable, It doesn't matter what class you enter, you'll be talking and writing about racism, gender discrimination....etc..etc", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-16 20:09:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line.", 
        "intTime": 20090517, 
        "postID": 55, 
        "quote": "Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller?", 
        "reply": " See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-17 10:43:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "foxred03"
    }, 
    {
        "content": "Negative there FoxRed . . . Stand For Something, or Fall For Anything Conservative in exile (from REP party)", 
        "intTime": 20090517, 
        "postID": 56, 
        "quote": "", 
        "reply": "Negative there FoxRed . . . Stand For Something, or Fall For Anything Conservative in exile (from REP party)", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-17 10:53:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country... You probably can't comprehend what they're teaching you. Unregulated capitalism is destroying this country. Let me break it down for you: Since the dawn of this country, there have been 10-15 year cycles of financial panics, the worst of which was in 1929. You can see them all here: \"http://www.answers.com/topic/financial-panics\" After depression era regulations were passed, regulating the banks and the financial sector...50 years of prosperity! Then came the 80's, and calls for deregulation. It started with: DEPOSITORY INSTITUTIONS DEREGULATION AND MONETARY CONTROL ACT OF 1980 http://www.fdic.gov/regulations/laws/rules/8000-2200.html Removed all limitations on interest rates. GARN-ST. GERMAIN DEPOSITORY INSTITUTIONS ACT OF 1982 http://thomas.loc.gov/cgi-bin/bdquery/z?d097:HR06267:@@@L&summ2=m& Allowed adjustable rate mortgages. Deregulated the savings & loan industry. These acts helped cause the savings & loan crisis and stock market crash of 1987, requiring a government bailout of the industry. It also contributed to the early 90's recession. And finally: GRAMM-LEACH-BLILEY ACT OF 1999 http://banking.senate.gov/conf/grmleach.htm One of the main causes of the crisis we are in now. You should stop looking at reality through liberal/conservative glasses.", 
        "intTime": 20090517, 
        "postID": 57, 
        "quote": "Originally posted by Irwin_R_Schyster: The liberals in this nation are too self-absorbed and ignorant to safely guard America. They are soft on national security, they are destroying our image overseas, and they are willing to negotiate with lunatics who deny events like the Holocaust.. I'm currently a college student, and the liberal indoctrination is astounding, it really is. I'm almost shocked by the garbage being repeated in some circles. \"**** AMERICA\" \"Capitalism is destroying this country\" \"We're not the best, we're the worst\" On and on....Why do young American adults believe that crap? I'll tell you what, it ain't conservatives breeding an entire generation to hate their country...", 
        "reply": " You probably can't comprehend what they're teaching you. Unregulated capitalism is destroying this country. Let me break it down for you: Since the dawn of this country, there have been 10-15 year cycles of financial panics, the worst of which was in 1929. You can see them all here: \"http://www.answers.com/topic/financial-panics\" After depression era regulations were passed, regulating the banks and the financial sector...50 years of prosperity! Then came the 80's, and calls for deregulation. It started with: DEPOSITORY INSTITUTIONS DEREGULATION AND MONETARY CONTROL ACT OF 1980 http://www.fdic.gov/regulations/laws/rules/8000-2200.html Removed all limitations on interest rates. GARN-ST. GERMAIN DEPOSITORY INSTITUTIONS ACT OF 1982 http://thomas.loc.gov/cgi-bin/bdquery/z?d097:HR06267:@@@L&summ2=m& Allowed adjustable rate mortgages. Deregulated the savings & loan industry. These acts helped cause the savings & loan crisis and stock market crash of 1987, requiring a government bailout of the industry. It also contributed to the early 90's recession. And finally: GRAMM-LEACH-BLILEY ACT OF 1999 http://banking.senate.gov/conf/grmleach.htm One of the main causes of the crisis we are in now. You should stop looking at reality through liberal/conservative glasses.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-17 13:40:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 58, 
        "quote": "Originally posted by foxred03: quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? See that kind of attitude is why the GOP is getting it's ass kicked right now. You need to let go. The country is moving farther to the left at this point in history, these things are cyclic. But you cannot afford to keep pushing away experienced, largely honest and credible people like Powell and McCain just because they don't spout the bankrupt radically conservative line.", 
        "reply": " No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-18 03:05:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller? Zell Miller has already been traded. Try to keep up. And see, he already has the secret republican salute down.", 
        "intTime": 20090518, 
        "postID": 59, 
        "quote": "Originally posted by PinkBlossoms: Can we trade Powell and McCain for Zell Miller?", 
        "reply": " Zell Miller has already been traded. Try to keep up. And see, he already has the secret republican salute down.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-18 03:53:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "Comparing Republicans to Nazis is offensive and you should know better. Using my sliding bar scale, the Nazis were far left on the scale and 3/4 the way up on the bar. Republicans are up but not that far left.", 
        "intTime": 20090518, 
        "postID": 60, 
        "quote": "", 
        "reply": "Comparing Republicans to Nazis is offensive and you should know better. Using my sliding bar scale, the Nazis were far left on the scale and 3/4 the way up on the bar. Republicans are up but not that far left.", 
        "threadID": "409192893_5100073322001", 
        "time": "2009-05-18 13:50:00", 
        "title": "RINOS that still need to be purged from the GOP", 
        "userID": "shuman14"
    }
]